{
    "data": [
        {
            "author": "megaxlf",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2rhweelf",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546879210,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/adjfb9/psychoanalysis_or_cognitivebehavioral_therapy/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "adjfb9",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": false,
            "num_comments": 3,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/adjfb9/psychoanalysis_or_cognitivebehavioral_therapy/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546879239,
            "score": 2,
            "selftext": "I've been doing psychoanalysis for about 2 years, but still struggle with anxiety, from time to time it really gets me, so I'm thinking about changing to a cbt therapist, should I stay and give more time to the psychoanalysis or should I change to cbt? Which one gets the best results for short and long term??",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 219924,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Psychoanalysis or cognitive-behavioral therapy?",
            "url": "https://www.reddit.com/r/Anxiety/comments/adjfb9/psychoanalysis_or_cognitivebehavioral_therapy/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "icecoldcokezero",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2xt1e1zq",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546807607,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ad9nvd/anxietips_or_not_really_just_a_story_of_my/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ad9nvd",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "progressflair",
            "link_flair_richtext": [],
            "link_flair_template_id": "75128fca-2f35-11e5-8846-0e610b6925bb",
            "link_flair_text": "Progress!",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 10,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ad9nvd/anxietips_or_not_really_just_a_story_of_my/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546807826,
            "score": 2,
            "selftext": "Eight years ago, i was diagnosed with chronic anxiety. That time, i shrugged it off thinking, \"hey, this is normal, right? Everyone gets anxious sometimes. This will go away, right?\" Wrong. Here i am, eight years later, cringing at past me for even thinking that anxiety goes away like a seasonal flu.\n\nI spent some time going through therapy sessions, and while those helped, they didnt really cure me of my anxiety*, because for people like me, anxiety is ever-present -- an annoying, unwanted companion i am eternally cuffed with.\n\nI struggled battling anxiety for a long time. It was hard to be a fully-functional human when every speedbump looked like a giant boulder in the middle of the road. Instead of looking for ways around it, my focus was on the speedbump-boulder and how impossible it was to conquer it. Anxiety paralyzed me and made me feel like i was always bound to fail.\n\nThe smallest tasks would sometimes trigger anxiety and panic. I would cross the road planning my funeral because what if the bus hits me? I would get invited to parties, and yes i craved to socialize, but i would bail because what if i spill the drink and make a mess of myself? Public speaking was the worst subject ever, because that triggered so much what-ifs. I was sweating with just the thought of mispronouncing words and forgetting my lines. There were days when i thought i was perfectly fine, then i would be attacked by constant panic and pressure that took away my ability to function, and i would shut myself in, because anxiety was crippling that way.\n\nI quit a lot of things in my life -- school, jobs, relationships -- some, i didnt even get to start, all because i worried i wasnt good enough. I was scared of taking a course i wanted because what if i couldnt find a job after i graduated? I couldnt take these programs because what if i fail them and i had to retake them? I resigned from my teaching job because i feared no one would take my subjects the following year, that i might not be a good enough instructor. I was scared to build relationships and would stop talking to people i really liked or wanted to be friends with, because what if they dont understand me?\n\nBecause that was what i felt, that no one understood me. I craved validation and support, but instead, some of the people i cared about left me for being \"over-dramatic\" and a \"cry-baby,\" only because they didnt understand what i was going through. Well, same. How could i blame them when i myself couldnt understand it?\n\nAfter years of battling anxiety, i got fed up with it and i internally told it to fuck off. It didnt. But i knew i had to do something about it, or else, i wouldnt be able to really live. I knew that there was only so much i could do to help myself. So i did. I read self-help books, which, if i would be honest, really didnt help that much because they all say the same things i already knew (still good reminders, though). I started reaching out to my fellow anxious people and asked for advice, because, you know, it takes one to know one, and they were the best people to talk to if i wanted to really get myself. Little by little, i gained confidence about who i was and what i was capable of. It took years and a lot of hard work, but i learned so much, and i couldnt be any more thankful to the people who helped me and made me feel a little better about myself.\n\nFast forward to a few years later. I cant say that i dont get anxious anymore. After all, anxiety is already a big chunk of who i am. Maybe i just learned a few tricks to manage it somehow. Or maybe it just doesnt scare me as much as it did before.\n\nThe fact is, there is no one-size-fits-all approach in managing anxiety. Some people fight their anxiety. Some people try to ignore it. If it works for you, then it must be for you. But if there's one thing i realized for myself, it's that fighting my anxiety is a losing battle, so i embrace it instead. I take a break. I breathe. I ground myself to my surroundings. This way, i know that i have control of the environment im in. I recognize the situation and try as much as possible to think logically. I acknowledge the facts, and while i cant really do anything about my emotions, i talk about the situation to the people who care to listen. If im alone, i express what upsets me through writing. I walk. I go for a run. Not to try to escape the situation, but to shake off the excess nerves. I look back to what makes me anxious and assess what i can do about it. If i need to take a break and feel the emotions as they happen, i allow myself a few hours, or maybe a few days to let it run its course. I think to myself, \"it will pass.\" It always does.\n\nTo my fellow anxious people, you got this. It is a hard road, and you may sometimes feel alone, but youre not. Be kind to yourselves. If you need to cry, do it. If you need to rest, take as much break as you need. If it's too much to bear alone, seek help.\n\nTo everyone else, anxiety thrives in a person's inability to take control of a situation. When someone feels lost, it is important that they feel secured, heard, and validated. This is why it is important to show kindness and compassion to everyone.\n\n\n(*Disclaimer: Im not saying that people should ditch therapy like i did. It just didnt work for me, but im sure it helps others. Please, please go/continue going to therapy if you feel that it helps.)",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 219624,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Anxie-tips. Or not really. Just a story of my anxiety and how im not taking shit from it anymore",
            "url": "https://www.reddit.com/r/Anxiety/comments/ad9nvd/anxietips_or_not_really_just_a_story_of_my/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "irish-boyyaya",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2g13p36y",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546807231,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ad9lko/my_story/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ad9lko",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 7,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ad9lko/my_story/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546807520,
            "score": 2,
            "selftext": "So I’m lying here in bed 8.20pm Ireland. \nHere’s my story.\n\nI’ve had a traumatic childhood. My Mother cheated on my dad numerous occasions. She developed OCD and left 5 kids with their daddy. Practically my childhood was hell, except the times I was with my dad. He’s an angel! \n\nI’m the youngest in my family, now 21. I never spoke to anyone about what happened with my Mam, when people asked where she was I said on holidays! I put a brave face on. And I was good at doing it! \n\nI’ve done a lot of stupid shit in my life, got a DUI when I was driving home with my bro after being in Amsterdam.. That fucked me up a little bit as I had aspirations of being in the police etc.  So since then I’ve partied hard in college! \n\nI drank way more used drugs more commonly and I was loving it, this only lasted 4 weeks though! Woke up after doing MDMA and had a massive panic attack #Yikes. I thought I was dying and on the cold kitchen floor at 5am in the morning all I could think about was my dad and how I let him down, between everything. \n\n3 months on and I’m suffering really fucking badly from anxiety panic attacks etc. the panic attacks have kinda ceased, but I’m in a constant fear and stressed out about the anxiety - and its symptoms. This is all so new to me! \n\nAnxiety symptoms (Weird vision/headaches/inability to swallow/heart palpitations/dis realization) \n\nI’ve started seeing a guy in Dublin, he’s an holistic therapist. He’s helped so much compared to all the other avenues I’ve tried in my bid to feel ok again. He believes it’s all this trauma I’ve experienced coming out now and I don’t have any mental disorder etc. rather an emotional one! To my relief.\n\nI’m very sporty and outgoing usually but I have now deferred college and stopped working. Literally isolated myself so much to this day, I just can’t seem to get back out there. CONSTANT FEAR is really starting to make me suicidal. That’s why I’m writing this tonight is the worst night I’ve experienced, I have been planning my death the past week. Getting money in order for my dad and writing letters. This needs to stop, I know I have the power to change this but I don’t have the courage or strength. \n\nI just cry. I’m so alone. I’m so afraid. I’m so lost \nI just want to be loved. I wish I had a mother who I could love now more than ever. I want my life back.\n\nThanks for reading. Goodbye ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 219623,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "My story",
            "url": "https://www.reddit.com/r/Anxiety/comments/ad9lko/my_story/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "SunnySideOvertheEdge",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_8zw8y1i",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546336543,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/abh1i0/i_just_got_home_from_uber_driving_on_new_years_i/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "abh1i0",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 4,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/abh1i0/i_just_got_home_from_uber_driving_on_new_years_i/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546336544,
            "score": 1,
            "selftext": "Over a year ago I started driving for Uber because we very seriously needed any extra money. I had to stop almost immediately because my anxiety wouldn’t allow me to in good conscious drive others around. I felt devastated. I felt like a failure. I felt like shit, I couldn’t help my family when the time needed it. \n\nI recently picked up where I left off because his work gave a hefty heads up that they were taking off for the holidays for way too much time and it was unpaid. I’ve been doing decent with it. I’ve helped make enough to help us stay afloat and was able to help make sure Christmas was still magical for our kids.\n\nI knew tonight (or last night) would be a big deal, good money. All the time leading up to New Years I’ve been debating if I wanted to put myself through it with my anxiety. I’ve been doing OK but what if it was too much on me? \n\nI fucking nailed it. I made more in one night/morning than I’d made the whole week combined. I was sociable! I freaking went places I’ve never driven before. I don’t know. I feel so on top of the world. I remember feeling my throat tightening in between one ride and thinking “it’s just roads sunny. Just roads” and was able to calm myself down. I’ve NEVER been able to calm myself down. In fact by the end of the night I was eager for new rides and I was calm. \n\nFlipping calm, a word I never ever thought I’d used to describe myself ever.  I don’t know how long this high will last but.. I’m glad I can share it with you all. Happy New Years! \n\nAlso, for anyone wondering. I’m medicated and in therapy and just got out of IOP, I know it doesn’t always help everyone but I put a lot of it into that. Me getting help. ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218030,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "I just got home from Uber driving on New Years.. I feel amazing.",
            "url": "https://www.reddit.com/r/Anxiety/comments/abh1i0/i_just_got_home_from_uber_driving_on_new_years_i/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "mintcroixxxxx",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_1yhoew4n",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546472772,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/abzcdh/panic_attack_at_work/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "abzcdh",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 3,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/abzcdh/panic_attack_at_work/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546472772,
            "score": 1,
            "selftext": "I've dealt with anxiety my whole life and recently it has been worse than usual but manageable. \n\nI can usually manage my symptoms through exercise and breathing exercises and (I don't like admitting it) alcohol.\n\nI occasionally get anxious at work but I can manage by going on a walk or going into the bathroom for some breathing exercises. \n\nToday was the worst. I turned my head too fast and became extremely dizzy (world spinning, never felt like this before). I sat down and tried to regain my composure but with the dizziness it set off the worst panic attack I've ever had. I couldn't breathe, my heart was racing, I was shaking to the point of tremors. I told my co worker I thought I was gonna pass out. He sat next to me and tried to calm me down and I then asked him to take me to the ER. He did and I was diagnosed with vertigo which had thrown me into an anxiety attack.\n\nNow I still feel im recovering from both the vertigo and my anxiety. And I'm horrified to go back to work. What if just being there throws me into another attack? I'm so embarrassed about this happening in front of all my co workers. What if I start spinning again? The ER dr shrugged off my anxiety and basically said to just deal with it. I plan on calling a psychiatrist tomorrow for an appointment to talk about potential medications. Is there anything else I can do to ease my anxiety for work tomorrow?\n\nAlso thanks for reading, I also really needed to vent about this.",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218461,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Panic attack at work.",
            "url": "https://www.reddit.com/r/Anxiety/comments/abzcdh/panic_attack_at_work/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "kendal_me",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2jxzvjvz",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546477807,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac04rv/anxiety_and_cyberstalking_please_help/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac04rv",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "helpflair",
            "link_flair_richtext": [],
            "link_flair_text": "Needs A Hug/Support",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 7,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac04rv/anxiety_and_cyberstalking_please_help/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546477809,
            "score": 1,
            "selftext": "Unknown people found my address. Send it for other people and they come and knock on my flat about 12 hours a lot of different people. they say that I give free tv or fridge, It was on October. I did screenshots, audio and etc. gave it to police... no answer. Now they began again! Please give advice how to stop it and keep calm! Please! I live alone on the 1st floor. Without parents. I am a girl. They play and want my reaction, but I try to ignore it. And I have an anxiety disorder many years. That’s not easy for me to smile on this situation! ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218482,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Anxiety and cyberstalking! Please help!",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac04rv/anxiety_and_cyberstalking_please_help/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "unknown2091",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2qegm802",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546509297,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac4adt/you_just_gotta_do_it/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac4adt",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 0,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac4adt/you_just_gotta_do_it/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546509298,
            "score": 1,
            "selftext": "Sometimes, if you wanna get better, you just gotta jump on out of your situation regardless of how you feel. Or will always feel how you feel right now. You just gotta get up and get going, if anxiety comes, just say \"go ahead, do what you want to do, I don't give a fuck.\" Get moving!!!!!",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218645,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "You just gotta do it",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac4adt/you_just_gotta_do_it/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "nathwine",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2brru8x1",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546513206,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac4ogk/going_to_work/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac4ogk",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "schoolflair",
            "link_flair_richtext": [],
            "link_flair_text": "Work/School",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 0,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac4ogk/going_to_work/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546513207,
            "score": 1,
            "selftext": "I work in my job since march 2017 and in the first few months I felt super anxious everytime I headed to work because I were so afraid of making a mistake. I think my coworkers like me and I do everything as they ask me to and complete my tasks but for some reason, today I feel anxious again. I have to leave in 2 minutes and I'm so stressed and dont even know why. I dont even know why I'm typing this. I guess I dont want to annoy anyone personally with it so I'm posting it where people can choose to open or ignore it... Sorry",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218652,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Going to work",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac4ogk/going_to_work/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "SadElvenMermaid",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_hfddgia",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546494758,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac2mnn/i_get_anxiety_to_play_even_a_single_player_game/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac2mnn",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 2,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac2mnn/i_get_anxiety_to_play_even_a_single_player_game/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546494759,
            "score": 1,
            "selftext": "how stupid is that. i get so avoidant and anxious that i dont even play a game, because if i see myself doing worse, ill see myself as having become worse as a person somehow.  i know rationally its ridiculous, but its still how i feel.  ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218567,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "i get anxiety to play even a single player game because i fear failing to measure up to my past self",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac2mnn/i_get_anxiety_to_play_even_a_single_player_game/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "CrazyDude10528",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_79dr4",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546501534,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac3gsc/somebody_please_help_me/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac3gsc",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "helpflair",
            "link_flair_richtext": [],
            "link_flair_text": "Needs A Hug/Support",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 3,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac3gsc/somebody_please_help_me/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546501535,
            "score": 1,
            "selftext": "So yesterday I made a post about conquering my fear of 17 years of throwing up. I caught a stomach bug that made me sick and threw up twice yesterday. Once at 6 am and again at noon. I haven't thrown up since, but now my mom got the exact same thing but way worse, intense stomach pain, and was throwing up way more, way more frequently, and violently, all within the span of 3 hours. She was taken to the hospital, but hearing her violently throw up while she was here just made me so scared just like it always does when she gets these things. I'm still recovering myself which makes me so scared. I don't want to get it again but worse this time like she had, and that makes me feel awful feeling that way because I was the one who got her sick and I want her to get better. But I'm just so scared again to the point that I taped the door to my room so that way I can isolate myself as much as possible from the rest of the house. Now it's night time and I hate night time in the winter, it makes me feel trapped, scared, and alone, because I've always had this feeling like everything bad happens at night like this. I don't know if I'm just panicking or if I'm still sick, but I feel like I'm gonna throw up again, and now I don't have anyone here to comfort me again if I do and I'm freaking out. How am I ever going to get over / control this fear? I can't take this anymore, my heart is always racing, I'm always scared, It's affecting my health really badly and I just want it to end. Someone, anyone, please, help me.\n ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218609,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Somebody please help me.",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac3gsc/somebody_please_help_me/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "GoCommitScooterAnkle",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2hmx49e8",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546500080,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac3ar2/does_anyone_else_keep_googling_questions_and/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac3ar2",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "daeflair",
            "link_flair_richtext": [],
            "link_flair_template_id": "cb0b9cf8-eabd-11e4-baec-22000b2690f5",
            "link_flair_text": "DAE Questions",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 1,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac3ar2/does_anyone_else_keep_googling_questions_and/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546500080,
            "score": 1,
            "selftext": "",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218605,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Does anyone else keep googling questions and symptoms but can never find any answers?",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac3ar2/does_anyone_else_keep_googling_questions_and/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "dudenotrightnow",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_11l0i94",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546510033,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac4d1f/how_do_i_stop_myself_from_feeling_guilty_when_i/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac4d1f",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 1,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac4d1f/how_do_i_stop_myself_from_feeling_guilty_when_i/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546510033,
            "score": 1,
            "selftext": "If I take even a day off to have fun, my anxiety kicks in and I keep thinking about all the work I have to do. This happens even when I have nothing important to do and is genuinely keeping me from enjoying my life. ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218645,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "How do I stop myself from feeling guilty when I am having fun?",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac4d1f/how_do_i_stop_myself_from_feeling_guilty_when_i/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "naylsonsb",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_10l5oiim",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546514806,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac4uvk/i_feel_so_akward_when_trying_to_talk_to_a_stranger/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac4uvk",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "adviceneeded",
            "link_flair_richtext": [],
            "link_flair_template_id": "1070d94c-76a1-11e5-9d9f-0e949b5b21c5",
            "link_flair_text": "Advice Needed",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 1,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac4uvk/i_feel_so_akward_when_trying_to_talk_to_a_stranger/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546514807,
            "score": 1,
            "selftext": "Is there a right way to talk to strangers?",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218661,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "I feel so akward when trying to talk to a stranger...",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac4uvk/i_feel_so_akward_when_trying_to_talk_to_a_stranger/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "YthoughFR",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_16kgas",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546517687,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac56b7/is_this_panic_attack_just_anxiety_or_something/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac56b7",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 0,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac56b7/is_this_panic_attack_just_anxiety_or_something/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546517689,
            "score": 1,
            "selftext": "I don’t really know how to classify this problem I’ve been having, I can’t tell if this is just anxiety or something more because I haven’t had this happen to me before and I haven’t really had anxiety to know if that’s what this is.\n\nSo, these ‘attacks’ I’ve been having started after seeing my Grandpa. He’s got Dementia and the beginning stages of Alzheimer’s. I hadn’t talked to him a lot or been to see him at all in a year before I visited him this thanksgiving (he lives out of state) and seeing him genuinely messed me up. I don’t know how to explain it, he’s not all the way gone but the cracks in his reality are starting to show in big ways, and a huge part of me, as selfish as it sounds, worries it’s gonna happen to me eventually. The thought of that sends me into a spiral that’s hard to come out of. I will think I see something out of the corner of my eye like I normally would before but now my brain will immediately think of him, and how he looks/ acts now and how that could be me one day. I can shake it off but random thoughts come into my head and I can’t seem to stop them from reoccurring.\n\nI just feel like it’s important to say that because my ‘attacks’ have only happened after seeing him and I feel like they are in some way a build up of the reoccurring bad thoughts I’ll have because of the thought of him. (I know I may sound like a bad person as it’s not his fault he’s going through this and I love him with all of my heart but I genuinely can’t help the way I feel, I feel horrible for even feeling this way and having these thoughts.) \n\nThe attacks will happen at random but something small always triggers them. For example, I’ll lay in one position for too long and my arm or leg will start to go to sleep. I’ll have a simple thought like “what if this tingling only gets worse” and before I can rationalize that I’m okay or even react myself, my body will react in the worst possible way, to the point that I’m convinced something has to be wrong because of the way my body is reacting. It’s like I loose the ability to control anything regarding how my body feels and it acts on its own. It’s like I’m having a conversation with my body trying to calm it down but my body is telling me It feels like there’s definitely something wrong. It feels like I’m going to die and something going on with my body will make me die at any second. I don’t know how to explain it properly because it feels so surreal when it happens, but the best example is that it feels like, within a fraction of a second, someone else is coming into my body and controlling all emotions and rationalizing for me and all I can do is deal with it. I’ll tell myself I’m okay and that nothings wrong but my body will genuinely feel like there’s something I need to get ready for, like something horrible is getting ready to happen. My feet will feel cold, my head will start to feel flushed and I get dizzy, all because of a simple “what if” thought that I’m not worried about anymore because I’m worried about how my body is reacting over everything. Then once it feels like I’m about to pass out because of how intense the experience is, the emotions start, it feels like every ‘on and off’ switch for every emotion I could have is being flipped on and off repeatedly. It literally burns, and feels like I’m a battery being drained to 0% and charged to 100% within a few seconds over and over, or like I’m a pilot who’s only ever flown in auto pilot and then in the blink of an eye, while flying, I have to know what everything does and how to fly a plane I’ve never learned to fly. All I can do is cry when this happens and try to call my mom or brother who think I’m crazy trying to explain why I’m crying and shaking but talking semi normally and responsively. It’s out of my control. I’ve never experienced anything like it before. I normally completely stop worrying about my body at this point, because whatever made my body freak out moved to my emotions, and I just try to manage the emotions because the emotions are worse than the initial attack. Then just as quickly as it all came, it’s over. I feel like I’m in control again, of my emotions, rationality and body. I normally just scream into my pillow after this and calm down knowing it’s over but cry thinking about it happening again. This will all happen in about 5 minutes. \n\nThis is hard for me to share and if you made it this far I really appreciate it, I never thought I’d have to reach out for help about my mental health and it’s really scary to do so. I’ve only had this happen 3 times since thanksgiving but each time is just as bad. If you know what this is, even if it’s just anxiety, or maybe you deal with it as well, any response will help me feel better and not so alone. ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218668,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Is this panic attack just anxiety or something else?",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac56b7/is_this_panic_attack_just_anxiety_or_something/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "veryverytiredbruh",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2tg3pa52",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546476842,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/abzzak/does_anyone_else_feel_better_when_they_delete/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "abzzak",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "daeflair",
            "link_flair_richtext": [],
            "link_flair_template_id": "cb0b9cf8-eabd-11e4-baec-22000b2690f5",
            "link_flair_text": "DAE Questions",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 5,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/abzzak/does_anyone_else_feel_better_when_they_delete/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546476843,
            "score": 1,
            "selftext": "I remember deleting my FB account a while back and feeling much better after doing that. and i'm kinda considering doing that again with other social media very soon. i mean, social media is just trash, honestly. i see all of these people living their lives, having great experiences, and getting a lot of attention, but meanwhile i'm here rotting in my home just waiting for someone to check on me, or for a chance to get away from my current life... as pathetic as it may seem, they just make me hate my current circumstances a lot more than i already do, and i don't think i need that 100%\n\nWhat about you guys?",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218478,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Does anyone else feel better when they delete their social media accounts?",
            "url": "https://www.reddit.com/r/Anxiety/comments/abzzak/does_anyone_else_feel_better_when_they_delete/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "Greg1994",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_kpfew",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546607349,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/aci09o/will_stopping_prozac_cause_a_return_in_anxiety/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "aci09o",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "medsflair",
            "link_flair_richtext": [],
            "link_flair_template_id": "ce379faa-e1c4-11e4-b574-22000bb24418",
            "link_flair_text": "Medication",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 6,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/aci09o/will_stopping_prozac_cause_a_return_in_anxiety/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546607350,
            "score": 1,
            "selftext": "I have been on Prozac for 2 years. 40mg capsules. I am a 24 year old male. I can honestly say it helped me get out of bad depression, anxiety, and OCD intrusive thoughts. I am in a good place now. Work a full time job, exercise, have a girlfriend, am fun to be around, etc. However two things are bothering me. One, I experience some sexual side effects with my girlfriend (low libido, delayed ejaculation, erection difficulties). This is something that’s bugged me for a while and I believe it’s due to the Prozac. Two, I plan on becoming a police officer in the next 2-3 years and don’t want to have to be on antidepressants as a cop. I also worry it might hinder my eligibility to get hired. \n\nSo my question to you, have you weened off Prozac and had your anxiety and depression come back? This is what I fear most. Thank you",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218991,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Will stopping Prozac cause a return in anxiety and depression?",
            "url": "https://www.reddit.com/r/Anxiety/comments/aci09o/will_stopping_prozac_cause_a_return_in_anxiety/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "1bluemooshie",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_1kej1vsd",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546620766,
            "domain": "i.redd.it",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ack0o9/for_those_who_have_anxiety_like_i_do_pretend_you/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ack0o9",
            "is_crosspostable": false,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": true,
            "is_robot_indexable": false,
            "is_self": false,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "helpfultips",
            "link_flair_richtext": [],
            "link_flair_template_id": "e63fe758-f081-11e4-8051-22000bb942c5",
            "link_flair_text": "Helpful Tips!",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 0,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ack0o9/for_those_who_have_anxiety_like_i_do_pretend_you/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546620767,
            "score": 1,
            "selftext": "",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 219034,
            "subreddit_type": "public",
            "thumbnail": "default",
            "title": "For those who have anxiety like I do, pretend you are here. You are safe, warm and secluded. No one can hurt you here.",
            "url": "https://i.redd.it/cuwr9qu2sf821.jpg",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "happiestunhappyhuman",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_i5mr3kr",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546624426,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ackn2o/does_anyone_else_mistake_the_urge_to_use_the/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ackn2o",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 1,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ackn2o/does_anyone_else_mistake_the_urge_to_use_the/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546624426,
            "score": 1,
            "selftext": "Whenever I have to use the restroom I feel like it’s an anxiety attack coming on but really I just need to go to the bathroom (sorry if this is TMI). I was wondering if anyone else shared the same experience.",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 219050,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Does anyone else mistake the urge to use the restroom for anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/ackn2o/does_anyone_else_mistake_the_urge_to_use_the/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "MarcendaSampaio",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_zdchqvv",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546515705,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac4y8z/wisdom_teeth_removal_anxiety/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac4y8z",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "adviceneeded",
            "link_flair_richtext": [],
            "link_flair_template_id": "1070d94c-76a1-11e5-9d9f-0e949b5b21c5",
            "link_flair_text": "Advice Needed",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 6,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac4y8z/wisdom_teeth_removal_anxiety/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546515706,
            "score": 1,
            "selftext": "I'm getting 2 of my wisdom teeth (in the left side of my face) removed in a few hours. It's the first time I'm doing something like this and I'm very nervous. How can I stay calm when entering the dentist's office? I feel like I'm going to pass out when the procedure starts.",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218663,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Wisdom teeth removal anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac4y8z/wisdom_teeth_removal_anxiety/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "MissJ0321",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2wubnkon",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546544761,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac9cwo/nervous_to_ask_for_an_esa/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac9cwo",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "helpfultips",
            "link_flair_richtext": [],
            "link_flair_template_id": "e63fe758-f081-11e4-8051-22000bb942c5",
            "link_flair_text": "Helpful Tips!",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 3,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac9cwo/nervous_to_ask_for_an_esa/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546544762,
            "score": 1,
            "selftext": "So I took a teaching job 4 hours from home (which for me is pretty far.) My first semester, I was so busy with teaching and coaching one act I had no time nor energy to socialize. Once one act season ended, I have been slowly but surely trying to get out more. However the town I live in is extremely small, like 800 people, so there's hardly any sort of volunteer opportunities. I've tried reaching out to coworkers, but they are all married and/or with kids and busy. \n\nMy landlady is extremely nice, but the Tennant before me  had a cat that torn the place to hell now there's a no pets policy. She did say I could have a reptile or bird and I did get a fish, but it's not the same. A repitle or bird would be too high maintenance for me to care for, a cat would probably be the best for me. I know that b/c of my ADHD and anxiety I could probably qualify for an ESA, but I feel like it wouldn't be fair to my landlady. She's very good to me, and I don't want to look like \"that person\". I do have an appointment to speak with a doctor here so on, but I just wanted to to get some other opinions as well. \n\nDo I try to find a new place to live that allows pets or do I try to go for getting an ESA?",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218788,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Nervous to ask for an ESA",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac9cwo/nervous_to_ask_for_an_esa/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "BlackPershing",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2stqs9e6",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546533327,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ac7d06/do_you_ever_get_that_feeling/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "ac7d06",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 19,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/ac7d06/do_you_ever_get_that_feeling/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546533328,
            "score": 1,
            "selftext": "When your anxious and your chest is tight and you can’t take a deep breath... ugh been dealing with that lately.. it sucks ",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218741,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Do you ever get that feeling",
            "url": "https://www.reddit.com/r/Anxiety/comments/ac7d06/do_you_ever_get_that_feeling/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "malkie-moon",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_i5dromb",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546601086,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/acha49/my_coworker_found_out_about_my_selfharm_issues/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "acha49",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "adviceneededflair",
            "link_flair_richtext": [],
            "link_flair_text": "Advice Needed",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 4,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/acha49/my_coworker_found_out_about_my_selfharm_issues/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546601087,
            "score": 1,
            "selftext": "Background:\nCoworker A and me have been friendly since I work here (4 months) and he's occasionally flirty, but even Though I was anxious at first I just ignored his approaches.\nSo today I was talking to Coworker B who mentioned how surprised she is by my attitude, I always sounded so weird when CW A talked about me. Apparently A has been telling B a lot about me and, even though I don't know any details, most of it wasn't exactly nice.\nCW B also told me that A texted her saying that he thinks I'm 'a cutter' and how that totally turned him off.\nEspecially this made me extremely anxious, I'm nauseous and dizzy and took the long way to my Office to avoid running into A.\n\nI don't know why him being 'turned off' by my scars is so hard for me. I really, really don't want a relationship with A but I feel so abnormal and somehow freaky. To encounter how judgemental people are just scares me because how many others will think the same of me? I've made an effort not to let anyone at work know about my  mental health issues because of stuff like this.\nThe talking behind my back thing just worsens the situation.\n\nI feel so shitty avoiding him And I know I should talk to him but just thinking about bringing the subject up makes me shaky.\n\nHas anyone experienced something similar and has advice for situations like this?\nThanks for reading.",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218980,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "My coworker found out about my self-harm issues and it's making me nauseous",
            "url": "https://www.reddit.com/r/Anxiety/comments/acha49/my_coworker_found_out_about_my_selfharm_issues/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "yella_fella",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_2pto349k",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546620308,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/acjxww/i_can_let_go_of_my_worries_to_feel_better_but_not/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "acjxww",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "discussion",
            "link_flair_richtext": [],
            "link_flair_template_id": "0cd8a752-f6ac-11e5-859d-0e1f6820d4a9",
            "link_flair_text": "Discussion",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 0,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/acjxww/i_can_let_go_of_my_worries_to_feel_better_but_not/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546620309,
            "score": 1,
            "selftext": "Every time I let go of a worry or an anxious thought, I feel like I’m forgetting something and eventually coax myself into worrying about the same things I just tried to forget. This has been a vicious cycle that I almost defeated.... except this keeps happening. Anyone else have this problem overcoming the anxious thoughts once and for all?",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 219033,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "I can let go of my worries to feel better, but not really",
            "url": "https://www.reddit.com/r/Anxiety/comments/acjxww/i_can_let_go_of_my_worries_to_feel_better_but_not/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "puta_trinity",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_klnvz",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546595163,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/acgo33/too_late_to_call_someone_need_to_talk/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "acgo33",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_css_class": "venting",
            "link_flair_richtext": [],
            "link_flair_template_id": "19ddd408-76a1-11e5-acb1-0ea7f7edc7ed",
            "link_flair_text": "Venting",
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 3,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/acgo33/too_late_to_call_someone_need_to_talk/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546595164,
            "score": 1,
            "selftext": "I just woke up from a terrible dream where I died in a car accident. That was enough to wake me up with my heart pumping fast. I tried brushing it off and falling back asleep but it didn’t quite work. \n\nI then texted my boyfriend about it thinking getting it out might be nice and relieve from stress. \n\nBut now I’m just thinking about things that aren’t really related. I recently just started living by myself temporarily. But I’ve been so anxious about it. Making sure I locked the door. I just am unrealistically imagining someone coming in to hurt me but I know that isn’t going to happen. I know I’m being irrational but I can’t stop. \n\nI just want to sleep. Forget about it all. And wake in the morning so there is some distance to the feeling I have now. \n",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218972,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "Too Late to Call Someone.. Need to Talk",
            "url": "https://www.reddit.com/r/Anxiety/comments/acgo33/too_late_to_call_someone_need_to_talk/",
            "whitelist_status": "house_only",
            "wls": 1
        },
        {
            "author": "akahaus",
            "author_flair_css_class": null,
            "author_flair_richtext": [],
            "author_flair_text": null,
            "author_flair_type": "text",
            "author_fullname": "t2_ku8hshm",
            "author_patreon_flair": false,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1546462884,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/abxoki/cbd_for_anxiety/",
            "gildings": {
                "gid_1": 0,
                "gid_2": 0,
                "gid_3": 0
            },
            "id": "abxoki",
            "is_crosspostable": true,
            "is_meta": false,
            "is_original_content": false,
            "is_reddit_media_domain": false,
            "is_robot_indexable": true,
            "is_self": true,
            "is_video": false,
            "link_flair_background_color": "",
            "link_flair_richtext": [],
            "link_flair_text_color": "dark",
            "link_flair_type": "text",
            "locked": false,
            "media_only": false,
            "no_follow": true,
            "num_comments": 1,
            "num_crossposts": 0,
            "over_18": false,
            "parent_whitelist_status": "house_only",
            "permalink": "/r/Anxiety/comments/abxoki/cbd_for_anxiety/",
            "pinned": false,
            "pwls": 1,
            "retrieved_on": 1546462885,
            "score": 1,
            "selftext": "I’m not looking for recommendations so much as insights.\n\nI’m already on medications (Lexapro and Buspirone) so already that’s one reason I should think twice about adding to the mix.\n\nBut I’m reframing my whole outlook and think that someday, if I can, I want to try to manage my anxiety without pharmaceuticals.\n\nAnyway...\n\nWhat does it feel like ? I’m considering oral solution as a starting point. \nDo you take some drops and feel calm within a few minutes? \n\nDo you feel tired or out of it?\n\nHow much do you take and how?\n\nDo you also take meds?\n\nIn general, what is your experience and has it been positive?",
            "send_replies": true,
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "subreddit_subscribers": 218412,
            "subreddit_type": "public",
            "thumbnail": "self",
            "title": "CBD for anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/abxoki/cbd_for_anxiety/",
            "whitelist_status": "house_only",
            "wls": 1
        }
    ]
}