{
    "data": [
        {
            "author": "ricolahpse",
            "author_created_utc": 1365528319,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b973x",
            "created_utc": 1365528455,
            "domain": "self.Anxiety",
            "edited": 1365690855,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c01xp/i_am_a_guy_who_used_to_suffer_from_social_anxiety/",
            "gilded": 0,
            "id": "1c01xp",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 118,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c01xp/i_am_a_guy_who_used_to_suffer_from_social_anxiety/",
            "retrieved_on": 1412838088,
            "score": 325,
            "secure_media_embed": {},
            "selftext": "/u/rainman18 asked me on /r/meditation to describe what had changed for me. I typed a long response for him and, as luck would have it, lost the response. So I decided to visit here and share my development\n\nI am male and have the background probably most of you have\n1) Super anxious mother, absent dad. No one to turn to when I couldn't take my mom anymore. She did a lot of things that didn't exactly have the outcome of, er, pacifying my anxiety.\n2) Terrified of talking to girls\n3) Might as well have gotten my doctorate for all the research I did into anxiety and all the rumination I expended on. For long stretches, EVERY. WAKING. THOUGHT. of mine was about how to outsmart or out-think or manage my anxiety.\n4) Enormously self-critical of my performance and my anxiety and my thinking\n5) Fundamentally unhappy even though I came to develop compensatory behaviors which fooled a lot of people into thinking I was confident.\n\nI'm not going to spend anymore time discussing the ways I suffered over the years for brevity's sake. If you are interested, go ahead and ask :)\n\nNow on to how I overcame anxiety\n\nAs I said above, I spent many years researching and ruminating and plotting/developing compensatory behaviors for my anxiety. About a year ago, as part of this neverending search, I came across a book named Search Inside Yourself by Chade Meng Tan. It introduced me to mindfulness from a neuroscientific/practical benefit perspective. For someone with a hyper critical mind, I think its emphasis really suited my need for specific outcomes and efficacy data.\n\nAnd so I began to meditate. Being brash, I started off meditating for an hour and spent the hour being utterly frustrated and incensed at myself for not being able to pay any quality attention to my breath. But the next morning, I swear, the world looked more garish, more vibrant. I was sold. \n\nOver the next couple of months I would continue these hour-long sits in which I would spend 80-90% of the time running the mental treadmill over these thoughts \"I don't know if I'm doing this right. This doesn't feel right. I think if I pay attention to the vibration of the breath in my nostrils I'll be able to stay mindful for longer. No.. that didn't work. Dammit! Why isn't this working?\" Sitting turned into a deeply unhappy, hyper-critical time in which I obsessed more about whether I was meditating correctly, or how I could meditate better, than actually, you know, meditating. \n\nI can't even say that I was being diligent in the frequency of my meditation. Over the last year, I've meditated an average of one day a week - maybe. A stretch of 3-5 days followed by some life disruption (usually tiredness) and then 2 weeks off. But I did try during my waking hours to pay attention to my breath whenever I could. Ironically, this meant that I carried the same hyper-criticism and dissatisfaction and unhappiness into even neutral activities. But, in retrospect, it did provide a diversion from my usual, *consuming*, habit of ruminating all day everyday about my anxiety.\n\nDuring driving, during conversations with my mom, and so on I would try to come back to the breath. The intention and determination to stay mindful was always there and I can't precisely explain why. After maybe 5 or 6 months I noticed that my mind was getting quieter. I used to talk in my head A LOT but that had diminished - and would continue to diminish over the months. My anxiety was largely there and my avoidance behaviors and compensatory behaviors and ruminating thinking was still there. I still couldn't approach any girls if you put a gun to my head. I could barely make eye contact with strangers for fear that they would be offended. The self criticism was still strong. I would still rather have died than turned to a friend or loved one and shared my problems with anxiety, or my two academic suspensions from an Ivy League school (simply could not function due to performance anxiety), or that I was a virgin who had never had a girlfriend.\n\nBut something was happening. In an ineffable sense, it got a bit quieter in my head, and then I started to loosen up here and there. I would say yes to invitations from friends (I never accepted ANY invitations from friends before), I would hold eye contact (even with girls!), smile, and even say hi to strangers. Now, full disclosure, a lot of these developments occurred because there were times when I wouldn't feel anxiety. Times, for instance, when I would look at a girl and my chest wouldn't constrict painfully and I wouldn't feel like a deer in headlights. Sans the associated physical symptoms, I behaved healthily. \n\nBut. Nine months in, the higher hanging fruit in my anxiety totem pole - sharing intimate details with people (people, even those who barely know me, have often called me out for being closed off), conversing with my mum (especially about anxiety triggering topics), approaching girls - all of those still triggered the physical symptoms of anxiety and avoidance. I was convinced that the key to beating my anxiety was abating the overwhelming physical symptoms of anxiety which trigger avoidance. I was wrong.\n\nTo cut a long story short, over the last three months, three key events happened which helped break me completely free of anxiety. The first was having my first ever girlfriend. The second was her breaking up with me 3 days after we were together due to insecure, compensatory habits I had developed for my anxiety in the past and my ensuing deep guilt and soul searching, and the third was a meditation retreat I attended.\n\nToday, I still feel anxiety. I still trigger avoidance when I feel the physical symptoms of anxiety. But there's a clear difference in my response. The moment I feel those physical symptoms and that avoidance, I have this ineffable intuitive sense that attending to my anxiety in a certain way only increases my suffering, I have this intuitive sense that *I have a choice* about whether to cultivate the anxiety or let it go, and I have this intuitive sense of how exactly to let it go.\n\nThink of it like playing basketball. You shoot the ball and it goes into the basket, broadly speaking. But you have only an intuitive sense of how you're able to calculate how far the basket is, how much spin to give the ball, what arc to give the ball. Now think of what happens when a beginner plays in a basketball game when someone applies defensive pressure to them. Their brain gets scrambled because of their anxiety and they lose the ability make use of that intuitive sense. But look at a professional player. He is not oblivious to the defensive pressure. It still affects him. But he is still able to recover from the momentary mental confusion and tap back into his intuitive sense of how to direct the ball into the hoop, even though he could never tell you how he's able to do it. \n\nThat's how it is with anxiety and me. It arises like a bubble and I experience it and something tells me that I don't have to continue paying attention to it in a certain way (what 'in a certain way' means, I will never be able to explain in words). So I direct my attention to my breath. SOMETIMES, my attention will instantly go forcefully back to the physical symptoms and my mental confusion will return and this will happen over and over again. The KEY DIFFERENCE is that whereas before I would have questioned whether I was being mindful in the correct way or if my mindfulness was working or whether I needed to tweak my technique or try something different is that I bring my attention right back to my breath, over and over again. SOMEHOW, I'm not sucked into the anxiety. I can't explain it. But it's not voluntary - AT ALL. It just sort of happens in the way the basketball player intuitively knows to fluidly change his pace and his direction at full speed to elude defensive pressure. I could never fully explain it. And that's the thing - I simultaneously have a clear intuitive understanding that if I try to consciously mess with these responses, my anxiety will only inflame and increase. I subconsciously understand exactly how much to get involved and how much to leave alone. I subconsciously understand that attending to the physical emotions of anxiety and mental confusion does something bad to my quality of attention and thinking. How all this came from simply paying attention to the physical sensations of my breath and body, I have no idea - but I really didn't do anything more special than that over the past year.\n\nSo looking back, I can safely say that none of the efforts I made to help my anxiety alone were worthwhile. But, at the same time, I'm not even sure I could have helped any of the efforts. The more I meditate, the more I see that it's a very questionable proposition to attribute any of my volitions or emotions - healthy or not - to my doing. In fact, more and more of my creativity and my performance comes from understanding how my drive to manage and exert control and intellectually master/understand only interferes with beautiful processes which are working themselves out. But if you had told me this a year ago today when I found Search Inside Yourself, I'm not sure it would have made a difference even if I had completely believed you. The brain does its own thing. :)\n\nAsk away! I've omitted and truncated here and there because I realized this was turning into a tl'dr :)\n\n\n----\nEDIT: I'll be writing a series of thoughts here based on things that occur to me or seem to be common threads or concerns. Please check it periodically. Also look through the thread periodically as your question or concern may have been answered by me in 5 different ways :) I'm always happy to re-engage with you though. My time and my knowledge are yours.\n\nhttp://www.reddit.com/r/Anxiety/comments/1c01xp/i_am_a_guy_who_used_to_suffer_from_social_anxiety/c9bvosh",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I am a guy who used to suffer from social anxiety and no longer does (AMA)",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c01xp/i_am_a_guy_who_used_to_suffer_from_social_anxiety/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365947066,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1cbovy/i_find_my_new_watch_strangely_comforting/",
            "gilded": 0,
            "id": "1cbovy",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1cbovy/i_find_my_new_watch_strangely_comforting/",
            "retrieved_on": 1412821583,
            "score": 276,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/xtnxx3gCwM6sj_c6.jpg",
            "title": "I find my new watch strangely comforting.",
            "url": "http://i.imgur.com/mkEFuTu.jpg",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365886993,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1caep1/a_great_sentiment/",
            "gilded": 0,
            "id": "1caep1",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1caep1/a_great_sentiment/",
            "retrieved_on": 1412823381,
            "score": 265,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ewrEURDB8JuEr5da.jpg",
            "title": "A Great Sentiment.",
            "url": "http://i.imgur.com/5nte66K.jpg",
            "user_reports": []
        },
        {
            "author": "Njbb",
            "author_created_utc": 1328158062,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tfyi",
            "created_utc": 1365814088,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c8rtl/hey_ranxiety_after_a_long_year_of_unemployment_i/",
            "gilded": 0,
            "id": "1c8rtl",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c8rtl/hey_ranxiety_after_a_long_year_of_unemployment_i/",
            "retrieved_on": 1412825693,
            "score": 145,
            "secure_media_embed": {},
            "selftext": "I quit my job and moved across the country a year ago to find myself in a situation I did not enjoy and no money. For months and months I've been working up the courage to submit applications. Today I got hired full-time at a place near my home. I know it's a small step for many, but it's a milestone in my life. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey r/Anxiety, after a long year of unemployment, I finally got hired!",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c8rtl/hey_ranxiety_after_a_long_year_of_unemployment_i/",
            "user_reports": []
        },
        {
            "author": "alittlestranger",
            "author_created_utc": 1350445828,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9bsi4",
            "created_utc": 1365470233,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1byj7t/youre_braver_than_you_believe_xpost_from/",
            "gilded": 0,
            "id": "1byj7t",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1byj7t/youre_braver_than_you_believe_xpost_from/",
            "retrieved_on": 1412840050,
            "score": 124,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/Fr7KvwKILNOQAaE1.jpg",
            "title": "\"You're braver than you believe...\" [x-post from r/QuotesPorn]",
            "url": "http://i.imgur.com/aMjeqIx.jpg",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365686172,
            "domain": "self.Anxiety",
            "edited": 1365695527,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c4ruf/we_have_to_quit_turning_this_subreddit_into_a/",
            "gilded": 0,
            "id": "1c4ruf",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c4ruf/we_have_to_quit_turning_this_subreddit_into_a/",
            "retrieved_on": 1412831548,
            "score": 103,
            "secure_media_embed": {},
            "selftext": "We all have anxiety. We know the chest pains, heart palpatations, dizzy feeling, and the other 100000 symptoms of anxiety.\n\nBut sitting in front of your computer posting about how bad you feel on reddit is never going to make you feel better. And sitting here wanting people to feel sorry for us because we all feel the same isn't going to help you either. \n\nYou need to be active in wanting to help yourself. Can we start posting more POSITIVE things here? It's just a place now for people to post links about how shitty they feel. We all know the feeling and it's getting old. \n\nI've been dealing with anxiety for over 10 years. Ive been in the hospital several times. I started to deal with it, get medical help, quit being scared of taking pills and the side effects, changed my diet, exercise, get out of the house and away from the computer, quit googling your symptoms so you don't think you always have cancer or going to have a heart attack, and be PRO-ACTIVE and positive.\n\nI'm not posting this to be a dick, but posting this because I see myself in so many people here. If anyone wants to talk or wants maybe some guidance, please PM me. I am  not a doctor but if you need to talk through something, I'm more than willing to try and lend an ear.\n\nBut right now, all we are doing is fueling our anxiety because we keep talking about negativity all the time here. Let's start being proactive together and supportive and not use this place as a forum to ask others if you are having a heart attack.\n\nYou would have had one already if that was the case. No. You are not dying. You just have anxiety. We get it. We all know the feeling.\n\nAnd to answer questions like Does anyone else feel this way or have you ever felt like this- I will save you time- the answer is YES YES YES. lol YES. We have. \nxoxoxo\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "We have to quit turning this subreddit into a circle jerk of sob stories about how shitty we feel. Anyone agree?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c4ruf/we_have_to_quit_turning_this_subreddit_into_a/",
            "user_reports": []
        },
        {
            "author": "Gurgumul",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365602361,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c29k6/social_anxiety_making_me_look_like_an_asshole/",
            "gilded": 0,
            "id": "1c29k6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 56,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c29k6/social_anxiety_making_me_look_like_an_asshole/",
            "retrieved_on": 1412835001,
            "score": 98,
            "secure_media_embed": {},
            "selftext": "I often get the feeling that I seem rude to others. I'm a guy and almost not talk to girls because of my anxiety. I rarely greet people on my own initiative, though I usually greet them back. There's more, like for example today I accidentally stepped on a girl's foot (I'm quite clumsy overall) in a bus and didn't even say a short \"sorry\" for it, instead I tried to act a bit like it didn't happen. All these situations make me feel bad and arrogant, so how can I at least care a bit less about that?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Social anxiety making me look like an asshole.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c29k6/social_anxiety_making_me_look_like_an_asshole/",
            "user_reports": []
        },
        {
            "author": "mizzlebizzle",
            "author_flair_css_class": "",
            "author_flair_text": "GAD - Panic - Phobia",
            "created_utc": 1365472637,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1bymjj/saw_this_on_rpics_felt_it_summed_up_anxiety/",
            "gilded": 0,
            "id": "1bymjj",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1bymjj/saw_this_on_rpics_felt_it_summed_up_anxiety/",
            "retrieved_on": 1412839931,
            "score": 92,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/guEtmFi9qahIEq0o.jpg",
            "title": "Saw this on /r/pics... felt it summed up anxiety pretty well at times",
            "url": "http://i.imgur.com/gePiDvB.png",
            "user_reports": []
        },
        {
            "author": "phantasmagorical",
            "author_created_utc": 1279158347,
            "author_flair_css_class": "",
            "author_flair_text": "GAD/PD/Agoraphobia",
            "author_fullname": "t2_46mx5",
            "created_utc": 1365722747,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c64a4/victory_no_sob_story_here_my_disability_claim_for/",
            "gilded": 0,
            "id": "1c64a4",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c64a4/victory_no_sob_story_here_my_disability_claim_for/",
            "retrieved_on": 1412829574,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "I just received notice from California State Disability insurance. Worked my last day in February, couldn't take it anymore. Originally I filed a claim with my private STD / LTD in the beginning of March. Mid March I filed with the state (because I wasn't told I had to &gt;&lt;). \n\nJust checked in with SDI Online and I was approved!!! I get covered for almost the entire 3 months I've been out of work.\n\nPlease don't give up. I was so close to giving up so many times, but I tried to just keep my head up and hope for the best. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Victory] No sob story here. My disability claim for anxiety got approved!!",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c64a4/victory_no_sob_story_here_my_disability_claim_for/",
            "user_reports": []
        },
        {
            "author": "buckthefishtem",
            "author_created_utc": 1364815266,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b5c7x",
            "created_utc": 1365852370,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c9iyd/anticipatory_anxiety_i_cant_make_plans/",
            "gilded": 0,
            "id": "1c9iyd",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c9iyd/anticipatory_anxiety_i_cant_make_plans/",
            "retrieved_on": 1412824640,
            "score": 57,
            "secure_media_embed": {},
            "selftext": "The thought of making plans is awful to me. I am happy to talk about them, commit to them.. But when it comes down to it? Jesus. I get sweaty, cold, shaky, nausea and gassy..\n\n I can't relax, calm down or focus.. Basically kills everything I ever plan to do. My *own* birthdays are terrifying, knowing that I'll have to tolerate people and am expected to socialize on a day that's meant to be for me. Doctors appointments? Hell. I end up with more symptoms on the walk to the doctor than I had before the phone call. Meals out with family or friends? FORGET IT. I'll sit at home and eat my microwavable meal whilst in bed on my laptop. \n\nI don't know what to do. How to deal with it, or how to breach this subject with a doctor. It's tearing away at me. I haven't had a real, active friendship for about two years. It's bad. THAT bad. \n\nI recently met a girl online, and it's getting serious. LDR serious. Five months now, and in about a year and a half if we're still going strong, we may end up moving in together and being happy. How can I be happy? I have to plan trips, visits, everything is just weighing down on me.\n\nOn top of this, I suffer with a massive phobia of sickness (vomiting in particular) and all symptoms related to sickness sends me into an anxiety attack. I cannot deal with this. If I'm not feeling anxious about going out, if I finally commit to going out and get a cramp, ache or hunger pang.. I'm back to square one. \n\nI need help. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anticipatory Anxiety... I can't make plans, socializing is a mental chore.. How can I stop myself from staying at home all day everyday? I'm going to die alone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c9iyd/anticipatory_anxiety_i_cant_make_plans/",
            "user_reports": []
        },
        {
            "author": "Phoenix1Rising",
            "author_created_utc": 1322243584,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6b8d0",
            "created_utc": 1365418712,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1bwsey/how_does_alcohol_and_your_intake_of_it_affect/",
            "gilded": 0,
            "id": "1bwsey",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 73,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1bwsey/how_does_alcohol_and_your_intake_of_it_affect/",
            "retrieved_on": 1412842286,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How does alcohol (and your intake of it) affect your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1bwsey/how_does_alcohol_and_your_intake_of_it_affect/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365425983,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1bwxms/overthinking_analyzing_too_much/",
            "gilded": 0,
            "id": "1bwxms",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1bwxms/overthinking_analyzing_too_much/",
            "retrieved_on": 1412842102,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "Does anyone tend to do this?\nIt works me up each and every time, no matter what it has to do with: Friends, Work, Relationships, Money, etc. The list goes on and on and on!\n\nI realized this weekend just how much time I spend worrying about friends being two-faced, relationships not working out, how I over think and analyze and tend to jump to conclusions, assuming the worst of people, just because I've had some shitty luck in the past. I need to really focus on the best outcomes, and positive things more than the negative. Maybe this will truly help my anxiety issues. \n\nHas anyone else come to this conclusion and/or dealt with this sort of thing before?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Overthinking &amp; Analyzing Too Much",
            "url": "http://www.reddit.com/r/Anxiety/comments/1bwxms/overthinking_analyzing_too_much/",
            "user_reports": []
        },
        {
            "author": "thejaegers",
            "author_created_utc": 1365116260,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b76an",
            "created_utc": 1365647137,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c3xq3/dae_feel_that_their_anxiety_builds_up_slowly_over/",
            "gilded": 0,
            "id": "1c3xq3",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c3xq3/dae_feel_that_their_anxiety_builds_up_slowly_over/",
            "retrieved_on": 1412832656,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I have officially been diagnosed with GAD, although social anxiety, panic disorder, and health anxiety make appearances every so often. I have been on Paxil for a month and a half and my anxiety is definitely better controlled on this medication. However, I have noticed that if low, manageable levels of anxiety rear their head over a period of several days, it eventually culminates in the need to take Xanax to sort of \"reset\" back to my normal levels of anxiety. This has resulted in me taking a Xanax approximately once a week in order to keep things all leveled out. I was wondering if this was a common occurrence or something out of the ordinary. Thanks!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE Feel That Their Anxiety Builds Up Slowly Over Several Days?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c3xq3/dae_feel_that_their_anxiety_builds_up_slowly_over/",
            "user_reports": []
        },
        {
            "author": "Phoenix1Rising",
            "author_created_utc": 1322243584,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6b8d0",
            "created_utc": 1365761951,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c75aj/thinking_about_yourself_in_third_person/",
            "gilded": 0,
            "id": "1c75aj",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c75aj/thinking_about_yourself_in_third_person/",
            "retrieved_on": 1412828030,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "Sometimes this has helped me control my anxiety, or at least understand that it is a temporary emotion (since in the moment it can seem like it will last forever).\n\nFor example, thinking \"Phoenix1Rising is anxious right now. Her heart is racing.\" can actually help me, versus \"Oh my god I'm so anxious right now, what's wrong with me? I already took a benzo but am I still going to have a panic attack?\"\n\nHas anyone else had any success with this type of method, or similar ones?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thinking about yourself in third person",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c75aj/thinking_about_yourself_in_third_person/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365396793,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1bwekj/screw_you_anxiety/",
            "gilded": 0,
            "id": "1bwekj",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1bwekj/screw_you_anxiety/",
            "retrieved_on": 1412842780,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I am SO over this. \n\nToday started out really good, it was actually an awesome day after what had been kind of a crappy week. My kids were getting along swimmingly, I got a ton of stuff done, it was just good.\n\nAfter I made lunch and got the little ones down for a nap, I sat down to play online for a little bit and BAM. Anxiety attack. Out of nowhere. WTH?\n\nI beat it though! It happened, I didn't stop it, but I powered through. My husband was asleep after working a 16 hour overnight shift, and he is working again tonight so no way was I going to wake him up. I only had one kid awake, so I set her up with some cartoons and I forced myself to eat, drink some water, I went out and watered the yard, I scrubbed the heck out of the bathroom and I mopped the floor. \n\nMy house looks amazing, and I managed to get through an attack alone. It feels like a big victory!\n\nBut seriously. Why do they just hit like that? There was not a single reason for it, at all. I was relaxed and happy. Now, I'm in that tired, kind of achy anxiety-hangover phase. I feel kind of depressed, kind of full of dread that I'll have another one.  Screw anxiety. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Screw you, anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/1bwekj/screw_you_anxiety/",
            "user_reports": []
        },
        {
            "author": "01zerrz",
            "author_created_utc": 1331820398,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_76f3y",
            "created_utc": 1365679414,
            "domain": "pchtreatment.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c4mpd/houston_rockets_royce_white_speaks_out_about/",
            "gilded": 0,
            "id": "1c4mpd",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c4mpd/houston_rockets_royce_white_speaks_out_about/",
            "retrieved_on": 1412831734,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/8AE12PyJchYkC9xW.jpg",
            "title": "Houston Rockets' Royce White Speaks out about Anxiety Disorder. Finally, somebody getting this topic some serious attention.",
            "url": "http://www.pchtreatment.com/psychological-treatment-blog/houston-rockets-royce-white-speaks-out-about-anxiety-disorder/",
            "user_reports": []
        },
        {
            "author": "Redz0ne",
            "author_created_utc": 1361839113,
            "author_flair_css_class": "",
            "author_flair_text": "PTSD/GAD",
            "author_fullname": "t2_aqeew",
            "created_utc": 1365533790,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c09go/i_feel_like_such_a_faker/",
            "gilded": 0,
            "id": "1c09go",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c09go/i_feel_like_such_a_faker/",
            "retrieved_on": 1412837793,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "as in, my psychiatrist has basically told me that i do have a very bad case of anxiety and PTSD-like symptoms... but there are some days where i feel like i can function like a normal human being.\n\nand in those days, there are times when i think \"gee, other people seem to have a worse time with their anxiety and depression... so, maybe i'm just faking it?\"\n\nI know that that's an irrational train of thought but to be completely blunt, it's there... and don't get me wrong, i'm not saying i AM a faker as the days that are not good are really, really not good (As in, i cannot even go outside for fear that my anxiety will get the better of me if i find myself in a triggering situation.) so, on an intellectual level i do understand that i'm not normal... but there's that little hater inside me that tries to trip me up. (that little hater being that overly negative train of thought or internal monologue that tends to crop up once in a while.)\n\nI mean, right now... as in, right now at this very moment in time, i feel okay... not \"i can take on anything\" but more the \"i'm feeling okay... not great, but not terrible.\" and it's these days that i feel somewhat decent that make me feel like i'm a fake.\n\nAny suggestions you can give for getting that little-hater to STFU?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like such a faker...",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c09go/i_feel_like_such_a_faker/",
            "user_reports": []
        },
        {
            "author": "Anxiousandalone",
            "author_created_utc": 1365793039,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bamo9",
            "created_utc": 1365793269,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c827q/anxiety_and_panic_makes_me_feel_so_alone/",
            "gilded": 0,
            "id": "1c827q",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c827q/anxiety_and_panic_makes_me_feel_so_alone/",
            "retrieved_on": 1412826696,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I'm having a lot of anxiety and panic attacks lately and I'm feeling very alone, even though my wife is supportive. Just sucks. I'm taking Paxil and klonopin and it's not helping. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety and panic makes me feel so alone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c827q/anxiety_and_panic_makes_me_feel_so_alone/",
            "user_reports": []
        },
        {
            "author": "thing1not2",
            "author_created_utc": 1357601903,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a51ui",
            "created_utc": 1365790037,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c7xt3/i_have_a_lovehate_relationship_with_my_cell_phone/",
            "gilded": 0,
            "id": "1c7xt3",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c7xt3/i_have_a_lovehate_relationship_with_my_cell_phone/",
            "retrieved_on": 1412826866,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I get crazy anxious about my cell phone. I find myself constantly checking it to see if anyone's tried to contact me. Even when I really just want to be left alone and don't feel like talking to anyone. Does anyone else deal with this? Any ideas on how to stop it for good...or at least help me with my compulsions? I'll leave it at home intentionally every now and then, but then I find myself anxious about getting home to check it. Aaaaah make it stop!!!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have a love/hate relationship with my cell phone",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c7xt3/i_have_a_lovehate_relationship_with_my_cell_phone/",
            "user_reports": []
        },
        {
            "author": "quixotic_raconteur",
            "author_created_utc": 1328138038,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tcg3",
            "created_utc": 1365518512,
            "domain": "self.Anxiety",
            "edited": 1365550390,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1bzow9/how_can_i_feel_ok_about_relaxing/",
            "gilded": 0,
            "id": "1bzow9",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1bzow9/how_can_i_feel_ok_about_relaxing/",
            "retrieved_on": 1412838580,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I have this terrible workaholic anxiety. \n\nEver since I got on meds (Celexa and Abilify) I've had energy to do stuff, which is great. But I get terribly down and anxious if I ever do nothing.\n\nHelp? :(\n\nEdit: thanks, guys! I will certainly try these things to see what works for me. c:",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How can I feel ok about relaxing?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1bzow9/how_can_i_feel_ok_about_relaxing/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1365459664,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1by4rv/my_girlfriend_has_started_triggering_my_anxiety/",
            "gilded": 0,
            "id": "1by4rv",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1by4rv/my_girlfriend_has_started_triggering_my_anxiety/",
            "retrieved_on": 1412840570,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I'll say this: I love my girlfriend very, very much. We've been together almost three years, and it's been wonderful. Even in the down times I've never wanted to leave, and I never doubted my feelings before.\n\nBut a few months ago, I noticed that I was getting irritated by her sometimes, just when she was around. Rationally I think it was situational, since we were in a bad living situation at the time and we were both very stressed. But of course, GAD to the rescue.\n\nI started getting anxious, wondering if the feelings meant I hated her. I never want to leave her, so you can imagine that the thought of us breaking up was scary. A person without anxiety probably could have sorted this out, but I just started panicking (I have both GAD and panic disorder, fun fun). My mind went to all the usual places. *Are we going to break up? Do I hate her? How does she feel about me? I can't live without her. What's going to happen?* We're living apart at the moment, so thankfully she didn't have to be around for all of this.\n\nIt all just kept compounding until this was all I could think about all day. And I mean for weeks and weeks. I'm still thinking about it, and I wouldn't be surprised if I've been panicked about it for around two months now. I stopped eating for a while, lost a bunch of weight, couldn't get out of bed, couldn't really clean myself. And all the while, the same thoughts.\n\nIt's not as bad now, but I still feel like almost every time I talk to her, the GAD clicks on and I start thinking, *okay, pay really, really close attention, because I HAVE to figure out how to keep this from going bad.* And that makes me nervous. And of course, seeing her through this filter of anxiety is almost certainly making me perceive her differently, making me more anxious about us breaking up, which makes me think maybe we will break up, which makes me more anxious. Anxiety begets anxiety.\n\nTalking to her and thinking about her has become an anxiety trigger. Sometimes I don't feel so bad (this happens about 3/4ths of the time now. A big improvement) but it's still happening. I even think I'm blocking things out when I talk to her, using the anxiety to sit on the fence and avoid dealing with it if it does go bad. I can't take this anymore.\n\nI hate having these bad feelings about my girlfriend. I want it all to go away. I'm on treatment for my disorders and take medication every day, but as they say, there is no \"magic pill.\" So all I want to know is, how do I get rid of this anxiety trigger? I feel fine about her when I'm not panicking about her, and I feel a lot more optimistic when I come at our interactions with no anxiety, but it always comes back. Anyone have any ideas? Sorry for the long post.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My girlfriend has started triggering my anxiety. What do I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1by4rv/my_girlfriend_has_started_triggering_my_anxiety/",
            "user_reports": []
        },
        {
            "author": "flj7",
            "author_created_utc": 1354431474,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9rs7l",
            "created_utc": 1365654601,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c46of/does_anyone_have_experience_with_weighted_blankets/",
            "gilded": 0,
            "id": "1c46of",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c46of/does_anyone_have_experience_with_weighted_blankets/",
            "retrieved_on": 1412832321,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "My anxiety tends to peak at night, and I've found that using a think blanket to add pressure to my body is a very calming thing. I've been thinking about getting a weighted blanket, but I thought I'd ask here first to see if anyone had experience. Any companies you'd recommend, or thoughts on weighted blankets in general?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone have experience with weighted blankets?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c46of/does_anyone_have_experience_with_weighted_blankets/",
            "user_reports": []
        },
        {
            "author": "armchairdetective",
            "author_created_utc": 1340382651,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8344o",
            "created_utc": 1365601683,
            "domain": "guardian.co.uk",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c28ug/does_going_to_university_make_you_feel_inadequate/",
            "gilded": 0,
            "id": "1c28ug",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c28ug/does_going_to_university_make_you_feel_inadequate/",
            "retrieved_on": 1412835033,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/Zl0OgY1-RGIRe39G.jpg",
            "title": "Does going to university make you feel inadequate?",
            "url": "http://www.guardian.co.uk/education/mortarboard/2013/apr/10/university-makes-students-feel-inadequate",
            "user_reports": []
        },
        {
            "author": "calm_myself",
            "author_created_utc": 1346378019,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8ul6g",
            "created_utc": 1365739098,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c6pa6/dealing_with_secondhand_embarrassment/",
            "gilded": 0,
            "id": "1c6pa6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c6pa6/dealing_with_secondhand_embarrassment/",
            "retrieved_on": 1412828691,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Does this strike anyone else like crazy?\n\nFor a recent example (and I mean 2-3 hours ago), I just saw a comedy show (Hannibal Buress, amazing) and he had a brief interaction with an audience member, and a couple of times, the audience member was asked to repeat himself because Hannibal couldn't hear what he said. Now, I'm pretty sure the guy felt no embarrassment or shame, but whenever I'm asked to repeat what I said, I feel embarrassed and if it happened at a comedy show with hundreds of people, I don't know how I'd cope.\n\nRather than thinking \"Oh, well I guess it's not so bad.\" I thought \"Oh my God, I feel bad just being a bystander here\" ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Dealing with secondhand embarrassment?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c6pa6/dealing_with_secondhand_embarrassment/",
            "user_reports": []
        },
        {
            "author": "ridden_anxiety",
            "author_created_utc": 1365600868,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b9l6v",
            "created_utc": 1365601378,
            "domain": "self.Anxiety",
            "edited": 1365602871,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1c28i9/anxiety_is_seeping_into_my_relationship/",
            "gilded": 0,
            "id": "1c28i9",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1c28i9/anxiety_is_seeping_into_my_relationship/",
            "retrieved_on": 1412835048,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "Using a throw away account since my boyfriend is a Reddior.\n\nMy boyfriend (25/M) and I (23/F) have been together for 2.5 years. I'd say overall we have a great relationship. We're very much in love, trusting, best friends, supportive..all that good stuff.\n\nI have suffered from anxiety since I was about 16, after my high school boyfriend commited suicide. Nothing too extreme, just constant worry of outcomes.\n\nNow recently I have realized that my anxiety is getting pretty bad in my relationship with my boyfriend. I find myself always questioning his moods(even when there really isn't anything up) I constantly fear that he is mad at me, or will be mad at me if I'm not perfect. Arguments almost cause me to have a panic attack out of fear that he will break up with me. He is the kind of person who after an argument or disagreement would rather just cool off and not talk for a little while. Which becomes hell for me because of the constant \"What is he thinking?\" \"He's going to break up with me\" \"What can I do to fix this before he hates me?\"\n\nLast night I was out at a friends, left my phone upstairs to charge. He had texted me to say goodnight. I obviously didn't see it.15 mins later I get a text \"guess you're busy..night\". Immediate panic. He hasn't answered any of my texts yet, most likely because he is still asleep. But I'm still in this weird state of panic that he is so mad at me and I won't be able to deal with arguing.\n\nCan anyone relate, or help?\n\nEdit** Boyfriend is awake now, everything seems perfectly fine, as it normally is. What I was feeling before I finally heard from him was almost unbearable",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety is seeping into my relationship",
            "url": "http://www.reddit.com/r/Anxiety/comments/1c28i9/anxiety_is_seeping_into_my_relationship/",
            "user_reports": []
        }
    ]
}