{
    "data": [
        {
            "author": "oogieboogie1996",
            "author_created_utc": 1355604039,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9wixu",
            "created_utc": 1376080758,
            "domain": "self.Anxiety",
            "edited": 1376092117,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k1s4s/i_am_17_years_old_and_last_night_i_slept_in_my/",
            "gilded": 0,
            "id": "1k1s4s",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 60,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k1s4s/i_am_17_years_old_and_last_night_i_slept_in_my/",
            "retrieved_on": 1411951332,
            "score": 321,
            "secure_media_embed": {},
            "selftext": "I wanted to share my success with someone, maybe even someone who can relate. \n\nFor almost all of my life, I have dealt with a variety of anxieties. For as long as I could remember, I slept in my mom's bed with her. I couldn't explain why, I just could not face sleeping in my room alone. I hardly ever had any friends over (Back when I actually had friends) for the night, because I knew that if I ended up in my mom's bed, there would be a lot of questions. \n\nEven when my sister had friends over, I stayed awake until they fell asleep, so I could sneak off to my mom's room. \n\nBecause of the small bed size, and because my younger brother also sleeps in the bed (For other complicated reasons), I rarely got a good nights sleep. \n\nOccasionally, I have attempted to sleep on my own, but couldn't do it. During the day, I tell myself that I want to sleep on my own. I get so close, until the night comes. Every time, I found that I couldn't do it. Something would come up, or something would scare me into crawling back to my mom's room. \n\nThere were times when I was younger, that my little brothers father would try to force me to sleep in my own bed. He would tease me, or laugh at me. Because of this, I would lay awake in my bed until I was sure that he was asleep, so that I could creep silently in next to my mom. He often slept on the floor in the living room. \n\nFinally, last night, I decided that enough was enough. I will be a high school senior in just a few weeks. It was time that I grow up and face one of my fears. I hooked my ipod up to a speaker, and set in to play some of my favorite songs on a low volume. \n\nAs lights in the house went out, I got a little bit nervous. Could I really do this? I tossed and turned for half an hour, trying to clear my fears out of my head. There were quiet a few times that I almost gave up. A big one was when I had to get out of the bed and throw the light on after finding a thumb tack stuck under the sheets. It would have been so much easier to throw the light off and run to my mom's room. But something inside knew that I could do it. \n\nI clicked off the light and padded back to my bed, settling in once again. It took a while, but I guess that eventually I fell asleep because the next thing I knew, my alarm was going off on my iPod. It was morning! I had finally, after so many years, slept in my bed through the night. I even turned off the alarm and slept for another hour! \n\nTonight will be my second attempt, and hopefully it will stick! \n\nTL;DR: After 17 years of embarrassment and ridicule, I finally got through a night in my own bed alone.\n\nEdit: thanks so much for the support and good luck! I almost didn't post this, but now I'm so glad that I did :) if I had cash you all would be swimming in Reddit gold. Instead, have some Internet hugs! \\(• •)/  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I am 17 years old, and last night I slept in my own bed for the first time.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k1s4s/i_am_17_years_old_and_last_night_i_slept_in_my/",
            "user_reports": []
        },
        {
            "author": "lilacbear",
            "author_created_utc": 1344059795,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8jzj8",
            "created_utc": 1376000619,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1jzjop/i_think_most_people_can_relate/",
            "gilded": 0,
            "id": "1jzjop",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1jzjop/i_think_most_people_can_relate/",
            "retrieved_on": 1411954917,
            "score": 277,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/Ra7kW-7I8T5cjMyB.jpg",
            "title": "I think most people can relate",
            "url": "http://i.imgur.com/3ZqmSAd.jpg",
            "user_reports": []
        },
        {
            "author": "Amandrai",
            "author_created_utc": 1340197726,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_824r3",
            "created_utc": 1376142816,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k373b/a_psychoanalyst_joke_with_a_really_great_analogy/",
            "gilded": 0,
            "id": "1k373b",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k373b/a_psychoanalyst_joke_with_a_really_great_analogy/",
            "retrieved_on": 1411948968,
            "score": 160,
            "secure_media_embed": {},
            "selftext": "&gt;A grown man is convinced that he is really a grain of corn and is subsequently taken into care. Eventually the therapist in charge of his case is able to convince him that he is really a human being and is allowed to leave the hospital, he immediately comes back trembling. There is a chicken outside the door and he is afraid it will eat him. \"My dear fellow,\" says the doctor, \"you know very well that you are not a grain of seed but a man.\" \"Of course I know that,\" replies the patient, \"but does the chicken know it?\"",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A psychoanalyst joke with a really great analogy of what's like to try to reason your way out of anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k373b/a_psychoanalyst_joke_with_a_really_great_analogy/",
            "user_reports": []
        },
        {
            "author": "wtfiikkss",
            "author_created_utc": 1376289721,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cq515",
            "created_utc": 1376302541,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k76a2/when_the_phone_rings_i_die_a_little/",
            "gilded": 0,
            "id": "1k76a2",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k76a2/when_the_phone_rings_i_die_a_little/",
            "retrieved_on": 1411942834,
            "score": 151,
            "secure_media_embed": {},
            "selftext": "I hate it when the phone rings. If I'm not at work (My job requires me to answer the phone), I just let it ring. The weird part is, each time I end a call, I feel good. I'm like \"This isnt so hard, what is so bad about the phone?\". But for some fucked up reason, I always forget this... crazy",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "when the phone rings, I die a little.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k76a2/when_the_phone_rings_i_die_a_little/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1376493351,
            "domain": "self.Anxiety",
            "edited": 1376504248,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1kcoi1/proposed_idea_a_separate_subreddit_for_when_youre/",
            "gilded": 0,
            "id": "1kcoi1",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1kcoi1/proposed_idea_a_separate_subreddit_for_when_youre/",
            "retrieved_on": 1411934195,
            "score": 144,
            "secure_media_embed": {},
            "selftext": "Personally I find that when I am feeling particularly anxious, visiting this subreddit can worsen that feeling, due to rants and descriptions of symptoms etc. I've seen quite a few posts on here from people mentioning that they feel similarly. \n\nI've found myself wishing that there was subreddit for just the positive aspects of this subreddit without the anxiety-triggering parts. Don't get me wrong, those kind of posts definitely have a place and can be very helpful. But when I'm in a certain mindset I can find them triggering.\n\nSo I was thinking we could create a subreddit named something like /r/anxietysuccess, /r/nomoreanxiety or /r/anxietyhelp (I'm crap with names but you get the idea)\n\n**or alternatively**, create a separate subreddit for [rant] posts and such that could be triggering for some, called something like /r/anxietyrants\n\nIt's just an idea, any thoughts / opinions would be helpful.\n\n**Edit - for those interested, /r/anxietysuccess has been created**",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Proposed idea: a separate subreddit for when you're too anxious to use this one, with only positive stories and helpful resources",
            "url": "http://www.reddit.com/r/Anxiety/comments/1kcoi1/proposed_idea_a_separate_subreddit_for_when_youre/",
            "user_reports": []
        },
        {
            "author": "elkanor",
            "author_created_utc": 1328210094,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tmbs",
            "created_utc": 1376401625,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k9zh9/dae_do_a_playbyplay_after_social_interaction/",
            "gilded": 0,
            "id": "1k9zh9",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k9zh9/dae_do_a_playbyplay_after_social_interaction/",
            "retrieved_on": 1411938588,
            "score": 128,
            "secure_media_embed": {},
            "selftext": "My anxiety is primarily social. When I'm in public by myself, I tend to have to bring knitting or a book or my phone with me and I have to really convince myself to talk to strangers or casual acquaintances. Even if they initiate the conversation or invite me to sit at their table and even if I am having a good time, I'm also analyzing the situation and trying not to freak out or be too obvious when my body is tensing up.\n\nAfter I leave the table or the bar or wherever, especially if the people I was with aren't friends but are people who I like, I tend to replay everything I said or did in my head. I beat myself up over what I did wrong or what might be taken wrong or how I was weird or annoying or not someone they would ever want to talk to again. I convince myself that they made fun of that weird girl the second I left the table, then have to remind myself to stop going down that road.\n\nThis just extends the anxiety and tension and makes me more scared to deal with anyone. Does this happen to other people, this automatic replay? Does anyone have a good way to cope or redirect the thoughts? Distracting myself doesn't seem to work.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE do a play-by-play after social interaction?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k9zh9/dae_do_a_playbyplay_after_social_interaction/",
            "user_reports": []
        },
        {
            "author": "chompop",
            "author_created_utc": 1322799207,
            "author_flair_css_class": "",
            "author_flair_text": "Panic Disorder",
            "author_fullname": "t2_6csyp",
            "created_utc": 1376308633,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k79wb/dae_never_click_the_links_or_browse_this/",
            "gilded": 0,
            "id": "1k79wb",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k79wb/dae_never_click_the_links_or_browse_this/",
            "retrieved_on": 1411942678,
            "score": 111,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE never click the links or browse this subreddit because thinking/reading about anxiety gives them anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k79wb/dae_never_click_the_links_or_browse_this/",
            "user_reports": []
        },
        {
            "author": "azureseabird",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1376443927,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1kbiok/why_does_anxiety_sometimes_make_us_feel_so/",
            "gilded": 0,
            "id": "1kbiok",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1kbiok/why_does_anxiety_sometimes_make_us_feel_so/",
            "retrieved_on": 1411936101,
            "score": 99,
            "secure_media_embed": {},
            "selftext": "At least personally. Why do my anxiety attacks  make me wracked with guilt and shame all the time? And torture me about every mistake I've ever made? It magnifies my problems and makes me find the smallest ones devastating and later on I feel guilty for getting so worked up. Lather rinse repeat. It's a cycle and it hasn't gone away. Has anyone else dealt with this and mabye overcome it?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Why does anxiety sometimes make us feel so painfully guilty?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1kbiok/why_does_anxiety_sometimes_make_us_feel_so/",
            "user_reports": []
        },
        {
            "author": "DankShankFrank",
            "author_created_utc": 1375879490,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cnuel",
            "created_utc": 1376332610,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k80zv/dae_feel_like_an_alien_when_they_try_to_explain/",
            "gilded": 0,
            "id": "1k80zv",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k80zv/dae_feel_like_an_alien_when_they_try_to_explain/",
            "retrieved_on": 1411941544,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "I get really bizarre but STRONG anxieties about things. My wife is getting fed up with me, as did my last wife.\n\nAs have all of my groups of friends over the years. As have people I worked with. On and on the list goes. It kills me so much because people just roll their eyes, or even laugh. In my mind it's reality.\n\n I can't look at someone and tell them not to see that grass is green. I can't tell someone not to feel a burn on their hand when they touch a hot stove. Just like I can't see it any other way that these ideas and suspicions that creep into my head are laughably impossible.\n\nI worry about having about 20 different health conditions a year. Adding in about a new 5 as each year passes. I come to terms that I don't have others, but something new always comes in to replace that one. \n\nIt just goes on and on, and though I thankfully haven't passed these tendencies into my children...they now see me in the same light as others. My son laughs and rolls his eyes at me. My wife tells me I worry about everything and gets pissed that I can't just be happy. She says I'm unreasonable and that I don't look at things logically. YET in my mind I'm using nothing but logic. \n\nIn my mind it feels like she leaves everything up to chance. I feel like stress is protecting me from forgetting important details, from being careless when I hand in paperwork that's important. I feel like stress makes me a good father because my kids don't go without anything. It makes me humble and a good worker.\n\nYet I feel like it's destroying my life. It has destroyed my life, more and more consuming everything as each year passes.\n\nI take the medications that are supposed to work. They are supposed to be the alternative. They don't work, they don't help they just make me blank. Sometimes shit still creeps in, and I still just have to talk to someone. I have to vent I have to feel better, because if I say it, and I hear it, sometimes it sounds so stupid that I do laugh about it.\n\nAnd my wife sits there and gets frustrated, and I go \"I'm sorry, I know this gets old.\"\n\nTo which she replies...\"::sigh:: it's fine. I'm used to it.\"\n\nI'm starting work out of state away from them for a while, so that maybe giving them space from me will help things and they won't be so burnt out by me. I'll only be home a couple of days a week, but it hurts. I'm going to miss so much of my children's life. and I'm going to be so alone. I just don't know how to deal with any of this anymore. I'm not suicidal or anything, I just want to be happy and have my family happy to have me around.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel like an alien when they try to explain their anxiety to loved ones?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k80zv/dae_feel_like_an_alien_when_they_try_to_explain/",
            "user_reports": []
        },
        {
            "author": "aSlowDance",
            "author_created_utc": 1376167504,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cpho7",
            "created_utc": 1376171424,
            "domain": "self.Anxiety",
            "edited": 1376171638,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k3znr/it_gets_better_seriously/",
            "gilded": 0,
            "id": "1k3znr",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k3znr/it_gets_better_seriously/",
            "retrieved_on": 1411947601,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "EDIT: formatting and why the fuck did I put an apostrophe in gets -_-.\n\n**Why I am writing this** I've been meaning to post here for awhile because I feel like as a 'survivor' of panic disorder and depression that I have, in a way, let down those who still suffer daily. I find that people who have made major improvements and have gotten their lives back rarely ever speak about anxiety or panic, especially on the internet in public forums like these. Maybe it is a result of the stigma associated with mental disorders, I'm not sure.\n\nAnyways, I just wanted to come in here and let everyone know it gets better. Seriously, you really can beat this. I know you, as a current sufferer, likely read a ton of stuff on here and other websites about how difficult of a time others are having. Many talk about how they have had to deal with panic disorder for their entire lives and have \"accepted\" the idea that they are going to live with this for the rest of their lives. There is often a giant sense of hopelessness; I know . I just want to quickly write out my story and let everyone know that there are in fact people out there who really do beat this and go on to find happiness and success in life.\n\n**Background on my history with anxiety and panic:** I started suffering from panic attacks around age 15, after experimenting with a number of drugs (marijuana daily, mushrooms, MDMA, few other small things). Things got bad fast; I stopped going out and seeing my friends. Grades dropped big time. I began taking SSRIs and ativan. After trying a few, I found that Celexa worked. At age 17, after about 2 years on Celexa (40mg) I began to taper off because I wasn't experiencing any symptoms anymore. I thought it was just a phase I was going through. \n\nSure enough, the panic attacks came back and even stronger this time. I went back to my doctor and immediately got back on ativan, which I began taking 5-7 times a day, and also started trying out a slew of other SSRIs (tried Celexa again, wasn't working anymore). My panic disorder spawned into full depression and stuff got real bad. I nearly failed high school, I was barely eating, rarely left my room. Thoughts of killing myself crossed my mind at multiple times. I had no friends, couldn't keep up a job, was terrified to leave my bed and absolutely hated myself and life.\n\n**Getting help** My doctor finally asked me if I would try seeing a psychologist. At this point in time, I thought it wouldn't do any good and had accepted the fact that my life was going to be this mess forever. Anyways, I ended up making the appointment and  going weekly. My psychologist 'formally' diagnosed me with panic disorder and depression - I scored 99th-100th percentile in all areas on the standardized severity test I took (forgot what it's called). My psych was also a bit of a hard-ass but we had an excellent doctor-patient relationship. (I still remember on day 1, going in there and I immediately started talking about how horrible my day was and how crippling anxiety is. My psych interrupts after five minutes and says, \"Listen, your parents are paying quite a bit of money right now just to have you sit here and complain. Our time is limited and I did not spend a decade in University to have you sit here and complain. We have work to do.\" It was a real eye opening moment.)\n\nI guess the 'secret' to my success with anxiety, panic and depression was a strict regiment of Cognitive Behaviour Therapy(CBT). This included daily monitoring logs, lot's of reading, lots of writing, along with various other lifestyle improvements (exercise, some mindfulness meditation, etc.). I immediately started seeing improvements after a few weeks. It wasn't easy though: CBT is tough, real fucking tough. It was the most difficult thing I have ever had to go through, but trust me when I say this it works damn well. You just have to put in the work. After 8-10 months of regular visits I woke up one morning and realized I wasn't scared anymore. The anxiety and panic were gone. It was like how life was before except even better. I now had a much clearer understanding of my emotions, behaviour and thoughts. I had the tools to deal with anxiety when it appeared and the panic attacks had fucked right off. I kept seeing my psychologist for an additional 3-4 months after this for life and career help (I had previously nearly failed my first year of University and wanted to head into second year with a renewed focus).\n\n**Today** So, in short, today I sit here at age 24 as a completely changed person. Some notable highlights are:\n\n* The old me nearly failed high school and first year of university. Today, I am a month away from starting a Masters degree at one of the top universities in my country. I have a full scholarship. \n* Previously, I was overweight and physically unwell. Now, I live much healthier.  I began running years ago and can now complete a 5km run in under 20 minutes (19:52). I have also been training for a half-iron man race which happens at the end of the month. \n* Before I had trouble walking down the street to check the mail. In February I flew to Spain by myself and vacationed for 10 days.\n* I had a horrible time meeting girls and knew nothing about dating or sex. I've had multiple girlfriends these past view years from a variety of walks of life. While none of them lasted very long I am still having an absolute blast with dating and whatnot.\n* I thought I would be taking SSRIs and ativan for the rest of my life. Today I sit here medication free for years now (not that there is anything wrong with medication, but if you feel like you don't need it than why bother).\n* I'm content. Life isn't always easy but as sufferers of anxiety and panic we know the difference between tribulations like the death of a friend, and well, dealing with this shit on a daily basis. I love the direction I have taken my life and I'm very excited for whatever the future may hold.\n\nSo, again, trust me when I say it gets better. I am no one special. I grew up an average/below average kid in almost all facets in life. Nothing remarkable about me, no genius IQ as a child or any of that shit. Just a normal kid who developed a crippling panic disorder. I just want everyone to know that they can beat this shit and accomplish things they never thought possible. If you would have asked me 6 years ago what my life would be like today, I would have answered \"likely would have killed myself by then\". CBT might not be for everyone, I'm not a doctor, but it worked for me. See a psychologist, they're doctors and have an incredible amount of knowledge that can help you. If things don't work out with one, keep trying until you find one you really connect with. I know this shit is expensive but it will be the best investment you have EVER made.\n\nTL:DR: Got severe anxiety and panic when I was a teenager, likely due to experimenting with drugs. Took SSRIs and benzos for years. Life reached a new low and finally saw a psychologist. After a year of hard work, I came out changed for the best and prepared for the world. It can get better, you don't have to live the rest of your life like this.\n\nLove you all and have a great weekend.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "It get's better. Seriously.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k3znr/it_gets_better_seriously/",
            "user_reports": []
        },
        {
            "author": "PresidentBinLaden",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1376061771,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k133u/does_anybody_else_when_believing_to_be_under/",
            "gilded": 0,
            "id": "1k133u",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k133u/does_anybody_else_when_believing_to_be_under/",
            "retrieved_on": 1411952446,
            "score": 55,
            "secure_media_embed": {},
            "selftext": "Just seeing if anyone can relate. :(\n\nEdit: make *many* mistakes.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else, when believing to be under pressure even if you're not, become extremely nervous and indecisive and make more mistakes?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k133u/does_anybody_else_when_believing_to_be_under/",
            "user_reports": []
        },
        {
            "author": "Better_MixMaster",
            "author_created_utc": 1343725044,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8ie7j",
            "created_utc": 1376078002,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k1oic/the_onion_made_a_video_anyone_with_anxiety_would/",
            "gilded": 0,
            "id": "1k1oic",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "The Onion",
                    "author_url": "http://www.youtube.com/user/TheOnion",
                    "description": "Potentially offering hope to millions of Americans struggling with psychological and emotional problems, a study published this week in The New England Journal Of Medicine found that test subjects were capable of fully resolving their anxiety by thinking about it real hard.",
                    "height": 338,
                    "html": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/RIoQARGLY8o?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i1.ytimg.com/vi/RIoQARGLY8o/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Study: Anxiety Resolved By Thinking About It Real Hard",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=RIoQARGLY8o",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/RIoQARGLY8o?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k1oic/the_onion_made_a_video_anyone_with_anxiety_would/",
            "retrieved_on": 1411951485,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/PNqaZqgZ9Ue0CYmc.jpg",
            "title": "The Onion made a video anyone with Anxiety would laugh at",
            "url": "http://www.youtube.com/watch?v=RIoQARGLY8o",
            "user_reports": []
        },
        {
            "author": "Gylleneyunnan",
            "author_created_utc": 1293135180,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ne9i",
            "created_utc": 1376239624,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k5fpx/anxiety_agoraphobia_and_falling_into_the_sky/",
            "gilded": 0,
            "id": "1k5fpx",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k5fpx/anxiety_agoraphobia_and_falling_into_the_sky/",
            "retrieved_on": 1411945445,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "Does anyone else ever get the feeling that they might fall into the sky? I know it's an absolutely ridiculous thought, and it's in no way possible, but the thought just comes to me sometimes when anxiety strikes.\n\nWearing a hat helps me, so does cloudy weather and umbrellas. I laugh at it when it's not happening, but when I'm there, it can be absolutely terrifying.\n\nThis xkcd comic is fairly relevant: http://xkcd.com/1115/",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety, agoraphobia, and falling into the sky.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k5fpx/anxiety_agoraphobia_and_falling_into_the_sky/",
            "user_reports": []
        },
        {
            "author": "pigpigdogdogcatcat",
            "author_created_utc": 1376083843,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cp1ya",
            "created_utc": 1376384219,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k9nli/dae_find_relief_from_a_panic_attack_by_pooping/",
            "gilded": 0,
            "id": "1k9nli",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k9nli/dae_find_relief_from_a_panic_attack_by_pooping/",
            "retrieved_on": 1411939088,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "Lately (i.e. an hour ago) I've been waking up in full panic mode. Nearly all my panic attacks are at night like this. I always seem to have to poop when this happens and upon relieving myself the panic subsides. \n\nI'm not sure if it's just from the time passing or the actual bathroom act. Ether way, my panic always passes afterwards.\n\nI read somewhere that \"bearing down\" or using your abdominal muscles in a way that mimics pooping can slow your heart rate so maybe there is something to it. \n\nAlso my cat who never cuddles actually came up to me and is now sleeping on my chest. I might actually get back to sleep tonight.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE find relief from a panic attack by pooping?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k9nli/dae_find_relief_from_a_panic_attack_by_pooping/",
            "user_reports": []
        },
        {
            "author": "ShitterTwitter",
            "author_created_utc": 1374212033,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cfnwh",
            "created_utc": 1376249495,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k5qtc/are_we_born_with_this/",
            "gilded": 0,
            "id": "1k5qtc",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 44,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k5qtc/are_we_born_with_this/",
            "retrieved_on": 1411944978,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "GAD and Social Anxiety. Is it something you are born with or do you developed it throughout your life?\n\nAnd if it is the latter, what situations cause us to develop anxiety?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Are we born with this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k5qtc/are_we_born_with_this/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1375975660,
            "domain": "self.Anxiety",
            "edited": 1376079431,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1jykuf/maintenance_entering_my_apartment_without_me/",
            "gilded": 0,
            "id": "1jykuf",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1jykuf/maintenance_entering_my_apartment_without_me/",
            "retrieved_on": 1411956543,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "The maintenance workers at my apartment just walk in without you answering the door. This send me into a massive panic attack every time.\n\nOne just walked in, while I was asleep and I have no idea why. I'm alone all day so being woken up by someone coming into your apartment is terrifying. \n\nThere was this printed out note on the door that had this on it: due to an emergency maintenance had to enter your apartment. It had a place for a check box next to it. Which wasn't checked. It had placed for the guys name, why he entered. Nothing was filled out. So now I'm paranoid about why he entered. Is something wrong? Is my house clean enough? Are they going to kick me out for some reason? I'm still in panic mode. I have a bunch of clothes in bags I was going to give out for donation to the local women's shelter. What if they think I'm some clothes hoarder? \n\nI wish they gave some sort of notice. If I knew they were coming it would have been better than them walking in when I'm asleep.\n\n\nEDIT: When my husband got off of work, he called them and they came in because the blinds in the other room (thank god) fell down. This does not constitute an emergency in my opinion. I have a bad phobia about calling people. I live in TX. I'm just....I dont even know what to say.\n\nEDIT 2: Found out the heat from the outside is melting the blinds. It got up to the 110's yesterday. We have blackout curtains but they do nothing. Last year the bedrooms would get up to 95 degrees. This year we put up think blankets over the top of the blinds. It cut down on the heat dramatically. It made the bedrooms able to be lived in again. The office says we can't keep the blankets up because it's melting the blinds. When he took the blanket down the room jumped up 10 degrees, and the air near the window was scorching. Our bedroom is going to be unusable again until the weather cools down. I don't know what to do. I was almost in tears talking to the maintenance guy. I can't call them on the phone, because of my phobia. My husband isn't going to do anything because of his autism. I'm actually completely helpless. I am so angry at the fact my brain is such garbage.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Maintenance entering my apartment without me answering the door",
            "url": "http://www.reddit.com/r/Anxiety/comments/1jykuf/maintenance_entering_my_apartment_without_me/",
            "user_reports": []
        },
        {
            "author": "im_not_not_white",
            "author_created_utc": 1349160695,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_96o6l",
            "created_utc": 1375909740,
            "domain": "self.Anxiety",
            "edited": 1375910891,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1jwsb7/talk_to_your_friends/",
            "gilded": 0,
            "id": "1jwsb7",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1jwsb7/talk_to_your_friends/",
            "retrieved_on": 1411959475,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "I suffer from GAD. It has gotten really bad again right now during the middle of my college career. \n\nI am flaky towards my friends, and I avoid leaving my house unless it has to do with my girlfriend.\n\nAnxiety has put a huge strain on my ability to retain relationships, and it has been adversely affecting my friendships and my girlfriend for a while now.\n\nI have a friend who I hardly get to see anymore. We were close in high school, but since college started, we see each other maybe 8 times in the year. I also have a history of being flaky with him (like I do with all my friends). Last night, this friend asked me to join him and his girlfriend at a bar that supposedly doesn't card (I am not 21 yet). The thought of getting caught bothered me. I asked him if he was sure I could get in, to which he said \"85 percent sure, but worst case is we go elsewhere with some rum in my bag\". Now, normally this would make me feel better, but I began to worry that I would have to get in their car and drive somewhere far away. Transportation has been hard for me lately, I only feel really comfortable when I am driving, and when it is a short distance.\n\nAfter spending an hour and a half of giving him flaky answers and kind of deflecting questions on whether I would meet up with him, I decided I should be honest with him about what I was feeling. He knows I suffer from anxiety, but I am sure he knew little about what how it effects me. I simply texted him a long response stating essentially, \"I want you to know that I am not going to come out tonight. The reason is that tonight I am experiencing a lot of anxiety, and getting out of the house is too much for me to handle right now. I don't normally explain this to people when I don't go through with plans, but I wanted to tell you so that you don't take it personally. In fact the only reason I have been indirect for the last hour and a half is because I have been trying to conjure up the mental state needed to get up and out of the house to see you. I don't talk about my anxiety much, but if you have any questions you can ask any time.\"\n\nNow this felt really good. I think that being honest with people around you forces you to be honest with yourself. I felt a little down on myself for \"giving in\" to my anxiety by not going out, but I wasn't going to pretend that I didn't have anxiety and I was going to own up to it and talk about it shamelessly.\n\nHe responded saying, \"Thank you for telling me. Would you prefer to be alone? Because I would love to come over and hang out with you.\"\n\nI said, \"Yes! That sounds like a great idea. Are you sure that's okay?\n\nTo which he said, \"You underestimate the love I have for you\".\n\nThat was pretty powerful, even if the love part was tongue-in-cheek on his part. I never share my anxiety with my friends, only my parents and girlfriend, but this really felt good.\n\nHe came over with his girlfriend and a few more of my friends and we had a great night all together. It was made possible by my communication of how I was feeling, which opened up other options for us to all have a good night.\n\nInstead of sulking all night about how I wasn't good enough or normal enough to get out of my house and join my friends, they came to me and made me forget about all of it.\n\nI know I am lucky now to be surrounded by compassionate people. I know that some people don't have this fortune, including possibly some of you reading this. But I advise those of you who do have people to talk to you, even people who might not understand (like my friend), to talk about your anxiety and make compromises with yourself and keep pushing yourself a little bit every day.\n\nI will end this with a little bit of /r/Fitness wisdom- we're all gonna make it.\n\nEdits for grammer",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Talk to your friends.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1jwsb7/talk_to_your_friends/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1376351533,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k8qsp/anxiety_when_buying_things/",
            "gilded": 0,
            "id": "1k8qsp",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k8qsp/anxiety_when_buying_things/",
            "retrieved_on": 1411940479,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "This has been happening to me lately.  Usually happens for small purchases at stores where you just go in and out.  I bought a pack of gum the other day... my hands were shaking and it was hard to put the change back in my wallet.  If I buy alcohol or tobacco, I have to just set my ID on the counter because if I held it in my hands it would shake too much.  Then I get self conscious about the clerk judging me/worrying about me for being so jittery.\n\nI really don't get it... I go to parties and bars crammed with people, busy shopping centers, dates every now and then, and I'm perfectly fine.  I even teach just fine.  Stopping at a convenience store is too much for me somehow.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety when buying things?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1k8qsp/anxiety_when_buying_things/",
            "user_reports": []
        },
        {
            "author": "silvia_s13",
            "author_created_utc": 1315203617,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5sl1n",
            "created_utc": 1375927792,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1jxfex/any_good_books_regarding_anxiety_or_depression/",
            "gilded": 0,
            "id": "1jxfex",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1jxfex/any_good_books_regarding_anxiety_or_depression/",
            "retrieved_on": 1411958417,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "Can anyone recommend any good books that deal with anxiety or depression?\n\nThanks!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any good books regarding anxiety or depression?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1jxfex/any_good_books_regarding_anxiety_or_depression/",
            "user_reports": []
        },
        {
            "author": "bintykins",
            "author_created_utc": 1298548348,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4vw4p",
            "created_utc": 1376246993,
            "domain": "bintykins.blogspot.co.uk",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k5nvx/worry_wart_29_my_personal_anxiety_comic/",
            "gilded": 0,
            "id": "1k5nvx",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k5nvx/worry_wart_29_my_personal_anxiety_comic/",
            "retrieved_on": 1411945098,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/p-6_dFuCbfCsNdex.jpg",
            "title": "Worry Wart #29 [my personal anxiety comic]",
            "url": "http://bintykins.blogspot.co.uk/2013/08/worry-wart-29.html",
            "user_reports": []
        },
        {
            "author": "GezzySinger",
            "author_created_utc": 1357490619,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety/Depression",
            "author_fullname": "t2_a4gg0",
            "created_utc": 1376414462,
            "domain": "self.Anxiety",
            "edited": 1376509346,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1kafha/i_got_a_letter_from_my_psychiatrist_prescribing/",
            "gilded": 0,
            "id": "1kafha",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1kafha/i_got_a_letter_from_my_psychiatrist_prescribing/",
            "retrieved_on": 1411937846,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I posted a week or so ago about getting a letter for an ESA from my psychiatrist. After speaking with her, she agreed that it would be very beneficial for me to have an ESA and wrote a letter for me.\n\nNow, I am really nervous about bringing it to my landlord. When I first moved in, I asked about their pet policy and they said my building is being turned into a no pet building, like all of their other properties. They recently bought the building from another company, but it was pet friendly under the previous owner. They are honoring the pet agreement for older tenants that already have pets. So, there were and are pets in the building (including the people who were living in my unit immediately before me).\n\nAnyway, I am nervous to bring this up to them. It's a company, not just a person or family. There are more than 5 units in the building and the landlord does not live there. Legally, they shouldn't be able to say no. But, how should I approach them with the letter? Should I go in with a typed request from me as well as the letter? Or should I snail mail it to them? It seems silly to mail it since the office is so close to my building. Has anyone had experience with this?\n\n**UPDATE!** I went into the office today and the leasing agent was on lunch or something, but the receptionists took my papers and said he would call me when he got in. Now, we wait...*I'm so anxious.*",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I got a letter from my psychiatrist prescribing an ESA! How do I approach my landlord about it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1kafha/i_got_a_letter_from_my_psychiatrist_prescribing/",
            "user_reports": []
        },
        {
            "author": "paniejakubie",
            "author_created_utc": 1361656385,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_aphnv",
            "created_utc": 1376249820,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k5r7b/after_spending_my_evening_having_another_panic/",
            "gilded": 0,
            "id": "1k5r7b",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "Elliott Hulse",
                    "author_url": "http://www.youtube.com/user/elliottsaidwhat",
                    "description": "in this video elliott shares a few exercises to use in the face of fear.",
                    "height": 338,
                    "html": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/c8BZlIXPlis?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i1.ytimg.com/vi/c8BZlIXPlis/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Do THIS In The Face Of Fear",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=c8BZlIXPlis",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/c8BZlIXPlis?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k5r7b/after_spending_my_evening_having_another_panic/",
            "retrieved_on": 1411944963,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/plVQFvTDMxSw8RWM.jpg",
            "title": "After spending my evening having another panic attack, I went to YouTube and found this advice on fighting fear. Maybe it will help someone.",
            "url": "http://www.youtube.com/watch?v=c8BZlIXPlis",
            "user_reports": []
        },
        {
            "author": "mclovinash",
            "author_created_utc": 1304878218,
            "author_flair_css_class": "",
            "author_flair_text": "OCD, Anxiety, Aspergers",
            "author_fullname": "t2_57hmo",
            "created_utc": 1376436741,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1kba61/something_that_might_help_sufferers_with/",
            "gilded": 0,
            "id": "1kba61",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1kba61/something_that_might_help_sufferers_with/",
            "retrieved_on": 1411936468,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "Hi all. So I have been diagnosed with OCD, and have intrusive thoughts linked with this disorder. I was watching \"Extreme OCD Camp\" where one of the presenters was talking about techniques on how to cope with intrusive thoughts. His explanation was simple. The word \"maybe\". Maybe I will do something bad, maybe I won't? I don't know, I have to accept this anxiety and uncertainty, because if I fight this thought, it will only get worse. Once you learn to master the act of acceptance, you should improve. This is what I have been trying to do with my intrusive thoughts, although it is preeettyy hard.\n\nThis is my way that I have been trying, but I DO NOT KNOW if it's a proper good way to help, so you may want to try if you want, but it makes sense to be honest. He seemed to know what he was talking about, and it made sense. I hope this helps some people.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something that MIGHT help sufferers with intrusive thoughts (particularly OCD)",
            "url": "http://www.reddit.com/r/Anxiety/comments/1kba61/something_that_might_help_sufferers_with/",
            "user_reports": []
        },
        {
            "author": "realish",
            "author_created_utc": 1309955372,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5h5ni",
            "created_utc": 1376319063,
            "domain": "reuters.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1k7jee/inexpiable_chronic_stomach_pain_in_children/",
            "gilded": 0,
            "id": "1k7jee",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1k7jee/inexpiable_chronic_stomach_pain_in_children/",
            "retrieved_on": 1411942301,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/UAcvWe5g8j5d8q-r.jpg",
            "title": "Inexpiable chronic stomach pain in children linked with anxiety",
            "url": "http://www.reuters.com/article/2013/08/12/us-kids-chronic-stomach-idUSBRE97B0E120130812",
            "user_reports": []
        },
        {
            "author": "Anxietyabout",
            "author_created_utc": 1375710151,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cmwcz",
            "created_utc": 1375991146,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1jz6hp/update_so_i_made_a_doctors_appointment_it_went/",
            "gilded": 0,
            "id": "1jz6hp",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1jz6hp/update_so_i_made_a_doctors_appointment_it_went/",
            "retrieved_on": 1411955518,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "About 3 days ago I made a post expressing my worries over my first doctors appointment for anxiety. \n\nWell, I stressed, I shook and I panicked - but I went. And I'm so glad I did. The doctor was very patient and friendly (while I, on the other hand, was a quivering mess), took me completely seriously, and talked me through the various options. He spoke about a women with anxiety that he had seen in the past few months, and put me very much at ease.\n\nWe discussed medication and counselling, he left the decision of what  kind of avenue to pursue very much in my hands, and in the end he gave me the names of some support forums, and a prescription of low dosage Propranolol.\n\nI really cannot recommend going to see a doctor enough. It was nothing like the terrifying experience that I had built it up to be, and I will be happy to return in the next week or two to discuss how my medication works (or if it does), and whether I need to be given a higher dosage, or try anti-depressants.\n\nThank you all for helping to calm me down, and if there's one thing that I want you to take away from this, it's that going to see the doctor *helps*. Really - it's worth it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "(Update) So I made a doctors appointment - It went well.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1jz6hp/update_so_i_made_a_doctors_appointment_it_went/",
            "user_reports": []
        }
    ]
}