{
    "data": [
        {
            "author": "emcedilla",
            "author_created_utc": 1357403779,
            "author_flair_css_class": "",
            "author_flair_text": "I draw.",
            "author_fullname": "t2_a424v",
            "created_utc": 1357404519,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/160glu/sometimes_art_is_the_only_way_i_can_deal_with/",
            "gilded": 0,
            "id": "160glu",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/160glu/sometimes_art_is_the_only_way_i_can_deal_with/",
            "retrieved_on": 1413227928,
            "score": 190,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ISb-7WJeKLhGhr3U.jpg",
            "title": "Sometimes art is the only way I can deal with things. (depersonalisation/derealisation)",
            "url": "http://i.imgur.com/3ZJ1E.jpg",
            "user_reports": []
        },
        {
            "author": "miscellaneouscat",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357320119,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15yiow/my_anxietyinspired_tattoo/",
            "gilded": 0,
            "id": "15yiow",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15yiow/my_anxietyinspired_tattoo/",
            "retrieved_on": 1413230859,
            "score": 160,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/DJQd_RB-h_vrCbLH.jpg",
            "title": "My anxiety-inspired tattoo",
            "url": "http://imgur.com/OxsXO",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357544265,
            "domain": "self.Anxiety",
            "edited": 1357631693,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/163yuu/does_anyone_else_feel_disconnected_from_other/",
            "gilded": 0,
            "id": "163yuu",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/163yuu/does_anyone_else_feel_disconnected_from_other/",
            "retrieved_on": 1413222600,
            "score": 101,
            "secure_media_embed": {},
            "selftext": "Like you feel like everyone has this connection with everyone where they know what to say and do, and you never know how normal people act? \n\nAnd you sort of feel like you're not even living your life, you're just watching from a third person perspective, like a book? \n\nAnd you're not in the story, you're just a reader, and when you have to talk to people, it's like you're reading a book when suddenly the author writes \"okay reader how are you?\" \n\nDoes anyone else feel like this?\n\nEdit: wow, this got a lot more attention than I expected it to. I'm glad I'm not alone in this. Thanks guys (:",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel disconnected from other people, and sometimes themself?",
            "url": "http://www.reddit.com/r/Anxiety/comments/163yuu/does_anyone_else_feel_disconnected_from_other/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357051969,
            "domain": "sphotos-e.ak.fbcdn.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15rtl4/probably_the_most_useful_thing_ive_seen_on/",
            "gilded": 0,
            "id": "15rtl4",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15rtl4/probably_the_most_useful_thing_ive_seen_on/",
            "retrieved_on": 1413241207,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Probably the most useful thing I've seen on facebook...quite liberating",
            "url": "http://sphotos-e.ak.fbcdn.net/hphotos-ak-prn1/551753_10151215139341523_181523838_n.jpg",
            "user_reports": []
        },
        {
            "author": "Citruswater",
            "author_created_utc": 1353507528,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_9o4fi",
            "created_utc": 1357489351,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/162c7p/just_a_quick_thank_you_to_all_the_amazing_and/",
            "gilded": 0,
            "id": "162c7p",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/162c7p/just_a_quick_thank_you_to_all_the_amazing_and/",
            "retrieved_on": 1413225165,
            "score": 68,
            "secure_media_embed": {},
            "selftext": "For pretty much all of 2012 I battled anxiety every moment of everyday. When I found this subreddit, I confess I made many throw away accounts asking questions and looking for support. I always recieved genuine replies, concern, advice and support from people who actually understand. It astounded me that people cared enough to take the time to read my whinging posts and then even take the time to reply to me! \n\nYou all helped me find my own way through my anxiety! And I'm proud to say, even though it still lingers in my life, I've learnt how to not let it take over my every thought and control me and interrupt my everyday life. I have good days and bad days, but this subreddit never fails to be forthcoming with support and generosity to a complete stranger on the other side of the globe. \n\nI now want to give back to this amazing community and be that person who can help others, and share the tricks I've learnt. It's a tough journey, but I believe altogether we can do it :) \n\nMuch love to all you amazing people! Xx",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just a quick thank you to all the amazing and supportive people that make up this subreddit! ",
            "url": "http://www.reddit.com/r/Anxiety/comments/162c7p/just_a_quick_thank_you_to_all_the_amazing_and/",
            "user_reports": []
        },
        {
            "author": "in2080",
            "author_created_utc": 1357068106,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a2f5o",
            "created_utc": 1357070235,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15s7u9/i_had_no_idea_that_what_ive_been_feeling_my_whole/",
            "gilded": 0,
            "id": "15s7u9",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15s7u9/i_had_no_idea_that_what_ive_been_feeling_my_whole/",
            "retrieved_on": 1413240568,
            "score": 66,
            "secure_media_embed": {},
            "selftext": "For as long as I can remember, I've been anxious. You would never know from meeting me though. I'm personable and charming and outgoing and friendly. I'm fortunate enough to have been blessed with art skills, therefore I can get away with being the weird, nervous, arty girl. I've worked my anxiety into my personality, and it works. \n\nAs far back as kindergarten, I was positive I would die if I walked into a classroom after the bell rang, and I would freak myself out so badly that my mom would let me stay home. \n\nMy heart skipped a beat whenever the doorbell rang, and I would hide in the bathroom and spy out the window until they left. Forget about ringing other peoples doorbells, I literally didn't go to a friends house alone until I got a cellphone with texting capabilities so I could text them when I was outside. \n\nI don't call anyone, I don't walk anywhere unless I can see the path I have to walk, I frequent the same places so I don't get stuck somewhere.\nThe funny thing is, I love change. I love new places and new experiences, as long as I'm not alone. \n\nAnytime I get asked out or someone wants to befriend me, I immediately get sick. I don't have many friends, the ones I do have aren't aware of my anxiety. My boyfriend is amazing and super supportive, and my dog is the only thing that can really calm me down. It probably doesn't help that I'm scared of any and all medications. My boyfriend had me try marijuana for the first time last week. We smoked every day for the past week and a half, and I've found it doesn't help anything, it just makes me feel sick and my head hot. \n\nI've tried talking to my family, but my parents, as great as they are, have their own lives and are unreceptive most of the time. My panic attacks are always quiet and I'm alone so much that no one ever sees them, so it never got brought up while I was living with them. My sister thinks I'm being dramatic and keeps telling me to just \"get over it\" and that I'm just asking for attention. I believed her for a long time. I figured I was just overreacting and that I need to get over it. \n\nUp until today, I didn't know this was a real disorder. I just thought I was weird. \n\nI recently got hired at a restaurant. I'm completely capable of waiting tables without freaking out too badly. I hide it well. I'll say something stupid, stumble, drop some silverware, and walk away from a table with my cheeks burning and a death wish in my head, but I can control it on my face. When I get through a table without any triggers, I literally get emotional and have to hold back tears of joy. It's hard, but I thought I could handle another waitressing job. \n\nYesterday, the thing that got me was the calendar app on my phone. I set 3 or 4 alarms for each shift so that I show up on time, and the app displays my next shift whenever I check my phone. I'm used to it, which is why this was strange. Every time I looked at my phone, I had a panic attack. Just the simple green box that said \"Server - 3:00\" set me off. As I get closer and closer to 3, I feel worse and worse. \n\nThat's when I found r/anxiety. \n\nSo now, I've been sitting here crying for the past hour, reading through all these posts, because I had no idea that what I'm feeling isn't normal, and that I can potentially do something about it. \n\nI guess I just needed to get this off my chest. I'm still deciding if I can go to work today. I've got 2 hours. Right now, I'd rather just do a no call/no show, and sleep the rest of the day. I texted my mom and told her I'm serious about seeing a doctor, because I can't let this affect my life anymore. I think 22 years is enough. \n\nIn the meantime, I'm glad I found you guys. So, hi, I guess. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I had no idea that what I've been feeling my whole life isn't normal. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15s7u9/i_had_no_idea_that_what_ive_been_feeling_my_whole/",
            "user_reports": []
        },
        {
            "author": "SarElle",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357096161,
            "domain": "self.Anxiety",
            "edited": 1357096442,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15syzt/50_ways_to_constructively_channel_negative/",
            "gilded": 0,
            "id": "15syzt",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15syzt/50_ways_to_constructively_channel_negative/",
            "retrieved_on": 1413239285,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "**I found [this](http://www.theemotionmachine.com/50-ways-to-constructively-channel-negative-emotions) on /r/ZenHabits , a SubReddit I think most of the users here could benefit from!**\n\n1. Play an instrument as a way to express yourself through sound.\n2. Listen to music that fits your mood (see how to use music to manage your emotions).\n\n3. Paint or draw as a way to express yourself through pictures (see creativity and happiness).\n\n4. Create a personal diary, journal, or blog to keep track of your thoughts, feelings, and experiences (see the power of writing).\n\n5. Dance as a fun way to exercise and release built up negative emotions and stress.\n\n6. Go to the gym or workout (see the connection between physical and mental health).\n\n7. Go some place where you can yell at the top of your lungs (sometimes it can be a helpful release of built up tension).\n\n8. Watch a movie that echoes how you feel and provides a happy or inspirational ending.\n\n9. Do yoga, tai chi, or some other mind-body exercise to release the physical stress behind your emotions.\n\n10. Speak your thoughts and feelings to someone who is willing to listen.\n\n11. Write a short story that focuses on similar thoughts and emotions to what you are experiencing.\n\n12. Donate to a cause that you really believe in.\n\n13. Ask yourself, “What are my emotions trying to tell me?” Often there is a thought process behind what we feel that we can learn from.\n\n14. Learn how to reframe a negative situation in a more positive or productive light (see quick tips for reframing your perspective).\n\n15. Do something kind for someone. Often creating pleasant feelings for others increases our own well-being (get started with one of these 30 acts of kindness).\n\n16. Go out to your local park or a nature preserve. Nature can often help us get outside of our minds and appreciate the world around us more.\n\n17. Photography, find a good place to take pictures. Then look through your set and find 1 or 2 photos that really speak to your current emotions.\n\n18. Go for a drive with no particular destination in mind.\n\n19. Lift weights or hit a punching bag to release stress.\n\n20. Play a stimulating video game.\n\n21. View anxiety or stress as motivators to act, not things that inhibit you (see the hidden power of anxiety).\n\n22. Write a poem or song lyrics about what’s on your mind.\n\n23. Practice a self-love meditation (see improve feelings of self-love in 5 minutes).\n\n24. Try to solve a puzzle. It’ll help occupy your mind with something else, rather than just ruminating over the same problems (see challenge your brain – and other ways to maintain cognitive fitness).\n\n25. Go outside for a light walk to help clear your mind.\n\n26. Reflect on negative experiences and see what you can learn from them (read more at reflection improves learning).\n\n27. Meditate on your thoughts and emotions without being judgmental. Don’t label them as “good” or “bad” – just accept them for what they are.\n\n28. Channel your emotions into a competitive sport, like basketball or football.\n\n29. Consider star gazing as an opportunity to stop and reflect on the bigger things in life (try the sky gazing meditation).\n\n30. Respectfully confront someone who may be responsible for how you feel.\n\n31. Engage in a simple pleasure to remind yourself of the finer things in life (such as a dessert or your favorite TV show).\n\n32. Learn how to take criticism constructively, rather than letting it just get you sad or frustrated (see how to take criticism like a champ).\n\n33. If a negative emotion is motivating you to do something destructive, try doing the exact opposite of what you feel.\n\n34. Read a novel that temporarily takes you into a new world.\n\n35. Join a forum or online support group that shares similar troubles.\n\n36. Use negative relationships in the past as a resource to improve relationships in the future.\n\n37. When reflecting on negative events in your life, try to see how they may have made you a better person. Often these experiences can build resilience in the long-term (psychologist refer to this as post-traumatic growth).\n\n38. Channel your anger or other “high charged” emotions to drive you to be more productive.\n\n39. Make tedious work more fun to help manage boredom or apathy (see blur the line between work and play).\n\n40. Use stress or fatigue as a sign to take a break or enjoy some leisure time (see 50 stress relievers that take 5 minutes or less).\n\n41. Wake up early and watch the sunrise. Learn to appreciate every new day as a clean slate.\n\n42. Label your fears when you experience them and they become easier to face (see labeling negative emotions can help you overcome them).\n\n43. Surround yourself with positive and supporting friends and family who can quickly turn your mood around.\n\n44. Use your emotional energy to create positive affirmations that motivate you to grow and improve (see 75 affirmations for self improvement).\n\n45. Find something to be grateful (see be grateful for your senses).\n\n46. Channel your emotions and write your own daily prayer to help motivate and inspire yourself (see write your own daily prayer).\n\n47. Think about role models in your life who may have overcome similar obstacles (see how we find motivation in other people’s struggles).\n\n48. Use your energy to clean, organize, or redecorate your home or office space.\n\n49. Read some inspirational quotes (see quotes I’ve collected).\n\n50. Indulge in one of life’s simple pleasures (see 50 simple pleasures to brighten your day).",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "50 Ways to Constructively Channel Negative Emotions",
            "url": "http://www.reddit.com/r/Anxiety/comments/15syzt/50_ways_to_constructively_channel_negative/",
            "user_reports": []
        },
        {
            "author": "anxietykitty",
            "author_created_utc": 1351871337,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9hf6l",
            "created_utc": 1357237492,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15we8b/update_my_boyfriend_broke_up_with_me/",
            "gilded": 0,
            "id": "15we8b",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15we8b/update_my_boyfriend_broke_up_with_me/",
            "retrieved_on": 1413234063,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "it's been almost three weeks since he broke up with me. i found myself begging for him to take me back. then i gave up and finally accepted it. my therapist was really helpful and i felt myself getting stronger on my own. my medicine is also working wonders.\n\ni have been overcoming my social phobia and hanging out with my friends and cousins and other relatives. i feel so proud of myself.\n\nhowever, last night he texted me. apologizing for the way he handled it. that he wants me back. that he wants to help me get better and he doesn't want me to be with anyone else. i said no, not right now. i need to get better for myself, by myself. our relationship was too toxic. and i am afraid that if we get back together i will slip into my old clingy ways.\n\ni am feeling sad, but strong for finally standing up for myself. i just want to make sure i did the right thing. any input from the anxiety community is appreciated.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[UPDATE] my boyfriend broke up with me",
            "url": "http://www.reddit.com/r/Anxiety/comments/15we8b/update_my_boyfriend_broke_up_with_me/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357525238,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/163fea/trick_ive_found_to_lower_my_anxiety/",
            "gilded": 0,
            "id": "163fea",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/163fea/trick_ive_found_to_lower_my_anxiety/",
            "retrieved_on": 1413223464,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "I've started to get caught up in a cycle of anxiety again this December.  It has SUCKED because I was riding such a grandeur covered delusional wave for the longest time. I'm a 25 year old male, and this is my first post here. \nPush ups.. Seriously, just did 100 of them and it relieved so much pressure. I don't feel dizzy or lightheaded from the anxiousness.  Right after I was done my heart did pound pretty hard, but I rode through it and the result was a more confident relaxed body.   \nI'm in decent shape, so if you can't do that many no big deal.  When our bodies go into that fight or flight mode and nothing happens, that's when we start hyperventilation and the carbon monoxide makes us light headed and what not.  Any physical activity is what your body is waiting for, it's expecting you to do something with the anxiety.  If you can only do 10 that's perfect!  Make sure you really exhaust yourself.  Your body is awaiting a tough strain, it's basically getting you prepped. \nI was working out all the time when the anxiety hit and instead of pushing through it, cutting out caffeine consumption and altering my workout.  I just stopped all physical activity, kept the caffeine and was also trying to stop drinking so much alcohol. It overwhelmed me.  \nA personal thing I'd thought I'd share. and as someone who's lived with depression and anxiety my whole life, i just want to thank you for welcoming me into the community. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Trick I've found to lower my anxiety. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/163fea/trick_ive_found_to_lower_my_anxiety/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357223747,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15w0ox/i_finally_free_brave_enough_to_tell_my_boyfriend/",
            "gilded": 0,
            "id": "15w0ox",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15w0ox/i_finally_free_brave_enough_to_tell_my_boyfriend/",
            "retrieved_on": 1413234624,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "I want to start off by saying that my boyfriend of a year and half is a wonderful person. He's been incredibly patient with my anxiety, albeit a little ignorant on how to deal with it. I take full ownership of my anxiety and owned up to the mistakes I made by trying to place my healing on him. However, we have a constant back and forth about how I tend to shut myself off from him until I break down and he has to work his way to pull me out. I know it frustrates him. It frustrates me 10x more because I'm already hyper aware of the whole situation. I just wasn't certain on what to do or why I reacted that way.\n\nBack in the beginnings of our relationship, we had some troubling events happen where we both hurt each other and breached each other's trust. When I tried to explain my feelings to the event and how they made me feel, he redirected them, kind of brushed them off by trying to blame me for my less than stellar actions. Basically, what I was feeling shouldn't be a big deal. My boyfriend gets defensive and has these reactions to protect himself from his own guilt/pain. however, by him doing that, I felt a lot f shame towards my own feelings and tried to bury them to save the situation. He would try to tell me after that I wasn't \"wrong\" but he never understood that what he did really messed with my anxiety. This has happened on a few occasions during our tiffs (which aren't too often).\n\nAs of now, he wonders why I have a hard time opening up to him. He gets frustrated because he feels like he has done everything he can but that he's still doing something wrong. It took me a while to realize what it was myself, but I always feel too nervous and anxious to tell him. I finally found it within myself to accept the person I was with my anxiety and to try to not feel shame about my feelings. Now I want him to understand that how he reacts to me wasn't the right way to go about things.\n\nThe only thing is, I'm not sure how to phrase all of this. While I take full responsibility of my anxiety, I want him to realize that he did some counter productive things that didn't help me even though he wants to so badly. Any advice would be appreciated.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I finally free brave enough to tell my boyfriend that his invalidation of my feelings only exacerbated my anxiety rather than helped.",
            "url": "http://www.reddit.com/r/Anxiety/comments/15w0ox/i_finally_free_brave_enough_to_tell_my_boyfriend/",
            "user_reports": []
        },
        {
            "author": "randomguy85",
            "author_created_utc": 1283953164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4bpod",
            "created_utc": 1357152761,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15u6v4/i_think_im_making_progress/",
            "gilded": 0,
            "id": "15u6v4",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15u6v4/i_think_im_making_progress/",
            "retrieved_on": 1413237347,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "There is a long road ahead and I still have struggles, but I am starting to see some progress. I am seeing it partially in the relationship I have recently officially started. I have a lot of anxiety in general and she hss been VERY patient with me. She finally knows a bit of why I act the way I do and why I get so nervous. Between her being patient and me going to counseling, I have slow become less intimidated by those around me, including her. Now I feel guilty that my fear had me concentrating on her \"flaws\" . But I have come to realize that it was my fear of a relationship and anxiety in general. I now do that less and less, and see her as the beautiful person she is much more. I love to be the man that makes her happy. Even when I had a bit of an attack a week ago. She didn't get irritated with me or force me to talk abiut what was wrong , she just let me know she is here for me. It is amazing what a supportive and positive person can do. I still have some insecurity to deal with and a lot of progress to make, but I'm on the right track. \n\nThe couple of hours between us can be a challenge, but we are making progress. Just wanted to thank /r/anxiety for listening to me vent and providing stories to make me feel more normal and at ease. \n\nThe relationship is going well for me so far. Hope I can keep from messing it up. Just wanted to let /r/anxiety know that it can get better. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think I'm making progress!",
            "url": "http://www.reddit.com/r/Anxiety/comments/15u6v4/i_think_im_making_progress/",
            "user_reports": []
        },
        {
            "author": "rahiller0",
            "author_created_utc": 1337049188,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7q08s",
            "created_utc": 1357101895,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15t4pz/woooooo_first_panic_attack_of_the_new_yearrr/",
            "gilded": 0,
            "id": "15t4pz",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15t4pz/woooooo_first_panic_attack_of_the_new_yearrr/",
            "retrieved_on": 1413239035,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "I didn't even make it one day!!! Damnit!!!!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "WOOOOOO FIRST PANIC ATTACK OF THE NEW YEARRR ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15t4pz/woooooo_first_panic_attack_of_the_new_yearrr/",
            "user_reports": []
        },
        {
            "author": "Orionator",
            "author_created_utc": 1353990997,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9q18g",
            "created_utc": 1357253307,
            "domain": "self.Anxiety",
            "edited": 1357268602,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15wxjc/i_tried_writing_how_i_feel_but_for_some_reason_i/",
            "gilded": 0,
            "id": "15wxjc",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15wxjc/i_tried_writing_how_i_feel_but_for_some_reason_i/",
            "retrieved_on": 1413233246,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "I don't get it;\n\nthis painless sensation.\n\nIt takes over me.\n\nLeaves me crippled.\n\nWhat am I feeling?\n\nThe switch at the back\n\nof my head;\n\nIt's been tampered with.\n\nI'm no longer me.\n\nMy interests remain,\n\nbut my emotions are inverted.\n\nI'm angry.\n\nBut at what?\n\nMy fear of death;\n\nit's slowly fading.\n\nI **fear** myself more.\n\nI **fear** my actions.\n\nI **fear** my emotions.\n\nI **fear** my future.\n\nI **fear** my world.\n\nI **fear myself**.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I tried writing how I feel. But, for some reason, I feel like even this can't describe it. And I wrote it myself.",
            "url": "http://www.reddit.com/r/Anxiety/comments/15wxjc/i_tried_writing_how_i_feel_but_for_some_reason_i/",
            "user_reports": []
        },
        {
            "author": "shallah",
            "author_created_utc": 1220919695,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_38lau",
            "created_utc": 1357384850,
            "domain": "blog.smu.edu",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1605qi/outoftheblue_panic_attacks_arent_without_warning/",
            "gilded": 0,
            "id": "1605qi",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1605qi/outoftheblue_panic_attacks_arent_without_warning/",
            "retrieved_on": 1413228380,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/PRLvweUUoyoKNBcS.jpg",
            "title": "Out-of-the-blue panic attacks aren’t without warning; data show subtle changes before patients’ aware of attack: “We found 15 subtle but significant changes an hour before the onset of the panic attacks that followed a logical physiological pattern. These weren’t present during the non-panic period\"",
            "url": "http://blog.smu.edu/research/2011/07/26/out-of-the-blue-panic-attacks-arent-without-warning/",
            "user_reports": []
        },
        {
            "author": "Slyx",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357188518,
            "domain": "self.Anxiety",
            "edited": 1357201884,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15vd1z/advice_dont_have_insurance_costco_pharmacys_offer/",
            "gilded": 0,
            "id": "15vd1z",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15vd1z/advice_dont_have_insurance_costco_pharmacys_offer/",
            "retrieved_on": 1413235590,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I recently started getting my prescriptions filled at Costco and you would not believe the prices on their generic meds. Oftentimes, you will pay LESS than what your copay would be if you were getting something filled somewhere else WITH insurance. \n\nAND, if you don't have insurance and are a Costco member, you can get an additional discount as well! (Just ask the pharmacist about how to sign up). \n\nI'd highly recommend anyone taking generic meds to give their local Costco a call and check on their prices... you may be surprised! \n\nEdit: I am 99% sure you don't need a membership to use the pharmacy in any state. If you don't have a membership, give them a call and ask ahead of time - just in case :) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Advice] Don't have insurance? Costco Pharmacy's offer amazing pricing on Generics and you don't even need a membership to use the pharmacy. If you have insurance, it still may be cheaper than your co-pay. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15vd1z/advice_dont_have_insurance_costco_pharmacys_offer/",
            "user_reports": []
        },
        {
            "author": "Dymodeus",
            "author_created_utc": 1328275239,
            "author_flair_css_class": "",
            "author_flair_text": "Social anxiety",
            "author_fullname": "t2_6tuu4",
            "created_utc": 1357041300,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15rpkg/rant_i_feel_alone/",
            "gilded": 0,
            "id": "15rpkg",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15rpkg/rant_i_feel_alone/",
            "retrieved_on": 1413241381,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I guess I'm not the only one here or anywhere for that matter that's feeling kind of lonely, but I feel like writing this nonetheless. I'll just give a summery of things that make me feel this way.\n\nFirstly, I brought my xbox to my parents' for the holidays and yesterday my brother and I were about to play some games, when he wondered why I only have two accounts (his and mine). I realized that in the years that I have that thing, I've only ever played together with my brother, never with any of my friends.\n\nI lay in my bed last night, after midnight, and I could here a group of neighbours shooting fireworks and talking and laughing and stuff, and I felt jealous. The same feeling came to me when I watched a New Years' concert and people were having fun. The thing is, if I were there, I'd feel very uncomfortable, anxious even, but I really wanted to feel like they felt in that surrounding. \n\nOn the subject of New Years, I didn't get any messages from friends wishing me a happy new year. This probably won't be personal, but of course my mind thinks of the worst scenario, which is that they sent everyone else messages, but not me.\n\nMy two best friends gave started dating each other, which is also making me quite jealous. It's made me realize that I want to have a girlfriend, but I don't know how I could ever get a girlfriend if I keep being so anxious. How could I ever go on a date or be intimate with someone when I already feel nervous at my friends'. \n\nAnd lastly, [this post](http://www.reddit.com/r/aspergers/comments/14s56g/defriended_on_facebook/), which still bugs me from time to time. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] I feel alone",
            "url": "http://www.reddit.com/r/Anxiety/comments/15rpkg/rant_i_feel_alone/",
            "user_reports": []
        },
        {
            "author": "gobstopperDelux",
            "author_created_utc": 1290826087,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4k6an",
            "created_utc": 1357011889,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15r9xc/in_2013_i_resolve_to_face_every_attack_i_have/",
            "gilded": 0,
            "id": "15r9xc",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15r9xc/in_2013_i_resolve_to_face_every_attack_i_have/",
            "retrieved_on": 1413242118,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I've posted a few times here in the past month. I fell for a woman at work, and all my anxiety issues came back to me full swing over the idea of asking her out. Eventually I got the nerve to ask her out a couple times, and we ended up hanging out at the bar for about 4 hours and had a good time. She's \"not really looking to date anyone\". I don't even care. Well I do, but not overly. The whole process has left me full of life and energy and a huge feeling of self. \n\nI owned up and faced a situation that was giving me my worst anxiety attacks in years. It showed me where my best of friends were. It showed me where my strength was. That I can still conquer myself and that there's a lot of life yet to see. \n\nI am re-invigorated and re-awakened as of this month. The next year of life is going to be full of fight. I'm going to own every day of it, and take back my own damn life again. 27 is far too fucking young to quit, and just sounds like the perfect time to conquer the world.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "In 2013, I resolve to face every attack I have head on. No more running from life. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15r9xc/in_2013_i_resolve_to_face_every_attack_i_have/",
            "user_reports": []
        },
        {
            "author": "Shoujo",
            "author_created_utc": 1320855117,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_67nfd",
            "created_utc": 1357476929,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1624vq/worried_about_sleeping_so_you_cant_sleep_so_you/",
            "gilded": 0,
            "id": "1624vq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1624vq/worried_about_sleeping_so_you_cant_sleep_so_you/",
            "retrieved_on": 1413225454,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I'm working away from home. I've been out here for nearly 4 months. 2 more to go. However, recently I've started to have this problem. I had it back when I was 16/17. It's insomnia mixed with anxiety. \n\nEven just thinking about the run up to bed time makes me anxious. I suffered for 2 years through my college days (British) but it eventually left me. I know it's probably going to go again once I get back home because then I'll feel... well, at home.\n\nOne of my worst fears was laying awake in bed all night for 8 hours. this happened to me about a month back just before my first day actually at work, and since then it's just been torture when 8pm rolls around and I have to start thinking about bed.\n\nMy night routine is lay in bed around 10/10.30. Read until about 12. Sleep (hopefully) Then rise at 7 for work.\n\nI worry I won't get enough sleep for the next day, even though I've done that day with no sleep. I worry about the effects on my health etc. fucking etc.\n\nAny suggestions would be fantastic. Though mentally I'm able to laugh at this at night and say to myself it's only 2 months, but I'd still like the problem to go.\n\nCheers.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Worried about sleeping, so you can't sleep, so you worry more about sleeping, meaning you still can't sleep. How do you break the cycle?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1624vq/worried_about_sleeping_so_you_cant_sleep_so_you/",
            "user_reports": []
        },
        {
            "author": "MegatronStarscream",
            "author_created_utc": 1350067754,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9a875",
            "created_utc": 1357302637,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15y4me/help_how_do_i_trust_therapists_again_after_they/",
            "gilded": 0,
            "id": "15y4me",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15y4me/help_how_do_i_trust_therapists_again_after_they/",
            "retrieved_on": 1413231428,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "My parents were really despeate to help me become healthy. I was agoraphobic at the time and after talking too a bunch of therapists with different titles they sent me to the hospital for testing. Completely unannounced and without telling me. I went into shock because of this. When I went back home, I went back into shock and went into a fit of rage and went sent in a psych ward. I suffered a lot of crazy, bat-shit things that I think a weaker person would have killed themselves over by now. I am not listing these specific abuses. But it was probably \"Classic PTSD\" because I was in danger of being assaulted, and being abused by workers and the other patients. \n\nAfter I got out of the hospital I tried to get help. My occupational therapist quit on me. I was getting help from a home care agency but I quit that too because there was no plan inplace so thigns didn't work out. It made me worse off because i became too dependant on workers to help me. I predicted this but no one would listen to me.\n\nAnyways. It's to the point now where my gum line is receeding and I'm afarid that I am going to lose my goddamn teeth in a few years. I've been sick for a year or longer with as inus infection. I can't go to the hospital for testing without going into severe anxiety maybe ptsd. I want to get therapy done because there's someone who does EDMR therapy here. But I can not fucking trust therapists anymore because I'm actually traumatized *from* therapy in the first place.\n\ntl;dr: I'm trauamtized from therapy. I want to see a new therapist but I can not work up enough courage. How do I trust therapists again after they literally caused me to get PTSD and be in a situation where I was almost assaulted and had to suffer a lot of abuse. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] How do I trust therapists again, after they were responsible for traumatizing me in the first place? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15y4me/help_how_do_i_trust_therapists_again_after_they/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357246962,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15wplt/tightness_in_throat/",
            "gilded": 0,
            "id": "15wplt",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15wplt/tightness_in_throat/",
            "retrieved_on": 1413233601,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I've had a bunch of medical tests performed and it's nothing physical.  My doctor is leaning towards it being related to my history of anxiety.  Anyone ever had symptoms like this due to tension from anxiety?    \n  \nIt's like there is someone gently squeezing my throat.  Nothing gets caught when I swallow, but there is greater effort involved in swallowing and I feel foods passing down the top part of my throat more than I would if things were operating normally.  \n  \nThanks",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Tightness in throat...",
            "url": "http://www.reddit.com/r/Anxiety/comments/15wplt/tightness_in_throat/",
            "user_reports": []
        },
        {
            "author": "jessikaye",
            "author_created_utc": 1316576133,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wbf8",
            "created_utc": 1357192676,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15vhfn/i_feel_so_accomplished/",
            "gilded": 0,
            "id": "15vhfn",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15vhfn/i_feel_so_accomplished/",
            "retrieved_on": 1413235410,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I called and made my own appointment at the dentist, showed up on time and got a tooth pulled without having to be heavy medicated first! I'm so happy I accomplished this. I'm terrified of calling to make appointments.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel so accomplished!",
            "url": "http://www.reddit.com/r/Anxiety/comments/15vhfn/i_feel_so_accomplished/",
            "user_reports": []
        },
        {
            "author": "Subhazard",
            "author_created_utc": 1267261658,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_3wsrx",
            "created_utc": 1357538369,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/163u0b/how_many_of_you_since_getting_your_anxiety/",
            "gilded": 0,
            "id": "163u0b",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/163u0b/how_many_of_you_since_getting_your_anxiety/",
            "retrieved_on": 1413222818,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "I see a lot of people are like 'I should really cut back' but I can't drink any of it. It always makes me freak out, am I alone here?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How many of you, since getting your Anxiety disorder, can't drink ANY caffeine.",
            "url": "http://www.reddit.com/r/Anxiety/comments/163u0b/how_many_of_you_since_getting_your_anxiety/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357311928,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15yaob/derealisationdepersonalisation_is_crippling/",
            "gilded": 0,
            "id": "15yaob",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15yaob/derealisationdepersonalisation_is_crippling/",
            "retrieved_on": 1413231197,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "Hello, this is my second bout of anxiety. I had a couple of panic attacks at work and haven't been back since, I'm on sick pay and 20mg of citalopram from my doctor. I don't really go out, I do try but it's overwhelming, feeling so disconnected from everything makes me panic, it's like I can't take everything in and I feel like I'm going to fall through the ground, not being able to feel my legs or my arms. I sleep for either stupidly long hours or a couple of hours. I sit here all day only getting up to go to the bathroom, get something to eat quick or go to bed. I got over it the first time, I had to leave high school and it took a year but it was a long empty year.\nI feel bad because my dad is being so good about it all, we're going to the doctor again on Monday, she's really lovely and I think she's going to increase my dosage but I don't know if this will do anything for the physical symptoms. \nI'm open to any suggestions at all, thank you so much.\n\nTL;DR - Intense surreal feelings ruining life, has anybody had success dealing with these feelings? Thanks a lot!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Derealisation/Depersonalisation is crippling",
            "url": "http://www.reddit.com/r/Anxiety/comments/15yaob/derealisationdepersonalisation_is_crippling/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1357534264,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/163pnt/anyone_else_deal_with_night_paranoia_and_insomnia/",
            "gilded": 0,
            "id": "163pnt",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/163pnt/anyone_else_deal_with_night_paranoia_and_insomnia/",
            "retrieved_on": 1413223007,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "I'm talking like, you're laying in your bed and your convinced that your house will spontaneously light on fire and everyone will die. Or you're sure that a murderers going to break into your house, and kill you and your family. Orrrrrr on the hypochondriac side of it, that you definitely have cancer because you have a headache. One more... Gas leaks... Fucking monoxide is going to leak into your house and for some reason the alarm doesn't sound so your going to die. \n\nAll of these terrible things have gone through my head during what I'm just going to call night paranoia. For me, its like the most disturbing scary things go through my mind and it feels so real that I believe it all. Now, the realistic side of me thats typing this knows that none of this will happen, but when I get into that paranoid state I have completely convinced myself. It's scary because I can so vividly see the terrible things in my head and it's next to impossible to think of something else. Its terrible seeing loved ones like that, and I have to physically shake my head to distract myself.  Does anyone else deal with this? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else deal with night paranoia and insomnia resulting from it? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/163pnt/anyone_else_deal_with_night_paranoia_and_insomnia/",
            "user_reports": []
        },
        {
            "author": "antonjfernando",
            "author_created_utc": 1335412038,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7k6aa",
            "created_utc": 1357424978,
            "domain": "antonfernando.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/16117k/living_as_directed_by_thoughts_emotions_and/",
            "gilded": 0,
            "id": "16117k",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/16117k/living_as_directed_by_thoughts_emotions_and/",
            "retrieved_on": 1413227091,
            "score": 12,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Living as directed by Thoughts, Emotions and Feelings.",
            "url": "http://www.antonfernando.com/2013/01/05/day-223-living-as-directed-by-thoughts-emotions-and-feelings/",
            "user_reports": []
        }
    ]
}