{
    "data": [
        {
            "author": "bigboltrules",
            "author_created_utc": 1304691775,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_577u3",
            "created_utc": 1333915492,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rzmu3/what_is_the_worst_thing_someone_has_said_to_you/",
            "id": "rzmu3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 70,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rzmu3/what_is_the_worst_thing_someone_has_said_to_you/",
            "score": 34,
            "selftext": "Mine was my boss who told me \"We just want the old you back.\"",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What is the worst thing someone has said to you about your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rzmu3/what_is_the_worst_thing_someone_has_said_to_you/"
        },
        {
            "author": "Psychonaut7",
            "author_created_utc": 1319169965,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_634g3",
            "created_utc": 1334080591,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s2v0v/your_fears_and_anxieties_do_not_exist_stop/",
            "id": "s2v0v",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "theiofgod",
                    "author_url": "http://www.youtube.com/user/theiofgod",
                    "description": "No Fear in the Now",
                    "height": 338,
                    "html": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/ZUdHX1Bent0?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i3.ytimg.com/vi/ZUdHX1Bent0/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "No Fear in the Now",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=ZUdHX1Bent0",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/ZUdHX1Bent0?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s2v0v/your_fears_and_anxieties_do_not_exist_stop/",
            "score": 32,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/F5aDgI58go3DIv5p.jpg",
            "title": "Your fears and anxieties do not exist. Stop dwelling on the past and future.  Do not fear the now.  Live in the now...",
            "url": "http://www.youtube.com/watch?v=ZUdHX1Bent0&amp;"
        },
        {
            "author": "electric-girl",
            "author_created_utc": 1334025061,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7eq6j",
            "created_utc": 1334026390,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s1x8a/im_sick_of_feeling_like_this_big_changes_start/",
            "id": "s1x8a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s1x8a/im_sick_of_feeling_like_this_big_changes_start/",
            "score": 32,
            "selftext": "I'm so tired of my anxiety controlling me. I'm at the point where I'm just constantly angry with myself for allowing my life pass me by. I want to be successful and happy and I'm so fed up with the strangle hold my anxiety has on my life. Last week was tough. I won't go into the details, but suffice to say that all the things I have been avoiding finally piled up and created one massive, unavoidable problem. My anxiety was so bad I couldn't get out of bed. I'm done living like this. \n\nTomorrow I have my first real appointment with my counselor (I've already met with him for the initial assessment). I'm shocked that I'm not feeling anxious about it. I'm actually kind of excited (what?!). I just want my life back, and this is the first step. \n\nOther than seeing a counselor bi-weekly, I'm finally going to start doing the things I know help me with my anxiety. I've always known these things help me, but I always seem to allow my anxiety to stop me from doing them (vicious cycle). These things include:\n\n1. Exercising (daily)\n2. Keeping a daily planner\n3. Keeping my apartment tidy, and specifically, making my bedroom a calming and meditative environment\n4. Sticking to a routine (e.g, having a routine for before I go to bed every night and doing it the same every night. this had been really helpful for me in the past, but like I said, I sabotage myself by saying \"oh, I'm too stressed to do that tonight\" when I know that not doing it will only make me more stressed) \n5. Reading (every night)\n\nI've made these promises to myself before, but I've always let my anxiety get the better of me. I really want a better life. I'm not going to let my anxiety destroy another relationship or opportunity. I'm scared, but I'm finally going to take control.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm sick of feeling like this. Big changes start tomorrow.",
            "url": "http://www.reddit.com/r/Anxiety/comments/s1x8a/im_sick_of_feeling_like_this_big_changes_start/"
        },
        {
            "author": "PhilRivers",
            "author_created_utc": 1320843989,
            "author_flair_css_class": "",
            "author_flair_text": "SAD",
            "author_fullname": "t2_67me2",
            "created_utc": 1334234312,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s62mi/im_exactly_like_this_getting_ready_for_any_social/",
            "id": "s62mi",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "clattermachine",
                    "author_url": "http://www.youtube.com/user/clattermachine",
                    "description": "tina fey, in her ultimate hilarity, has a classic liz lemon moment on \"30 rock,\" season 3.",
                    "height": 338,
                    "html": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/_9U78NbX9ro?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i4.ytimg.com/vi/_9U78NbX9ro/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "you stupid bitch!",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=_9U78NbX9ro",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/_9U78NbX9ro?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s62mi/im_exactly_like_this_getting_ready_for_any_social/",
            "score": 30,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/4G3rjWUREplwu9_X.jpg",
            "title": "I'm exactly like this getting ready for any social event",
            "url": "http://www.youtube.com/watch?v=_9U78NbX9ro"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334115563,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s3rrg/facebook_is_a_major_source_of_anxiety_for_me/",
            "id": "s3rrg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s3rrg/facebook_is_a_major_source_of_anxiety_for_me/",
            "score": 28,
            "selftext": "I understand the simple solution would simply be to delete my account. However, the thought of having to explain myself to people almost feels worse than the persistent anxiety FB brings me. Fuck. Most people don't even realize I have anxiety problems, and I don't care to advertise that fact.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Facebook is a major source of anxiety for me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/s3rrg/facebook_is_a_major_source_of_anxiety_for_me/"
        },
        {
            "author": "gutentagpenis",
            "author_created_utc": 1331345150,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_74tnj",
            "created_utc": 1334292607,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s7hkb/its_the_small_things_that_help_me_see_ive_taken/",
            "id": "s7hkb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s7hkb/its_the_small_things_that_help_me_see_ive_taken/",
            "score": 27,
            "selftext": " \nI am a 20 year old female student struggling with anxiety (social anxiety)I thought I'd share some changes I've seen in my life. It's far from over, But I know I've come a long way with my social anxiety. \n\nI used to never be able to leave my house unless someone was with me. I lost so many beautiful days to anxiety. \n\nI developed an eating disorder at 10 years old because of social anxieties and fought with it until the beginning of college.\n\nTeachers and councilors thought I was mute up until high school.\n\nI lost my only friend because of my clingyness. Depending on her for so much must have been a heavy burden. Seeing her in the streets truly embarrasses me- I was such a horrible friend. \n\nI hated myself so much. I cut, starved, and puked because of who I was. I would sleep on the bathroom, garage, or attic floor and ended up with lice at 15 years old.  \nI was a disappointment and budren for my mother. \n\nI never once talked to my college roommates, instead I locked myself in my room and wasted those beautiful days away. \n\nI would take sleeping pills to make the time go by faster. \n\nI think one of my lowest points was when one of the roommates had friends over. I had to go to the bathroom, but was too afraid to leave the room so instead pissed into a pad and threw it out when they left. It might not be the worst, but even then I knew how low I had fallen. I felt sub-human not even being able to reach a bathroom. \n\nBut I think I've changed quite a lot in the past 2 years. I'm not sure what caused such a drastic change in such a short time, but in comparison, I can definitely see it. \n\nI can now go to stores on my own. :)\n\nI can now go to a public gym. :) \n\nI can now eat in public. :)\n\nI can now leave my home alone. :)\n\nI can now talk to some people and keep eye contact. :)\n\nI say thank you to cars that stop for me. :)\n\nI've called friends. :)\n\nI've talked to strangers. :)\n\nI've made new friends. :)\n\nI've talked when in group work at school. :)\n\nI say \"Thank you\" to my bus driver. :)\n\nI walk 30 minutes to class everyday through the city. :)\n\n\nI still hesitate when I leave my house or head to the gym. I still find it hard to keep a conversation going and to keep eye contact. I still find it hard to smile at strangers, but I think I've come a long way. :) \nAnxiety never goes away, but I think I've begun to manage it. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "It's the small things that help me see I've taken little steps in the right direction",
            "url": "http://www.reddit.com/r/Anxiety/comments/s7hkb/its_the_small_things_that_help_me_see_ive_taken/"
        },
        {
            "author": "ZombieKitty",
            "author_created_utc": 1294167742,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4or3p",
            "created_utc": 1334347373,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s8g48/seriously_dont_knock_it_till_you_try_it/",
            "id": "s8g48",
            "is_self": true,
            "media_embed": {},
            "num_comments": 47,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s8g48/seriously_dont_knock_it_till_you_try_it/",
            "score": 25,
            "selftext": "Hello my name is Zombiekitty and I had severe anxiety whenever I tried to study. I'm currently in grad school and about half way through my program. Last semester I failed 2 classes. Rather than outright failing me, the professors were nice enough to give me an \"incomplete\"and let me re-take the exams. \n\n\nI had quit my job in November to be ready for my exams in December and but I ended up failing 2 classes anyways. I felt like shit. I retook the the exam from Mrs. E in early March and I failed again, even after studying a shit ton for it. Dr. T told me to see him at the beginning of the Spring semester. The semester is over in 3 weeks and I still haven't seen him. I so horribly afraid of failing a 2nd time and having my financial aid taken away.\n\n\nDuring my first round of studies I felt the normal anxiety that comes with prepping for exams. After the failures, I started being afraid of failing, so anxiety starting building up whenever I sat in front of my books. My symptoms went from being uncomfortable to having full blown sobbing sessions with my body trembling something awful. \n\nI'd sit in front of my text book and begin reading. My heart would begin to race. I felt light headed. My hands would begin to tremble, then came the shortness of breath. And finally, tears would fall on the pages before me.\n\nWhat used to be my joy, the thing that also kept my curiosity going, now had me retreating to the opposite end of the room. I've had anxiety before this was by far the worst because its affects were destroying my grades. I recently came off financial aid probation and here I was back at square one. What if they take away my only source\n to pay for school, not to mention living expenses? \n\n\n\nIt seemed that my only choice was to use medication to treat my symptoms. But I wasn't looking forward to that option. I was on anti-depressants for a short while a few years ago but I stopped taking them because I just didn't \"feel right\", you know what I mean?\n\nAnd then I remembered Chinese medicine. If needles and herbs had \nhelped my physical aches and pains, why wouldn't  it be able to treat this?\n\nMy first treatment gave me some relief. I felt relaxed and able to get to my regular duties.\n\nIt was the second treatment that really made a difference. After he inserted the needles and left the room, weird stuff started happening. I got really, really cold even thought I had two heat lamps on me. My body got waves of goosebumps, then I started sobbing like a child. The acupuncture points were helping me have an emotional release I was \nunable to have on my own. After the tears dried up, I felt calm. \nAfter laying there for 30minutes, he returned to remove the needles and I told him of my experience. He said it was a good sign and decided to give me some \"homework\".  I was given some herbs to make a tea that I was to drink and hour before bed time. He also told me to massage my kidneys for a few minutes and massage the point [Kidney 1](http://yinyanghouse.com/acupuncturepoints/kd1) right before bed.\n\n\nThe tea and massage are to help me wind down enough to fall and stay asleep (yes, I suffered from insomnia and waking up frequently during the night). The tea didn't taste was bad as I thought it would. It was sweet with a hint of bitterness at the end. The massaging wasn't so bad either, though I will admit that I cried the first two nights I massaged Kid 1. I wasn't crying because it was painful, I was having emotional releases.\n\n\nThe next day, I had a two hour study session that just flew by. I took a 30 minute break and then went back into it for another hour and 45minutes. Not a single tear was shed! I felt fantastic. My fear was nearly gone. It was more of an annoying sound in the back of my mind instead of the blaring monster that was freaking me out.\n\n\nI had my reservations about using acupuncture for emotional issues because of studies saying it's a sham or the placebo affect.\nI am my own proof that it helps. I went to the 3rd treatment earlier this week and discussed my progress. I was sleeping better, I actually had energy throughout the day, and most importantly, I was getting work done.\n\nI have another 3 sessions left to help finish clear up stuff. I was advised to go in for occasional \"tune up\" if symptoms returned.\n\n\nChinese medicine isn't a cure all, but then again, nothing really is. I preferred having my qi moved around by needles and herbs instead of pills altering my bio-chemistry. I understand and am fully aware that medication is  necessary for some people (I prefer you to be alive &amp; medicated than be all dead). If my symptoms weren't improved or if they worsened I definitively would have taken medication.\n\nI wanted to share my story since I know a lot of us are apprehensive about taking medication.\n\n\nTL;DR Acupuncture is currently helping my anxiety. Yes, I know some of you of skeptical. But this is my story, not yours.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Seriously, don't knock it 'till you try it",
            "url": "http://www.reddit.com/r/Anxiety/comments/s8g48/seriously_dont_knock_it_till_you_try_it/"
        },
        {
            "author": "throaway_anxiety",
            "author_created_utc": 1333879928,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7e3i8",
            "created_utc": 1333881959,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rz3os/having_an_attack_and_crying_for_the_first_time_in/",
            "id": "rz3os",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rz3os/having_an_attack_and_crying_for_the_first_time_in/",
            "score": 20,
            "selftext": "I'm having insomnia tonight and my anxiety was just getting worse and worse and I felt it coming and I just started crying and I haven't really cried in years. \n\nI worry about everything.\n\nI get anxiety because I just moved away from my home-city to a city that's a 2 hour ferry ride away and an hour drive. All of my family except my oldest sister is still in the home city. I'm lonely over here.\n\nI worry about my mom because I know she has anxiety like I do and it's getting worse with age. She also has a heart-related condition that is giving her a lot of pain and may lead to a heart attack or stroke. She is so important to me and I don't think I could lose her.\n\nI worry about my dad, who's an emotional lockbox and is retiring soon. He and my mom both drink heavily and they've never stopped despite many attempted interventions by myself and (half-heatedly) from my sisters. My mom has a ton of anxiety about getting old and really wants to go on vacations and have some new experiences but my dad doesn't want to do anything except sit at home. They love each other but I feel like he's being incredibly, unbelievably selfish and isn't doing his duty to give my mom the happiness she deserves.\n\nI worry about my older sister. She has some issues that cause her to strain relationships within the family. We had a shouting match tonight but talked it out for an hour and resolved it, but I'm still upset about it. I shouldn't have allowed it to happen even though I wasn't the instigator.\n\nI get anxiety about my other sister, who I am extremely close with (whenever we're together) but ever since I moved it seems like we're losing contact. Sometimes we go a few days without even texting each other, and that scares me.\n\nI feel so responsible for keeping the ties on this family close, and I feel like I'm not doing a good enough job and no one else is trying or sees it. I guess my picture of the perfect family unit has been shattered in years past and I'm trying so desperately to retain it.\n\nI have anxiety about the fact that I'm 24 years old and I've never had a serious relationship. Before my last pseudo on-and-off girlfriend of 4 months I had never had sex with the same girl more than twice. I can talk to woman fine and I know I'm decently attractive but I've never dated the same girl for more than 4 months. It never really bothered me that much in my early twenties but now that I'm almost 25 it scares me. There's nothing in my life more important to me than family, and there's nothing more important to my future than a wife and kids who I can love, and now I'm worried that I won't ever get that.\n\nI worry that I'm falling so unbelievably short of my potential and that I'm ruining my life. I graduated with distinction from one of the hardest degree programs in Canada (with very little effort, wasn't able to apply myself either) and got a great job in November, but I can't apply myself to it or get motivated (Reddit on my phone 6 hours a day). I \"hate\" my job even though I know it's a great opportunity and I should be excited for it, and I know that I would hate any job right now. I am so scared that I'm just a lazy person and I'll underachieve my entire life. (Please don't think any of that is bragging, I just want to provide context for how I'm feeling. I'm not a boastful person.)\n\nI have anxiety about my past, particularly middle/high school. I was picked on and bullied and I just wish I could go back and change so many things. I wish I could've stood up for myself and punched the bullies in the face and fought for one time over that whole period.\n\nI'm so afraid of getting old. I'll be 25 in June and I feel like my twenties are blowing past me and I'm wasting them.\n\nI get anxiety over my friends. My best friend and former roommate did something that broke my trust nearly a year ago. We were incredibly close and ever since then, it just hasn't been the same. He doesn't know that I know what he did, but I can't look at him the same way. He's probably still my best friend, but the absolute trust just isn't there anymore. Two of my other good friend (and practically only friends) in new city are moving away for the summer, one for Basic Training and the other to work on a cruise ship. I'm lonely.\n\nI get anxiety in my life because I've struggled with erectile dysfunction due to anxiety. With new partners it happens moderately frequently, and I'm incredibly ashamed of it and terrified that it will happen with any new girl, which obviously just makes it worse and a self-fulfilling prophecy. I've never been able to truly enjoy sex because of this, I'm always concious of it.\n\nI get anxiety about my anxiety. I know there's something wrong with me and I need to fix it but I haven't done anything yet.\n\nI get anxiety about dying prematurely, not for myself but because I know it would absolutely destroy my family and my mother especially.\n\nI get anxiety about the fact that all of my resolutions to improve come when I'm getting anxiety and yet I follow through on so few of them.\n\nI'm sorry this is so long. I just had to get this out, to somebody, anybody, even if nobody reads this it's out there. I'm not sure how to end a post like this.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Having an attack and crying for the first time in years as a 24 year old male. I just really need to talk to somebody, please.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rz3os/having_an_attack_and_crying_for_the_first_time_in/"
        },
        {
            "author": "toleary520",
            "author_created_utc": 1298615060,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4w0y3",
            "created_utc": 1333951381,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s0fhz/i_just_finished_a_72_hour_voluntary_stay_at_a/",
            "id": "s0fhz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s0fhz/i_just_finished_a_72_hour_voluntary_stay_at_a/",
            "score": 20,
            "selftext": "So last Tuesday I had a bad panic attack at work. Bad to the point that I walked out of work, got in my car, and impulsively swallowed a bottle of Xanax. I sat in my car for a few minutes, panicked and drove home. I had my wife drive me to the hospital. I'm uninsured so I kept thinking that one, I don't want to pay for an ambulance ride and two, I shouldn't be driving. \n\nGet to the hospital, end up there overnight. I get told that I have three options. 1) Get admitted to the local private mental health facility at $5500 a week. 2) Voluntarily admit myself to the state run mental facility for 72 hours or 3) involuntarily get admitted to the hospital for an undetermined amount of time. \n\nExtremely reluctantly I chose option 2. The facility is the downtown drunk tank/mental health place. I got to spend some time in the drunk tank too. That was a blast. They put me in there while admitting me because I couldn't be in the lobby. Lots of screaming, drunk homeless guys...and me.\n\nI finally get admitted after 6 hours. The 72 hours consisted of 69 hours of sleeping/eating/watching tv (no books or other recreation), 2 hours of group meetings of which there were only 2 and being generous by 30 minutes, one-on-one time with a nurse practitioner. \n\nGroup sessions centered around alcohol and drug abuse because I was the only person in there not for substance abuse problems. \n\nThey told me they weren't allowed to give me time off work so they cleared me to go back to work in the morning. \n\nSo I don't know what to do now. My voluntary treatment was anything but treatment and basically a glorified jail sentence and I received no help for my anxiety problems and I'm back at square one. \n\nIt's been a long 5 days. \n\nTl;dr - panic attack, took a bottle of pills, went to mental health facility that did no good, feeling lost",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just finished a 72 hour 'voluntary' stay at a mental health facility after a panic attack gone bad",
            "url": "http://www.reddit.com/r/Anxiety/comments/s0fhz/i_just_finished_a_72_hour_voluntary_stay_at_a/"
        },
        {
            "author": "panicmonkey",
            "author_created_utc": 1317661190,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5z1rk",
            "created_utc": 1334160801,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s4ie7/anyone_quit_smoking_cigarettes_did_it_help/",
            "id": "s4ie7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s4ie7/anyone_quit_smoking_cigarettes_did_it_help/",
            "score": 20,
            "selftext": "My friend told me the #1 thing he did to help his panic and anxiety was to quit smoking, and that he rarely has any of it now.  Anyone else have a similar experience?\n\nEDIT:  Thanks for all the replies.  I really enjoy smoking, but less so lately and have been coughing and it's just time to quit.  I think as much as getting rid of the nicotine, getting rid of the other chemicals in the cigarettes will help too.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone quit smoking cigarettes?  Did it help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/s4ie7/anyone_quit_smoking_cigarettes_did_it_help/"
        },
        {
            "author": "AngstRider",
            "author_created_utc": 1334325935,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7g0ng",
            "created_utc": 1334327502,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s7yo9/passionflower_the_most_helpful_herb/",
            "id": "s7yo9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s7yo9/passionflower_the_most_helpful_herb/",
            "score": 20,
            "selftext": "Long-time anxiety sufferer here, probably my whole life on-and-off.  The last 8 years it's been on and it's sucked.  I've gone through a ton of prescriptions (pretty much every SSRI), buspirone, a few types of benzos (which help, but obviously shouldn't be used daily), beta-blockers, and tried a number of natural herbs, etc. with very little benefit.  That is, until I tried passionflower.\n\nIt actually works -- for me, at least.  I've found it more helpful to me than pretty much every other pill (maybe other than alprazolam/xanax) in terms of effectiveness and seems to have a total lack of side-effects.  It's not a 100% effective, but then again neither are benzos, but it is by far the most helpful treatment I've found and really doesn't cost much.  I've found 1 pill gets me through until about lunch (standard dose calls for 2 pills however many times daily you need), and then I usually end up taking one at lunch, then another a little later in the afternoon and it gets me through the remainder of the day, but I'm sure we're all different.  I've found it usually takes an hour or more for me to really start feeling the effects, then can last potently at least a few hours before it starts to dip, but unlike benzos or any number of other drugs, it's doesn't smack you with a ton of anxiety or drop you off a cliff when it starts wearing out -- it's very subtle, like it's still in effect all day, just that the effects are slowly diminishing.  Another thing that really surprised me was that it's effective off the first pill -- no need to build it up in your system over weeks or anything -- it literally worked off the first pill I took and could hardly believe it.\n\nI buy from Oregon's Wild Harvest and get the organic passionflower, but I'm sure there are other good sources too.  And no, I don't work for them or any other industry even remotely related to medicine/drugs/whatever, I just haven't tried any other place -- haven't needed to cuz the stuff works (for me).\n\nI do occasionally supplement it with l-theanine  (200mg) and/or propranolol (10mg), but I've found passionflower to be pretty damn effective on its own.\n\nI've found zero tolerance with the stuff, nor have I felt any dependence whatsoever after several months of daily use, and perhaps even better is a lack of side-effects -- only one might be just a very slight drowsiness.\n\nAnyways, just thought I'd pass news of this badass herb along and maybe it'll help other anxiety sufferers.  It's certainly helped me :D",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Passionflower: the most helpful herb(?)",
            "url": "http://www.reddit.com/r/Anxiety/comments/s7yo9/passionflower_the_most_helpful_herb/"
        },
        {
            "author": "Searching4hope",
            "author_created_utc": 1322391146,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6blb6",
            "created_utc": 1334225956,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s5z09/in_serious_need_of_some_tips_on_how_to_function/",
            "id": "s5z09",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s5z09/in_serious_need_of_some_tips_on_how_to_function/",
            "score": 19,
            "selftext": "Stress comes, anxiety hits. I can't sleep-not that I \"can't\" it's more that I really dont want to. I want to do anything or everything else, to have as much time and space between me and whatever is causing my anxiety as possible. Sleep makes that time shorter. Plus, I need to do things I enjoy to distract me from that anxiety. Right now, I am finishing college and I have a paper due tomorrow. It's 3am and I still am not asleep, nor have I finished the damn paper. Anxiety is ruining my life-or it already has. It's caused so much damage. I am so F*d up mentally and physically just because of years of severe anxiety wearing me down. I don't know how to beat this. It's got me in it's clutches and it's not letting me go.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "In serious need of some tips on how to function normally under stress..",
            "url": "http://www.reddit.com/r/Anxiety/comments/s5z09/in_serious_need_of_some_tips_on_how_to_function/"
        },
        {
            "author": "asw91",
            "author_created_utc": 1311055222,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5jarf",
            "created_utc": 1333995006,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s14ke/what_is_the_earliest_instance_you_can_remember_of/",
            "id": "s14ke",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s14ke/what_is_the_earliest_instance_you_can_remember_of/",
            "score": 17,
            "selftext": "I'll start. I was in kindergarten and a friend of mine was having a birthday party at a bowling alley. I left the lane at one point to go to the bathroom and when I got back, one of the chaperones told me it was my turn. After I bowled, the lady realized she had been wrong about the rotation and that I had taken someone else's turn. When she told me this, I got so anxious that I had to sit out the rest of the game.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What is the earliest instance you can remember of something trivial causing you extreme anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/s14ke/what_is_the_earliest_instance_you_can_remember_of/"
        },
        {
            "author": "3amRadio",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334363546,
            "domain": "medicalxpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s8tka/choline_levels_linked_to_anxiety_jeremy_coplan_md/",
            "id": "s8tka",
            "is_self": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s8tka/choline_levels_linked_to_anxiety_jeremy_coplan_md/",
            "score": 16,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Choline levels linked to anxiety? \"Jeremy Coplan, MD, professor of psychiatry at SUNY Downstate, and colleagues found that high intelligence and worry both correlate with brain activity measured by the depletion of the nutrient choline.\"",
            "url": "http://medicalxpress.com/news/2012-04-excessive-co-evolved-intelligence.html"
        },
        {
            "author": "ScopeOfTheFatedSky",
            "author_flair_css_class": "",
            "author_flair_text": "",
            "created_utc": 1334098699,
            "domain": "whatshouldwecallme.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s3cdh/i_thought_my_fellow_nervous_travelers_would_enjoy/",
            "id": "s3cdh",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s3cdh/i_thought_my_fellow_nervous_travelers_would_enjoy/",
            "score": 16,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I thought my fellow nervous travelers would enjoy this. ",
            "url": "http://whatshouldwecallme.tumblr.com/post/19470533416/turbulence"
        },
        {
            "author": "Socialmessup",
            "author_created_utc": 1284508852,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4cdsp",
            "created_utc": 1334290789,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s7ga3/relapse_of_anxiety_whenever_i_socialize_with_a/",
            "id": "s7ga3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s7ga3/relapse_of_anxiety_whenever_i_socialize_with_a/",
            "score": 15,
            "selftext": "I was on top of the world. Feeling good and confident. Then it hit me. Only reason I felt confident was because I wasn't interacting with anyone. I just went to an old friends house and all my anxiety came back. I was stuttering, weak voice, sweating, extremely self conscious about everything. Fuck this will never end. Time to get some meds",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Relapse of Anxiety whenever I socialize with a group",
            "url": "http://www.reddit.com/r/Anxiety/comments/s7ga3/relapse_of_anxiety_whenever_i_socialize_with_a/"
        },
        {
            "author": "detailed_fred",
            "author_created_utc": 1331760365,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_767x5",
            "created_utc": 1334243637,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s69gc/have_any_of_you_100_recovered/",
            "id": "s69gc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s69gc/have_any_of_you_100_recovered/",
            "score": 14,
            "selftext": "Simply put: Is this horrific madness ever going to end? \n\nI've seen psychologists, I'm on meds, I spend all my time on self help/motivational sites, my life is on track, ...but nothing seems to be getting any easier. I still over analyse, I still over complicate, and I still stress about every god damn minute detail.\n\nI just want to know that someone out there has been some what \"cured\" and can now live a happy life 100% without any fears or concessions. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Have any of you 100% recovered?",
            "url": "http://www.reddit.com/r/Anxiety/comments/s69gc/have_any_of_you_100_recovered/"
        },
        {
            "author": "dirtyslattern",
            "author_created_utc": 1328590133,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6uy38",
            "created_utc": 1334023521,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s1une/anyone_else_have_middleofthenight_anxiety_attacks/",
            "id": "s1une",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s1une/anyone_else_have_middleofthenight_anxiety_attacks/",
            "score": 14,
            "selftext": "I have a fair amount of anxiety in my waking life, but it can get really bad during the night. I'll hear something in my sleep, like my phone going off, and it'll half wake me up. In that half-awake state, my mind will interpret the noise as something sinister, like a disembodied voice or creepy music, and I'll get so terrified I can't move. Last night, I woke up with an area of localized pain in my leg. I turned on the light to see if there was a bruise, and since there was none, I reasoned that I must have a blood clot. And if I moved too much, the clot would certainly dislodge and destroy my lungs (yes, I'm a nursing student). So until I went back to sleep, I laid there truly convinced that if I didn't lay still, I would die. I didn't remember this episode until the next afternoon. I did take 3mg of melatonin last night, I wonder if that was a contributing factor.\n\nIs this a common symptom of an anxiety disorder? Anyone else experience these? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else have middle-of-the-night anxiety attacks? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/s1une/anyone_else_have_middleofthenight_anxiety_attacks/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333947568,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s0cyq/anxiety_over_school/",
            "id": "s0cyq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s0cyq/anxiety_over_school/",
            "score": 13,
            "selftext": "DAE get extremely anxious when doing anything related to school? I'm a high school sophomore right now and I'm really struggling. I don't know if it's caused by laziness, stupidity, depression, or something else, but it's been a challenge for me to just get Bs and Cs (And I've had better grades this year than ever before). It makes me feel like absolute shit whenever I hear people talk about how easy high school is and how they didn't even have to try to get straight As.\n\nDuring class, my mind is constantly racing and I have a hard time staying calm and not shaking in my desk. On many nights I will start doing homework, then either freak the fuck out or curl up in a corner until I can pretend to be finished. I have an extremely hard time concentrating and staying motivated, and I feel like I'm going to completely fuck up any chance I have for a happy life because my grades aren't good enough for college.\n\nI apologize for the wall of text. This thread is more about you guys than it is for me, and I want to hear about what you might have done about this.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety over school",
            "url": "http://www.reddit.com/r/Anxiety/comments/s0cyq/anxiety_over_school/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334003215,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s1cbw/fear_of_pissing_my_pants_for_no_reason/",
            "id": "s1cbw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s1cbw/fear_of_pissing_my_pants_for_no_reason/",
            "score": 12,
            "selftext": "I've had problems with anxiety for the past year or so. It started out not being too bad, but it's gotten fucking ridiculous lately. Since around the end of December, I've had the this weird fear that I'm going to piss my pants at school even though I haven't pissed my pants since I was like 5. It makes it fucking impossible to concentrate on anything because I feel like I'll just pee all over myself if I don't concentrate on holding it in. I try to go to the bathroom after like every class, and I usually don't even have to go. I don't really feel like I have to, but I feel like if I don't try to hold it in, it'll come out anyways. It only really happens at school or in situations where I can't leave. I had a couple of panic attacks today because of it. Is there any way to deal with this besides going to a doctor?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Fear of pissing my pants for no reason",
            "url": "http://www.reddit.com/r/Anxiety/comments/s1cbw/fear_of_pissing_my_pants_for_no_reason/"
        },
        {
            "author": "SCJnr",
            "author_created_utc": 1325350192,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6jwlj",
            "created_utc": 1333905638,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rzezv/im_really_hoping_someone_can_help_me_right_now/",
            "id": "rzezv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rzezv/im_really_hoping_someone_can_help_me_right_now/",
            "score": 12,
            "selftext": "I need help, im in the middle of another attack 3rd one for the night, but i can't calm myself down anymore, iv been awake for almost three days now, and now iv almost lost all feeling in my hands, im really struggeling right now.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Im really hoping someone can help me right now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rzezv/im_really_hoping_someone_can_help_me_right_now/"
        },
        {
            "author": "GashcatUnpunished",
            "author_created_utc": 1327431135,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6qsz8",
            "created_utc": 1334017863,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s1pdr/anyone_else_get_this_shit/",
            "id": "s1pdr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s1pdr/anyone_else_get_this_shit/",
            "score": 12,
            "selftext": "Now, my mother is a saint and incredibly supportive, but she likes to bust out this mind-bending little tidbit a lot.\n\nMy Mom: Worrying over yourself is a symptom of being self-centered so stop being self-centered.\n\nWell *gee*. That helps a lot mom. I didn't start worrying any less but I *do* have less self esteem! Thanks!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else get this shit?",
            "url": "http://www.reddit.com/r/Anxiety/comments/s1pdr/anyone_else_get_this_shit/"
        },
        {
            "author": "yellowhairedfemale",
            "author_created_utc": 1316543546,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5w81z",
            "created_utc": 1334113815,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s3qdm/frightening_thoughts_is_this_normal/",
            "id": "s3qdm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s3qdm/frightening_thoughts_is_this_normal/",
            "score": 12,
            "selftext": "I have known that I suffer from anxiety.  But now I am having these frightening thoughts about everyone I love dying and how I don't give anyone enough time to spend time with them or take in everything they are, like I take everything and everyone for granted and I don't know how to stop.  I feel like I have lost my drive, that I am too scared of everything to continue, even the thought of going on vacation send my brain spiraling out of control.  I'm scared something is going to happen when I am not here.  I suffer from a digestive-system illness and I am constantly afraid of not feeling good somewhere outside my home.  I feel like there is so much I can't control.  I don't think I am cut out to be a wife and mother one day.  I don't know how to tell someone how I feel without sounding crazy.  Every time I feel this way I push the thoughts out of my head but they keep coming back.  I am scaring myself with these thoughts and think I should be telling someone about them but I am afraid to find out what it all means.  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Frightening thoughts, is this normal???",
            "url": "http://www.reddit.com/r/Anxiety/comments/s3qdm/frightening_thoughts_is_this_normal/"
        },
        {
            "author": "cdank",
            "author_created_utc": 1315545322,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5tno3",
            "created_utc": 1334373024,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s90gb/start_being_honest_with_yourself/",
            "id": "s90gb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s90gb/start_being_honest_with_yourself/",
            "score": 12,
            "selftext": "People need to start being honest with themselves. Everyone with anxiety fantasizes about discovering they have some illness, some deficiency, some disorder that's causing them to feel horrible. They wish they could eat a certain food, take a magic pill, do a certain activity that will fix a kink in their brain and 'cure' them.\n\n\nI'll tell you what : almost no anxiety is caused by a chemical imbalance. You're not lacking some sort of chemical sold for $40 a bottle and marketed to the fearful and desperate. Your anxiety is caused by YOU. You will  have to consistently confront your fear and change the way you approach it, view it, and react to it before you make any sort of real, lasting progress.\n\nSure, you can mask your symptoms by taking tranquilizers, but as soon as they wear off, the anxiety will be right back there waiting for you, and it wont stop bothering you until you treat it on a **behavioral** level.\nThere is so much wrong with the search to find a 'cure', it's all delusional and it inhibits making real progress. There is no instant gratification, but there IS a way out.\n\nResearch mindfulness, meditate **every day**, teach yourself to stop reacting to your emotions and labeling them as \"Good\" or \"Bad\". Hold anxiety fully in awareness, face it,  feel it, welcome the unpleasant feelings and thoughts, do not resist or try to change them, and they will LOSE ALL CONTROL OVER YOU. It is the fight you put up every day that keeps you exhausted and afraid.\n\n**This is a copy of a comment I made in another thread.*",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Start being honest with yourself.",
            "url": "http://www.reddit.com/r/Anxiety/comments/s90gb/start_being_honest_with_yourself/"
        },
        {
            "author": "justcountingdays",
            "author_created_utc": 1333599508,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety Hypochondriac Depression",
            "author_fullname": "t2_7d105",
            "created_utc": 1334005019,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s1dyv/what_are_your_anxiety_symptoms/",
            "id": "s1dyv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/s1dyv/what_are_your_anxiety_symptoms/",
            "score": 11,
            "selftext": "First of all, I'd love to thank everyone that helped me last week on my first days-long anxiety attack, you guys are amazing. I do feel much better now.\n\nA new symptom appeared since and that is a low rumbling sound and numbness in my left ear and reduced hearing. I started freaking more again as i dont know what this was. I still have it though, almost constantly, it seemed to go away yesterday at our easter get together with my in-laws, i dont remember having it.\n\nHas anyone had something new show up when having an attack?\nI know that everyone experiences different things so what are yours?\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What are your Anxiety symptoms?",
            "url": "http://www.reddit.com/r/Anxiety/comments/s1dyv/what_are_your_anxiety_symptoms/"
        }
    ]
}