{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333481623,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rrmei/how_to_care_for_introverts_a_guide_for_parents/",
            "id": "rrmei",
            "is_self": false,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rrmei/how_to_care_for_introverts_a_guide_for_parents/",
            "score": 175,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How to care for introverts: A guide for parents, teachers, and friends.",
            "url": "http://i.imgur.com/Ym2ru.jpg"
        },
        {
            "author": "shankingviolet",
            "author_created_utc": 1320940709,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_67w6n",
            "created_utc": 1333581385,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rtq9t/reasons_to_live_xpost_from_rhappy_rdepression/",
            "id": "rtq9t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rtq9t/reasons_to_live_xpost_from_rhappy_rdepression/",
            "score": 41,
            "selftext": "Hey there.  \n\nI've just started a new subreddit: [r/reasonstolive](www.reddit.com/r/reasonstolive). It's basically what it sounds like -- a place for people to post things that give them joy, meaning, inspiration, hope or a reason to fight. Any format goes; you can share an experience, photo, song, quotation, or anything else. My hope is for it to become a compendium of redditors' reasons to live that might serve others who are having trouble finding reasons of their own.  \n\nGo to it!  \n\n[Sorry for all the x-posting. I'm new at this starting a subreddit thing, and don't really know what I'm doing.]",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Reasons to Live (x-post from r/happy, r/depression, r/stopselfharm, r/anxiety, r/bipolar, r/suicidewatch, r/gettingoverit, and r/getmotivated.)",
            "url": "http://www.reddit.com/r/Anxiety/comments/rtq9t/reasons_to_live_xpost_from_rhappy_rdepression/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333821078,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ry309/whats_a_nice_way_of_saying_i_didnt_go_to_class/",
            "id": "ry309",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ry309/whats_a_nice_way_of_saying_i_didnt_go_to_class/",
            "score": 37,
            "selftext": "I pretty much missed class nearly all of last week after a minor breakdown, but I'm ready to go back. The teacher is very friendly, as are some of the students, and I know I'm going to get the standard \"We missed you last week! Where were you?\" lines and I was wondering how to deal with them. Normally I just say I wasn't feeling well but I feel like if we're paying all this money to be here, it's pretty lame to stay home simply because you feel tired or have a sore throat...and it's obvious I haven't been suffering from anything more serious. Should I just say \"I don't want to talk about it right now\"? That seems so offputting, and I don't want people to think I don't want to talk to them, because I do....",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "What's a nice way of saying \"I didn't go to class last week because I was too anxious/scared\" without looking weird?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ry309/whats_a_nice_way_of_saying_i_didnt_go_to_class/"
        },
        {
            "author": "starrymoon",
            "author_created_utc": 1333068844,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7azid",
            "created_utc": 1333330929,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rour7/i_would_really_appreciate_some_help_right_now_ive/",
            "id": "rour7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rour7/i_would_really_appreciate_some_help_right_now_ive/",
            "score": 21,
            "selftext": "oooooooooookay.\n\nthis will be a long one, but i'll try to be succinct.\n\ni am 18 years old, female, and i have been experiencing panic attacks 5/7 days a week for the past month and a half. i had my first panic attack when i was about 12 and have had short bursts of panic since then.\n\ni have diagnosed depression and anxiety, and could also possibly be bipolar II because i have had hypomanic episodes before and have a very very strong family history in its favour.\n\ni am a strong and resillient person and i have pushed my way through this as best i could but some days i really collapse and can't handle it. i'm trying to finish up my first year of university here, and am working part time and i'm bending under all the weight of this. there have been many times where i've been on the edge and i've been thinking suicide is a good option, but i love my friends and family too much. i want to get better.\n\nsome triggers for my attacks are being in a place i can't leave, thinking about throwing up, performance (had an attack on stage last night), and meta-anxiety: worrying about my anxiety long term.\n\ni think i might have low self esteem because i had a very very awful childhood, i was neglected and left alone all the time. i know that self esteem ties intimately in to anxiety issues.\n\ni've been to my doctor about this but the only thing she has to offer me is a medication that i have a long history with. i was on 100mg of seroquel for two whole years in high school after going into the hospital for depression. i don't know why they gave me seroquel for depression, but it helped with the sleeping issues and it agreed with me pretty well. i guess it turned me into a complacent zombie who kept filling the prescriptions they gave me. last june, however, i successfully got off it and didn't take it again until january.\n\nin january i went to my doctor to describe a hypomanic episode during which i stayed up really late and got a lot accomplished. apparently that calls to be medicated and i was okay with it because i like it for sleeping. i soon got off it for the same reasons as before.\n\ni don't want to be on seroquel at all because it has the possible side effect of tardive dyskinesia. if you're not familiar with this, it's uncontrollable facial twitching/grimacing. i would kill myself if i came down with this. the chances increase with the time you're taking it for. i don't want to risk that!\n\nanyways, she convinced me to take it again when i went in about 3 weeks ago for this problem. i was really reluctant but she kept saying just trust me, take the seroquel. so whatever, i did. i felt a bit better once it got into my system, i guess stable is the word. the panic attacks subsided a bit but still stayed around. then i had a panic attack where my eye wouldn't stop twitching so i started thinking it could be a sign of tardive dyskinesia and got off the seroquel.\n\nit's been four days and i feel shitty but i'm not being given any other options. i feel very alone. i'd like to get a new doctor but that can't be done immediately.\n\ni guess what i'm asking for is some support: anyone been through anything similar? what should i do? what are some non-prescription options to help myself? (diet, exercise, CBT exercises, whatever techniques you like)\n\nto whoever read through my story, and to whoever replies, thanks very much. \n\ntl;dr: have panic attacks. doctor pushing seroquel for anxiety. do not want, what do?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "i would really appreciate some help right now. i've been losing it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rour7/i_would_really_appreciate_some_help_right_now_ive/"
        },
        {
            "author": "Losinggriponsanity",
            "author_created_utc": 1332934471,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7afjx",
            "created_utc": 1333301813,
            "domain": "memegenerator.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ro6lp/just_noticed_this_about_myself_anyone_else_do_it/",
            "id": "ro6lp",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ro6lp/just_noticed_this_about_myself_anyone_else_do_it/",
            "score": 19,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/0J2YkB_ro397-74r.jpg",
            "title": "Just noticed this about myself. Anyone else do it too?",
            "url": "http://memegenerator.net/instance/17602661"
        },
        {
            "author": "Melongirl76",
            "author_created_utc": 1330477704,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_71m9t",
            "created_utc": 1333674705,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rvkjl/why_dont_i_want_to_be_with_my_friends/",
            "id": "rvkjl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rvkjl/why_dont_i_want_to_be_with_my_friends/",
            "score": 18,
            "selftext": "I posted this on askreddit with no real help. So I'm posting it here Most of the time I don't even want to go out. Im sixteen and I usually don't go to parties or hang out with friends. Whenever they ask me I do but I never ask myself. I know I'll have a good time, but I'd rather be at home. Why does this happen?\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Why don't I want to be with my Friends?\n",
            "url": "http://www.reddit.com/r/Anxiety/comments/rvkjl/why_dont_i_want_to_be_with_my_friends/"
        },
        {
            "author": "lifeishowitis",
            "author_created_utc": 1309528064,
            "author_flair_css_class": "",
            "author_flair_text": "GAD, panic disorder",
            "author_fullname": "t2_5gegs",
            "created_utc": 1333326631,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rorbt/hi_im_amelia_dont_post_much_but_anywho/",
            "id": "rorbt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rorbt/hi_im_amelia_dont_post_much_but_anywho/",
            "score": 17,
            "selftext": "Hello! I just wanted to say, even though I do more commenting than posting (as in never posting), hanging out here has been really awesome for me. Most people think I don't have anxiety problems because I do a good job with facing my whatever, except when I die. It's nice to have most people around sort of working their way through life while still dealing with this constant feeling of impending doom. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hi, I'm Amelia. Don't Post Much But Anywho",
            "url": "http://www.reddit.com/r/Anxiety/comments/rorbt/hi_im_amelia_dont_post_much_but_anywho/"
        },
        {
            "author": "segroeg",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333296909,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ro2iw/i_dont_know_whats_wrong_with_my_head/",
            "id": "ro2iw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ro2iw/i_dont_know_whats_wrong_with_my_head/",
            "score": 17,
            "selftext": "When I am at my apartment I feel cramped and lonely. I miss people. I miss being social.\n\nWhen I am out of my apartment, I feel fake, like I'm putting up this happy  front to let everyone know how great I am doing.\n\nIts so fake, but nobody can see through it. I've tried telling people the truth, but honesty just drives people away.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't know whats wrong with my head.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ro2iw/i_dont_know_whats_wrong_with_my_head/"
        },
        {
            "author": "beamish14",
            "author_created_utc": 1321148121,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_68eao",
            "created_utc": 1333480284,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rrl8g/sartre_was_right_hell_is_other_people/",
            "id": "rrl8g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rrl8g/sartre_was_right_hell_is_other_people/",
            "score": 16,
            "selftext": "I loathe social gatherings and having to interact with my co-workers so much. Why can't people just respect those who want to be left alone and not make glib, patronizing comments about how we're just \"shy\"? Frankly, I just feel bored when I'm around large groups of people. Even when I was a young child I'd bring a library book or two when I'd go out to a restaurant just so I could disengage from the people around me. I know that I'll never change the way I interact with others, so why bother asking me to conform to your norms?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sartre was right. Hell IS other people. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/rrl8g/sartre_was_right_hell_is_other_people/"
        },
        {
            "author": "Oliphauntintheroom",
            "author_created_utc": 1306999485,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5bjgh",
            "created_utc": 1333706369,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rw3aq/going_to_see_a_psychiatrist_tomorrow_for_adderall/",
            "id": "rw3aq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rw3aq/going_to_see_a_psychiatrist_tomorrow_for_adderall/",
            "score": 16,
            "selftext": "Over the past couple years i've come to suspect that what I thought was a mild life long depression, really could be Generalized anxiety disorder. I find myself often overcome with negative thoughts about my relationship, my future, my apparence, and my interaction with other people.\n\nWhen I was in forth grade I was diagnosed and treated for OCD, after I became obsessed with the fear of my mom dying. I couldn't leave her site for almost a year, just barley got away with passing 4th grade because of it. Soon After I was treated, the OCD symptoms completely went away. My biggest fear is that someday Ill be triggered by something that will cause an extreme obsessive  thought like that to manifest again. \n\nAfter my symptoms went away, my family never mentioned it again. It was something that I hardly thought about. In high school I did a lot of worrying and stressing about my life, but it didn't really become something that drastically effected me till about my sophomore year of college. \n\nWhen I was about 20 I completely became withdrawn and depressed. I pretty much stopped leaving my apartment, and ended up being put on academic suspension for a semester because of my grades. After that I started to see a psychiatrist who put me on adderall. \n\nAdderall ended up really helping me for a while. In my semester off from college I worked a lot and saved money, and when I came back to school, things really turned around for me. Even though mentally I didn't feel perfect, I was able to accomplish a lot, and I was generally happier then before. After about a year on it, I decided to stop going to my psychiatrist because of money and somewhat because of my parents worry about me becoming dependent on it. \nEver since I've always wondered if things would be better for me if I were back on it. Sometimes I buy a few here and there from friends, and I feel really great for a week.\n\n I'm at a very challenging time for me right now. I'm about to graduate from college, and I am in the process of applying to grad schools, getting my portfolio together (i'm a designer/copywriter), and applying for internships. I don't feel like Ive been emotionally stable enough to accomplish any of this right now, and they've been piling up and weighing on me more then anything ever has. \nI could go to the psychiatrist tomorrow and get adderall. I know it has worked for me in the past, but i'm convinced that my real problems are anxiety. Or I could try to be treated for my anxiety, and risk wasting precious time that I don't have right now figuring out what medications work for me, etc. \n\nReddit, what should I do? I'm leaning toward going back on adderall till the end of the semester and bring up my anxiety problems in the summer, when Ill have time to experiment. \n\nI'd really appreciate peoples opinions, just found this subreddit, but it seems like a really great resource. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going to see a psychiatrist tomorrow for adderall, considering talking about anxiety problems instead.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rw3aq/going_to_see_a_psychiatrist_tomorrow_for_adderall/"
        },
        {
            "author": "dontknowhatodo5",
            "author_created_utc": 1333248688,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7bn3y",
            "created_utc": 1333252097,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rnbhb/i_feel_like_im_wasting_everyones_time/",
            "id": "rnbhb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rnbhb/i_feel_like_im_wasting_everyones_time/",
            "score": 16,
            "selftext": "I started having panic attacks a couple months ago. I've had 3 appointments with 2 different whatever they're called (therapists?). 2 of those were just them trying to find out what's going on, and they went fine I guess. Recently, though, I had a followup appointment and I don't think I was very helpful at all. I have a 2nd appointment with the other one coming up, so I was wondering if I could get some advice on how to be more prepared to answer their questions, I guess, but I don't know how realistic that is.\n\nAnyway, I answered pretty much every question with \"I don't know\" or \"I (don't) think so.\" Most notably, probably, he asked if I had any questions or anything I wanted to say and I couldn't think of anything. Also, I dropped my classes this semester because I had avoided going too many times and he asked if there was anything he could do to help me get back to school. I couldn't think of anything for that either. It seems the only thing I can do about that is wait until the end of the semester, enroll in some classes, and try to go.\n\nIn the meantime, they have this weekly group thing I've been going to. I don't really like it, but it doesn't seem like I have an alternative. It does make me feel better to go, I think, but it is mostly just talking about what you did the past week and what skills you exercised and I don't ever have anything to say. Whenever it gets to my turn it's:\n\"I drove [something I was/am avoiding] some more\"\n\"Where did you go?\"\n\"To the store\"\n\"Did you feel anxious?\"\n\"Yes.\"\n\"But you did it anyway?\"\n\"Yes.\"\n\"That's good.\"\nAnd I feel silly not having anything more to say. Especially when there is someone in a similar position to me who is anxious about driving, but didn't drop their classes and has to drive much farther than I did to get to them.\n\nThe person my upcoming appointment is with had me record my thoughts, particularly, I think, when I dwell on mistakes. Immediately after the appointment I thought of answers I gave to some questions that I knew I could give better and I wrote them down. So I have some things to say if I can get myself to bring them up, but it's hard to answer new questions and I end up wasting the opportunity I waited a month for. She asked me what I wanted out of this and I said I didn't know. I still don't really know. I say that a lot.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like I'm wasting everyone's time",
            "url": "http://www.reddit.com/r/Anxiety/comments/rnbhb/i_feel_like_im_wasting_everyones_time/"
        },
        {
            "author": "GADSAM",
            "author_created_utc": 1333410382,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7c9mu",
            "created_utc": 1333410854,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rqbt8/i_just_started_cymbalta_today_for_general_anxiety/",
            "id": "rqbt8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rqbt8/i_just_started_cymbalta_today_for_general_anxiety/",
            "score": 15,
            "selftext": "A little about me.  I’ve just recently realized that I have general anxiety disorder for much of my life.  Overall I appear confident and successful, but behind the scenes I deal with anxiety daily.  I’ve always thought I was a procrastinator and that I was weak, now I realize it was avoidance.  The better I would feel, the less I would want to do things that would cause anxiety.  This is a constant thorn in my side and causes me to be extremely critical of myself.\n\nI have my own company and the anxiety and avoidance is causing me to delay or avoid things that can seriously hurt my business.  I finally bit the bullet and started Cymbalta today (20mg).  This is my first time on any sort of anxiety medication.  I will be happy to report my progress, or lack thereof, if anyone is interested.\n\nEdit: 4 Days In Now.  The first day I had a slight ringing in my ears and occassionaly I have what feels like slight pressure on the sides of my head.  Overall I do feel calmer, although it might be a placebo effect this early.  Also, I spoke with my Dr. about withdrawl issues many people have.  The Dr let me know that as long as you taper off, the symptoms are manageable and that in their own experience, none of their patients had a 'terrible' episode weaning off the drug.  They did point out that some people will react differently to the drug and a minority will have the horrible symptoms.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just started Cymbalta today for general anxiety disorder.  I will let you know how it works out.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rqbt8/i_just_started_cymbalta_today_for_general_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333330151,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rou41/has_anyone_had_positive_results_taking_fish_oil/",
            "id": "rou41",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rou41/has_anyone_had_positive_results_taking_fish_oil/",
            "score": 13,
            "selftext": "I haven't been able to locate a lot of sound research beside what is mentioned in [this article](http://www.dispatch.com/content/stories/local/2011/11/19/fish-oil-calms-anxiety-osu-study-finds.html). I finally started taking it today and was wondering if anyone who tried it has noticed any positive effect on their anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone had positive results taking fish oil?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rou41/has_anyone_had_positive_results_taking_fish_oil/"
        },
        {
            "author": "hamton1900",
            "author_created_utc": 1333397113,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7c7im",
            "created_utc": 1333399210,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rq1mp/my_mother_died_in_2010_now_im_a_different_person/",
            "id": "rq1mp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rq1mp/my_mother_died_in_2010_now_im_a_different_person/",
            "score": 12,
            "selftext": "In 2010, my mother died from leukemia. We had just celebrated her 5 year anniversary free of breast cancer. The chemotherapy she received from that had given her a small chance to get leukemia, and it did. She had been sick for a few weeks, with random symptoms it seemed like. After she died, it was uncovered she hadn't been sharing all her symptoms with doctors and was in fact hiding the serious pain and issues she was feeling. \n\nI went to work one day and my dad called me to tell me my mother was in the emergency room, she collapsed from weakness. In the ER they diagnosed the leukemia from a simple blood test. At the time, my wife was 5 months pregnant. My mother asked me if she would live to see her grandson...one of the worst moments of my life. I told her she had already seen him on the ultrasound, and that was all that mattered.\n\nThe next day I came back to the hospital and she couldn't speak, but was conscious. I instantly regretted leaving at all, despite her begging me not to stay the night prior. She insisted I didn't need to be there. I told her what I needed to, and I hope she heard. She died later that afternoon.\n\nA few months after my mother died, my best friend was hospitalized with Crohn's disease and had his entire colon removed. He nearly died from several surgeries and I was fearful I would lose him also.\n\nAround the same time, I had some stomach problems and a weird prostate problem for my age (I'm 27 now, 25 at the time) and got what I would call a panic attack, the first real one in my life. I went to the ER, and they hospitalized me because I had strange kidney levels. It turned out it was all due to taking ibuprofen for my prostate and temporarily inhibited my kidneys, and I was released in a few days.\n\nAfter that, I had an extreme mental breakdown. The day I was released I was convinced they missed something wrong with me. I felt extreme fatigue, and was told it was from anixety. I insisted I had leukemia or something they missed. I went to my family doctor and he gave me an SSRI and Xanax, said I needed them and nothing was wrong with me medically.\n\nI refused to take the pills for fear of what they would do to me. Over the next several months I struggled with severe hypochondria. I worried about nearly every disease, and none of them panned out. I saw several doctors for fear they weren't doing the right thing, and saw many specialists. The only diagnosis I have received is Gastritis and Anxiety/Depression. Throughout all this I was prone to frequent crying fits about my mother or worrying about other items in my life. \n\n \n\nAfter my son was born and the stress subsided, for the first 8 months or so of 2011 was mostly normal. Ever since though, I have had recurring hypochondria, with various degrees of intensity. It is stressing my wife out and I can't blame her. I saw a normal counselor (not psychiatrist) for 8 weeks during the worst of it. It helped some but I'm still not normal. Even in times when I'm not seriously worried about a medical problem, my mind drifts to death and worrying about how I will die and what comes after.\n\nMy question is: is this common? Has anyone else had a similar experience? Before all of this, I had no history of depression or serious anxiety (some claustrophobia). How do other people cope? What should I do? How do I fix my life? I've thought about taking the SSRI but worried my sexual life will never be the same again after googling horror stories about them. I just need help, I'm not sure where else to turn.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My mother died in 2010, now I'm a different person.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rq1mp/my_mother_died_in_2010_now_im_a_different_person/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333804539,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rxta4/iama_wife_of_a_man_with_gad_w_panic_attacks/",
            "id": "rxta4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rxta4/iama_wife_of_a_man_with_gad_w_panic_attacks/",
            "score": 10,
            "selftext": "My husband was diagnosed after we had been together about a year. Currently is off treatment (we lost our insurance). Ask me anything :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "IAMA wife of a man with GAD w/ panic attacks",
            "url": "http://www.reddit.com/r/Anxiety/comments/rxta4/iama_wife_of_a_man_with_gad_w_panic_attacks/"
        },
        {
            "author": "MrsDonkeyKongJr",
            "author_created_utc": 1333748992,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7dl1h",
            "created_utc": 1333756748,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rx4gw/counsellor_wants_me_to_stop_self_medicating/",
            "id": "rx4gw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rx4gw/counsellor_wants_me_to_stop_self_medicating/",
            "score": 10,
            "selftext": "me - female 29\n\nI've been seeing a counsellor for 6 months, i'm in the process of being referred to more long term couselling. \n\nThis isn't the first time this has come up but this counsellor wants me to stop smoking pot and drinking. Without pot I have really bad panic attacks. She thinks it would be easier to diagnose and medicate if I wasn't self medicating.\n\nI'm unsure what to do, I'm know the pot exasperates some of the issues but i also don't want to have panic attacks. It's not that she's anti-drugs, just thinks it would be good for me to quit.\n\nAnyone have any opinions, advice or related stories?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Counsellor wants me to stop self medicating...",
            "url": "http://www.reddit.com/r/Anxiety/comments/rx4gw/counsellor_wants_me_to_stop_self_medicating/"
        },
        {
            "author": "Losinggriponsanity",
            "author_created_utc": 1332934471,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7afjx",
            "created_utc": 1333300882,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ro5tl/you_are_not_alone/",
            "id": "ro5tl",
            "is_self": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ro5tl/you_are_not_alone/",
            "score": 10,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/W32xS_tREKVHu1iB.jpg",
            "title": "You are not alone",
            "url": "http://imgur.com/CduI7"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333254287,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rnd39/any_advice_or_experiences_going_off_of/",
            "id": "rnd39",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rnd39/any_advice_or_experiences_going_off_of/",
            "score": 10,
            "selftext": "I have been on 1mg (.5 2xday) of clonazepam/klonopin for about 4 years now and I have decide it's time to try going off and use just as needed.  I have heard some horror stories going off this medication from those who were on much higher doses.  Does anyone have any advice or experiences to share?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any advice or experiences going off of Klonopin/Clonazepam",
            "url": "http://www.reddit.com/r/Anxiety/comments/rnd39/any_advice_or_experiences_going_off_of/"
        },
        {
            "author": "naturallyselected007",
            "author_created_utc": 1331654826,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_75tw7",
            "created_utc": 1333656120,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rv4qn/in_need_of_advice_or_something_first/",
            "id": "rv4qn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rv4qn/in_need_of_advice_or_something_first/",
            "score": 9,
            "selftext": "So this is my first post and its because I'm going absolutely insane right now... Without going into too much detail, I got my self in a extremely fucked up position and my anxiety/panic is getting the best of me and i don't know what to do.... I ended up making a bad decision (which in this case was a lie because i panicked and didn't know what else to do).. I knew it was wrong but I somehow rationalized it in my head and now i've been freaking out ever since.... there are two outcomes that can come over it, Hopefully I can fix what I lied about before it becomes apparent and then I won't get into serious trouble, but I know I'll still be freaking out and panicking about how much of a hypocrit i feel like... the other outcome will be that the problem won't get fixed and I'll get into trouble and still feel like a hypocrit... I know when confronted with the issue, I know that i've lied, I know that it was wrong, and I have zero excuse for doing it other than panic and a horrible last minute decision and I've felt pretty much frozen ever since... for the past 8 hours i've felt like i'm going to throw up, my heart has been pounding and my mind has been racing...\n\nI realize this is a bit of a rant and probably a little hard to understand, any advice will be helpful, and yes I realize i'm a fucking moron for lying in the first place and getting myself into this situation, i think the fact that I realize this is making it even worse... FML",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "In need of advice or something (first)",
            "url": "http://www.reddit.com/r/Anxiety/comments/rv4qn/in_need_of_advice_or_something_first/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333649511,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ruyqw/emdr_has_anybody_had_experiences_with_this_type/",
            "id": "ruyqw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ruyqw/emdr_has_anybody_had_experiences_with_this_type/",
            "score": 9,
            "selftext": "I'm starting it with my psychologist next week, I trust her but just wondered if anybody here had tried it, and basically if it worked for you/what to expect?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "EMDR - Has anybody had experiences with this type of therapy?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ruyqw/emdr_has_anybody_had_experiences_with_this_type/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333414231,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rqetc/tremblingtremors_as_a_physical_anxiety_symptom/",
            "id": "rqetc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rqetc/tremblingtremors_as_a_physical_anxiety_symptom/",
            "score": 9,
            "selftext": "I thought I had experienced every physical symptom of anxiety... the numbness or tingling in the hands and arms, chest pains, upset stomach or loss of appetite.. More recently I have noticed I have this shaking feeling in my legs or arms or sometimes my whole body. \n\nMost often I feel them when I am in bed about to fall asleep. It's almost as if I can distract myself during them and they go away... likewise if I focus on the shaking, it intensifies.\n\nIt's not really visible, my hands or legs do not physically shake - they just feel like they are on the inside. \n\nHas anyone else experienced this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Trembling/tremors as a physical anxiety symptom?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rqetc/tremblingtremors_as_a_physical_anxiety_symptom/"
        },
        {
            "author": "silverbeat",
            "author_created_utc": 1314665806,
            "author_flair_css_class": "",
            "author_flair_text": "panic disorder",
            "author_fullname": "t2_5r365",
            "created_utc": 1333576927,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rtm87/im_having_a_problem_with_tunnel_vision/",
            "id": "rtm87",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rtm87/im_having_a_problem_with_tunnel_vision/",
            "score": 9,
            "selftext": "That's the best way I can think to describe it. When I'm out in most public places, and when driving, [the two things that make me very anxious] it's like I can't focus on things in my peripheral, even when I turn to look around it's like stuff doesn't register. It made me really scared to drive so I haven't been. \n\nI'm not sure what to do or how to help this, other than avoid doing the things that cause it, which I don't want to do. Does anyone else get this? What do you do about it?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm having a problem with.. tunnel vision?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rtm87/im_having_a_problem_with_tunnel_vision/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333255823,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rnech/the_fear_of_getting_gas_around_people_prevents_me/",
            "id": "rnech",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rnech/the_fear_of_getting_gas_around_people_prevents_me/",
            "score": 8,
            "selftext": "If I'm around people I'm comfortable with (childhood friends and direct family), I never have issues with my stomach unless I'm legitimately sick. But when I'm in a situation with people I'm less close with... (aka in classrooms, at cousins' house, or at parties), I get gassy almost every time. And you can bet that almost the entire time, even before the gas starts happening!, I'm worrying about my stomach and how I can possibly manage my gas this time and how many excuses I'll have to come up with to leave the room before people get suspicious. This fear has caused me to become terrified of normal social events because I don't want to be \"that\" gross, weird person who constantly is gassy. \n\nI've had times where I've tried to sit through social situations and just \"deal\" with it which have often miserably failed. I had to walk out of two movies now with no good-sounding excuse to give those I was with. And I've had to leave in the middle of board games due to my stomach going wild.\n\nDoes anyone have experiences similar to this? It's been with me for about 7 years now. I really think it's entirely mentally inflicted since my stomach is, as I said, completely fine as long as I'm with people I already know *really* well. But I don't know how to stop my mind from making my body freak out.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The fear of getting gas around people prevents me from hanging out with them. Is anyone else like me?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rnech/the_fear_of_getting_gas_around_people_prevents_me/"
        },
        {
            "author": "sillytreebucket",
            "author_created_utc": 1333269576,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7bq31",
            "created_utc": 1333530803,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rsn8r/problems_with_paperwork_and_organisation/",
            "id": "rsn8r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rsn8r/problems_with_paperwork_and_organisation/",
            "score": 7,
            "selftext": "One thing I've noticed about myself is that the thought of having to fill out a form, or particularly, having to go into an office to talk to someone about something, is utterly terrifying to me and sets me off in a panic. I feel dizzy, shake, tear up, and want nothing more than to curl up into a ball somewhere, over something so completely small. The pressure of doing something wrong feels enormous, and even though it's probably pretty inconsequential if you answer a question on a form incorrectly - just means you have to do it again - I feel as if I'm going to be yelled at, judged, and admonished if I make a mistake, even though, most likely, I'm not. I get a lump in my throat and feel nauseous, and have a general dark, sinking feeling. I'm not sure how to describe it other than dark, and heavy. It's almost twisting, or writhing, like my insides are trying to get out.\n\nI know it sounds ridiculous, but I start going down this spiral when I have to post a letter, too - what if I put the stamp in slightly the wrong place? What if I make a mistake in the address? What if it's actually too heavy or big for the postbox, and I was supposed to have taken it to the office? I feel like the recipient is really counting on me to deliver it properly, and get terrified that I can't meet their expectations and will let them down. Is this something that anyone else has experienced? I guess it's a kind of test anxiety?\n\nI'm supposed to go to the bank later today to do a kind of transfer that I've never done before. It may involve going to a different bank than usual, too... I'm terrified that I'll do something wrong, or in particular, that I'll be halfway through trying to do it, when I get a tap on the shoulder, and an 'excuse me, you can't do that.' I don't mean to make mistakes, but I just don't know the right way of doing things. I just wish I could stop myself from getting *so worked up* about the prospect of doing something wrong.\n\nIt makes organising and managing my life near impossible, and nobody seems to understand just how useless and incompetent this kind of thing makes me feel. The attitude I come across tends to be along the lines of 'you should just man up', but if I could, I would have done it years ago. I wish people would stop telling me that my fears don't exist. They do, and I can't avoid it. I'm just trying to work out how to cope with them.\n\n**tl;dr: Can't even fill out a form, post a letter, or go to the bank without bursting into tears. Does anybody else have this problem? Is it more common than I think?**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Problems with paperwork and organisation?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rsn8r/problems_with_paperwork_and_organisation/"
        },
        {
            "author": "Ireallyjustneedahug",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1333643363,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rutab/my_bodys_reaction_to_stress/",
            "id": "rutab",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rutab/my_bodys_reaction_to_stress/",
            "score": 7,
            "selftext": "My anxiety has been getting worse, and recently I've started getting the hiccups when I get stressed and then they get awful during an attack. Its so frequent now that I've picked up the nickname \"squeaky\".\n\nAnyone else have this problem? Any other weird way your body reacts to stress? \n\nAlso, hiccup management advice would be appreciated. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My body's reaction to stress",
            "url": "http://www.reddit.com/r/Anxiety/comments/rutab/my_bodys_reaction_to_stress/"
        }
    ]
}