{
    "data": [
        {
            "author": "knifersaurus",
            "author_created_utc": 1327973228,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6spt5",
            "created_utc": 1335377288,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ss3sf/went_somewhere_alone/",
            "id": "ss3sf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ss3sf/went_somewhere_alone/",
            "score": 79,
            "selftext": "I have agoraphobia so this is the first time i've done this in a really long time and I feel proud of myself. I had to leave the house because I was extreamly mad at my aunt and couldn't srand being in the house with her. I drove around for a while and now im in a frozen yogurt shop eating vegan frozen yogurt by myself. I'm probably going to start doing this more often.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Went somewhere alone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ss3sf/went_somewhere_alone/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335474970,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/su6wu/exposure_exercise_today_and_im_proud_of_myself/",
            "id": "su6wu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/su6wu/exposure_exercise_today_and_im_proud_of_myself/",
            "score": 65,
            "selftext": "Today, as per my therapist's advice, I went to have my makeup done at a department store. May not seem like much, but it involved some pretty creative/good exposure therapy:\n\n1) I had a complete stranger doing my makeup and seeing every flaw on my face, up close. For someone who has low self-esteem, this was not very pleasant. But the longer it went on the more I realized that we all have things we don't like about our looks, and that I blow my flaws out of proportion. \n\n2) As a suffer of OCD, I have a lot of strange obsessions. One of the biggest includes a fear of chemicals and somehow accidentally ingesting them. While the very friendly and chatty lady was smearing many types of lotions and cremes all over my face, some got on my lips. It was excruciating at first, but I eventually calmed down and realized it wasn't a big deal! This obsession isn't going to go away very easily, but I think it was a step in the right direction.\n\n3) There were strangers walking around me, while I was at my \"worst,\" so I was exposed to the public. It was uncomfortable, but then I realized they probably don't give a shit about me getting my makeup done. \n\nIt was not easy, and I experienced quite a bit of anxiety at the very beginning, but toward the end I began to calm down some. I am proud of myself! ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Exposure exercise today, and I'm proud of myself!",
            "url": "http://www.reddit.com/r/Anxiety/comments/su6wu/exposure_exercise_today_and_im_proud_of_myself/"
        },
        {
            "author": "I_am_the_Walrus",
            "author_created_utc": 1254274148,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3nj5l",
            "created_utc": 1335113916,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/smsc6/any_other_high_functioning_anxious_people/",
            "id": "smsc6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/smsc6/any_other_high_functioning_anxious_people/",
            "score": 55,
            "selftext": "I'm just curious how many of us here are more high functioning anxious people. I haven't had a severe panic attack in over a year, primarily because I'm not leading a particularly stressful lifestyle at the moment, but I have had two so far (I suspect I've started going from GAD to Panic Disorder--not sure haven't been officially diagnosed). However, I find myself more terrified about the consequences of not getting my shit in order than by the process of getting my shit in order. I still plan on seeing someone about it once I go back to school in the fall, but because I'm terrified of having a life in which my personal goals are not met, I've been able to apply and be accepted for my second bachelor's, and audition for a music program and obtain scholarship. In short, I'm hella productive, even though I'm freaking out all the time. XD\n\nAnyone else?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any other high functioning anxious people?",
            "url": "http://www.reddit.com/r/Anxiety/comments/smsc6/any_other_high_functioning_anxious_people/"
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1335165722,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/snv98/i_dont_try_my_hardest_because_im_afraid_that_if_i/",
            "id": "snv98",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/snv98/i_dont_try_my_hardest_because_im_afraid_that_if_i/",
            "score": 43,
            "selftext": "Hopefully this won't all come out as a jumbled rant, and hopefully someone can understand the same frustration that I do. This issue has been the main thing holding me back and also the cause of many depressive tendencies. \n\nA quick background history: I'm 21 years old, and have had anxiety for most of my life. It started getting really bad in my junior year of high school, and wasn't fully diagnosed until the beginning of my senior year. I ended up missing a ton of school because of it, and decided to take the noble route of dropping out and acquiring my GED through the local college instead of failing numerous classes, and taking my senior year over again. My anxiety would wax and wane, I would get massive panic attacks out of the blue, and anxious spells that could last a few days. During high school (and continuing after I left), I had a part time job at a local grocery store. There would be periods where I would miss a few days of work due to anxiety, and they didn't take too kindly to that. One week was particularly bad for me, and I ended up missing a ton of work. I started having panic attacks on the job as well and within a few days, I decided to quit. That was two years ago. \n\nIt should be noted that I don't have health insurance, and so seeing a doctor was a matter of money. I saw a few here and there who would prescribe me small amounts of benzos to tide me over, but once those were gone there was nothing I could do. I sought a therapist for a while and did some CBT, but it never really took. \n\nDuring the last two years, my anxiety has gotten substantially better. I currently have a 30-pill supply of Ativan which I only use in emergencies (I've only had to take 2 halves in the last 3 months), and my panic attacks are becoming sparser and sparser, as well as less intense. However, there's a slight problem. During these last two years, I haven't really been doing much. I currently work from home doing freelance web design, I still live with my parents, I haven't stepped foot in a college yet, and most of my friends that I used to regularly see have moved away. \n\nHowever, I could have a better job, I could be in college, I could have my own place, and I could have a better social life if it wasn't for this damn feeling that I get. I have this extreme fear, this crippling thought process that if I put any time, money, or effort into something and it boosts me in a positive direction, my anxiety will come along and drag me back down to where I was (or worse). Everything that I've worked for, I've had taken away from me. My job, my school, various job and relationship opportunities, friends, meetups, hang outs, plans, all gone. I find fear in getting started with these things, because I'm absolutely afraid of failing. \n\nI want nothing more than to be in school right now, and working at a job that I enjoy. However I'm terrified that if I get everything together and paid for for school, I'll end up missing classes due to anxiety. Or what if I have a panic attack during a test? Then it'll all be for naught. Same with the job, what if I really enjoy it and it pays really well, but I end up a few months down the line having to quit because my anxiety is too much to bear? \n\nI know, this is a horribly irrational and destructive thought process, but I just can't shake it. Does anyone share this? Has anyone beaten this, or can give me even a shred of advice? I'd do anything to be in college by next fall, or at least take the first steps and see a guidance counselor for options of how to get in. Interviews with jobs would be awesome too. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't try my hardest because I'm afraid that if I start progressing toward something better, my anxiety will push me back further or make me give it up. Can anyone else relate?",
            "url": "http://www.reddit.com/r/Anxiety/comments/snv98/i_dont_try_my_hardest_because_im_afraid_that_if_i/"
        },
        {
            "author": "aerynjbson",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335076110,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/smczx/after_a_panic_attacki_just_felt_completely/",
            "id": "smczx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/smczx/after_a_panic_attacki_just_felt_completely/",
            "score": 39,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "After a panic attack,I just felt completely exhausted,does this happen to anybody else?",
            "url": "http://www.reddit.com/r/Anxiety/comments/smczx/after_a_panic_attacki_just_felt_completely/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335061648,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sm42i/test_post_of_new_tag_system_help_so_heres_a/",
            "id": "sm42i",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sm42i/test_post_of_new_tag_system_help_so_heres_a/",
            "score": 29,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Test post of new tag system [Help] so here's a picture of a kitten!",
            "url": "http://i.imgur.com/2Utjl.jpg"
        },
        {
            "author": "lauraisbored",
            "author_created_utc": 1328637174,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6v3az",
            "created_utc": 1335445563,
            "domain": "shutuplife.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sthoh/i_took_a_deep_breath_and_finally_wrote_in_depth/",
            "id": "sthoh",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sthoh/i_took_a_deep_breath_and_finally_wrote_in_depth/",
            "score": 25,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/8HkQNM-8FUVQguUA.jpg",
            "title": "I took a deep breath, and finally wrote in depth about my Agoraphobia.",
            "url": "http://shutuplife.com/blog/2012/04/26/anxiety-agoraphobia-and-what-exactly-my-deal-is/"
        },
        {
            "author": "ultimate_loser",
            "author_created_utc": 1328593553,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6uyne",
            "created_utc": 1335383867,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ssa6c/went_to_get_my_head_shrunk_noticed_another_dr_in/",
            "id": "ssa6c",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ssa6c/went_to_get_my_head_shrunk_noticed_another_dr_in/",
            "score": 22,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/FoQZkWxt6tPaGXTU.jpg",
            "title": "Went to get my head shrunk... noticed another DR in the building....",
            "url": "http://imgur.com/xvHfm"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335048464,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/slux1/my_biggest_fear_is_going_blind_and_deaf_is_this/",
            "id": "slux1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/slux1/my_biggest_fear_is_going_blind_and_deaf_is_this/",
            "score": 20,
            "selftext": "I've suffered with Severe Anxiety and Depression for over 7 months now and I was getting over but due to some family issues and a recent panic attack things have got a bit too much again. I fear that I will die in my sleep or I will wake up blind and/or deaf.\n\nI know how stupid this sounds but that's no comfort in my mind, I'm just wondering whether any other people suffer from these thoughts.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My biggest fear is going blind and deaf, is this common among other Anxiety sufferers?",
            "url": "http://www.reddit.com/r/Anxiety/comments/slux1/my_biggest_fear_is_going_blind_and_deaf_is_this/"
        },
        {
            "author": "AnxiousAlias",
            "author_created_utc": 1330280312,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_70vej",
            "created_utc": 1335522448,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sv3ot/help_the_stress_is_killing_me_the_depression_is/",
            "id": "sv3ot",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sv3ot/help_the_stress_is_killing_me_the_depression_is/",
            "score": 19,
            "selftext": "To clarify, I posted this on r/Anxiety rather than r/Depression because anxiety is the core reason why I am unable to handle living. I know damn well what depression alone is like, but anxiety came, and then depression mixed in, and it's all kinds of fun. Also, I simply trust the collective mindset of r/Anxiety more than r/Depression when it comes to these things. We are the over-analyzers, after all. Anyway,\n\nThe gravity inside of my head is insane. It's like a black hole that steals the light and won't let anything go.\n\nWhat I really meant was, \"The stress is too much to handle on top of the depression, and I have no place to hide.\"\n\nMy hugest stressors right now are: Work, anxiety, discomfort (generally speaking), money, medication, sleep (or lack thereof), and it all originates from my god damn head. It seems as if I have no way to deal with it all, no way out, no place to hide, nothing to look forward to. Having been generally stressed and ridden with anxiety that kills my feelings and abilities to function for the duration of my life so far, I'm at the point where I'm about to just leave and say \"fuck it.\" Leave everything behind, burn it all, to take everything locked up in my head and fucking unleash it on everyone and everything around me all at once.\n\nThere is a minimum of one-hundred reasons why I would be unhappy, but to sum it up, it's the lack of happiness throughout life so far that is leaving me feeling so ripped off and convinced that it will not get better soon enough to stop me from giving in or giving up.\n\nSo, I have three options:\n\n1: Keep Trying\n\nAs I have been for years, NON-STOP. I have received no result as of yet. I have not become better, or, at least, not enough to give me a reason to think that trying to become better actually leads to becoming better. The process is simply too inefficient and takes too long, and I'm much too impatient to put up with it. It's kind of like if I would just quit trying, I could finally fall to where I'm supposed to, to be in my place. If I would quit holding myself up, I'd fall into the fire or the sea or whatever place. But just \"letting go\" right now can take minimal effort compared to how much effort I put into keeping myself alive. So, point 2:\n\n2: Give In\n\nHospitalize myself. Put myself in a place where I have no choice but to be fixed. The place where I belong. I'm talking mental hospital, here, but probably a \"real\" hospital to start out. This way, I probably throw away the things that I still own and the \"friends\" that I still have. At least, that's how I feel it is. I throw it all away and get to stand there and watch it all burn. Strangely, I think that would be satisfying. Little effort, guaranteed result.\n\n3: Give Up\n\nGiven my current situation, there is actually a way in which I may be able to very easily kill myself. A way that will probably happen unless I lift a finger to prevent it. And probably within a couple of weeks from now. This reality has become very possible in my mind, and I've actually grown to be disgusted by all of the things that I own, thinking that there's no point in having all of these useless damn decorations and clothes and everything else because I won't be alive to even see it. Hence why I took some old belongings and burnt them last week. I just wanted to kill away the memories, and I felt a legitimate smile, watching it burn. It felt like one of the few things I would actually remember.\n\nIf there's a fourth option to be here, I'm open to suggestions. I haven't decided on one yet, but option one has been playing on repeat for years and years and I just want to hit the goddamn stop button. I just want it to stop. Just make it stop.\n\ntl;dr: I'm unhappy with what I have been through so far and I want it to stop or change, now. What do I do?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[help] The stress is killing me, the depression is allowing it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/sv3ot/help_the_stress_is_killing_me_the_depression_is/"
        },
        {
            "author": "Xuchilbara",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335112619,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/smrg8/egotism_and_selfesteem/",
            "id": "smrg8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/smrg8/egotism_and_selfesteem/",
            "score": 19,
            "selftext": "Does anyone else have anxiety in regards to how much you may or may not think about yourself?  \n\nI find that I often go out of my way to try and be seen as kind, friendly and helpful partially because I just want to be but likewise partially because I'm afraid of being seen as egotistical/full of myself.\n\nI end up cringing a lot when it comes to discussing my ideas, my interests and such with others because I think afterward about how self-absorbed I must sound.  When someone mentions something and I reply, \"I once/I remember when I\" or other sort of sharing my own experiences, I end up biting my tongue because I realize I'm talking about myself again.\n\nA lot of times, it isn't even about talking to other people.  I end up feeling bad for considering myself in terms of what I want to eat when my husband makes me decide, instead trying to think of what he might like even if I don't care for it.  Or if I have my heart set on doing something and he or friends want to do something else, I won't say a word about it.\n\nI'm just so anxious about people seeing me as an egotist, then I mentally berate myself for being one.  If I show I care about something to myself, I get scared because my mind is like, \"See, now you're just thinking of yourself.  You're not that special, you know.\"\n\nAnd the cycle of worrying about it continues.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Egotism and self-esteem?",
            "url": "http://www.reddit.com/r/Anxiety/comments/smrg8/egotism_and_selfesteem/"
        },
        {
            "author": "DESX",
            "author_created_utc": 1298935718,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4wjue",
            "created_utc": 1335228420,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sp4kx/passionflower_and_teas_for_anxiety_my_personal/",
            "id": "sp4kx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sp4kx/passionflower_and_teas_for_anxiety_my_personal/",
            "score": 16,
            "selftext": "Hey guys, I wanted to make this post in case anyone else was wondering about the effectivness of Passionflower for Anxiety. I also wanted to throw in some other stuff about teas that I have found to be effective. I am going to try to make this as short but detailed as possible. \n\nSo a little over a month ago I decided to try out Passionflower and see if it worked for me and my anxiety. I decided to do this based on information from other reddit suggestions in the past and random reading I had been doing. It seemed to have at least some scientific basis for its anxiety-reducing benefits. \n\nSource: [Study] http://www.ncbi.nlm.nih.gov/pubmed/11679026\n\nAnyway I bought these: [Amazon]http://www.amazon.com/Natures-Answer-Passionflower-Standardized-60-Count/dp/B000I48M3A/ref=sr_1_1?ie=UTF8&amp;qid=1335225158&amp;sr=8-1\n\nand took them as directed, 2 capsules a day. I took one in the morning (when my anxiety is the worst) and one mid-day. I don't know if it was a placebo effet or if it did in fact work. All I can say is it definetly FELT like it worked. I had almost the exact same feeling as Xanax minus the drunk-like feeling and not near as much drowsiness. I am only on .5mg of Xanax as needed though, and have only taken it 2 times in the last 4 months, just an FYI. \n\nAny day I woke up anxious during this last month I would take a capsule and it seemed to work everytime. If it didn't completely eliminate my anxiety, it made it very manageable. Of course I still keep a spare Xanax in my wallet in case I ever get a terrible panic attack. Passionflower just worked wonderfully for me.\n\nDuring this same time, I started to experiment with teas. My mom is a HUGE tea drinker and has buttloads of different teas at her house. She was showing me some that had been recommended to her a long time ago when she was suffering from anxiety/depression too. \n\nIt was these in particular: \n\n[Mix Blossoms Tea]http://www.botanic-art.com/anahuac-blossoms-bags-pi-224.html\n\n[7 Blossoms Tea]http://www.mexicanimports.us/images/thumbs/0000345_300.jpeg\n\nAfter looking at both of them, I kind of said, \"Wow no wonder\". BOTH teas have Passionflower in them and the mixed blossoms tea has Valerian Root, another scientfically proven herb to reduce anxiety. I was lucky enough to find more at local hispanic stores.\n\nI combined this with my now routine, twice daily, Passionflower pills and WOW. I sleep like a freaking baby now. I'll drink a tea 30mins-1hr before bed an it knocks me out. I get such a good nights sleep without feeling anxious during the time it takes me to actually fall asleep.  \n\nSo to recap my routine goes like this: \n\n*1 Passionflower Capsule in the morning if I feel anxious.\n*Another one mid-day. \n*Either one of these teas before bed. \n\nI highly suggest giving this or something like this a shot if you are a new anxiety sufferer (like me) and don't know in which direction to go yet. IE: Medication, CBT, or both. Or maybe you want to try to fight off anxiety yourself and need something asap. I personally want to get rid of my anxiety ASAP (or make it more mangeable) thus I am starting CBT next friday and will continue to do this routine to help facilitate the whole process. If needed though I will incorporate actual anxiety meds but im currently optimistic that Passionflower and CBT will help me overcome anxiety. \n\n**NEEDLESS TO SAY**, DO NOT take with any other anxiety meds without talking to your doctor first. I haven't taken my Xanax once since starting with the Passionflower since I have not had a chance to ask our family doctor yet. That and also because I haven't needed it =D. \n\nGood luck everyone! ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Passionflower and Teas for Anxiety, My Personal Experience",
            "url": "http://www.reddit.com/r/Anxiety/comments/sp4kx/passionflower_and_teas_for_anxiety_my_personal/"
        },
        {
            "author": "Spreo_superbus",
            "author_created_utc": 1305319630,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_58dy0",
            "created_utc": 1335314518,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sqwtt/stomach_issues_anyone/",
            "id": "sqwtt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sqwtt/stomach_issues_anyone/",
            "score": 16,
            "selftext": "When my long-term stress and anxiety reach very high levels, and stay that way for several months, I start developing stomach problems. Food never sounds good, no matter how hungry I feel. When I force myself to eat, I feel sick to my stomach for hours, and often have gastrointestinal problems. In the past, I have ended up losing more weight than I was comfortable with. \n\nBefore anyone asks, let me clarify: I did NOT want to lose the weight. I am at a very healthy weight to begin with. At one point, I was drinking those high calorie shakes they give to kids that are picky eaters just to try to get more calories in me. \n\nThis has happened during the three months I was applying to grad school, during a 6-month rocky period with a mentally abusive boyfriend, and now as I prepare to leave the country for six weeks to a remote location with little guidance.\n\nAnyone else dealt with this? Any suggestions? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Stomach issues, anyone?",
            "url": "http://www.reddit.com/r/Anxiety/comments/sqwtt/stomach_issues_anyone/"
        },
        {
            "author": "TTTweak",
            "author_created_utc": 1327957946,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6sn6c",
            "created_utc": 1335225132,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sp1i3/after_suffering_from_panic_attacks_and_anxiety_on/",
            "id": "sp1i3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sp1i3/after_suffering_from_panic_attacks_and_anxiety_on/",
            "score": 14,
            "selftext": "For those of you who are like me and keep putting off calling a doctor (or don't have the money to, rather) please just take the plunge.  I've only had one session so far, but I feel somewhat at ease knowing that he is going to help me work through this.  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "After suffering from panic attacks and anxiety on an almost daily basis for the last 5 months.  I finally saw a therapist today.  ",
            "url": "http://www.reddit.com/r/Anxiety/comments/sp1i3/after_suffering_from_panic_attacks_and_anxiety_on/"
        },
        {
            "author": "3amRadio",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335220296,
            "domain": "en.wikipedia.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sox1g/if_binge_drinking_damages_amygdala_and_thus/",
            "id": "sox1g",
            "is_self": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sox1g/if_binge_drinking_damages_amygdala_and_thus/",
            "score": 14,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/Yv76S6dyhdKZqjAF.jpg",
            "title": "If binge drinking damages Amygdala and thus dampens its activation. . Does it help with anxiety? Any experiences? ",
            "url": "http://en.wikipedia.org/wiki/Amygdala#Alcoholism_and_binge_drinking"
        },
        {
            "author": "blank-canvas",
            "author_created_utc": 1329543045,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ycby",
            "created_utc": 1335088058,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/smh1v/cant_even_get_a_hair_cut/",
            "id": "smh1v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/smh1v/cant_even_get_a_hair_cut/",
            "score": 13,
            "selftext": "I'm to scared to go get a hair cut because im afraid everyone is gonna hate it and make rude comments about it. \n\nEdit: Thank you everyone for your comments, im leaving in 10 minutes so i don't have time to reply. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Cant even get a hair cut",
            "url": "http://www.reddit.com/r/Anxiety/comments/smh1v/cant_even_get_a_hair_cut/"
        },
        {
            "author": "forever_aloneforever",
            "author_created_utc": 1335242271,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7jj4f",
            "created_utc": 1335274421,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/spx20/rant/",
            "id": "spx20",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/spx20/rant/",
            "score": 13,
            "selftext": "I am a high school sophomore. I'm #1 in my class with a 4.0 gpa. I play a varsity sport, and could play at the division 1 level in college. You would think things are great. They're not. Most people look at me and assume that I am a confident person. I would much rather go an entire day at school without talking to anyone than have to talk. I wish I could be as outgoing as the rest of the world sometimes, but I just can't make myself do that. I'm afraid that I offend people sometimes, or make them think that I don't like them because I don't talk to them or look away when we pass in the hallway. In truth, i am afraid to talk to them. I have never had a girlfriend or really even talked to girls because I'm too afraid that they will see that I really like them and not feel the same way. That's the worst part. Im just afraid to get too close to people. Whenever it appears that we are growing closer, whether its a girl or a friend or anyone else, I have a tendency to push them away. I have a group of friends that I hang out with, and I feel comfortable talking to them but even then I feel awkward sometimes and I'm not sure that they realize why I don't say \"hi\" to them sometimes when I see them. I do spend time with girls, but it is always with at least one other friend who I let do all the talking. I'm sure the girls must think I'm really weird but whatever. I even have trouble talking to my teammates. They might say something to me and I respond in a really awkward way or without looking at them. \nI hate when people being up that I don't talk much or am quiet.\nI just wish people understood how I feel, but I'm just so different from everybody.\nI don't know why I wrote this post or if anyone will see it or take the time to read it but I guess it's just good to vent for once. Maybe you guys know how I feel.\n\nEDIT: Thanks to everyone who took the time to read this post, and especially those who commented. It means a lot.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[rant] ",
            "url": "http://www.reddit.com/r/Anxiety/comments/spx20/rant/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335502170,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/suu7u/lets_talk_ibs/",
            "id": "suu7u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/suu7u/lets_talk_ibs/",
            "score": 12,
            "selftext": "It seems that my bowels go hand in hand with my anxiety. When I have a panic attack, my stomach roils and I end up running to the bathroom in a panic. I've had IBS for almost five years now and it is ruining me. I'm in constant abdominal pain and the last time I pooped like a normal person was probably around 2009.\n\nSo, anyone else with IBS? How do you deal with it? Any tricks you've learned to make the experience less awful? I've tried peppermint, ginger, three different diet changes, and a multitude of antispasmodics. I currently have a prescription for Bentyl and hyoscyamine.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Let's talk IBS",
            "url": "http://www.reddit.com/r/Anxiety/comments/suu7u/lets_talk_ibs/"
        },
        {
            "author": "libreg",
            "author_created_utc": 1313310935,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5nzqb",
            "created_utc": 1335236086,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/spbyr/something_crossed_my_mind_today_that_may_help/",
            "id": "spbyr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/spbyr/something_crossed_my_mind_today_that_may_help/",
            "score": 12,
            "selftext": "I was walking around my neighborhood today, in contemplation, and something ridiculously obvious crossed my mind. Something that I had thought about before, but never really appreciated because it seems like such a \"duh\" kind of thing. Before I developed my anxiety, the thing that I'm afraid of NEVER happened to me. I never even thought about it. But now I live in fear. So it's important to rationalize the improbability of your fears. The next logical step is to address the thing you're REALLY afraid of, a panic attack/your ability to handle your emotions. This can be helped with cognitive behavioral therapy, as most of you know.\n\nI realize this is a bit of obvious advice and won't do much for most of you, since the complexities of your anxiety are each unique, and thus hard to deal with. But if one person here can be better of because of this advice, it's worth posting imo.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something crossed my mind today, that may help some of you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/spbyr/something_crossed_my_mind_today_that_may_help/"
        },
        {
            "author": "Mickolas08",
            "author_created_utc": 1324449903,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6hewm",
            "created_utc": 1335322089,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sr40m/help_bathroom_anxiety_22m/",
            "id": "sr40m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sr40m/help_bathroom_anxiety_22m/",
            "score": 11,
            "selftext": "Recently, I've noticed that I have bathroom anxiety. For years, I never used urinals because I was afraid to, but I eventually started using them like 2 or 3 years ago. Before then, I wouldn't use one at all, and I was uncomfortable to piss outside when a bathroom wasn't nearby. Sometimes my dad would notice that I wasn't going when I needed to go, which resulted in me walking away and nervously doing it. At those times, it took me longer.\n\nI still suffer from a type of anxiety in public bathrooms because I can't go when people are at other urinals, and sometimes I can't go because there are other people in the bathroom in general. It really affects me in negative ways since I'm still taking college classes, and I don't want to miss lecture time.\n\nIt also extends to when I have to use a stall. I am afraid that I will make a lot of noise and people will be disgusted or think badly of me if they happen to see me exit the stall later on.\n\nHow do I deal with a situation like this? I have tried telling myself that these are normal bodily functions that everyone has, and it does help at times. However, I still get nervous often.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Bathroom Anxiety 22/M",
            "url": "http://www.reddit.com/r/Anxiety/comments/sr40m/help_bathroom_anxiety_22m/"
        },
        {
            "author": "Chilly73",
            "author_created_utc": 1313970674,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pgup",
            "created_utc": 1335548390,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/svkrd/ive_been_having_a_panic_attack_now_for_almost_a/",
            "id": "svkrd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/svkrd/ive_been_having_a_panic_attack_now_for_almost_a/",
            "score": 11,
            "selftext": "I feel like my chest was tight. I was actually questioning whether it was a heart attack. I've been shaking like an addict on withdrawal. I am taking my meds like I'm supposed to, as prescribed. Every noise makes me jump, literally. My husband, coming upstairs to bed, scares the crap out of me. I'm so anxious, I can't even focus on getting anything done in the house. I've been thinking about knives all damn week. But, I won't hurt myself. I keep saying that because I don't want to hurt my husband. I'm scared, jittery, and very, very tired. Just ranting, I'm sorry.\n\nEDIT: So, it's Saturday, and I'm still having a panic attack. I'm avoiding caffeine and sugar as much as possible. I talked to my husband, and he told me to call my shrink first thing Monday morning. I really appreciate all of the help and encouragement I've been given.\n\n\nUPDATE: Well, after almost 2 weeks solid of a panic attack, I finally heard from my psyche. Hecalled today, and said to reduce my Bupropion to 300mg, and my Lithium to 300mg. He said to do that until I see him, on May 18th. But, if I have any more trouble, I'm supposed to call him. We shall see. Wish me luck!\n\n\nUPDATE:Monday here, and I'm still shaking,and I feel quivery(?) like a big pile of jello(Eew!). ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've been having a panic attack now for almost a week straight. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/svkrd/ive_been_having_a_panic_attack_now_for_almost_a/"
        },
        {
            "author": "atuan",
            "author_created_utc": 1284912886,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4cvg2",
            "created_utc": 1335386639,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sscy4/any_students_that_have_a_crushing_sense_of/",
            "id": "sscy4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sscy4/any_students_that_have_a_crushing_sense_of/",
            "score": 10,
            "selftext": "I'm currently a graduate student in the humanities. I've been in the program for one year and have been suicidal and depressed with intense anxiety for the whole time.\n\n\nI can't sleep days before class or when I have a lot of work to do. I can't concentrate on the reading because I start thinking about what I should say in class and start to get anxious. Then when I am in class, I feel this crushing sense of humiliation after everything I say. Sometimes I have to fight back tears. I'm seeing a therapist and have been trying to do yoga and meditation to get my thoughts to stop running. It has helped me stay afloat, but I still feel humiliated every single day. I still get panicky every time I talk. I just started Lexapro so we'll see if that helps.\n\n\nI moved from very far away and I don't have any friends here, so that doesn't help. I also moved here with my boyfriend and we are having problems because of all the stress issues I'm having. I'm stuck here for the time being and have to at least complete next year which involves teaching, of which I'm dreading.\n\n\nI just wanted to see if there were any other students Redditors that are experiencing similar problems, how they are dealing, etc. Or just to commiserate because I just really want to talk to someone and I have no one I can talk to right now. Usually I come home from class and cry myself to sleep which increases the anxiety the next day.  I need to stop that behavior and I'm trying to stay optimistic and social. Help!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any students that have a crushing sense of humiliation every time they speak in class?  Every time I speak I have a mild panic attack and can't stand people looking at me  [x-post from /r/depression]",
            "url": "http://www.reddit.com/r/Anxiety/comments/sscy4/any_students_that_have_a_crushing_sense_of/"
        },
        {
            "author": "tmpacc2012",
            "author_created_utc": 1330231374,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_70qyh",
            "created_utc": 1335598955,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/swkju/mini_panic_attack_trying_to_sleep/",
            "id": "swkju",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/swkju/mini_panic_attack_trying_to_sleep/",
            "score": 10,
            "selftext": "My panic attacks started about a month or two ago and I have been trying to manage them on my own (I pretty broke, so I can't afford to go see a psychologist and have no insurance). And I think I have been doing better since they started, only 2-3 attacks and that was when they first started. But since then I have been able to keep them away (now its usually a lingering thing at the back of my mind to remind me to be on guard). \n\nNow my attacks are about having a heart attack. And recently (past week) when I try to go to sleep, right before I feel that last part of my conscious fall asleep, I am suddenly jolted (I literally shoot up out of bed) awake by a big wave of panic that feels like it emanated from my heart. It only lasts for a second, but it scares the fuck out of me. Now when it first happened it was a big one, and I was afraid to sleep again. Then they were only less intense ones, and I sorta got use to them (more of an annoyance than scary). And then I pretty much figured out how to no have them happen at all.\n\nBut just before I wrote this I had another big one like the first. And now I am asking if anyone else has this problem and has advice on how to get over this?\n\n**EDIT:** Just realizing that it trigger an actual panic attack. Much different than my first once. Those lasted for hours, this one I think just peaked after 15min\n\n**EDIT 2:** Would buying sleeping pills work? I know you don't need a prescription for some of them and they can be inexpensive. Knock me out before fear can build up and burst out right before I fall asleep?\n\n**EDIT 3:** I am a student at a vocational college if that is any help",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Mini panic attack trying to sleep?",
            "url": "http://www.reddit.com/r/Anxiety/comments/swkju/mini_panic_attack_trying_to_sleep/"
        },
        {
            "author": "Russiee",
            "author_created_utc": 1313092483,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5nk4u",
            "created_utc": 1335576206,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sw77r/help_going_to_see_a_psychiatrist/",
            "id": "sw77r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sw77r/help_going_to_see_a_psychiatrist/",
            "score": 10,
            "selftext": "Recently, I had to drop out of school because I was underachieving so badly, I lost motivation, I lost all care in the world about succeeding, I lost contact with my friends. I was told to speak to a doctor because the school was concerned about my mental health. \n\nNow a bit of a back story, i've lived with symptoms of Social Anxiety, General Anxiety, Manic Depression and have had 3 voices in my head (including the inner voice everyone has) for as long as I can remember, however my issue was, I was too nervous and too anxious to ask if this was normal, and so I believed everyone has this. I was scared of letting my family down, of letting my friends down, and so I pretended I was fine and everything was going well. This was going on for atleast 12 years, and very recently, everything just came crashing down on me.\n\nSo I saw a doctor, and they told me that I most likely have Social Anxiety, General Anxiety, Panic Disorder, Manic Depression however that they are unable to legally correctly diagnose me as it is a psychiatrists job.\n\nNow here is what i'm worried about, i've pretended that everything has been fine all my life, it's gotten to a point where I act and look completely normal, if I HAVE to talk to someone, even though inside i'm dying and all I want to do is fade away. I'm worried that when I see the psychiatrist, that I will act completely normal again, and that they will simply say i'm making everything up and i'm completely fine.\n\nIs it still worth seeing a psychiatrist, and how can I be sure that they won't simply dismiss what I say as false?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Going to see a psychiatrist",
            "url": "http://www.reddit.com/r/Anxiety/comments/sw77r/help_going_to_see_a_psychiatrist/"
        },
        {
            "author": "hyper_sensitivity",
            "author_created_utc": 1335183651,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7j9ik",
            "created_utc": 1335185047,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/so2uc/rant_im_sick_of_it_all/",
            "id": "so2uc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/so2uc/rant_im_sick_of_it_all/",
            "score": 10,
            "selftext": "I apologise in advance, I'm feeling a little sorry for myself today.\n\nI'm totally and utterly sick of anxiety.\n\nI feel sick to my stomach with worry about the future. It's draining the colour from my life into a big black hole of depression. WHY WON'T IT GO AWAY?\n\nI'm a medical student; typical high achiever, type-A personality. I was always a confident person, out-going and always up for a challenge. Nowadays a challenge is staying in a room with 8 other people for 1 hour. I can't believe how much I have fallen.\n\nI used to play lead guitar in a rock band, I travelled and lived in a different country by myself. I applied for medical school, went to four interviews, got accepted into my top choice, and FINALLY for the first time in my life I feel like I am doing something that I genuinely LOVE, I'm struck down with this piece-of-shit affliction. \n\nEveryday feels like a struggle. Thoughts of tomorrow bring genuine fear. I don't know when it will end and I'm struggling to see a light at the end of the tunnel. I'm normally very positive. Last week I had a good week (my best in months) but today I don't feel like anything has changed. It teases me; I get little glimpses of the old confident me, before this worthless, nervous, shell of my former self retakes its mantle in my anxiety-stricken day-to-day existence. \n\nI don't understand it! I genuinely went into medicine hoping for a better life for myself and hopefully a chance to make a difference in other peoples' lives too. And this is messing it up.\n\nFear and dread seem to be the default emotions when I think of my timetable tomorrow. A 1 hour class that I'm terrified of. I've had this class almost 100 times in my 2 years of medical school and over the past few months my anxiety has decided to manifest a fear towards it boarding on phobic proportions.\n\nIt makes no sense.\n\nI had difficulties in my life a few years back. I had a friend die, a suicide in my extended family, and a couple more deaths all in the space of 6 months or so. I was okay being back at school this year until I got another phone call from home informing me of someone else's death in a car accident. Could this be causing it?\n\nI've been to counselling but it didn't seem to help very much. I feel like I'm rearranging deckchairs on the titanic. It's something that I don't feel in control of. It's controlling me. The mind is a terrible master.\n\nI desperately want to feel normal again. I want to feel normal nerves as I would have done before and not this pathological sense of fear and dread at seemingly mundane situations. It's not normal and it's eating away at me from the inside. I've done okay so far to bottle it up and keep a handle on it but I'm not sure how much longer I can do it. \n\nI'm terrified that it'll get in the way of my dream of becoming a doctor. I'm terrified that if it does, I may never recover. I'm terrified of wasting my family's money to put me through school. I'm terrified that something so seemingly small as 'nerves' is gonna get the best of me.\n\nI honestly don't know what to do about it anymore. It's making me feel like I have to pee all the time and now I can hardly go anywhere without worrying about going to the toilet. I can't sit in class without the constant worrisome dread that I'm gonna piss myself. How I have fallen. And it's so depressing.\n\nI've exams coming up soon and I've no idea how I'm gonna get though it.     \n\nEdit: I also want to say for anyone reading this and is interested in the development of the anxiety that I had a direct trigger for the return of my anxiety this year (I had a little in my first year, but nothing near as bad as this year). I received a phone call from home informing me of a death of a family friend in a car accident, and the next day in class, *BOOM*, I had a very large anxiety attack. \n\nThis seemed to manifest in the sensation of having to urinate. Very, very badly. Basically, I thought I was gonna piss myself in class, ridiculous as that sounds. Watching this from the perspective as a medical student, I find the whole thing interesting, but, holy hell, it's annoying as hell. At its worst it has the potential to be very crippling but I'm fighting though as best I can. I do get tired though.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[rant] I'm sick of it all",
            "url": "http://www.reddit.com/r/Anxiety/comments/so2uc/rant_im_sick_of_it_all/"
        }
    ]
}