{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334706323,
            "domain": "qkme.me",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sf2qh/cant_socialize_even_on_reddit/",
            "id": "sf2qh",
            "is_self": false,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sf2qh/cant_socialize_even_on_reddit/",
            "score": 237,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/ccT8gI1PqMHKFWqj.jpg",
            "title": "Can't socialize, even on Reddit",
            "url": "http://qkme.me/3ou9rb"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334799704,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sh30x/ive_lost_all_of_my_friends_online_and_off_because/",
            "id": "sh30x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sh30x/ive_lost_all_of_my_friends_online_and_off_because/",
            "score": 39,
            "selftext": "The only person I have now is my husband.  \nI don't feel that it's fair to him that I rely on him for social interaction (aside from Reddit).  \nMind you, that he doesn't like to be around people either, but he's forced to because he's in the Army.    \n\nI had friends in grade school, until I graduated high school.  \nI pushed everyone away and became a recluse, allowing myself to become addicted to the Internet.  \nI replaced local friends with online ones (people from MMOs and chat rooms), and made numerous friendships that I thought would last.  \nI was very satisfied with online friendships, because I didn't have to deal with face-to-face contact. However, years ago, my anxiety reached a point where I became afraid to interact socially on the web and lost all of those friendships.  \nMany of the friendships also died because we all grew up and didn't have time to chat so often. I guess I was the only one who didn't grow up since I can't even leave the house.    \n\nI'm ashamed to rekindle any of them, and fear that too much time has passed.    \n\nMy husband has to go away for 3-4 months starting June, and I will be faced with the responsibility of going out and getting things done, which I'm extremely terrified of doing.  \nI was able to do all of that when he was in basic training, but I had a vehicle then. Now I live in a place across the country from family and I have no vehicle (we have one that is a stick shift, but I don't know how to drive it). I'll have to take cabs (which is extremely expensive) or ride the bus.       \n\nCan anyone relate to this? Am I just a freaking loser that needs to suck it up? I don't know how else to be. I'm even afraid to go to the doctor to try to get help.  \nI pondered if medical marijuana could help me, but I'm too chickenshit to ask my doctor about it. I figured he would look down on me for even asking and think I just wanted to get high. Mind you, I've tried drugs before, but I don't do anything now, and don't want to.  \nI've tried anxiety medications, but they only worked for a month or so and required me to take a higher dosage. By the time the meds ran out, I was anxious again and afraid to go to the doctor.    \n\nalksjdflakjsdflkjasdf  \nHow do you cope? How do you deal? What if you were alone and had no one to talk to?  \nI feel like you're going to say \"Get out of the house, even for a little bit a day.\" I've done that. I try to get out about twice a week and sit at the park and read. Whenever I try to talk to someone, or someone engages conversation with me, I never know what to say, and stumble through my words, saying the wrong things, or taking to long to think of a response.  \nI've tried many things, and always fall back into the same rut.  \nThe main problem is not having support. That's my problem, and it's my fault for being this way.    \n\nDownvote this all you want. I just wondered if anyone could relate to even a bit of this.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've lost all of my friends, online and off, because of anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/sh30x/ive_lost_all_of_my_friends_online_and_off_because/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334472550,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sajeu/a_word_to_my_fellow_anxiety_sufferers/",
            "id": "sajeu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sajeu/a_word_to_my_fellow_anxiety_sufferers/",
            "score": 34,
            "selftext": "It sucks, doesn't it? It's incredible to think that such a simple feeling like anxiety can make you feel so terrible, so hopeless. It's as if you will never escape it, that awful state of mind follows you around like your own shadow. Even when you feel alright, you know it's still there. You know that at any moment it could creep up and paralyze you with fear.\n\n\nBut you know what? You can beat this. You had the power to put the anxious thoughts in your head, and you have just as much power to conquer them. Your mind is just that: yours. You own the anxiety. Every debilitating panic attack, every anxious thought, they're all making you stronger. You're becoming more familiar with yourself; what makes you feel better, what makes you feel worse. All you have to do is try. So many people have beaten it, what makes you think you can't? You can do this. You're GOING to do this. It's going to be hard, but you aren't going to give up. And after you've gotten better, you can look back and realize how much stronger of a person you are for it.\n\n\nIt's going to be okay. I promise you, it's going to be okay.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A word to my fellow anxiety sufferers",
            "url": "http://www.reddit.com/r/Anxiety/comments/sajeu/a_word_to_my_fellow_anxiety_sufferers/"
        },
        {
            "author": "sillytreebucket",
            "author_created_utc": 1333269576,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7bq31",
            "created_utc": 1334936582,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sjstb/everyone_lets_share_our_victories_no_matter_how/",
            "id": "sjstb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sjstb/everyone_lets_share_our_victories_no_matter_how/",
            "score": 34,
            "selftext": "In the middle of a severe mood crash, and with that all-too familiar overwhelming surge of dread, and feeling unable to leave my room, let alone the house, I made myself go to a crowded shopping centre and finally get my hair cut. It was awful at first, and I was teary-eyed, and shaking, but somehow I got past the panic, and with a new look, I'm feeling a new sense of confidence, too. \n\nSo, share what you've accomplished lately, even if it's just getting out of bed, or introducing yourself to someone new.\n\nEDIT: Thanks for the amazing response! Reading through these comments has made me feel so much more optimistic about this condition. There are days when it feels so completely hopeless, but if we hold onto the small things, I feel like it'll all be alright. Congratulations on everything you've achieved, and keep on taking it one step at a time. In the end, we'll get there.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Everyone, let's share our victories, no matter how small. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/sjstb/everyone_lets_share_our_victories_no_matter_how/"
        },
        {
            "author": "sigtrap",
            "author_created_utc": 1284868026,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4cu3k",
            "created_utc": 1334606136,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/scw6o/thank_you_anxiety_for_making_me_look_like_a/",
            "id": "scw6o",
            "is_self": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/scw6o/thank_you_anxiety_for_making_me_look_like_a/",
            "score": 32,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/vD0CS8kAIJiWVWFB.jpg",
            "title": "Thank you anxiety for making me look like a complete idiot (this is why I can't get a job)",
            "url": "http://i.imgur.com/fJcgH.png"
        },
        {
            "author": "jumpingtheship",
            "author_created_utc": 1321839686,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6a5dv",
            "created_utc": 1334435266,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/s9wa1/pissed_off_at_my_anxiety_nsfw_language/",
            "id": "s9wa1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": true,
            "permalink": "/r/Anxiety/comments/s9wa1/pissed_off_at_my_anxiety_nsfw_language/",
            "score": 30,
            "selftext": "I am a very calm person with tons of patience but today I got pissed off at my anxiety.\n\nI've had anxiety since August 2010 and have been reading and using various non-medication methods.  I do have Xanax (.25mg) for the times that it's bad and I'm down to only needing it about once a month for a really bad day.  Last week, my doctor prescribed Lexapro and last Sunday, I took one 10mg of Lexapro.  Usually the anxiety builds up before a full blown panic attack so I haven't had one since last November because I have learned to control the anxiety.  But that medicine threw me into a panic attack immediately with no anxiety build up.  Along with other side effects, it had me in bed for about 3 days.  I did not take any more of that medicine because 1. my reaction and 2. my doctor told me to stop.\n\nNow that the medicine has fully cleared my system, I wanted to go to Office Depot this morning, my first time driving in a week.  I drive and a block away from the store, I freak and go home.  Then I saw my electricity bill that I have to mail off today.  I put on my jacket again, grab the bill and realize that I cannot walk **one** block to the post office.\n\nAfter trying my various methods to calm down, I realize today is my once a month day that I will need the Xanax.  I walk into my bedroom where I keep some by the bed (placebo effect makes me sleep well knowing it's close by).  Then I start crying because I don't want to take it. I don't want to rely on medication. I want to be stronger because I know I can overcome this and one day I will be fine.  \n\nThen I got mad.  And I mean pissed off, cursing like a sailor mad.  I throw my jacket on, grab the bill, grab my keys and storm out the door.  The entire time I am stomping down the block, I am cursing under my breath.  This bill HAS to be mailed today.  It's the electric bill.  If the electricity gets turned off because of this damn anxiety, well what the fuck?!  No baseball, no tv, no internet, can't apply for jobs if no internet, can't cook, food will spoil.  Fuck this anxiety!  It's thrown me to the hospital and doctor's office more times in the past 8 months than I've been to see my doctor in the past 10 years!  I had to take a leave of absence from school, I'm thousands in debt (and that is **after** insurance), I finally paid off one ambulance, now I have to work on the second one.  I'm still paying for those doctor visits from last October and many more after.  Fuck you anxiety!  Fuck you.  You're holding me back from going to the store.  I am tired of being in my apartment!  I was able to walk to the library a few days ago.  I went to the post office the other day.  And today you want to rear your ugly head that I can't even go **one** block?!  I AM TIRED OF YOU HOLDING ME BACK.  Fuck you anxiety!  Fuck you brain!\n\nBy now I'm passing a group of people for the second time who are standing outside a building.  When I get pass them, I begin to laugh and realize I look like a crazy ass person.  Stomping down the street, face red from crying, cursing under my breath pretty loudly at myself.  Even now, an hour later, I'm still laughing at myself.\n\nI honestly cannot remember the last time I have ever been pissed off. Everything I've read so far has been to be calm, have patience and accept the feelings.  I've been doing that for eight months and I don't know what snapped, but today, I said fuck it, fuck anxiety.\n\nI'm off to Office Depot, because fuck it, I want to use my $5 rewards and get some free stuff and get out the apartment!\n\nHas anyone else gotten mad and pissed off at their anxiety?  Besides the common methods, do you have any unusual methods to deal with your anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "nsfw",
            "title": "Pissed Off at My Anxiety [nsfw: language]",
            "url": "http://www.reddit.com/r/Anxiety/comments/s9wa1/pissed_off_at_my_anxiety_nsfw_language/"
        },
        {
            "author": "Chuckgofer",
            "author_created_utc": 1321467214,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_697iu",
            "created_utc": 1334943153,
            "domain": "rantsandfieldnotes.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sjzbb/i_was_sent_this_a_while_ago_is_this_valid_advice/",
            "id": "sjzbb",
            "is_self": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sjzbb/i_was_sent_this_a_while_ago_is_this_valid_advice/",
            "score": 27,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/mwlONxGBBb8HkJn7.jpg",
            "title": "I was sent this a while ago.  Is this valid advice or insulting to people with anxiety?",
            "url": "http://rantsandfieldnotes.tumblr.com/post/13756405442/how-to-decode-a-person-with-an-anxiety-disorder"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334974322,
            "distinguished": "moderator",
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/skq6g/lets_try_a_tag_system_help_for_questions/",
            "id": "skq6g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/skq6g/lets_try_a_tag_system_help_for_questions/",
            "score": 26,
            "selftext": "Feel free to begin posting your favorite ways/links to relax. Maybe we will have a collection of our favorites.\n\nAgain, the tag system is optional, but it helps others know what it is you are looking for. =)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Let's try a [tag] system! [Help] for questions, clarifications, feedback, etc. [Relaxing] for things that relax you, [Rant] for when you just want people to understand and e-hug. (this is optional)",
            "url": "http://www.reddit.com/r/Anxiety/comments/skq6g/lets_try_a_tag_system_help_for_questions/"
        },
        {
            "author": "whytofly",
            "author_created_utc": 1308858984,
            "author_flair_css_class": "test",
            "author_flair_text": null,
            "author_fullname": "t2_5f1wp",
            "created_utc": 1334626321,
            "distinguished": "moderator",
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sdfuq/meta_should_we_start_posting_things_that_help/",
            "id": "sdfuq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sdfuq/meta_should_we_start_posting_things_that_help/",
            "score": 24,
            "selftext": "We are almost at 5k subscribers! I was wondering what people's thoughts were on adding what helps our anxiety along with the questions and quirps we have around here. \n\nFor example, I could post:\n\n**Title:** \"When I am feeling anxious, I watch massage videos on YT [Relaxing]\"\n\n**Link:** http://www.youtube.com/watch?v=wkXI5bGlCjU\n\n\nThoughts?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Meta] Should we start posting things that help with our anxiety/help us relax? We can do a [tag] system like [Relaxing] or [Helpful]? Talk inside.",
            "url": "http://www.reddit.com/r/Anxiety/comments/sdfuq/meta_should_we_start_posting_things_that_help/"
        },
        {
            "author": "ArrrrghB",
            "author_created_utc": 1284256133,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4c2ny",
            "created_utc": 1334599792,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/scpv0/success_story/",
            "id": "scpv0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/scpv0/success_story/",
            "score": 23,
            "selftext": "I don't see too many success stories on here compared to questions and problems, so I thought I would share. Treatment can work!\n\nI went through a big illness and a traumatic breakup at the beginning of the year. During this time I had my first real panic attack (woke up in the middle of one, I didn't even know that could happen) and ended up dropping a class because I was so overwhelmed. I was working with a fantastic therapist at the time who suggested I may need medication because all the work we were doing together wasn't helping my anxiety. I saw my doctor and asked what I could do.... I was scared of trying benzos because I was worried I would like them too much, and I was scared to try an anti-depressant because I didn't have enough time to deal with the crazy side effects in the first few weeks. He suggested Paxil, and said at the time \"I bet you will feel this working within a matter of days\". I was skeptical but gave it a shot... it was a low enough dose that I wouldn't need to taper if I hated it. \n\nIts now been two and a half months on Paxil and my life is so much better. My anxiety is gone... well, not entirely. I still have anxiety over things that \"normal\" people freak out about, but I'm not CONSTANTLY worried about little details and events far into the future. I wake up and feel like I can manage the day, and that I can accomplish great things! It is such a liberating feeling that I can't accurately put into words. \n\nWhat actually prompted me to share my story was something I saw on PostSecret today: [this image really struck a chord with me.](http://2.bp.blogspot.com/-km8O6sY5Rmo/T4oLwpZb_YI/AAAAAAAAS0U/wLeYbqHx3zU/s400/loveisnotenough.jpg) I think many people can feel like a failure if they have to resort to medication when they shouldn't, especially when people suggest they just \"try harder\" to feel better. Now I'm just kicking myself for not seeking meds out sooner!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Success story",
            "url": "http://www.reddit.com/r/Anxiety/comments/scpv0/success_story/"
        },
        {
            "author": "calendersandclocks",
            "author_created_utc": 1334393434,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7gaga",
            "created_utc": 1334522195,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sb8we/social_anxiety_does_it_ever_get_better/",
            "id": "sb8we",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sb8we/social_anxiety_does_it_ever_get_better/",
            "score": 21,
            "selftext": "I was diagnosed with SA when I was 14. I've been seeing a psychiatrist, and therapist since my diagnosis. I've tried what seems like every medication, with no help. I'm trying everything I can, and it all just seems to be getting worse. Does it ever get better? Is it normal for things to get worse before they get any better? When I was first diagnosed I could leave my house, I could, with difficulty still be a part of society, but that's not possible anymore. Even the thought of it makes me incredibly anxious. Just posting here makes me feel incredibly anxious. Is there hope? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Social Anxiety, does it ever get better?",
            "url": "http://www.reddit.com/r/Anxiety/comments/sb8we/social_anxiety_does_it_ever_get_better/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334601846,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/scrwq/heart_palpitations_linked_to_anxiety/",
            "id": "scrwq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/scrwq/heart_palpitations_linked_to_anxiety/",
            "score": 17,
            "selftext": "I think I have mild to moderate (sometimes moderately high levels) anxiety and depression.  I go to therapy but don't take meds.  I've been experiencing palpitations the last 48 hours.  I'm overall healthy, 28 year old female, upped my exercise just a little last week but not much, I drink 4 or 5 times a week but no more than 2 beers or 2 glasses of wine in one sitting and drink caffeine almost everyday (no more than one cup of coffee).  I really want to continue working out but I'm afraid about the palpitations.  I don't have good health insurance so going to the doc just for him or her to tell me I'm fine is really not what I want to do.  \n\nDoes anyone know how normal they are?   thanks for reading",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "heart palpitations linked to anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/scrwq/heart_palpitations_linked_to_anxiety/"
        },
        {
            "author": "ixregardo",
            "author_created_utc": 1300678669,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_4zlgj",
            "created_utc": 1334940861,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sjx08/sleep_deprivation_triggers_my_anxiety_what_are/",
            "id": "sjx08",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sjx08/sleep_deprivation_triggers_my_anxiety_what_are/",
            "score": 17,
            "selftext": "I got about 4 or 5 hours of sleep last night, way below my regular tolerance. When this happens my head feels fuzzy, my stomach gets really upset, and I'm constantly hungry. I take all of these as warning signs that something is Wrong and because I'm so mentally compromised from the lack of sleep I tend to spiral into panic and/or misery.\n\nI've got two job interviews today, and public transportation adventures to contend with. I'd love some advice and support from others who go through this. Intellectually, I know that I'll survive a night of missed sleep, but all my internal alarms are going off :P hellllpppp.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sleep deprivation triggers my anxiety. What are some good ways to get myself through the day?",
            "url": "http://www.reddit.com/r/Anxiety/comments/sjx08/sleep_deprivation_triggers_my_anxiety_what_are/"
        },
        {
            "author": "somebodyinteresting",
            "author_created_utc": 1326327658,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6n5dw",
            "created_utc": 1334697466,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/seugl/hey/",
            "id": "seugl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/seugl/hey/",
            "score": 15,
            "selftext": "I feel like talking. This seems like a good place.\n\nI have been struggling with, uh, anxiety, for my whole life, but as I went through college and then started pursuing an advanced degree in physics,  things got way worse and I had to take a long break from school. It's been a couple of years now.\n\nI have been making good progress with this anxiety by talking with one counselor from my university (while I was still enrolled), talking with some religious folks, talking with my girlfriend, surfing, oh and filling many many pages of composition books with all sorts of ideas. I am starting to feel a lot more functional and I am doing OK with the new responsibilities that come with this feeling. I found a new physics advisor and a pretty sweet PhD project is starting to take shape.\n\nAnyways, trying to live more mindfully is tough. When I start to get upset but don't yet understand what is happening, I can come down pretty hard on myself and generally be pretty unpleasant.\n\nSometimes after a meeting with this new advisor, I find myself ruminating on the subject of physics. This invariably makes me feel bad about myself and makes me feel sick of the subject, which can make it hard for me to go back to my research in the following days.\n\nYesterday, following a long period of stress, I started feeling like I was coming down with a cold and just found myself really, really upset. Like old times. I think I would benefit from talking with a counselor again. If I can get re-enrolled into my department, I will definitely start with more counseling soon after that. I'm taking it easy today and starting to feel better.\n\nAnyways, I'm working at this and I'm making progress. It is possible to make progress with anxiety. It is not easy on the ego, though. I know in my heart that accepting a more full experience of life has done me and my relationships a great deal of good, despite all the difficult new things I've had to learn.\n\nI am not sure what this community will do with this post, but it felt good to write it and I'm getting tired of just writing to myself.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey",
            "url": "http://www.reddit.com/r/Anxiety/comments/seugl/hey/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334578925,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sca3l/had_trouble_making_it_to_work_today/",
            "id": "sca3l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sca3l/had_trouble_making_it_to_work_today/",
            "score": 15,
            "selftext": "I've struggled with depression and generalized anxiety disorder my whole life.  I'm a 28 year old female.  Not currently on any medications and have been on a waiting list for a publicly funded therapist for 8 weeks now.  \n\nLately the anxiety has been coming in waves, followed by bouts of pretty bad depression.  I can feel a \"cycle\" coming on.  I woke up with that feeling in my chest... that uncomfortable \"tickle\" in my chest that eventually manifests itself into a pile of bricks that is completely stifling.  I felt it all weekend but this morning the stress of going to a job I despise made the walls close in and I just couldn't break through.  I got ready for work - got up at 6am, took shower, ate breakfast, but all the while that feeling just got worse and worse.  All morning I was trying to talk myself into going to work.  \"Just go, it's fine.  You'll feel better if you go.  GO!\"  It didn't work, I called out.  Now I feel like a huge failure and all day I'm just going to feel guilty.  \n\nIs this something that happens to any of you?  It's a vicious cycle for me.  Once I actually call out of work, I feel like such a pile of garbage... it doesn't solve anything.  I know this intellectually, but sometimes no matter how much I try to talk myself into going, my anxiety wins out.  Wondering if any of you have any advice on how to overcome these feelings without therapy/medication as I am still waiting to get into therapy.  (I cannot afford private therapy, my insurance does not cover mental health.) ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Had trouble making it to work today...",
            "url": "http://www.reddit.com/r/Anxiety/comments/sca3l/had_trouble_making_it_to_work_today/"
        },
        {
            "author": "marera",
            "author_created_utc": 1313094406,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5nkbe",
            "created_utc": 1334879359,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sipb6/ranxiety_what_foods_make_you_feel_considerably/",
            "id": "sipb6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sipb6/ranxiety_what_foods_make_you_feel_considerably/",
            "score": 14,
            "selftext": "I notice that when I'm not very conscious of it, I tend to eat copious amounts of simple carbohydrates (spoonfuls of nutella, handfuls of sugary cereal, ice cream, candy, etc.), and things very high in protein (maybe to compensate for my feelings of extreme tiredness and discomfort). When I'm a little more conscious of my diet and in a more productive mood, my brain always tends to crave things like wild salmon, avocado, pesto, and dark leafy greens, like spinach. does this happen to anyone else? and it's not even because i think those things are healthier, I just crave them, and when I eat them I feel like I'm less apt to freak out compared to other foods.\n\nI also feel as if the simple carbs make my anxiety worse, and so does consuming anything like tortilla chips, nuts and hummus. they are just as oil-rich and considerably nutrient-dense (excluding the tortilla chips) as the salmon and such, but I feel icky and uncomfortable after consuming them.\n\nEDIT: **also, do you drink an adequate amount of water everyday? or are you often dehydrated?**\n\nI do not drink enough water, and I think it definitely makes me feel cloudy and lethargic. I've never tried staying on top of being well hydrated, but I want to to see if I have a significant upswing.\n\nEDIT: and i'm definitely interested in trying the Keto diet. It seems like it's helpful for anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "/r/Anxiety, what foods make you feel considerably better or worse?",
            "url": "http://www.reddit.com/r/Anxiety/comments/sipb6/ranxiety_what_foods_make_you_feel_considerably/"
        },
        {
            "author": "Apollo7",
            "author_created_utc": 1300044507,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4yi8d",
            "created_utc": 1334890169,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/siz8x/avoidant_personality_disorder/",
            "id": "siz8x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/siz8x/avoidant_personality_disorder/",
            "score": 14,
            "selftext": "Anyone else? I haven't seen a lot of discussion about it on reddit, but it is classified as an anxiety disorder (type C personality disorder), so I thought I'd post it here.\nMixed with massive depression, schizophrenia and general paranoia...\n\n\n\n\n\n\n\n\n\nIt sucks.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Avoidant Personality Disorder",
            "url": "http://www.reddit.com/r/Anxiety/comments/siz8x/avoidant_personality_disorder/"
        },
        {
            "author": "Hellfighter",
            "author_created_utc": 1289688381,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4iq1n",
            "created_utc": 1334985577,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/skxk3/im_my_own_worst_enemy_what_do_i_do/",
            "id": "skxk3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/skxk3/im_my_own_worst_enemy_what_do_i_do/",
            "score": 13,
            "selftext": "I'm having this problem right now where my anxiety is being combined with me overstretching myself. I have this very bad habit of being way too hard on myself, I always have to do better, I have to be better prepared, ect. In the past few weeks, I've had quite the load of stress due to school, money, and looking for a co-op for the summer. The job looking has been hard, as no one has offered me a job, and as such, I'm panicking. Why am I not being hired, is there something blocking me, am I just not good enough, ect. I'm already nervous, combine that with the fact that I need some sort of income for the summer, and graduation issues just have clusterf**ked into a huge mess. I panic a lot, I beat myself up, and I keep beating down on myself. I've tried to yell stop to myself when a thought crosses my mind, and I've also gone on walks or started jogging, yet it doesn't help, and at some points, only makes things worse. I hate total uncertainty, I need to have some idea of what will happen in the future. Since I have no idea what will happen, I'm freaking out, I'm very scared. What are some things I can do to combat the anxiety I face right now, as well as stopping the panic attacks (Alcohol and Smoking cannot be used as a suggestion, TL;DR). Also, I'm conscious of the fact that I am very hard on myself, yet it's so embedded in me, how would I try to tackle this disease head on?\n\nTL;DR Very hard on myself and anxiety about future is complicating things. Having small panic attacks and chest pains. What can I do to stop my anxiety and being hard on myself.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm my own worst enemy, what do I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/skxk3/im_my_own_worst_enemy_what_do_i_do/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334925652,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sjjsb/i_have_a_job_interview_in_a_couple_of_hours/",
            "id": "sjjsb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sjjsb/i_have_a_job_interview_in_a_couple_of_hours/",
            "score": 13,
            "selftext": "And I feel like there's no way I will possibly survive it. I know that as long as I make it until like 2 pm I'll be alright, but the point a to point b journey just seems impossible right now. I'm almost trying to convince myself not to go, but I need a job. Ugh guys I hate this feeling.\n\nedit:  I survived!!  I'm SO glad that is over.  It went pretty okay (as in not stellar, but better than bad).  If nothing comes of it, at least I tried. And it was a little more practice for the next. AND now to enjoy the weekend.  Thanks guys!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I have a job interview in a couple of hours...",
            "url": "http://www.reddit.com/r/Anxiety/comments/sjjsb/i_have_a_job_interview_in_a_couple_of_hours/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334793590,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sgx92/attending_an_employee_mixer_for_700_people_at/",
            "id": "sgx92",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sgx92/attending_an_employee_mixer_for_700_people_at/",
            "score": 11,
            "selftext": "I would word all of this more eloquently but I'm sort of mentally preoccupied.... here goes.\n\nMy introvert needle is buried in the red, and suffer from fairly bad general anxiety. I just started my new job this Monday, and we're having an employee conference the next few days so everyone is in town for it. Tonight is the tip-off mixer at some hotel, and I neither drink nor know anyone other than my friend who isn't going to be there tonight. I'm desperately trying to break away from my established introverted and anxious self, but just the thought of having to make small talk with new people and make hundreds of first impressions is giving me butterflies. \n\nDoes anyone have any tips or ideas of things I can keep in mind? Or, any assistance in preventing a panic attack at the very least?\n\nI'll be back in a bit, I'm going to go take a shower.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Attending an employee mixer for 700~ people at brand new employer. Way out of my comfort zone. Any tips?",
            "url": "http://www.reddit.com/r/Anxiety/comments/sgx92/attending_an_employee_mixer_for_700_people_at/"
        },
        {
            "author": "cakemonster",
            "author_created_utc": 1295982374,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4rkwf",
            "created_utc": 1334558416,
            "domain": "anxietyguru.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sc1w0/get_anxious_after_drinking_booze/",
            "id": "sc1w0",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sc1w0/get_anxious_after_drinking_booze/",
            "score": 11,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/kLz27IuCHFYqPw7z.jpg",
            "title": "Get anxious after drinking booze? ",
            "url": "http://www.anxietyguru.net/why-alcohol-causes-anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334983540,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/skwdf/i_just_got_set_back_a_couple_of_years_whats_your/",
            "id": "skwdf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/skwdf/i_just_got_set_back_a_couple_of_years_whats_your/",
            "score": 9,
            "selftext": "All my \"buddies\" just went camping and didn't say anything to me about it, even invited the weird friend so I guess that puts me lower than him. The guys that didn't go won't return my texts. I think I realized my place. \n\n.\n\n\nOn top of that my wife hasn't touched me in 6 months, literally touched me. My friends were the only thing holding me together. I'm standing on the edge..\n.\n\n\n\nHow is anxiety going?\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I just got set back a couple of years, what's your story of failure?",
            "url": "http://www.reddit.com/r/Anxiety/comments/skwdf/i_just_got_set_back_a_couple_of_years_whats_your/"
        },
        {
            "author": "anxietytroubles",
            "author_created_utc": 1334677154,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7hasi",
            "created_utc": 1334677346,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sebtv/anxiety_and_sexual_dysfunction_help/",
            "id": "sebtv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sebtv/anxiety_and_sexual_dysfunction_help/",
            "score": 9,
            "selftext": "I'm a guy with general anxiety disorder, and i have trouble reaching climax with my partner. If i am on my own it is not a problem at all. Does anyone else have any similar problems? or any advice? Many thanks",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety and sexual dysfunction, help?! ",
            "url": "http://www.reddit.com/r/Anxiety/comments/sebtv/anxiety_and_sexual_dysfunction_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1334536195,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/sbk9s/a_question_to_all_of_you/",
            "id": "sbk9s",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/sbk9s/a_question_to_all_of_you/",
            "score": 9,
            "selftext": "Are any of aware of a website or database that exists for success rates of different treatments and drugs? It wouldn't necessarily have to be for just anxiety (depression/other mental disorders would count). Wouldn't something like this be important?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "A question to all of you",
            "url": "http://www.reddit.com/r/Anxiety/comments/sbk9s/a_question_to_all_of_you/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1335022289,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/slc0u/on_adhd_confusion_lexapro_two_crappy_shrinks_and/",
            "id": "slc0u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/slc0u/on_adhd_confusion_lexapro_two_crappy_shrinks_and/",
            "score": 7,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "On ADHD, confusion, Lexapro, two crappy shrinks and helplessness.",
            "url": "http://www.reddit.com/r/Anxiety/comments/slc0u/on_adhd_confusion_lexapro_two_crappy_shrinks_and/"
        }
    ]
}