{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344833910,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y4obg/whenever_i_leave_the_house/",
            "id": "y4obg",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y4obg/whenever_i_leave_the_house/",
            "score": 136,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/H49vzpi9fth1JTsV.jpg",
            "title": "Whenever I leave the house",
            "url": "http://i.imgur.com/uIfsm.jpg"
        },
        {
            "author": "hotchelle",
            "author_created_utc": 1333998458,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7el7t",
            "created_utc": 1344593425,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xznpa/boyfriend_sent_this_to_me_with_good_intentions/",
            "id": "xznpa",
            "is_self": false,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xznpa/boyfriend_sent_this_to_me_with_good_intentions/",
            "score": 117,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/sZk4E3Y3WKS0ZhbR.jpg",
            "title": "Boyfriend sent this to me with good intentions but he thinks it can fix my worrying; he doesn't understand it's not that easy :(",
            "url": "http://i.imgur.com/9M5DY.jpg"
        },
        {
            "author": "tarotblades",
            "author_created_utc": 1328232986,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety Girl!",
            "author_fullname": "t2_6tq8p",
            "created_utc": 1344946386,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y762u/sometimes_i_draw_silly_pictures_of_what_my/",
            "id": "y762u",
            "is_self": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y762u/sometimes_i_draw_silly_pictures_of_what_my/",
            "score": 69,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/Cbjw-7zKC_NcWmj2.jpg",
            "title": "Sometimes I draw silly pictures of what my anxiety looks like and make fun of the drawing. What are some things you do to help with your anxiety?",
            "url": "http://imgur.com/66guT"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344366380,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xu5s5/the_pain_of_knowing/",
            "id": "xu5s5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xu5s5/the_pain_of_knowing/",
            "score": 62,
            "selftext": "I know I am talented. \n\nI know I am intelligent.\n\nI know that people don’t hate me.\n\nI know I don’t have to make everybody happy.\n\nI know I’m allowed to do things that make me happy.\n\nI know people aren’t always angry with me.\n\nI know people aren’t bad-talking me behind my back.\n\nI know I’m not constantly being judged.\n\nI know I’m not being held to some unattainable standard.\n\nI know I don’t need to have so many rules.\n\nI know it’s not all about me.\n\nI know I’m not selfish.\n\nI know I’m not a bitch. \n\nI know I’m not lazy.\n\nI know I’m not crazy.\n\nI know I was abused.\n\n\n\nIf I could FEEL these things then I KNOW I wouldn’t have an anxiety problem.\n\n\n\nMy pulse is pounding in my throat right now. I’m sitting at work on a slow day and the weight of the idea that I will never internalize these things is crushing me. I want to cry but I can’t keep crying at work. I hate feeling like a burden to the people I love. I hate feeling as if they will abandon me because I can’t get my shit together.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "The pain of knowing\n",
            "url": "http://www.reddit.com/r/Anxiety/comments/xu5s5/the_pain_of_knowing/"
        },
        {
            "author": "Verez",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344476298,
            "domain": "tinybuddha.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xwyq7/the_best_article_i_have_ever_read_on_anxiety_it/",
            "id": "xwyq7",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xwyq7/the_best_article_i_have_ever_read_on_anxiety_it/",
            "score": 59,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/M9-JsEOQSM4GK-lu.jpg",
            "title": "The best article I have ever read on anxiety, it really sums up everything.",
            "url": "http://tinybuddha.com/blog/the-gift-of-anxiety-7-ways-to-get-the-message-and-find-peace/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344968102,
            "domain": "self.Anxiety",
            "edited": 1345001519,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y7qkz/im_going_to_kill_myself_tonight_i_tried_reaching/",
            "id": "y7qkz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 73,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y7qkz/im_going_to_kill_myself_tonight_i_tried_reaching/",
            "score": 57,
            "selftext": "**EDIT2: Since most of you are still unclear what happened. At 4:00pm I made this post because I was really stressed out. I wasn't ever going to kill myself.**\n\n**At 9:00pm I woke up to cops at my door because someone on Reddit submitted this post to hte police.**\n\n**I have PTSD because I was sent to the psych ward hospital and abused, and almost raped by people in the hospital. I was sent to a group home where I was afraid of being raped, where I was abused emotionally by workers, and where was in physical danger due to the crazy people living there.**\n\n**The cops wanted to send me to the hospital, but they understood my situation and even had experience at my group home, because believe me the cops were called a lot because the guy that lived there would try to kill people and do crazy shit a lot. That's what traumatized me.**\n\n**My parents came and explained my situation. Cops left when they knew my parents were there.** \n\nI understand why you guys did what you did, or if was a mod or whatever. But jesus christ you should have messaged me first or something? I'm happy that cops like this stop people from killing themselves but it really backfired for me. Cops were super professional and shit. \n\nSO WHOEVER REPORTED THIS POST IT TOTALLY BACKFIRED BECAUSE I AM HAVING A MASSIVE FLASHBACK BECAUSE THEY ALMOST SENT ME BACK TO THE PLACE WHERE I WAS RAPED AND ASSAULTED.  I am y OK though because I have my parents on speed dail if things get messy. I was never going to kill myself. I am fine. Please don't call the cops anymore everything thing is under control. \nEDIT: EVERYONE\n\nCops showed up at my house at 9:00am\n\nBecause I am traumatized from being sent to the psych ward which caused the depression/anxiety problems so bad when I was 20  this caused a massive episode of Post Tramtic flashbacks \n\nMy parents chilled with me and helped me through it and they agreed to not send me to the psych ward.\n\n\nI was never going to actually kill myself, but I was really fucking depressed.\n\nI had a Doctor Appointment next Thursday, where I was going to tell him about everything and get helo to see a new therapist, but I don't know the likelyhood of me going now that I am re-experiencing trauma. I have my parents on speeddial and they will help me through it.\n\nEven though it caused such severe PTSD I never knew Reddit could do this, so I'm glad that you guys may be responsible for legitly stopping suicide. But really I did not need this to happen tonight. It was so counterproductive, but it's not like anyone on reddit would have known and you have to take procautions so I'm happy you probably stopped people.   \n\n**tl;dr After this thread police showed up at my house and were going to take me to the place where I was traumatized in the first place. I understand why you did this but this was so unfortunate situation.**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm going to kill myself tonight. I tried reaching out for help for sexual trauma and I got a bunch of people blaming me for being raped. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/y7qkz/im_going_to_kill_myself_tonight_i_tried_reaching/"
        },
        {
            "author": "thatguywithtwothumbs",
            "author_created_utc": 1325012510,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_6ivoa",
            "created_utc": 1344709339,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y21vs/dae_get_anxiety_about_going_out_in_the_heat/",
            "id": "y21vs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y21vs/dae_get_anxiety_about_going_out_in_the_heat/",
            "score": 52,
            "selftext": "Title pretty much explains it but I seem to only get anxiety problems during summer and I believe it's for this reason. In my head, I think if I go out in the sun I will pass out or something. Just wondering if anyone else had this type of anxiety.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get anxiety about going out in the heat?",
            "url": "http://www.reddit.com/r/Anxiety/comments/y21vs/dae_get_anxiety_about_going_out_in_the_heat/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344810340,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y4202/went_out_today_and_felt_great_a_small_success/",
            "id": "y4202",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y4202/went_out_today_and_felt_great_a_small_success/",
            "score": 46,
            "selftext": "The weather was perfect, not too gloomy and not too hot, just in the between. the wind in my hair and ears felt like natures kisses. i looked at people walking by, and the demons in my head didn't rise up to the occasion to tell me that everyone is watching you, judging and ridiculing you. it felt nice. and peaceful. just wanted to tell you guys.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Went out today and felt great! A small success story.",
            "url": "http://www.reddit.com/r/Anxiety/comments/y4202/went_out_today_and_felt_great_a_small_success/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344895081,
            "domain": "self.Anxiety",
            "edited": 1344969711,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y61ck/should_i_go_to_a_professional/",
            "id": "y61ck",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y61ck/should_i_go_to_a_professional/",
            "score": 43,
            "selftext": "The general tip on this page (and many websites... and my instincts) tell me that if anxiety interferes with my life, I should seek help. However, I am unsure if I actually have a real anxiety problem or if I'm just overreacting to normal worries. Essentially, I'm worrying about my worrying...\n\nHere are some basic things that I'm concerned about.\n\nI am pretty much always concerned about how I come off to other people. I will put my own desires/needs aside to make sure other people will be content. My biggest \"trigger\" is any situation that might embarrass me or make others dislike me. I avoid making decisions in groups for fear that I will offend someone. \n\nEven the chance of this happening makes me worry. I will break down crying over the simplest things. For example, I saw a voicemail from my work yesterday and made my boyfriend listen to it because I was too busy crying and worrying about what it would say, even though I had no real reason to be worried about my job. I started crying, in front of a bunch of people... but I stopped after a few seconds. I still felt anxious about it for the next few hours.\n\nI have very few friends. People seem to like me, I just avoid getting close to anyone. I love listening to others and helping them with whatever they need, so I do have people that consider me to be a good friend. However, I do not consider anyone to be a close or best friend. My boyfriend is closest to me, he is the only personI don't get nervous around. He is my best friend and my support when life gets me down. The negative side of this is that I'm always worried that he will leave me because I will drag him down with me. I try to tell myself that I just don't like people, but I feel like its mostly my fault for not reaching out to others. I just... get way too nervous talking to people for me to get close to them. \n\nI also feel tired a lot. Exhausted. I also have difficulty sleeping most nights, to a point where I don't even remember sleeping at all. I zone out and get bored easily while watching TV etc... just kind of sink into my own mind. I just can't relax. I feel like I should be doing something more productive than things I enjoy. Essentially I can't even enjoy things anymore because i think I should be doing it better or doing something more worth while. I feel stressed over school, even though the year hasn't started. I have little motivation to get out. I love doing things with my boyfriend, but doing things with others is difficult. \n\nI just wonder if this is really anxiety, because sometimes one little worry will blow up into an \"end of the world\" depression for days/weeks at a time. I try to be positive... but it is extremely difficult for me to see the bright side of things. Other times (much less often than the worrying), I feel like nothings is wrong in the world and my life is fantastic. Most of the time I'm just neutral... blah. I almost always have terribly low self-esteem though, except on the rare occasion when I feel somewhat pretty/smart/whatever, but that never lasts long. It's weird... because I logically shouldn't have low self-esteem. I understand that others think I'm not terribly ugly, or stupid, or a bad person... I just can't accept it. I have high reaching goals, with low expectations for myself (if that can happen).\n\nBasically, I just wonder if this is normal anxiety or if I should talk to someone. I worry that I'm just worrying too much about my worry (if that makes sense). Like I'm going to go to the counseling center and the therapist will be like, \"Don't be ridiculous, you're just being stupid\" (of course in a nicer, more professional way). Worrying doesn't tend to interfere with my life too much. I pretend to not be nervous or depressed or worried, because I know it's useless and stupid. It's just always there. I will avoid little things, like talking on the phone or going to large parties, but most of the time I force myself to ignore my worries and participate anyways. Sometimes, I don't even know why I feel stressed or depressed, I just do. I've gotten very good at pretending I'm perfectly fine, even if I don't feel fine on the inside. I worry about letting my parents down, losing my boyfriend, upsetting people, failing school, being a bad psychologist (because that's what I'm shooting for), basically just any possibility of failing someone or something in some way. There's always something... I try not to let my worry stop me from achieving my goals and happiness... but I fear that it might be in ways I can't yet see.\n\nSo, does everyone feel this way? Is this normal worry? Or should I make the terrifying step of talking to a counselor (which also worries me... because I wouldn't really know what to say). If I do talk to a professional, what do I say? Where do I begin?\n\nI realize I typed a lot of random things... I'm just confused and lost. I don't know how to understand myself.\n\nFYI I'm a 20 year old female. If there are any questions, feel free to ask. I'm willing to be pretty open on Reddit because it's not connected to me directly.\n\nEDIT: Thank you EVERYONE for your wonderful replies! They were all really helpful and reassuring :) I think I'll go to the counseling center at my school once it opens next week. We have some wonderful people there. I'm thankful to be in such a supportive environment! Upvotes for everyone!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Should I go to a professional?",
            "url": "http://www.reddit.com/r/Anxiety/comments/y61ck/should_i_go_to_a_professional/"
        },
        {
            "author": "imaginelove615",
            "author_created_utc": 1297969461,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4uu5r",
            "created_utc": 1344657111,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y17g0/good_news/",
            "id": "y17g0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y17g0/good_news/",
            "score": 34,
            "selftext": "I finally nutted up (and took a whole xanax so I wouldn't flake out *again*) and told my doctor that I was having a lot of problems with anxiety and depression and that I was having some pretty severe flashbacks since adopting my kids from foster care. He asked if I wanted someone to throw pills at me or a therapist. I've tried almost all the pills and while they help the depression somewhat, it doesn't get rid of the panic attacks. The one therapist I did see was great, but related to my adopted kids' therapy group, which made it hard to trust her. \n\nHe said \"ok, do you want a male or female?\"\n\n\"Male. I don't feel comfortable with female doctors.\" (which is kinda weird because I'm a girl. I always feel judged with girl drs even though a couple are some of my favorite friends.)\n\nSo my Dr. says \"Well, my brother is a therapist who deals with adoption cases, foster children, and works with a lot of church groups. What do you think?\"\n\nOMG, that sounds perfect! This doctor is the only one I really feel comfortable with and there's another one of him that handles the issues I need as a special needs foster/adopt parent. \n\nFinally, I can get some treatment for me! Yay!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Good news! ",
            "url": "http://www.reddit.com/r/Anxiety/comments/y17g0/good_news/"
        },
        {
            "author": "hmwith",
            "author_created_utc": 1313559340,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ojdt",
            "created_utc": 1344731120,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y2kp3/does_caffeine_affect_your_anxiety_levels/",
            "id": "y2kp3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 58,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y2kp3/does_caffeine_affect_your_anxiety_levels/",
            "score": 30,
            "selftext": "I can hardly finish a Mountain Dew. It really kicks my anxiety into high gear. Anyone else?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does caffeine affect your anxiety levels?",
            "url": "http://www.reddit.com/r/Anxiety/comments/y2kp3/does_caffeine_affect_your_anxiety_levels/"
        },
        {
            "author": "frisky_business2",
            "author_created_utc": 1312602758,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5mj9b",
            "created_utc": 1344648738,
            "domain": "webchat.snoonet.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y10gx/hey_guys_theres_an_anxiety_chatroom_on_snoonet/",
            "id": "y10gx",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y10gx/hey_guys_theres_an_anxiety_chatroom_on_snoonet/",
            "score": 20,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Hey guys, there's an anxiety chatroom on snoonet for everybody if you want to talk, rant, socialize, or whatever. Look for #anxiety at the bottom.",
            "url": "http://webchat.snoonet.com/"
        },
        {
            "author": "mercurymac",
            "author_created_utc": 1343824965,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8iuyr",
            "created_utc": 1344418920,
            "domain": "suddenlysomethingreallyinteresting.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xvh89/18_therapy_101_suddenly_something_really/",
            "id": "xvh89",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xvh89/18_therapy_101_suddenly_something_really/",
            "score": 19,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/9-zTBy3EHGgDMh5D.jpg",
            "title": "18 Therapy 101 « Suddenly Something Really Interesting",
            "url": "http://suddenlysomethingreallyinteresting.wordpress.com/2012/08/08/18-therapy-101/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344775497,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y3ayi/omega_3_helped_me_why/",
            "id": "y3ayi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y3ayi/omega_3_helped_me_why/",
            "score": 18,
            "selftext": "I started taking omega 3 (V-pure brand because its from algae not fish - I'm vegetarian) and my anxiety is SO much better.\nIt's not perfect, but now I can sooth myself whereas before I could not. \n\nI know when I have missed doses because I wake up in the night and I have anxiety again. \n\nWhy would this help so much?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Omega 3 helped me... why?",
            "url": "http://www.reddit.com/r/Anxiety/comments/y3ayi/omega_3_helped_me_why/"
        },
        {
            "author": "Talima",
            "author_created_utc": 1336482637,
            "author_flair_css_class": "",
            "author_flair_text": "GAD, OCD",
            "author_fullname": "t2_7o0yk",
            "created_utc": 1344954501,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y7c22/a_small_victory/",
            "id": "y7c22",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y7c22/a_small_victory/",
            "score": 16,
            "selftext": "Hi all - just wanted to share a small victory that happened recently. I have a big fear of authority, so interacting with my boss at work sometimes can be really, really difficult. I just get sick to my stomach, cold sweats, the works. Every few weeks I have to submit articles that I write for her approval. Every time I have to do this, I get so unspeakably nervous, since she loves to make edits and generally tear apart my work. I am horrible at taking criticism, it makes me so ashamed I just want to go hide and cry.\n\nYesterday, I had copy due, but she wasn't in her office when I dropped it off. It was about an hour and 1/2 till I went home, and I knew she probably wouldn't get it back to me before I left. Still, I waited on tenterhooks, expecting her to come barging into my office at any moment and tell me what a shitty job I did.\n\nQuitting time rolled around and I still hadn't heard from her. I went home. At home, I started worrying about how badly she'd tear me apart the next day, how much criticism I'd get on the article, etc.  I started worrying that the reason she didn't get it back to me was because I did such a horrible job that it needed a re-write. BUT. Here's where the progress comes in.\n\nAwhile ago, my therapist told me that there's no sense in worrying about something that hasn't happened yet, because it's all just made up. For example, I don't KNOW that my boss is going to rip me apart, I ASSUME she's going to, but because it hasn't happened yet, I'm really just making shit up to make myself feel worse. \n\nSo, last night, when the anxious thoughts started creeping in, I told myself \"Look. You don't know that she is going to have any major issues with it, you're just making things up. You're imagining what MIGHT happen, when you should really just wait for the actual outcome before getting worried. There is a proper time and place to address that, and in bed at 11PM is not the time or place. Whether she ripped it apart or not, I'll have 8 hours at work tomorrow to deal with it. I don't need my precious time at home consumed by this.\" And so, I stopped worrying. It felt dirty to not worry. Like it was too easy. And the \"what ifs\" were just outside my conscious thoughts. But I decided to focus on other things, like my husband, or the book I was reading. Eventually I fell asleep, worry-free!\n\nAnd the best part of all this? I came in today to a simple \"OK\" on the top of my article. No edits, no ripping me apart. Just approval. I was SO GLAD I was able to talk myself out of worrying last night. It really just proved that my therapist was right - worrying about the future is pointless. 9 times out of 10 it won't happen the way you imagine and you get yourself riled up about nothing. \n\nAnyways, that's my small victory. :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A Small Victory :)",
            "url": "http://www.reddit.com/r/Anxiety/comments/y7c22/a_small_victory/"
        },
        {
            "author": "girloncouch",
            "author_created_utc": 1298145854,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4v5kk",
            "created_utc": 1344771285,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y39ff/looked_to_see_if_this_subreddit_existed_while/",
            "id": "y39ff",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y39ff/looked_to_see_if_this_subreddit_existed_while/",
            "score": 16,
            "selftext": "and it does! Thanks reddit! I have been struggling with anxiety and panic attacks for about 5 years now, and it seems like every time I learn my triggers and start controlling them it all changes. The last few nights I have been having anxiety that's been keeping me awake for hours leading up to having a big panic attack tonight. Usually talking to and cuddling with my husband helps but he is dead asleep right now. It's nice to know that there is a late night community that I can reach out to now.\n\nOne of the strategies I used to help myself tonight was to go on Web MD and read the list of PA symptoms. I've read it before of course, but it always seems to help me feel less like I'm dying etc.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Looked to see if this subreddit existed while having a panic attack...",
            "url": "http://www.reddit.com/r/Anxiety/comments/y39ff/looked_to_see_if_this_subreddit_existed_while/"
        },
        {
            "author": "stoppanicmode",
            "author_created_utc": 1343254703,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8g9hz",
            "created_utc": 1344464446,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xwmqv/the_source_of_all_my_anxieties_my_father_the/",
            "id": "xwmqv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xwmqv/the_source_of_all_my_anxieties_my_father_the/",
            "score": 15,
            "selftext": "I have known for a long time that the asshole of my father who abused me verbally and physically (not sexually) is the root source of all my issues that stem from G.A.D.\n\nToday I was listening to the lyrics of *Linkin Park's Numb* and I had one of those **HOLY FUCK** moments, great songs describing my life.\n\nI need to let go.\n\nStill a great song, strangely enough it empowers me.\n\nhttp://www.youtube.com/watch?v=GfrIipujxfQ\n\n\n\n\n*I'm tired of being what you want me to be*\n\n*Feeling so faithless, lost under the surface*\n\n*I don't know what you're expecting of me*\n\n*Put under the pressure of walking in your shoes,*\n\n*Caught in the undertow, just caught in the undertow,*\n\n*Every step that I take is another mistake to you,*\n\n*Caught in the undertow, just caught in the undertow*\n\n\n*I've become so numb, I can't feel you there*\n\n*Become so tired, so much more aware*\n\n*By becoming this all I want to do*\n\n*Is be more like me and be less like you*\n\n\n*Can't you see that you're smothering me?*\n\n*Holding too tightly, afraid to lose control*\n\n*'Cause everything that you thought I would be*\n\n*Has fallen apart right in front of you,*\n\n*Caught in the undertow, just caught in the undertow,*\n\n*Every step that I take is another mistake to you,*\n\n*Caught in the undertow, just caught in the undertow,*\n\n*And every second I waste is more than I can take!*\n\n*I've become so numb, I can't feel you there*\n\n*Become so tired, so much more aware*\n\n*By becoming this all I want to do*\n\n*Is be more like me and be less like you*\n\n\n*And I know I may end up failing too*\n\n*But I know you were just like me with someone disappointed in you*\n\n\n*I've become so numb, I can't feel you there*\n\n*Become so tired, so much more aware*\n\n*By becoming this all I want to do*\n\n*Is be more like me and be less like you*\n\n\n*I've become so numb, I can't feel you there*\n\n*I'm tired of being what you want me to be,*\n\n*I've become so numb, I can't feel you there*\n\n*I'm tired of being what you want me to be*",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The source of all my anxieties: my father (the asshole)",
            "url": "http://www.reddit.com/r/Anxiety/comments/xwmqv/the_source_of_all_my_anxieties_my_father_the/"
        },
        {
            "author": "hanzersbananzers",
            "author_created_utc": 1328335994,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6u381",
            "created_utc": 1344663080,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y1c92/oh_god_the_crowds/",
            "id": "y1c92",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y1c92/oh_god_the_crowds/",
            "score": 14,
            "selftext": "I'll be going back to school soon, and while I enjoy learning and seeing people I know, I also know that this will mean football games and assemblies and crowded hallways and just a lot of people in general.\n\nThis terrifies me to no end.\n\nI don't know why, but I've had this thing about being in a group of people, for a while. Even in class, I feel uncomfortable. I always feel as if I'm about to puke (one of my biggest fears, throwing up in public) and I always feel dizzy, and I psyche myself out even though physically there isn't anything wrong with me. \n\nHowever, I'd like a way for me to really be able to focus this year, because this year in school for me is very important. I'm sure others have experienced this, or just have general advice.\n\nAnything helps :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Oh God, the crowds.",
            "url": "http://www.reddit.com/r/Anxiety/comments/y1c92/oh_god_the_crowds/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344828577,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y4jcp/help_i_need_to_talk_about_some_deep_shit_for_the/",
            "id": "y4jcp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y4jcp/help_i_need_to_talk_about_some_deep_shit_for_the/",
            "score": 14,
            "selftext": "So for as long as I can remember (since I was about 8 or 9, I'm 18 now) i've been worrying. when i was little i couldnt stop thinking about death (my own personal death, friends family etc.) and i was scared shitless all the time. now that i'm older (18 years old) its gone from death to EVERYTHING. school, job, girls, car, music, myself, anything and everything. I haven't been able to see a therapist or anything because of my dad. I finally worked up the courage to go ask him for help (i was worried that he wouldn't believe me) i went to him with and showed him a website explaining General Anxiety Disorder and told him that this was how i felt all the time since i was little, and all he said was \"try not to diagnose yourself with the internet\" or something to that extent and wouldnt help me out. that was several months ago and nothing has been done since. I feel lost and helpless and pretty depressed, and theres no hope in sight for me. the anxiety builds up inside me and the only way i can let it out is through anger. and lots of it. it doesnt take much to set me off or annoy me. I'm trying to reach out for help, i hate feeling like this all the time. is there anything i can do?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] I need to talk about some deep shit for the first time",
            "url": "http://www.reddit.com/r/Anxiety/comments/y4jcp/help_i_need_to_talk_about_some_deep_shit_for_the/"
        },
        {
            "author": "jetlifemanuva",
            "author_created_utc": 1316965520,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5x7hi",
            "created_utc": 1344916806,
            "domain": "anxietyunderground.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y6nzr/anxiety_underground_seriously_a_great_forum_and/",
            "id": "y6nzr",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y6nzr/anxiety_underground_seriously_a_great_forum_and/",
            "score": 14,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/kCoDJK0xMPbk-QDc.jpg",
            "title": "Anxiety Underground - Seriously, a great forum and superb live chat.",
            "url": "http://www.anxietyunderground.com/"
        },
        {
            "author": "duckofdeath87",
            "author_created_utc": 1343440899,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8h74g",
            "created_utc": 1344717238,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y28ru/going_places_and_people_knocking_on_my_door/",
            "id": "y28ru",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y28ru/going_places_and_people_knocking_on_my_door/",
            "score": 13,
            "selftext": "Ok, so... when someone knocks at my door (I live alone) I usually freak-out, try to be as quite as possible, and hide on top of my washing machine. Sometimes I have nightmares where someone  I don't know is in my house. They never do anything, they just are there. One time my mother came to visit and slept in the next room. I ended up being so freaked out I yelled at her. I usually eat of a lot of antacid because of how stressed out I always am. \n\nI can only seem to go to the store and work. If I try to go somewhere else I usually get really nervous and turn around and go home. I get lonely sometimes, so I tried to go bars and places, but I always feel so terrible and I think, that it feels better just to stay home. I drink a lot at home, and that makes me feel better. Even when I go to the store, I have to walk around a while to calm down and look at a lot of stuff before I buy anything. I don't makes lists, because if I do i usually psych myself out and decide I don't need anything anyway.  \n\nWork is alright. It is a desk job at office with thousands of other people and I work with a lot of different people, but it is usually ok. I am good at what I do, so maybe that is how I deal with it. Maybe its because things are rather formal. I am not sure why. If we have a large meeting and everyone is leaving at the same time, that is usually frightening. \n\nI have never actually told anyone any of this. I just wanted to get it out there. Thanks for reading.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going places and people knocking on my door.",
            "url": "http://www.reddit.com/r/Anxiety/comments/y28ru/going_places_and_people_knocking_on_my_door/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344910061,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y6gzs/rant_bullying_victim_in_the_90s_married_life_in/",
            "id": "y6gzs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y6gzs/rant_bullying_victim_in_the_90s_married_life_in/",
            "score": 13,
            "selftext": "I'll try to keep this as condensed as possible. (This is also my 1st post)\n\nI'm 26 years old, I live in the crime-infested island of Puerto Rico and I was bullied all my school life (1990-2003), not physically, but psychologically. I was different...but I wanted to be like everyone else, because obviously I didn't want to be myself. Bullying made me a fearing person, I was always afraid of walking in front of groups of people for fear of being ridiculed, afraid of rejection, afraid of loneliness, everyday was hell for me. Everyday I worried, I cried, I was depressed. All this worrying kept snowballing to the point where the only thing in my mind was \"how am I gonna f*** up now?\" so now I blamed myself, because I had no self esteem.\n\nAs a defense mechanism, I developed a heightened sense of empathy. I figured that if I was nice to everyone, then I'll make friends, but I kept my emotions out of the equation. I don't like the idea of people feeling the same way I do, so I avoid any situation in which another person may feel uncomfortable, regardless of what I feel, and that's a big problem, I have no self respect.\n\nFlash forward to 2012.  All my feelings of fear, worry, anxiety, depression, obsession are still there, messing with my mind.  Now I'm a married adult (she asked me to be her b/f...I was too afraid to ask) with a 5 year old son.  I've been married for 6 years and I've never had a fight with my wife (we've had our discussions...but I have never even raised my voice to her).  Some may see this as a blessing, but the only reason we don't fight is because I **fear** that if we fight she wont talk to me, then I **worry** that she might just gtfo, which in turn causes **depression** because I could've avoided it by shutting the f*** up.  Even if a conversation ends in either of us just being disappointed, I apologize, because I have no **self respect**, and I keep apologizing to the point where she's pissed. This causes me to repress EVERYTHING, I wont fight anyone (even when provoked), I wont stand up for myself, and it's hard as hell living like this, everything keeps accumulating, I can't sleep at night because I'm angry, angry at myself.\n\nIf you're being (or have been) bullied never lose your self respect, it's a hard thing to come by these days.\n\nI have coping mechanisms which had gradually helped me throughout the years...but this post is long already...just ask and I'll answer.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] Bullying victim in the 90's, married life in the 2010's",
            "url": "http://www.reddit.com/r/Anxiety/comments/y6gzs/rant_bullying_victim_in_the_90s_married_life_in/"
        },
        {
            "author": "ixregardo",
            "author_created_utc": 1300678669,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_4zlgj",
            "created_utc": 1344785048,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y3fz0/dae_go_into_an_emergency_mode_that_shuts_down/",
            "id": "y3fz0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y3fz0/dae_go_into_an_emergency_mode_that_shuts_down/",
            "score": 13,
            "selftext": "This has happened to me a few times, and it's always when the event or whatever is just SO big and SO hard to manage that I know I won't make it through unless I shut off my anxiety. \n\nFor example, I studied abroad in Japan. I had a ridiculously long flight and a busy orientation and lots of phobias around food poisoning, lack of sleep, insomnia, and so on. But it was just so outside of my comfort zone that I was like, NOPE, I'm not going to be anxious. And it worked!\n\nOf course, it never works in familiar or semi-comfortable situations, like when I can't sleep on a weeknight and have to go to work (or graduate from college!! :P) the next morning. It's only in serious \"emergencies\" like that, and it's all very subconscious. \n\nAnyone else have this? Did you find a way to tap into it in more familiar situations as well? Just curious :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE go into an \"emergency mode\" that shuts down your anxiety symptoms for a bit?",
            "url": "http://www.reddit.com/r/Anxiety/comments/y3fz0/dae_go_into_an_emergency_mode_that_shuts_down/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1344540988,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xyeds/panic_attack_while_leaving_the_therapists/",
            "id": "xyeds",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xyeds/panic_attack_while_leaving_the_therapists/",
            "score": 12,
            "selftext": "I had my second session with my therapist today. The first one left me feeling really good and hopeful, but this one was a little bit harder. I'm trying to be as open as possible to everything she says. We were discussing how I need to learn to accept certain things. I agreed with her, but I kept explaining that even though I believe that that's true, I don't know how to actually do it. I can tell myself to accept things, but it seems to never actually happen. I still get really upset.\n\nI guess I sort of felt like she was really frustrated at me at one point. She kept telling me the key was acceptance, and I would say, \"But how do I do that?\" and she'd say, \"I just told you! Acceptance!\" I stopped questioning it and just forced myself to consider that I could accept something, without automatically telling myself that I can't, even if I want to. I felt a little bit better then, and like I was understanding more of what she was saying. She never looked angry, or yelled, but it seemed like she irritated at me. Of course, I tend to take things personally, so I don't know that this was at all true, but it affected me a little bit.\n\nWhen I left, I felt like crying, but I couldn't really explain why. As soon as I started crying, in the car, I thought to myself how stupid I was for *crying*, and then immediately decided that was *not* the right thing to do. I began repeating to myself that it was okay, that things will be okay, that things are getting better, only positive things. But then I started hyperventilating and it was a battle to get myself under control. As soon as I started hyperventilating, my hands and feet went numb, I got incredibly dizzy and my vision started to go. *I was driving*. I immediately started figuring out how to get off the road, while also trying to maintain my breathing. I was in the middle lane of three lanes and there were cars on either side of me. Plus, I was so dizzy, I could hardly see or concentrate, so I made the decision *not* to pull off the road and just slowed way down. I finally got my breathing under control and slowly became less dizzy as I drove with complete diligence. My limbs were still tingly minutes later.\n\nWhat the hell? I've had panic attacks before, but usually after I've been emotionally crazy for a little white, and this is only the second one I've ever had that hit me and just seemed like it took over my entire body immediately. It was scary -- being behind the wheel meant my life, and other's lives, were in danger. How could a *therapy* session trigger the worst panic attack I've had since I was 17? Is this normal? Do I tell her about it? Is this is a really bad sign, or does it mean I'm just working through my problem? Any advice at all? I'm still shaken up.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Panic attack while leaving the therapists.",
            "url": "http://www.reddit.com/r/Anxiety/comments/xyeds/panic_attack_while_leaving_the_therapists/"
        },
        {
            "author": "trekkey321",
            "author_created_utc": 1327896235,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6sfdi",
            "created_utc": 1344554904,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xytj9/thank_you_ranxiety/",
            "id": "xytj9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xytj9/thank_you_ranxiety/",
            "score": 11,
            "selftext": "In the midst of another anxiety attack - one of the worse this month - I took to my phone, and subsequently Reddit looking for a distraction. Then, I wondered what if? To which I discovered there IS an r/anxiety reddit! \n\nAfter browsing, I am now in tears - but not necessarily the bad kind. There are others, many others, who I can relate with and know what I'm going through. Still having the attack, but feeling much better. \n\nThank you for existing r/anxiety, and thank you everyone who posts and participates (even just upvotes for social anxiety types). It means the world, and I'm sure other's and my sanity. \n\nTLDR:  In the middle of an anxiety attack discovered r/anxiety. Thank you for existing.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thank you r/anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/xytj9/thank_you_ranxiety/"
        }
    ]
}