{
    "data": [
        {
            "author": "creepycrawl",
            "author_created_utc": 1337731426,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_7sa2c",
            "created_utc": 1345340808,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ygcqo/dae_browse_reddit_to_distract_themselves_when/",
            "id": "ygcqo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ygcqo/dae_browse_reddit_to_distract_themselves_when/",
            "score": 158,
            "selftext": "There's so much to read and see; I feel like it helps occupy my mind so that I'm not so overly focused on my fears.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE browse reddit to distract themselves when feeling anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ygcqo/dae_browse_reddit_to_distract_themselves_when/"
        },
        {
            "author": "whytofly",
            "author_created_utc": 1308858984,
            "author_flair_css_class": "test",
            "author_flair_text": null,
            "author_fullname": "t2_5f1wp",
            "created_utc": 1345250080,
            "domain": "buttersafe.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yemeb/technically_this_comic_has_nothing_to_do_with/",
            "id": "yemeb",
            "is_self": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yemeb/technically_this_comic_has_nothing_to_do_with/",
            "score": 94,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/-0Z5p252RhqlJljC.jpg",
            "title": "Technically this comic has nothing to do with anxiety, but I can really relate to this little squid.",
            "url": "http://buttersafe.com/2012/08/16/the-seasick-squid/"
        },
        {
            "author": "dweckl",
            "author_created_utc": 1253638522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3n51i",
            "created_utc": 1345432940,
            "domain": "self.Anxiety",
            "edited": 1345465198,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yi6pa/hey_anxious_redditors_the_key_to_all_successful/",
            "id": "yi6pa",
            "is_self": true,
            "media_embed": {},
            "num_comments": 54,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yi6pa/hey_anxious_redditors_the_key_to_all_successful/",
            "score": 93,
            "selftext": "YOU NEED TO STOP FUCKING LISTENING TO *YOURSELF.*  **STOP LISTENING TO YOURSELF!!!**  \n\nYou are a liar.  Did you know that?  There is a part of your brain that is a compulsive, pathological, incessant, unstoppable liar.  Every day, from the moment you wake until you pass out with your heart racing and feet rubbing together, a voice in your head is lying to you.  \n\nAnd the worst part about is that every day, from the moment you wake until you pass out, you fucking listen to that voice!  Here is what's going on: \n\nLong ago humans evolved the ability to think on an incredible level.  But this new brain did not replace the old one; instead, it grew on top of it.  We still have many, probably close to all, of the primitive functions that even simple animals have.  You eat, shit, fuck, and fear not much unlike a goddamn squirrel.  \n\nYou have inside your brain a primitive emotional system designed to provide short-term motivation to do things necessary to keep you alive or to reproduce.  Fear exists because it helps keep life living: something that's afraid will drop everything and run the fuck away, or fight to the death, better than something that's not, as a general principle. \n\nThe problem with you and me is that our primitive emotional system is entangled with our advanced upper-brain.  It's not just the angry bear standing in front of you that causes anxiety, it's the *thought* of an angry bear that causes an identical reaction in you.  \n\nLet me repeat that last point:  your thoughts can cause you anxiety to the same degree as if you were actually experiencing a dangerous event.  People who have panic attacks know this all too well - there could be literally nothing dangerous in front of them in the real world, but their mind will react to a thought - a goddamn fairy tale in their mind - as if they were facing actual danger. \n\nI think most people have a thought-system that creates and fires off negative thoughts by the dozens each day.  Some people aren't really aware of their negative thoughts until they really focus on them, though, because they can happen really, really fast and can be going on behind the scenes without the type of focus you usually picture when you think about your \"thoughts.\"  These aren't thoughts like the thoughts you have when you're trying to solve a math problem.  These are thoughts like fireworks popping off at any moment in your mind, almost from nowhere, but sometimes so feint you can only react to it without being aware that it even happened. \n\nWhat happened beginning in the 1950s with Albert Ellis and Aaron Beck is a new approach to therapy for people with anxiety disorders.  It's goal is to defeat your reaction to the negative thoughts that act like little angry bears in your mind - you learn that the thoughts are just thoughts, and they usually have little or nothing to do with reality.  This is the basis of **cognitive behavioral therapy**, which I did for years and am cured of my generalized anxiety disorder.  I still have anxiety, as does anyone who breathes, but it doesn't even come close to the shit I suffered for 10-15 years before finding a great CBT therapist and reading about it. \n\nSimilarly, **mindfulness** and **mindfulness based cognitive therapy** teach you to ignore, in a way, your thoughts.  Yes, this can be done.  The way I think of it is like this:  imagine you are standing in front of a girl naked, and she is laughing and making fun of you.  And this goes on for hours.  How long until you just don't give a fuck any more?  How long until you realize that her laughter doesn't mean shit to you?  \n\nHow long until you realize that the voice in your head telling you that you will fail, or you will make a fool out of yourself, or people hate you, or that a girl will reject you, or that you're going to get fired, or that you're going to have a panic attack outside and then the whole world will laugh at you, or that you just can't meet your boss' expectations, etc., are just words.  Worthless, meaningless, stupid words. \n\nThe next time you're anxious about something, don't run from the thoughts.  Invite them in.  Let them flow.  Relax your stomach and jaw.  Don't try to breathe more slowly, go with it.  And let the thoughts flow by without reacting to them.  Because it's your thoughts, and not the world out there, that makes you anxious.  \n\nThe cure for anxiety is to cure the way you react to your thoughts.  \n\n**EDIT 1**:   Reading some of the comments saddens me.  This forum is rife with recommendations and discussions of medications and anecdotal stories about what people have said about what people think is happening to them when they have anxiety.  Very, very, very few discussions of successful therapies, links to scientific reports and research, and discussions of therapists.  The reason people don't get better is because what they think is wrong.  Dead wrong.  Stop listening to me and others and GO READ THE GODDAMN RESEARCH.  \n\nPeople who think that the modality is not as important a good therapist of some ineffective modality are dead wrong, and the research proves it.  And it's not mindfulness, it's mindfulness based CBT.  Mindfulness is different.  \n\nPeople who think that anxiety just happens out of the blue are dead wrong, except for those extremely limited situations where someone has a medical issue or drug issue.  Anxiety has thought-based causes, and if you've never dealt with the thoughts, then you aren't aware of them.  Dealing with the thoughts does not mean stopping them, shutting them off, or stifling them, it means understanding them and their relationship to actual reality. \n\nI'm sorry, but anyone who wants to get better needs to look into successful treatment and stop bullshitting around this forum with discussions of medication.  Go to a psychiatrist for medication.  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey, anxious Redditors.  The key to ALL successful therapy modalities, and the literal cure for many anxiety disorders, is this...  ",
            "url": "http://www.reddit.com/r/Anxiety/comments/yi6pa/hey_anxious_redditors_the_key_to_all_successful/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345127070,
            "domain": "qkme.me",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ybkjx/how_i_feel_today/",
            "id": "ybkjx",
            "is_self": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ybkjx/how_i_feel_today/",
            "score": 86,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How I feel today.",
            "url": "http://qkme.me/3qic5n?id=225924107"
        },
        {
            "author": "MakingsOfaBLT",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345048596,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y9nue/agoraphobic_and_taking_myself_to_a_psychiatrist/",
            "id": "y9nue",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y9nue/agoraphobic_and_taking_myself_to_a_psychiatrist/",
            "score": 50,
            "selftext": "I just wanted to share.  Of course I'm nervous but I refuse to give up.  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Agoraphobic and taking myself to a psychiatrist today",
            "url": "http://www.reddit.com/r/Anxiety/comments/y9nue/agoraphobic_and_taking_myself_to_a_psychiatrist/"
        },
        {
            "author": "WadePool",
            "author_created_utc": 1317438701,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5yjfg",
            "created_utc": 1345458213,
            "domain": "self.Anxiety",
            "edited": 1345516755,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yimhb/marijuana_and_anxiety/",
            "id": "yimhb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 112,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yimhb/marijuana_and_anxiety/",
            "score": 47,
            "selftext": "I'm curious about people's experiences with smoking weed to help with anxiety. Personally, for me, it's a goddamn wonder drug. Anxiety fades into the background, panic attacks are virtually unheard from. Also is the ONLY thing that is proven to let me fall asleep when I actually want to- insomnia is a major issue for me. Have to add a disclaimer- for some people it can be like rubbing salt in a wound, so I'm not recommending it to anyone else and trying to smoke while a panic attack is actually happening is a very bad idea.\n\nBottom line- if someone offered me choice between a free month's supply worth of benzos or pot, I'd take the green in a heartbeat.     \n\nEdit- thanks all, I kinda figured most people wouldn't have the same experience as me. Hell, herb causes anxiety in plenty of people who don't has any psych issues :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Marijuana and anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/yimhb/marijuana_and_anxiety/"
        },
        {
            "author": "milensk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345287113,
            "domain": "anxietyadventures.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yf9zm/image_social_anxiety_explained_6_fear_of_being/",
            "id": "yf9zm",
            "is_self": false,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yf9zm/image_social_anxiety_explained_6_fear_of_being/",
            "score": 47,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/EyXdwXd4MiIAViTr.jpg",
            "title": "[Image] Social Anxiety Explained #6: Fear of Being Judged",
            "url": "http://anxietyadventures.wordpress.com/2012/08/18/social-anxiety-explained-6-fear-of-being-judged/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345179849,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yd21s/i_finally_told_my_mom_about_my_anxiety_problem/",
            "id": "yd21s",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yd21s/i_finally_told_my_mom_about_my_anxiety_problem/",
            "score": 42,
            "selftext": "For some background:\nI had mild anxiety problems in high school, nothing too bad as I didn't really try in high school. Things have caved downhill in college. Majoring in architecture, I rarely get any sleep. Being drowned with impossible tasks by an asshole of a professor and even dealing with the intense competition in all my classes- it hasn't been easy! In addition to school, there are the additional problems i've had to deal with such as death of a loved one, getting fired from my job, catching my dad cheating on my mom, a bunch of other shit. All in all, it has been an incredibly shitty year for me.\n\nA combination of all this stuff is what brought me to how i've become today. At first, it was anxiety over something specific that had happened but it soon led to having panic attacks about stupid shit like making a left turn while yielding or picking something in a menu. Making irrelevant decisions. Having constant panic attacks just *thinking* about finals week nearly 2 weeks before. I kept telling myself that it was temporary and would go away once the semester ended but all through summer, it's gotten worse as i've messed up so many important relationships in my life.\n\nI was all about self-healing, positive thinking and meditation. I've been doing yoga 3 times a week all summer and it has helped a bit but I mean I still have a problem. So today, I finally grew some balls and made the decision to do something about it. My mom took it surprisingly well and has been incredibly supportive, as are my close friends. I really do hope things improve...\n\nI do have a question though! When I have a lot of work to get done, just thinking about how much I have to do gives me anxiety and I end up worrying for hours until I realize I don't have much time left to complete the task. I always end up getting things completed and done well as I am really good at working under pressure. But do you guys have any tips for the pointless worrying? Do I have a fear of failure?I've also noticed I have a problem focusing. At times, my brain is a jumble and its like I have too many thoughts so I make lists ALL THE FUCKING TIME. Like at least 5 lists a day haha. They seem to help a bit until I have to start. I don't know...anything else I can do?\n\n*sigh, this felt good getting off my chest*\n\ntl;dr shitty year, anxiety got way worse, finally getting help",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I finally told my mom about my anxiety problem today and am finally seeing a doctor ",
            "url": "http://www.reddit.com/r/Anxiety/comments/yd21s/i_finally_told_my_mom_about_my_anxiety_problem/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345474596,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yiwlx/words_to_live_by/",
            "id": "yiwlx",
            "is_self": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yiwlx/words_to_live_by/",
            "score": 40,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Words to live by ",
            "url": "http://imgur.com/JPgH3"
        },
        {
            "author": "OldJunkie",
            "author_created_utc": 1329526198,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ya1u",
            "created_utc": 1345240226,
            "domain": "self.Anxiety",
            "edited": 1345249792,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yedf2/rantboth_my_sisters_basically_told_me_i_need_to/",
            "id": "yedf2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yedf2/rantboth_my_sisters_basically_told_me_i_need_to/",
            "score": 32,
            "selftext": "My Info:\n18 M on Zoloft 100mg and Klonopin 1mg\nAlso seeing therapist and psychiatrist.\n\nThe title says it all, and I'm really pissed off.  This post is just for me to vent about how fucking much it pisses me off that people think that way.   \n\nNot only that it makes me feel like I'm just doing this to myself.  Even though I know I'm not.  I hate the fact that I need their fucking support, and that their way of thinking bothers me this much.  I never thought I would care so much about their opinions.  The thing that probably hurts me most is that they believe that I'm just doing this to myself. Fucking family fucking people fucking life.\n\nWell I feel better just typing this out, they can both go fuck themselves.\n\nEdit: Thank you for the support. Internet hugs for all.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant]Both my sisters basically told me I need to think more positively and involve god instead of hospital and pills.",
            "url": "http://www.reddit.com/r/Anxiety/comments/yedf2/rantboth_my_sisters_basically_told_me_i_need_to/"
        },
        {
            "author": "torrosie",
            "author_created_utc": 1319131477,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_62zkr",
            "created_utc": 1345392235,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yh4zm/rant_first_haircut_in_10_months/",
            "id": "yh4zm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yh4zm/rant_first_haircut_in_10_months/",
            "score": 32,
            "selftext": "My hair was getting out of hand.  I have a wedding to attend next week, so I thought I better bite the bullet and just get it done.\n\nI thoroughly researched the place online, then spent about an hour scoping it out, pacing around, and smoking.  I went in once, then walked out, waited another 30 minutes and went in again.\n\nThe place was playing loud music, which I was grateful for - anything to make people talk less is good in my books.  I told the stylist that I wanted just a trim, and to have my bangs level with my eyebrows, nothing fancy.  I could see that she was going to cut off too much, but I didn't want to say anything (would she get mad?  distant?  think I didn't communicate clearly the first time?  think I'm a bad customer?) so I just went with it.  Now I'm at home, looking at myself in the mirror, and hating it.\n\nMy bangs are definitely crooked, and my friend says its no big deal, just go back and get them to correct it.  I just can't bring myself to do it.  I spent so long building up the courage to get it done, I feel exhausted.  My mind races with the possible conversations I would have to have.  All the explaining, and talking, and possible reactions they might have.  Will they deny it's crooked?  Will they tell me it's too bad because I said it was okay at the time?  Will they ask for proof I got it cut there?  (I don't have a receipt)  Will they do a bad job just because I'm a bother?  I don't know.  I'll just end up trying to fix it myself I guess. This is why I hate doing these things.\n\nPeople always tell me to just do things - it's not that hard.\n\nBut it *is* hard.  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] First haircut in 10 months",
            "url": "http://www.reddit.com/r/Anxiety/comments/yh4zm/rant_first_haircut_in_10_months/"
        },
        {
            "author": "themetz",
            "author_created_utc": 1321165409,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_68fsg",
            "created_utc": 1345515832,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yk4s9/request_can_we_please_maintain_the_integrity_of/",
            "id": "yk4s9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yk4s9/request_can_we_please_maintain_the_integrity_of/",
            "score": 31,
            "selftext": "Let's keep it a place for advice, help, and discussion. There has been an influx of pictures and links to quotes which I feel \"cheapens\" the mature quality of this subreddit. There are other subreddits for pictures and inspirational quotes. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Request] Can we please maintain the integrity of /r/anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/yk4s9/request_can_we_please_maintain_the_integrity_of/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345096003,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yb1xt/anyone_else_have_a_fear_of_driving_and_got_over_it/",
            "id": "yb1xt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yb1xt/anyone_else_have_a_fear_of_driving_and_got_over_it/",
            "score": 30,
            "selftext": "I don't know what it is but I get horrible panic attacks driving on the highway or driving in an unkown area. My friend is going with me to make me feel comfortable with driving in this certain area I need to go for work. If you were ever anxious about driving what helped you? I am taking Zoloft and Xanax because I am extremely desperate and bills rely on this. *note* not even the zoloft is making this any easier..",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else have a fear of driving and got over it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/yb1xt/anyone_else_have_a_fear_of_driving_and_got_over_it/"
        },
        {
            "author": "Wichelle",
            "author_created_utc": 1328321593,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6u19e",
            "created_utc": 1345040013,
            "domain": "m.psychologytoday.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y9fin/mice_who_got_the_probiotics_were_in_general_more/",
            "id": "y9fin",
            "is_self": false,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y9fin/mice_who_got_the_probiotics_were_in_general_more/",
            "score": 27,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/l5cW7US621hSKyQ5.jpg",
            "title": "Mice who got the probiotics were, in general, more chilled out than the control mice.  The probiotic mice had lower levels of corticosteroid release in response to stress.",
            "url": "http://m.psychologytoday.com/blog/evolutionary-psychiatry/201206/do-probiotics-help-anxiety"
        },
        {
            "author": "AeginetanTurtle",
            "author_created_utc": 1342630937,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8dfzn",
            "created_utc": 1344975759,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y7zir/dae_feel_anxious_about_not_being_really_anxious/",
            "id": "y7zir",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y7zir/dae_feel_anxious_about_not_being_really_anxious/",
            "score": 26,
            "selftext": "I just started treatment (meds + therapy) for depression and GAD, and a new major source of anxiety for me is that my health care providers don't believe me -- I worry that I'm just whiny, it's just first world problems, I'm somehow faking it, I'm not sick enough, it's all in my head, etc.  \n\nIt's making me not want to continue treatment, but rationally I know that at least my prescribing doc thought the issues were serious enough for meds.  I have had bad experiences with doctors and therapists before, so this is not really coming out of nowhere.\n\nCan anyone sympathize?  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel anxious about not being \"really\" anxious or sick?",
            "url": "http://www.reddit.com/r/Anxiety/comments/y7zir/dae_feel_anxious_about_not_being_really_anxious/"
        },
        {
            "author": "lizzardx",
            "author_created_utc": 1320702828,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_677su",
            "created_utc": 1345391170,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yh46v/something_uplifting_perhaps/",
            "id": "yh46v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yh46v/something_uplifting_perhaps/",
            "score": 25,
            "selftext": "So I'm taking it slow with the praise, I do feel better after getting an rx from my doctor (Celexa and xanax). I know it will take a while to kick in, but for right now... Oh dear Flying Spaghetti Monster. This is the best night's sleep i've ever had. Usually I take 10mg (which seems high to me... anyone else?) of Melatonin, and I fall asleep after an hour or two (usually having to take more...) and then I dream like crazy which can be cool, but I'm always waking up in the middle of the night. \n\nThese last couple of nights i've been out like a log. Deep sleeps, where i actually wake up feeling refreshed. \n\nALSO! and this is the big one! Last night there was a stranger (roommates friend) on my couch. I was in a bad mood because I was tired got out of work at two in the morning and drove home and he was in my parking spot. strike one. Then i get inside and he's using my blanket that I leave downstairs (for dr who marathons and the like) and no one had asked me. strike two. so im steamed. i get some water go upstairs and bitch to my fiance and then do you know what happened? I took some deep breaths and calmed down. I actually admitted I was overreacting (which NEVER happens!!!!!) \n\nFeeling uplifted and cautiously optimistic. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something uplifting perhaps?",
            "url": "http://www.reddit.com/r/Anxiety/comments/yh46v/something_uplifting_perhaps/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1345411974,
            "domain": "self.Anxiety",
            "edited": 1345432025,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yhmvy/constant_negative_rumination_after_social/",
            "id": "yhmvy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yhmvy/constant_negative_rumination_after_social/",
            "score": 24,
            "selftext": "Hi Anxiety Reddit, \n\nI have had this problem for a really long time. It tends to involve social situations that do not go 100% in my favor. I tend to play out 'what if's' and 'I should've' - what if I said that, what if I did that, I should've said that, I need to stand up for myself more, I need to interject more, I need to be more assertive. It's a constant wheel of repetition. It often last for days. At worst, it's weeks after a single negative social interaction.\n\nThis has been an issue since I was a child, and has gotten worse as I've gotten older. I believe my earliest memories of me doing this has been around 1st grade. I believe my issue is related to genetics and bad parenting that contributed to an anxious life style.\n\n**Example 1:** The other day me and my SO went to the local museum and the cashier asked \"Are you a student? Students with their student ID get a discount!\" \n\nI was a student once at the college listed on my ID. I'm not a student there anymore, graduated with a master's in experimental psychology, working in a neuroscience lab now and taking a few phd level classes elsewhere to see if a phd is up my alley. In any case, I said I was a student and showed the ID of my old school that I still carried in my wallet. \n\nHe says, \"Great! What are you two studying?\"\n\nI say, \"Psychology.\" I didn't want to ho into detail that I have/pursuing/pursued an advanced degree in psychology. Many people tend to look at me funny or not want to talk to me afterwards. Especially since I live in an area where there isn't a lot of college educated individuals. Sometimes I even get backlash for it. For example, one blue collar guy went on a rant involving, 'So you think you're better than me, huh!?' No, I don't sir, I say. Sometimes, I feel bad mentioning I have an advanced degree where I live. I only feel proud when I can talk about scientific topics to like minded others, where I don't have to be ashamed. My SO says I act ashamed of my intelligence, drive and accomplishments.\n\nMy SO says, \"Finance.\"\n\nThe cashier, \"I hate psychology. That's the worst subject! Finance, I understand that. I don't like psychology. I'd get into analyzing my head and others. I think it's ridiculous. Finance good, Psychology bad...... at least for me.\" His speech was in front of a line of people behind me that extended a good 20 feet.\n\nNeedless to say, I let his little tirade bug me for the better part of 48 hours. I constantly ruminate on it with things like I should've interjected and been assertive about my field, or mentioned that I'm not a 'lowly undergrad,' as my other grad school friends humorously put it. Other times I just let the event play out in my head like a broken record. I kept hearing, 'psychology is the worst subject!' over and over again. Dedicating six plus years to a craft, science, and knowledge and have someone say that made me a bit upset.\n\nWith my educational background and knowing what's going in my head, I should have the power to stop ruminating. I guess it's easier said than done with me. I'm no clinician, perhaps I need professional help. My SO and I conclude that I do fine in stressful big situations (e.g. getting the car stuck in the mud, getting lost in a new york city on vacation), but little social interactions with strangers appear to be my kryptonite.\n\n**Example 2:** I went on a camping trip this year, and I used the utility sink to brush my teeth. As I finish up, I see a guy with a few pots and pans in my periphery. As I leave, I nod to acknowledge his presence. He then says rather aggressively \"UTILITY SINK IS FOR WASHING DISHES!\" I walk away to use the bathroom thinking, wow that guy was a real jerk. Maybe I offended him. I don't know. Maybe I should apologize.\n\nI walk back and pass the utility sink and apologize, \"I didn't know it was only for washing dishes. I'm sorry.\" \n\nThe man gruffly says, \"It's alright.\"\n\nI probably shouldn't have apologized and went along my business. I don't know. Assertiveness appears to be a weak link in me. I also wish I knew how to interject more. For the next day or so, I played out the situation in my head over and over again with things I could've said, \"A sink's a sink. Why so serious about dish washing…\" Or some various snarky comment. I feel as if I have a great and witty sense of humor. My SO sees it, students I teach see it, my coworkers see it, my friends see it, but others see a weak person to pick on I feel. If only I had the courage to say such things to break the ice or tension. Instead, I opted to buy a few assertiveness training books on my kindle and read them for hours on end until I fell asleep in my tent.\n\nI'm still not that assertive after reading those books.\n\n**Example 3:** My boss was training me to use a new piece of equipment in the lab. Halfway through the training session, I absent mindedly placed a hand to lean on a very expensive piece of equipment that was in the lab. Roughly $5k.\n\nHe says very quickly, \"Don't lean on that!\"\n\nI looked down embarrassed, and quickly jerked my hand back. \"Oh yeah…\" As i said looking at the floor with a shy smile. Yeah…. the expensive piece of equipment, forgot about that.\n\nHe just laughed and continued with his speech and training.\n\nI kept playing out the thoughts, geez I just blew a promotion that's terrible! I dwelled on that for a day or so. Once again, I should said something funny, \"Oh just testing the sturdiness!\" I missed that opportunity. \n\n-----------\n\nThese are all recent examples. I gave tons of speeches and presentations at school or at conferences, and I never really dwelled on things as much after the fact. I guess because I had almost complete control during speeches. Interactions are a ever flowing dialog, analogous to an ever changing organism. I have little control over them.\n\nI also have this inner urge to express my masculinity, but not to offend. I feel so conflicted. I want to punch somebody, but I know I can't. I want to berate somebody with swear words or just belittle them, but I know that's not right. To the dude in example one, I wish I could brag about all my accomplishments, educate him in some way, and perhaps even yell… but I feel conflicted to do so. So I try to let it go, but instead I just quietly take it and ruminate and hate my life for the next couple of days until the memory slowly dissipates. \n\nI feel as if I was **(1) more assertive (2) less ruminative (3) learn the ability to interject instead of waiting for them to finish saying something relevant to me...** I would then lead a more fulfilling life I believe. It's all easier said than done. Even my boss/mentor in graduate school mentioned I need to stop being so passive and agreeable. It is a problem, that I wish I could stop. \n\nIs there any advice you can give? Should I seek professional help? Are there books you recommend? Do you recommend supplements for this type of anxiety and rumination? I'm not ready for prescription drugs. What type of anxiety would this fit under, anxiety experts? GAD? Social Anxiety? I'm thinking Social Anxiety, right?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Constant negative rumination after social interactions with strangers.",
            "url": "http://www.reddit.com/r/Anxiety/comments/yhmvy/constant_negative_rumination_after_social/"
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1345479951,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yj252/so_i_had_a_job_interview_today_and_woke_up_this/",
            "id": "yj252",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yj252/so_i_had_a_job_interview_today_and_woke_up_this/",
            "score": 24,
            "selftext": "I woke up this morning, drenched in cold sweats. My heart was racing, my thoughts were jumbled, and all I wanted to do was go back to bed and forget about the whole thing. Make up an excuse for why I couldn't make it. \n\nFortunately, I had different plans in mind. I woke up, drank some water, took a small dose of Ativan, and started getting ready. My stomach was still in complete knots, so I grabbed something light to eat and waited until it was time to go. Waiting is a horrible thing for me, I hate having to wait for something (anything) because it makes me incredibly anxious of the outcome. \n\nI can finally feel the effects of the Ativan taking a small hold on me. My nauseousness has gone down, but I still just want to go back to bed and forget about the whole thing. Forget about the job interview, if I do good that means that I'll have to start working again, which means that I could possibly get fired for anxiety, which mea- 'Stop.' I said. 'That's enough. This is what I want, this is what I need right now. This is a perfect opportunity, and if I don't go for it, if I let it slide past me like so many others, nothing will be different'. \n\nI got in my car, and drove 15 minutes to the store I applied at. I met the manager, a really nice, easy-going guy. He walked me around the store (my eyes still focusing on the exit once in a while), and asked me a few questions about what I like to do, where I would like to work in the store, and what I would be doing. It sounded perfect, I would be doing light stocking and cashiering, perfect for someone in my situation. Not stressful, but also a perfect way to open up and start dealing with my anxiety in a more productive and healthy manner. \n\nAfter the short interview, he told me that he liked my appearance, the way I presented myself, and that he would be hiring me. I have to call back tomorrow morning to confirm everything with him and get the process moving along. After shaking his hand and leaving the store, I felt like the king of the world. I drove home with a huge smile on my face, and I felt my happiness and excitability taking over my anxiety. It's been about an hour since that happened, now I'm sitting on the computer, relaxed (although I have a bit of a residual adrenaline rush from earlier, hah). \n\nWhat did I have to be worried about? Nothing, really. I knew it was going to turn out good. But I worry anyway. I'm hoping that this will be an opportunity for me to learn not to worry about what may be. I'm hoping that this job will help me get at least a small social aspect of my life going, and start freeing my mind from the barbed-wire fences that contain it and my anxiety. Am I still nervous about this job? Definitely. It's the first time I've worked in 2 years. Am I going to hide away from it, ignore all the calls back, and just try again in another year? No. I'm going to try my hardest. If it doesn't work out, that's okay, but at least I tried. I didn't sit on my computer day in and day out, I tried something, and it worked out. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So, I had a job interview today, and woke up this morning more nervous that I have been in a while",
            "url": "http://www.reddit.com/r/Anxiety/comments/yj252/so_i_had_a_job_interview_today_and_woke_up_this/"
        },
        {
            "author": "PatrckBateman",
            "author_created_utc": 1319268768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_63e4s",
            "created_utc": 1345519732,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yk8uz/does_anyone_else_feel_like_the_what_ifs_are_the/",
            "id": "yk8uz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yk8uz/does_anyone_else_feel_like_the_what_ifs_are_the/",
            "score": 20,
            "selftext": "My mind simply cannot stop worrying about what might happen in a situation. I don't care how banal the activity, my mind will start racing to any and all bad possible outcomes.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel like the \"what ifs?\" are the worst part?",
            "url": "http://www.reddit.com/r/Anxiety/comments/yk8uz/does_anyone_else_feel_like_the_what_ifs_are_the/"
        },
        {
            "author": "LMGRL",
            "author_created_utc": 1305585373,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_58tqm",
            "created_utc": 1345007377,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/y8wpi/negative_thinking_is_not_preparedness/",
            "id": "y8wpi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/y8wpi/negative_thinking_is_not_preparedness/",
            "score": 18,
            "selftext": "Anyone else struggle to remember this? In times of high stress, I have a tendency to imagine the worst-case scenario, as though that would somehow make me better prepared for the worst-case scenario. It. Never. Works. 100% of the time, envisioning the worst possible outcome has made things more difficult and fraught with challenges. On the occasions when I have envisioned the best possible outcome, it has nearly always led to me not only feeling better about the entire process, but the results are often far better than my negative thinking would have ever allowed me to believe was possible.\n\nI'm curious if other people have experienced this. I'm finding that negative thinking is still tripping me up when demands are exceptionally high, or my resources (sleep, food, medication) are low. I want to start getting back up faster when challenges are thrown in my path, and start reaping the benefits of my positive thinking more often.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Negative thinking is not preparedness.",
            "url": "http://www.reddit.com/r/Anxiety/comments/y8wpi/negative_thinking_is_not_preparedness/"
        },
        {
            "author": "wugtest",
            "author_created_utc": 1326085786,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6m9hw",
            "created_utc": 1345569817,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yl85n/help_feeling_of_impending_doom_knotted_in_my/",
            "id": "yl85n",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yl85n/help_feeling_of_impending_doom_knotted_in_my/",
            "score": 18,
            "selftext": "I've been feeling off in the last three days, like something bad is about to happen or like I'm about to hear news that will devastate me. I can't shake it (alcohol helps, but I don't want to resort to that) and it's really freaking me out.\n\nI mean, it's probably something pedestrian like I'm going to get caught with out transit fare and be fined or my boyfriend is going to end things, but I'm still a little worried something larger will happen like the death of someone close to me or an earthquake of a huge magnitude.\n\nAnyone else ever have this? Anything that I can do to quell these feelings? \n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Feeling of impending doom knotted in my stomach",
            "url": "http://www.reddit.com/r/Anxiety/comments/yl85n/help_feeling_of_impending_doom_knotted_in_my/"
        },
        {
            "author": "feeling_illy",
            "author_created_utc": 1345570458,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8qqoy",
            "created_utc": 1345570813,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yl987/i_forgot_to_take_my_medication_this_morning_and/",
            "id": "yl987",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yl987/i_forgot_to_take_my_medication_this_morning_and/",
            "score": 17,
            "selftext": "Anyone have advice? I don't want to reveal what prescription I'm on, and preferably that I am on any prescription in the first place.\n\nHowever, I don't look sick. I'm just having the side effects of having missed my dose this morning, and feel like crap because of it.\n\nAnyone have advice?\n\nThe medication I am on is Pristiq.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I forgot to take my medication this morning, and I'm not sure what to tell my boss so I may go and grab my dose at home.",
            "url": "http://www.reddit.com/r/Anxiety/comments/yl987/i_forgot_to_take_my_medication_this_morning_and/"
        },
        {
            "author": "electricpastry",
            "author_created_utc": 1341260483,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + OCD",
            "author_fullname": "t2_87cvv",
            "created_utc": 1345093668,
            "domain": "self.Anxiety",
            "edited": 1345093851,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yb017/just_a_story_about_me_going_to_the_grocery_store/",
            "id": "yb017",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yb017/just_a_story_about_me_going_to_the_grocery_store/",
            "score": 16,
            "selftext": "   Today I am going to the grocery store. This makes me very very anxious. I don't know why my anxiety acts up when I go to the store and it is very frustrating. I feel like a am going to throw up. I feel faint, my chest feels like it is on fire. My palms sweat and my heartbeat excelerates. I don't know how to control this\n    I feel like the world is out to get me. I worry that they won't have a certain item that I'm looking for, I'm worried I won't have enough money for the food. I worry about stupid things. I have to physically and mentally prepare myself to go to the market. This angers me. I want to be normal. Why can't I be normal?\nI used to go to the store and do just fine. I don't know what made me act like this but I can't control it. I want this to end! I'm fed up. I mean it's not something I can just avoid. I have to have food to survive. I wish I could be anxious about something else that I actually could avoid like going to the mall, or flying in an airplane. But no\nit has to be this one thing that I used to enjoy doing. I love food. I used to love to shop for it.  \n I don't know what snapped in me that made me like this. I wasn't this bad before. It's like my brain doesn't have anything better to do so it just sits around and tells me to worry about nonsense. Who cares if Aldis is out of avacados? You can just get some \nat Wal- mart. I tell my brain this but it never listens. Hell, I never used to worry about grocery stores not having a specific item, what the fuck happened? My brain just wants me to get worried over something irrational. I have always went to the store and bought avacados.    \nI have never seen them run out of avacados. But my brain wants me to worry\nabout fucking avacados! I wouldn't wish this shit on anybody. It's like having mental cancer. Your sanity is slowly being eaten away and you wonder why the hell an I worried about this? I don't understand and I probably never will. I can't eat right anymore. I can't sleep. Everything just stresses me out. My hair is falling out and I have these awful headaches \nall the damn time. I can just see it now. I wake up. I tell myself I have to go to the grocery store today. The nausea and sweaty palms start to set it. My heart feels like it is going to pound out of my chest. Most people would probably feel this way about normal stuff like going to the prom for the first time. Losing your virginity or having to make a\nspeech. But for me this happens everytime I go to the grocery store. I put on my clothes. I grab the list. I slowly make my way up the stairs. I probably dry heave a couple of times and I haven't even made it out the door. I wait for the person taking me to the grocery to get ready since I don't drive. I pace around frantically. Finally I get into the car. I buckle my seatbelt.\nAnnnnnd we're off!. I try listening to the radio to get my mind off of the situation I'm in. I grip the door handle tightly. We are getting very close now. We are at the stoplight that's next to the store. I see it staring at me. I don't want to go in but I have to.We get to the parking lot. I feel like death. We stop and the engine shuts off. My legs feel like jello. Welp here goes nothing.\nI walk up to the automatic doors and they open. I feel like I am stepping into the depths of hell. I frantically make my way to the first item on my list. I probably dry heave a little more. I continue on to the next item. By this time my anxiety wanes just a bit. I just tell myself to keep going. Before I know it I am done. You can call me stupid and dumb for being like this\nbut let me tell you that anxiety is very real and you should never judge a person with anxiety. What seems like a menial task to one person could be like trying to jump across the Grand Canyon to another.\n\nTL:DR I get very anxious going to the grocery store and it's fucking annoying",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just a story about me going to the grocery store",
            "url": "http://www.reddit.com/r/Anxiety/comments/yb017/just_a_story_about_me_going_to_the_grocery_store/"
        },
        {
            "author": "64BitHell",
            "author_created_utc": 1325288515,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6jr1u",
            "created_utc": 1345226597,
            "domain": "self.Anxiety",
            "edited": 1345227590,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ydyz8/something_happened_to_me_9_months_ago_and_i_am/",
            "id": "ydyz8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ydyz8/something_happened_to_me_9_months_ago_and_i_am/",
            "score": 16,
            "selftext": "This is my first time posting and I thought this would be the best place to start. I need some advise. Thanks.\n\nLast November, I went to hawaii on a business/vacation trip. While there I had a rental car and had gotten the full insurance on it. One afternoon I was drive back to the Office on my day off and I was entering and intersection and could not see that traffic was stopped in the intersection. I stop short and rear ended an older van. Going about 5 mph. We pulled over and inspected our cars. I have a bent license plate and some missing paint. His bumper was slightly bent in. He look at me and said to not worry about it. I asked him if he was sure he did not want to call it in. He said no. I shook his hand and we when our separate ways.\n\nI still reported to the rental car company and told them what happened. They said because I had the insurance that they would handle everything and notify me if anything arises. \n\nSince that day I have been so paranoid that this guy is going to come after me, report me to the police as a hit and run or something like that. The rental car company is going to forget to notify me and That I am going to have a warrant out for my arrest and I am going to end up in jail. I keep checking to see if I can find anything, by checking driving records and what not.\n\nLately the anxiety has been getting worse and I have not slept more then a few hours a night the last 2 weeks. I feel like it happened yesterday and/or my worries came true when nothing has happened.\n\nReddit I need some help. What should I do to over come this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something happened to me 9 months ago and I am still having anxiety over it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ydyz8/something_happened_to_me_9_months_ago_and_i_am/"
        },
        {
            "author": "tracisixx",
            "author_created_utc": 1329880287,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6zhqz",
            "created_utc": 1345479822,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/yj210/inspiration_on_a_anxious_day/",
            "id": "yj210",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/yj210/inspiration_on_a_anxious_day/",
            "score": 16,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/IYTkLb-PP6ymBd3C.jpg",
            "title": "Inspiration on a anxious day",
            "url": "http://imgur.com/CiljK"
        }
    ]
}