{
    "data": [
        {
            "author": "flossydog",
            "author_created_utc": 1353991700,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9q1d8",
            "created_utc": 1356417023,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15ete8/i_recently_explained_to_my_girlfriend_of_3_years/",
            "gilded": 0,
            "id": "15ete8",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15ete8/i_recently_explained_to_my_girlfriend_of_3_years/",
            "retrieved_on": 1413262041,
            "score": 622,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I recently explained to my girlfriend of 3 years that stuffed animals help me with my anxiety. This was her gift to me today. ",
            "url": "http://imgur.com/qIBAF",
            "user_reports": []
        },
        {
            "author": "slothwoman",
            "author_created_utc": 1352874663,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic",
            "author_fullname": "t2_9llad",
            "created_utc": 1356503653,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15ggvq/since_im_not_good_at_explaining_my_feelings_i/",
            "gilded": 0,
            "id": "15ggvq",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15ggvq/since_im_not_good_at_explaining_my_feelings_i/",
            "retrieved_on": 1413259308,
            "score": 388,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Since I'm not good at explaining my feelings, I drew a self-portrait of how my anxiety makes me feel and wanted to share [nsfwish]",
            "url": "http://i.imgur.com/uiYbB.jpg",
            "user_reports": []
        },
        {
            "author": "with_thebirds",
            "author_created_utc": 1355081546,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9ue4x",
            "created_utc": 1356671151,
            "domain": "self.Anxiety",
            "edited": 1356721312,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15k45n/my_anxiety_inspired_tattoo/",
            "gilded": 0,
            "id": "15k45n",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 60,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15k45n/my_anxiety_inspired_tattoo/",
            "retrieved_on": 1413253481,
            "score": 278,
            "secure_media_embed": {},
            "selftext": "http://i.imgur.com/PAgzV.jpg\n\nThe anchor (which I fully understand are become extremely cliche) represents my anxiety...holding me down. \n\nThe three birds represent the song \"Three Little Birds\" by Bob Marley (Don't worry about a thing, 'cause every little thing is gonna be alright) I listen to that song when I am feeling particularly anxious and it makes me feel better. \n\nEssentially, the birds are carrying my worry away:)\n\n**edit** ignore my face in the bottom left picture..I was pretending to be sleeping ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My anxiety inspired tattoo",
            "url": "http://www.reddit.com/r/Anxiety/comments/15k45n/my_anxiety_inspired_tattoo/",
            "user_reports": []
        },
        {
            "author": "Shadylane85",
            "author_created_utc": 1313355098,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5o27y",
            "created_utc": 1356275521,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15bsz7/i_look_at_this_whenever_im_losing_control_of_my/",
            "gilded": 0,
            "id": "15bsz7",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15bsz7/i_look_at_this_whenever_im_losing_control_of_my/",
            "retrieved_on": 1413266372,
            "score": 187,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/q_c7gE1OZP_TnfDF.jpg",
            "title": "I look at this whenever I'm losing control of my anxiety and it helps me to remember that I am stronger than my illness.",
            "url": "http://imgur.com/amzqE",
            "user_reports": []
        },
        {
            "author": "sleepinsilence",
            "author_created_utc": 1355017300,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9u5uy",
            "created_utc": 1356188439,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15a4zl/going_to_see_the_hobbit_today/",
            "gilded": 0,
            "id": "15a4zl",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15a4zl/going_to_see_the_hobbit_today/",
            "retrieved_on": 1413268675,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I'm a bit anxious about leaving the house. And I haven't been around my friends family a lot to be really comfortable with them. But I'm going to try my damn best to have a good time.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going To See The Hobbit Today",
            "url": "http://www.reddit.com/r/Anxiety/comments/15a4zl/going_to_see_the_hobbit_today/",
            "user_reports": []
        },
        {
            "author": "FatDrewLo",
            "author_created_utc": 1304535116,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_56w8h",
            "created_utc": 1356639109,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15j8hn/does_anyone_else_experience_self_perpetuating/",
            "gilded": 0,
            "id": "15j8hn",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15j8hn/does_anyone_else_experience_self_perpetuating/",
            "retrieved_on": 1413254845,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I have lucid moments where I am completely anxiety free and I'm thankful for every minute of it.\n\nHere's the rub: if I notice I'm anxiety free it all rushes back. It happens a lot when I first get up in the morning. I wake up, go about my morning routine, when at some point I realize I'm felling pretty good then BAM anxiety kicks me right in the throat.\n\n\"FatDrew, just 'don't think about it' \". Yeah... and you don't think about warm cookies. You're thinking about them now, aren't you?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else experience self perpetuating anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15j8hn/does_anyone_else_experience_self_perpetuating/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356618455,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15ipp7/does_anyone_else_feels_this/",
            "gilded": 0,
            "id": "15ipp7",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15ipp7/does_anyone_else_feels_this/",
            "retrieved_on": 1413255686,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "Sometimes I feel happy, one second later I feel extremely depressed.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feels this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15ipp7/does_anyone_else_feels_this/",
            "user_reports": []
        },
        {
            "author": "BrandoMcGregor",
            "author_created_utc": 1243680717,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3hw4g",
            "created_utc": 1356532538,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15gvn8/anxiety_free_for_2_years/",
            "gilded": 0,
            "id": "15gvn8",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15gvn8/anxiety_free_for_2_years/",
            "retrieved_on": 1413258639,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "One thing I have noticed is that once you're \"cured\" of your anxiety the last thing you want to do is go on message boards/subreddits etc where people who have anxiety are getting together and describing their symptoms/feelings etc. \n\n\nThe problem with that places like this subreddit have very few people talking about success stories and a lot of people in anguish and suffering.\n\n\nI wish that I could tell you what I did to cure myself, but it's not that simple. And lapses do happen. When I say 2 years I don't mean 2 years straight. I have had lapses, usually around winter time. But I move on from these lapses and instead of beating myself up and saying \"oh...there goes my streak, I'm back at square one\" I look at it as getting congested or getting a cold for a day or two and then going back to being healthy as opposed to suffering with a terminal illness.\n\nI wrote notes to myself over the course of my recovery and the funny thing the notes all say a bunch of things that sometimes contradict each other. But I want to share with you a few of my resources as well as \"catch phrases\" that I implemented to make myself better.\n\nThe first: \n\nEmbrace, and move on. As in, embrace the anxiety and move on. \n\nThe second:\n\nWhen you're feeling good don't look back and ask \"why, or what happened\" don't try to analyze the anxiety because you're basically telling yourself the anxiety is horrible, I don't want to experience it again, and now I have to find out what I did wrong so I make sure it never happens again. That just makes anxiety your focus. To be anxiety free anxiety cannot be your main focus in life.\n\nThird:\n\nI can handle it. If a thought pops in my head. I can handle it. If I feel a feeling, I can handle it. If I lapse, I can handle it. If I'm afraid of something that might happen in the future, I can handle it if it does. \n\n\nNow as far as resources go:\n\n [Anxietynomore.co.uk](http://www.anxietynomore.co.uk)\n\n [UCLA's Meditation workshops](http://marc.ucla.edu/body.cfm?id=22)\n\n[The Meditation Society of Australia](http://http://meditation.org.au/index.asp)\n\n[Free Online Cognitive Behavioral Therapy](https://moodgym.anu.edu.au/welcome)\n\n[And the meditation subreddit](http://www.reddit.com/r/Meditation)\n\n\nMeditation has been my favorite way to deal with my negative feelings, and developing new and more positive feelings. \n\n\nAnother thing that helps is to try and go 30 days without entertaining a negative thought. Negative thoughts will pop up but you learn to ignore them. This isn't that easy unless you have done the above exercises with meditation and the MoodGym. \n\n\nAlso some helpful facts to learn about your anxiety. Your anxiety has no mass or volume. It does not build up within you. You can have a cumulative of muscle tension and tightness from constant worrying but you can visualize that build up leaving you and escaping you and being pushed out of you if you like. \n\nAlso turn negative thoughts into cartoony thoughts. Make them ridiculous, transform them in your minds eye into little balls or orbs trying to penetrate your head and imagine yourself having a force field of good will and love preventing the bad thought from taking hold of you. Sometimes transforming a thought into something non threatening and shapeless etc helps a lot to make it dissipate.\n\nI don't think I'll visit this subreddit again or really stick around to answer too many questions. This seems very selfish of me and maybe unhelpful but I know if I stick around here, people will start describing symptoms I may or may not have had, and these symptoms might start appearing in me or I might start experiencing your anxieties as my own etc. and one of the best things I have learned for my peace of mind is to remove myself from places like this.\n\nIt's not that places like this can't be helpful, or can't be therapeutic, but for me personally, in order to be anxiety free I must starve my anxiety of any fuel it may want to re-ignite and I really enjoy my life right now too much and love being \"normal\" (whatever that is) too much and have too many responsibilities to the people I love to revisit my old symptoms and other peoples symptoms. \n\n\nFor me, anxiety is contagious! But I wanted to show you people some love and tell you that I have been there and give you hope. Not false hope but actual hope from someone who has been there done that. \n\nDo what feels right for you. I created my own cure script and had a progress journal for about 2 years. I went 2 years anxiety, 2 years cured. I'd like to make it 3, 4 etc etc. \n\n\nOne thing I can say however is that it doesn't matter how long you've had it (as I learned from anxietycure.co.uk) once you start taking positive action you get positive results. But it's hard.\n\n\nIf I where to describe to you what it feels like to be anxiety free, it's like feeling light. Like your muscles have exhaled all the anxiety, your brain feels clean, and shiney, and smooth.  Your chest is open and warm. And your overactive mind is now chewing up philosophy and spirituality, and interests, hobbies, politics, life and no longer chewing over worries, medical websites, symptoms, analyzations, testing yourself, thinking you're nuts, etc.\n\n\nThis is all very jumbled and I don't want to create a TL;DR because I feel like there has to be something in what I've written that has to help somebody out there, but I will tell you that I used to suffer from OCD (sexual), panic disorder, pure O, GAD. Used to take 100mg of Sertralin, now I only take half a 50 pill everyday (because part of me is afraid of going through severe withdrawals so I am weaning myself off VERY slowly)\n\nMy anxiety had mostly been about my anxiety. Feeling trapped. What if thinking. Fear of suicide. What if I can't handle it? What if I go crazy? What if I develop schizophrenia etc etc. Obsessions over physical processes like breathing (convincing myself that if I didn't breathe manually I would not breathe at all) touching, seeing, hearing. Fear of becoming depressed and not liking the things I liked and what would I do if that happened. Reading anxiety websites for the magic cure. Obsessively taking notes everytime I felt something and analyzing it to death. Etc. etc. Beating myself up for being so strange. Judging other anxiety sufferers to be weirdos and then telling myself that I am a weirdo too and shouldn't be trusted around people. Fears of my sexuality transforming into something unhealthy or evil.\n\nPhew. That was a lot to get out. But believe it or not, that is all gone. I love you guys. You're not weird. You're brain is programmed to scan for danger and you have taught it that whatever you fear or feel is dangerous, so you are obsessed with it. And you are afraid to stop because you feel that you will be out of control or things will be worse if you don't do your ritual or you don't worry about that impossible thing that will never happen.\n\nIt takes a long long time to learn to embrace uncertainty and realize that it's actually better to feel that out of control fearful feeling for a day or two than just do the same thing over and over and over again and feel like crap forever. \n\n\nBest of luck to all of you. Don't hate me for not sticking around. I'm like Lot's wife. I can't look back or I'll turn to sand. Gotta keep moving forward. Much love to all of you and support and good wishes.\n\nTL;DR Blah blah blah  Embrace uncertainty\n\n[Anxietynomore.co.uk](http://www.anxietynomore.co.uk)\n\n [UCLA's Meditation workshops](http://marc.ucla.edu/body.cfm?id=22)\n\n[The Meditation Society of Australia](http://http://meditation.org.au/index.asp)\n\n[Free Online Cognitive Behavioral Therapy](https://moodgym.anu.edu.au/welcome)\n\n[And the meditation subreddit](http://www.reddit.com/r/Meditation)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety free for 2 years",
            "url": "http://www.reddit.com/r/Anxiety/comments/15gvn8/anxiety_free_for_2_years/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356583136,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15i4ov/i_lost_my_job_a_few_months_ago_and_am_wondering/",
            "gilded": 0,
            "id": "15i4ov",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15i4ov/i_lost_my_job_a_few_months_ago_and_am_wondering/",
            "retrieved_on": 1413256645,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "I don't want to get in to the specifics, but basically I attempted suicide which obviously prevented me from showing up to work.  I was committed to the mental health ward for 30 days.  Other than family, I had 2 brief visits from 2 different co-workers.  Everyone at work knew what happened.  In what I hope was a non-asshole way I told them I didn't want any visitors and they obliged.  I was with the company over 5 years but I didn't really know anybody other than the 3 others in my group.\n  \nWhen I got home I found a box of all my personal belongings from my desk.  It was dropped off sometime while I was in the hospital.   I checked the website and found my job has been posted sometime after being hospitalized.  A week later I found the strength to call after hours and leave a message.  I simply asked the HR person to phone me back about returning to work.  I never got a call back and didn't call again.  I didn't have the strength to go back to work anyway.\n  \nAfter two months I got a package full of government forms about long term disability benefits.  It also had a form letter from the corporate head office informing me that I would no longer receive any pay from them, any further payments would need proof of long term disability.  Payment during disability is handled by the insurance company and corporate has nothing to do with it as they explained in the letter.  [I was getting 50% pay for the first 3 months of not working.]\n\nAnyway, I didn't try to contact work again.  I didn't receive any further communication from them either.  Obviously come tax time something will have to be done.  It's been about 10 months since I tried ending it.  I don't exactly feel welcome back at my old job.  I don't know if I actually need to do anything, given I was gong to quit anyway.  I just want some closure on the issue but don't know what to say.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I \"lost\" my job a few months ago and am wondering how someone without social anxiety, avoidant personality disorder and depression would have handled the situation.",
            "url": "http://www.reddit.com/r/Anxiety/comments/15i4ov/i_lost_my_job_a_few_months_ago_and_am_wondering/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356211160,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15ao33/is_it_normal_to_stress_about_something_going/",
            "gilded": 0,
            "id": "15ao33",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15ao33/is_it_normal_to_stress_about_something_going/",
            "retrieved_on": 1413267921,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Is it normal to stress about something going wrong at work to the point where you're sweating and have pins and needles all over your body?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15ao33/is_it_normal_to_stress_about_something_going/",
            "user_reports": []
        },
        {
            "author": "kodanky",
            "author_created_utc": 1288900813,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4hqq0",
            "created_utc": 1356359500,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15dhx8/mom_barges_in_my_room_when_im_asleep_with_my_dog/",
            "gilded": 0,
            "id": "15dhx8",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15dhx8/mom_barges_in_my_room_when_im_asleep_with_my_dog/",
            "retrieved_on": 1413264055,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I'm 29 and I'm in the wrong by family standards by asking mom not to do those things... Goddamn hate Xmas. Yes I think to resolve this I need to move out. But I can't afford. My vent for the day.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Mom barges in my room when I'm asleep with my dog. Takes my curtains down and goes though my closet. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15dhx8/mom_barges_in_my_room_when_im_asleep_with_my_dog/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356246432,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15bge8/freaking_out_about_christmas_seeing_my_father_who/",
            "gilded": 0,
            "id": "15bge8",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15bge8/freaking_out_about_christmas_seeing_my_father_who/",
            "retrieved_on": 1413266865,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "About a year ago, I completely cut ties with my emotionally and physically abusive father. It's caused tension between my sisters and a bit but mostly we don't talk about it. Things haven't been that awkward as he lives in a different country than us. \n\nAbout a week ago I found out that he is going to be in the same city my mom lives in (where I'll be staying) and yesterday I found out he will be there right for our family Christmas dinner. To make matters worse he keeps trying to get my sisters involved and now they are angry at me. AND one of them went behind my back and gave him my mailing address and he sent me a present. I don't want his present. I don't need his present. ALL I WANT IS FOR HIM TO LET ME BE. But now he's going to be forcing himself into my life again. \n\nI'm freaking out. Lightheaded, nauseous, panicky, sweaty. I haven't felt this stressed and anxious in a long time. Anyone have any tips to calm it down or been in a similar situation with cutting someone out of their life?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Freaking out about Christmas. Seeing my father who I've completely cut ties with against my wishes. My anxiety is going crazy. [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/15bge8/freaking_out_about_christmas_seeing_my_father_who/",
            "user_reports": []
        },
        {
            "author": "h456h",
            "author_created_utc": 1329462810,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6y2vm",
            "created_utc": 1356341033,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15d9lc/dealing_with_xanax_withdrawal/",
            "gilded": 0,
            "id": "15d9lc",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15d9lc/dealing_with_xanax_withdrawal/",
            "retrieved_on": 1413264374,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I took xanax for one month starting with 1.5mg dose/day eventually tapering it down to 0.5mg/day before quitting. Reason i quit was it wasn't helping me one bit.   \rNow that i'm off it, i'm experiencing severe side effects. My insomnia has gotten much worse, I feel exhausted all day and I have the worst headache. I tried getting melatlonin to improve my sleep but it's very hard to come by where i live. \r\rAny advice on how i can deal with withdrawal symptoms? Any alternatives to melatonin that you may be aware of or any other medication that's known to help people ease their way through benzo withdrawal?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Dealing with Xanax withdrawal ",
            "url": "http://www.reddit.com/r/Anxiety/comments/15d9lc/dealing_with_xanax_withdrawal/",
            "user_reports": []
        },
        {
            "author": "steph1cleveland",
            "author_created_utc": 1333509296,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7cnih",
            "created_utc": 1356719011,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15kzqz/on_the_topic_of_anxiety_inspired_tattoos_here_is/",
            "gilded": 0,
            "id": "15kzqz",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15kzqz/on_the_topic_of_anxiety_inspired_tattoos_here_is/",
            "retrieved_on": 1413252073,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "http://imgur.com/XBDdc\n\nIt's french for \"Remember to Breath\" since it is the one thing that helps getting me through panic and worry. Whenever I am around my mom and begin to get really anxious or worried she always reminds me to look at my foot and remember what it says and I love that. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "On the topic of anxiety inspired tattoos here is mine",
            "url": "http://www.reddit.com/r/Anxiety/comments/15kzqz/on_the_topic_of_anxiety_inspired_tattoos_here_is/",
            "user_reports": []
        },
        {
            "author": "albie_",
            "author_created_utc": 1335413431,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7k6im",
            "created_utc": 1356661199,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15jupm/how_do_i_tell_my_friends_i_cant_go_out_on_some/",
            "gilded": 0,
            "id": "15jupm",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15jupm/how_do_i_tell_my_friends_i_cant_go_out_on_some/",
            "retrieved_on": 1413253877,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I usually make something up like I'm sick or exhausted or have too much to do, but the truth is I have this sense of feeling overwhelmed or hyperstimulated and can't calm down. I pace around the house and end up texting cancellations on my friends every now and then. I feel like if I told the truth, they'd laugh or try to get me to come out anyway. Or, if they encouraged me to tell the truth, after a while it would start to sound incredibly lame or repetitive: \n\n\"Sorry, feeling anxious. Can't go out.\"\n\nWhat do I do?\n\n\n...this is currently my situation, by the way. Just cancelled on a friend I haven't seen in months because I feel like I can't breathe or shut my brain up, for no good reason at all.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do I tell my friends I can't go out on some nights because of anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15jupm/how_do_i_tell_my_friends_i_cant_go_out_on_some/",
            "user_reports": []
        },
        {
            "author": "ambitiousmix",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356565981,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15hoxi/anyone_know_of_any_good_anxiety_documentaries/",
            "gilded": 0,
            "id": "15hoxi",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15hoxi/anyone_know_of_any_good_anxiety_documentaries/",
            "retrieved_on": 1413257320,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Can anyone suggest good documentaries that talk about anxiety? I'm trying to do some research ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone know of any good anxiety documentaries?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15hoxi/anyone_know_of_any_good_anxiety_documentaries/",
            "user_reports": []
        },
        {
            "author": "triceratops3",
            "author_created_utc": 1324442151,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6hdxm",
            "created_utc": 1356589852,
            "domain": "self.Anxiety",
            "edited": 1356634777,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15iaky/rant_everything_is_forced/",
            "gilded": 0,
            "id": "15iaky",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15iaky/rant_everything_is_forced/",
            "retrieved_on": 1413256403,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "No interaction feels natural, ever\n\nSitting, and cracking jokes with my family over the holidays felt like a chore. I'd sit there and think *\"Okay, thirty more minutes and you can head upstairs for a bit.\"*\n\nAt work, a customer comes to my cash, and after saying the same greeting a thousand times, I still have to spit it out. The smallest thing goes wrong, and I'm willing myself not to tear up.\n\nThere's this boy who talks to me, and I'm forcing myself to give minor information about myself, just so we can get to know each other mutually, Normally, I shut whatever potential relationship down after a few days. But I've never had a relationship. I should just go with it, and see what happens. What could go wrong? (*Cue anxiety* EVERYTHING COULD GO WROOOONG.)\n\n\nAnyways, it felt really good to type that out. I can't tell my friends this. It feels to personal (*logically, I should tell strangers on the internet, right?*)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] Everything is forced",
            "url": "http://www.reddit.com/r/Anxiety/comments/15iaky/rant_everything_is_forced/",
            "user_reports": []
        },
        {
            "author": "whyamiworried",
            "author_created_utc": 1356368793,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9zoei",
            "created_utc": 1356371493,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15drem/help_anxiety_about_getting_older_what_do_i_do/",
            "gilded": 0,
            "id": "15drem",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15drem/help_anxiety_about_getting_older_what_do_i_do/",
            "retrieved_on": 1413263677,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "Before I write this, I should clarify that I will be turning 22 this coming January.\n\nI've been having this feeling of anxiety about getting older for the latter part of the year and it's beginning to drive me insane. I don't know why I'm having this anxiety even though I'm still quite young. I guess the feeling came about when my younger brother left to go to West Point back in July. For whatever reason, it depressed me quite a bit when he left even though I knew he would be coming home somewhat frequently while he is there. This depression that I was in caused me to think many negative thoughts, with getting older being one of them. I have since gotten over the worst of the depression, however, I feel like it has now been replaced by the anxiety of growing older (and perhaps other forms of anxiety though this one is the most severe). My main fear stems from the fact that my parents will become old and debilitated and will die at some point. Both sets of grandparents are still alive as well but they will most likely be dead in the next decade. I am also scared of other friends and family members becoming older as well as myself. I don't know why, but all I can see are the negatives of getting old even though I know there are positives somewhere in there. I'm having trouble sleeping because of the anxiety and my appetite has also taken a hit. It's also difficult for me to enjoy many of my hobbies because of the anxiety. Christmas isn't helping either as I have visited many of my family members who have noticeably gotten a little older in the past year.\n\nThe driving factor behind this anxiety may be from the inevitable nature of aging since I don't have much control over it. What can I do to combat this type of anxiety?\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Anxiety about getting older. What do I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15drem/help_anxiety_about_getting_older_what_do_i_do/",
            "user_reports": []
        },
        {
            "author": "Generalhooha",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356237120,
            "domain": "nothingworks.weebly.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15b9tu/the_best_guide_on_dealing_with_anxiety_that_ive/",
            "gilded": 0,
            "id": "15b9tu",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15b9tu/the_best_guide_on_dealing_with_anxiety_that_ive/",
            "retrieved_on": 1413267106,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "The best guide on dealing with anxiety that I've found",
            "url": "http://nothingworks.weebly.com/",
            "user_reports": []
        },
        {
            "author": "bDawk20",
            "author_created_utc": 1290051510,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4j7ph",
            "created_utc": 1356168908,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/159x70/story_about_and_advice_learned_from_my_small/",
            "gilded": 0,
            "id": "159x70",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/159x70/story_about_and_advice_learned_from_my_small/",
            "retrieved_on": 1413268995,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I thought I'd share a quick motivational/success story of sorts-- hopefully it will inspire people or make someone feel better. I'll try to keep this short, which is difficult as I tend to ramble. \n\nOkay so a little background: \nMy friend and I have anxiety-- he's been dealing with it longer than I have, but I've been worse lately. My friend has been on medication for a while and it seems to have helped him. I didn't really have anxiety until a few years ago and it was relatively manageable until recently. I passed out during an internship (part of my graduate program) in part because the stress was too much for me to handle. Before dropping the internship I caved and went on Buspar (my MD was the one who prescribed it though so it was a non-therapeutic dose). Eventually I dropped the internship. I feel less stressed/anxious since then, but I also feel more depressed/hopeless and worry or stress over little things or things far outside of my control. Hopefully my new \"corrected\" dosage works better-- it seems to be helping me cope better, but that could just be because there is less stress in my life now. \n\nAnyway, my anxiety stems mostly from social situations, stress, and random phobias (e.g. blood, vomiting, etc.). My friend's anxiety is somewhat different, but we both are uncomfortable in \"party\" situations. He does not drink (I believe it is against his religion), while I used to drink, but now don't because of my fear of throwing up. Both of us get anxious in big crowds, however, especially if alcohol or that party-like atmosphere is involved. \n\n\n\nSo long story short, our friends had planned this trip into the city tonight. We planned to see the tree and drink at someone's apartment. We split from the group at some point to get dinner with a third friend and ended up having an interesting adventure. We encountered a few situations that were slightly anxiety provoking. For example, we missed our train/subway, which got us lost and forced us to backtrack (through a bad neighborhood at one point), but we were fine the entire time. \n\nAt the end of the night my friend wanted to go home rather than heading back to the apartment where the party was. I knew the party was nothing out of control-- just a few friends drinking casually-- and I wanted to end this cycle of avoiding those situations so I convinced him to stop by so I could use the restroom. We ended up having fun and staying for an hour or so (it was actually his first \"party\"). \n\nI guess the moral of the story is I didn't avoid a situation I typically would have and everything was okay. I had a lot of fun and for the first time in a while felt NORMAL. It was a great feeling.\n\nAnd I guess I'll end with some advice garnered from my experience tonight: \n\n1. Take some risks. Don't avoid a situation-- you're only enforcing the reason for the anxiety. Granted this is easier said than done, but it's worth a try sometimes. \n2. No one is alone with this shit and it may help if you are friends with someone else who knows what you're going through firsthand. \n3. I had my medication on me most of the night (it's prescribed twice a day so I took it at the end of dinner) and just having it in my pocket made me feel better because I knew if I felt anxious at any time I had some relief to look forward to \n4. Go out. Do something. Preferably with friends. Don't sit home wallowing. I know it's hard to do when you're anxious, but I felt more alive and happy tonight than I had in a days. \n5. Think positive. Again, not easy to do, but think when the last time thinking negatively worked out in your favor. If you stay positive you have a shot at a silver lining. Did I just quote that new movie? It looks so lame. But the girl is kind of cute. And they're Eagles fans, which is a plus for me. Oh, there I go with the rambling. Oops. But the message is true. If you are positive you will be happier. Studies have shown people who force a smile are more likely to genuinely smile or laugh easier. So smile and think positive.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Story about, and advice learned, from my small victory over anxiety tonight",
            "url": "http://www.reddit.com/r/Anxiety/comments/159x70/story_about_and_advice_learned_from_my_small/",
            "user_reports": []
        },
        {
            "author": "Capri-Sonne",
            "author_created_utc": 1321806487,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6a1sl",
            "created_utc": 1356125732,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/158y8m/post_things_that_worked_for_you/",
            "gilded": 0,
            "id": "158y8m",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/158y8m/post_things_that_worked_for_you/",
            "retrieved_on": 1413270429,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I suffer from anxiety as well as OCD. Here are a few things that I learned from my therapist and which I still use:\n\n1: Write down what I fear, and level of fear in percents. Then write down why I should not have this fear. \n\nExample: \"I am scared of choking on my food\"\nFear level: 60%\nRational perspective: I didn't choke on my food earlier today, so why should I choke on it now? Clearly I don't have any physical problems regarding my swallowing mechanisms as fluids like water and soda go down easily. It's actually far easier to handle solid foods than fluids for the swallowing mechanism. Thus I should evidently have no problem swallowing. \n\n\n2: Abdominal breathing! Do 15-20 minutes a day. Divide it in several 5-6-7 minute chunks if 15 minutes at once is too much. The mind can't be anxious while breathing with the stomach!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Post things that worked for you!",
            "url": "http://www.reddit.com/r/Anxiety/comments/158y8m/post_things_that_worked_for_you/",
            "user_reports": []
        },
        {
            "author": "BrazenBull00R",
            "author_created_utc": 1354089323,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9qgy7",
            "created_utc": 1356495714,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15ga7z/any_hypochondriacs_here/",
            "gilded": 0,
            "id": "15ga7z",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15ga7z/any_hypochondriacs_here/",
            "retrieved_on": 1413259602,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "Just found this subreddit and would like to know anyone's experiences with hypochondria. I am M-27 and have been feeling anxiety over health reasons and illness and dying for a good 2/3 years now. I am not so worried about contracting an illness by infection or bacteria, it's chronic illness-Cancer, body falling apart, degenerative illness that worries me. Like I have some undiagnosed genetic problem. Started right before my 25th birthday when I suffered from heart palpitations for about 2/3 weeks straight. I thought I would drop dead at any minute. Eventually my heart straightened itself out and I got stronger and more able to work. Keep in mind I had to still go to work and pretend I wasn't shitting myself in panic every second. It was horrible. Now, even tough I know better, I still feel like every little pain and lump I find on my body is a sign of the end for me. I would like to hear others stories about medical fears and how to get over them. Thanks in advance.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any hypochondriacs here?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15ga7z/any_hypochondriacs_here/",
            "user_reports": []
        },
        {
            "author": "OrangutanClyde",
            "author_created_utc": 1321286773,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_68pjx",
            "created_utc": 1356560311,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15hjll/relaxing_i_love_dreams_even_nightmares_because_im/",
            "gilded": 0,
            "id": "15hjll",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15hjll/relaxing_i_love_dreams_even_nightmares_because_im/",
            "retrieved_on": 1413257547,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "I'm guessing its the same for a lot of you too, it makes me realise that my anxiety isn't so permanent, if I can dream and have no anxiety and only rational fear, then when I'm awake, at some point, I'll be able to live normally.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] I love dreams, even nightmares, because I'm free from the shackles of my anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/15hjll/relaxing_i_love_dreams_even_nightmares_because_im/",
            "user_reports": []
        },
        {
            "author": "vaguenotions",
            "author_created_utc": 1344567426,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8md26",
            "created_utc": 1356379138,
            "domain": "yourfaceismelting.blogspot.ca",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15dyo0/christmas_shopping_is_an_ordeal_comic/",
            "gilded": 0,
            "id": "15dyo0",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15dyo0/christmas_shopping_is_an_ordeal_comic/",
            "retrieved_on": 1413263378,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/hWRpWPghRndK4d8k.jpg",
            "title": "Christmas shopping is an ordeal. [comic]",
            "url": "http://yourfaceismelting.blogspot.ca/2012/12/happy-christmas.html",
            "user_reports": []
        },
        {
            "author": "shallah",
            "author_created_utc": 1220919695,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_38lau",
            "created_utc": 1356197801,
            "domain": "cmhc.utexas.edu",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15ac2e/stress_recess_stress_management_and_reduction_at/",
            "gilded": 0,
            "id": "15ac2e",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15ac2e/stress_recess_stress_management_and_reduction_at/",
            "retrieved_on": 1413268386,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Stress Recess: Stress Management and Reduction at the University of Texas at Austin (includes flash demonstrations &amp; mp3 downloads)",
            "url": "http://www.cmhc.utexas.edu/stressrecess/",
            "user_reports": []
        }
    ]
}