{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1355799905,
            "domain": "self.Anxiety",
            "edited": 1355869987,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1514t0/the_keys_to_getting_out_of_this_disorder_dont_let/",
            "gilded": 0,
            "id": "1514t0",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 71,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1514t0/the_keys_to_getting_out_of_this_disorder_dont_let/",
            "retrieved_on": 1413281847,
            "score": 180,
            "secure_media_embed": {},
            "selftext": "EDIT: Since I've been getting a lot of PMs asking for more tips, here are some things I have thought of since writing the original post: \n\n\nTHE OPPOSITES RULE: This is a rule I have found very helpful when I go out to challenge the anxiety. You can also use it during a regular panic attack in your own home. It is very simple and effective. Basically, you notice what you WANT to do during a panic attack (for me it's usually either GO HOME and be \"SAFE\", or watch something to distract me (movie or TV show), call a safety person, tense my muscles, check my heartbeat, etc. So you must NOTICE these actions/tendencies, and then do the EXACT OPPOSITE. SO if I wanted to watch something to take my mind off the anxiety, I would use the rule of opposites and instead get up, walk around, or sit quietly with my own thoughts. This FORCES YOU TO CONFRONT THE AVOIDANCE TECHNIQUES, as well as subconsciously tells your brain that there is no danger because you are not using your habitual coping techniques. You will find that this technique is a little difficult to master at first, but once you do, it will become extremely useful in recognising the habits you have formed. You may not think you have any, but you do. ALL anxiety sufferers form \"safety habits\" that they fall back on during an attack. You must do the opposite. \n\n\nSecondly, I'd like to look at \"SAFETY CRUTCHES\". These are things and people that you rely on to \"save\" you from a panic attack. For example, a laptop, water bottle, phone, mother, father, sister, etc etc. You will grab this item when you start feeling anxious, and try to use it to distract yourself, or you tell yourself \"it's ok because I have my phone and I can use it IN CASE something bad happens\". You need to begin to let go of these safety crutches. They are doing the opposite of what you think they are doing. Instead of making you feel reassured, they are sending your brain the subconscious message that you MIGHT NEED THEM because SOMETHING BAD *MIGHT* HAPPEN. You need to start sending your brain the correct message, which is \"I do not need these items because anxiety is NEVER dangerous. There is NO chance of anything dangerous happening to me because of anxiety\". Any CBT practise you do WITHOUT these items/people will be 80% more effective (I can link you to a scientific study that backs this up once I find it in my files)\n\n\nAnother helpful thing I'd like to explain is that your anxiety is a FALSE ALARM SYSTEM. This means that your fight or flight mechanism is overly sensitive because you have TRAINED IT TO BE THAT WAY. Instead of searching for danger OUTSIDE the body, your system has been trained to look INSIDE THE BODY at strange or uncomfortable sensations. So when you start to panic, your body looks are THE SENSATIONS you are having and thinks \"OH NO! These don't feel good. There must be danger\". You do NOT have to obey this false alarm. Most people think that just because they think something, their thoughts must be true. This is not the case. I'd say about 50% of what we think to ourselves is false. You do NOT have to become a slave to your thoughts. You can choose to look at a thought, and dismiss it. The thoughts that something dangerous is happening to you or that you might die or go crazy or lose control - They are all FALSE thoughts and you can choose to dismiss them as soon as you notice them. This will give you a big sense of freedom once you realise that you have the power to filter your thoughts based on their helpfulness. \n\nI'll add more to this as I think of things :)\n\n\n---------------------------------------------------------------------------------------------------------------\n\n\nI am effectively beating this motherfucking disorder one day and one step at a time using congnitive behavioural therapy. Now before you think \"ah yeah THAT thing - that thing that I haven't tried yet because there's probably no way it will work for me\", please hear me out. I have been struggling with SEVERE panic attacks, generalise anxiety, PTSD, and agoraphobia for over 3 years now. I have had GAD and panic disorder for almost my entire life (from age of 11, I'm now 22).\n\nI ALWAYS believed that I would beat this disorder on my own. Without seeing a psychologist, because in my mind, no one would really be able to help. I had already \"outsmarted therapy\" because I already knew more about my disorder than any other person could. So why waste the money? Another interesting thing is that I actually study psychology, so am well aware of cognitive behavioural therapy being the #1 MOST EFFECTIVE TREATMENT for anxiety and panic disorder. \n\nI finally had enough one day after having a huge panic attack while sitting in the back seat of a car a friend was driving. Fuck this, I thought. I WILL find the way out of this. At this point I was so severely agoraphobic that I could not walk 10 feet out of my front door. Even inside my own house I would have panic attacks frequently. I was tired ALL THE TIME. fatigue that absolutely eats away at you and your will to live. \n\nSo I began looking for self help books online. I found one called Beating the Panic Trick (Panic Attacks Workbook). I ordered it and started practicing with it immediately. I also enlisted the help of an online \"anxiety coach\" who I talk to once a week by phone. He has taught me that THIS IS A HABIT and a trick that our minds create simply because we have allowed negative and false beliefs to become real to us. \n\nYou might wonder \"well I get spontaneous panic attacks, and they come on so quickly and without conscious thought, so how can i undo that?\" - It really is very simple. You must retrain your mind to have REALISTIC thoughts and reactions to panic and fear. This can be done by BREAKING DOWN THE ANXIETY INTO PARTS. \n\nFirst, look at the symptoms that you get when you have a panic attack or attempt something out of your comfort zone. I'll go with mine because I don't know yours. I get\n\n* Racing, pounding heart\n* Shaking, trembling\n* Dissociation \n* Feeling of intense fear\n\nNow what you must do is train yourself NOT TO FEAR each of these symptoms. To do this, you need to teach yourself that none of these symptoms are dangerous. You could panic for hours and NO HARM will come to you. But you already \"know\" this. So the trick is, you need to GET OUT THERE AND FEEL ANXIETY. You need to invite some anxiety to come to you. You need to feel anxiety, experience it, and ALLOW it. This sounds horrible, I know. But I will tell you right now that it is THE ONLY WAY to truly overcome this disorder. If you simply want to live with the disorder, there are ways to do that. But to OVERCOME, you need to ALLOW, and stay with the anxiety until you don't fear it anymore. \n\nNow, the things that you can repeat to yourself in the case of an attacks are varied, but my personal ones are:\n\n- THIS IS NO DIFFERENT. This anxiety is NOT different to last time. Last time, nothing bad happened. Nothing that I fear will happen can happen. \n\n- This anxiety and panic WILL PASS NO MATTER WHAT I DO or how I handle it. \n\n- My symptoms are harmless, and I would have more extreme reactions if I were doing moderate exercise. This is not extreme.\n\n- Anxiety and panic are no more taxing on the body than vomiting is. Vomiting is more dangerous than anxiety (I use this one because I have this underlying fear that anxiety is somehow damaging my heart or body, and this reminds me that is really isn't)\n\n- You can handle ANY anxiety, ANYWHERE\n\nAnother things I cannot stress enough is EXERCISE. Do it slow at first if you are like me and have a fear of high heart rate. Remember that high heart rate is GOOD during exercise and athletes TRY to get their heart rates up. Exercise will teach you not to fear your body, and it will teach you about your own strength. it will also help you detox from all the stress chemicals in your system. Trust me on this. If there is one thing you take from all this, it is DO AT LEAST 20 MINS OF EXERCISE A DAY\n\nWrite in a journal. As you confront the anxiety and allow it to occur and repeat your CBT mantras, WRITE about your progress. \n\nIt is all a matter of regaining a feeling of control over your life. Once you feel slightly more in control, believe me, it snowballs. \n\nYOU WILL FEEL HAPPY AGAIN. If you want me to go into any more details about my experience or anything I've mentioned, please just comment. I hope this post doesn't get lost. I really believe I can help a few people understand things better. Believe me, I've been to hell. I've been IN HELL for 3 years and am finally feeling happy again. \n\n\n    \n    USEFUL LINKS:\n\n[Panic Cure Website - where I found my anxiety coach](http://www.paniccure.com/)\n\n\n[Link to the workbook that I used to get started](http://books.google.com.au/books/about/Panic_Attacks_Workbook.html?id=glQDAAAACAAJ)\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "The keys to GETTING OUT of this disorder (Don't let this post get lost!)",
            "url": "http://www.reddit.com/r/Anxiety/comments/1514t0/the_keys_to_getting_out_of_this_disorder_dont_let/",
            "user_reports": []
        },
        {
            "author": "Mayortomatillo",
            "author_created_utc": 1327174886,
            "author_flair_css_class": "",
            "author_flair_text": "GAD/agoraphobia",
            "author_fullname": "t2_6pwv5",
            "created_utc": 1355747985,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14zorc/hell_new_favorite_subreddit/",
            "gilded": 0,
            "id": "14zorc",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14zorc/hell_new_favorite_subreddit/",
            "retrieved_on": 1413283828,
            "score": 70,
            "secure_media_embed": {},
            "selftext": "You are all my new best friends. I live here now. I'm so glad I discovered you, in just half an hour, I've started to feel better about myself. For example, I'm not the only quitter in the world. \n\nYou guys are cool. You get me. \nThanks for being alive.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hell, new favorite subreddit",
            "url": "http://www.reddit.com/r/Anxiety/comments/14zorc/hell_new_favorite_subreddit/",
            "user_reports": []
        },
        {
            "author": "wisconsin85",
            "author_created_utc": 1269558915,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3yluq",
            "created_utc": 1356025543,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/156dd7/i_just_realized_something/",
            "gilded": 0,
            "id": "156dd7",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/156dd7/i_just_realized_something/",
            "retrieved_on": 1413274140,
            "score": 68,
            "secure_media_embed": {},
            "selftext": "I LOVE being HAPPY! Maybe the time of year, maybe dancing and listening to awesomely awful music, maybe discovering the hilarity of Jenna Marbles and My Drunk Kitchen, but something about it... I like being happy. Even when crappy music that you can't unhear (Call Me Maybe) comes on pandora, you just roll with it and dance like a crazy happy weird person around your Christmas Tree in your kitchen in the middle of a Thursday, because you are flying home Friday and didn't care enough about life to go to work... kind of the epitome of happy at the moment. I don't know who can relate, but I say everyone takes a 5 minute dance break to dance to their most favorite song, then the most annoyingly happy song that will be stuck in your head all day. Do it, today, now! GO! Stop worrying about everything for 10 MINUTES AND DANCE! \n\nSorry about the block of text, and the possible nonsense. \n\nEVERYONE! ENJOY YOUR DAY AND POST SOMETHING HAPPY!!!! :P\n\nThank you r/anxiety for being here :) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I JUST realized something!!!!",
            "url": "http://www.reddit.com/r/Anxiety/comments/156dd7/i_just_realized_something/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1355942414,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/154cq2/update_lost_my_job_last_month_just_as_i_was/",
            "gilded": 0,
            "id": "154cq2",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/154cq2/update_lost_my_job_last_month_just_as_i_was/",
            "retrieved_on": 1413277486,
            "score": 61,
            "secure_media_embed": {},
            "selftext": "[Here's the original post] (http://www.reddit.com/r/Anxiety/comments/137ylo/started_antianxiety_medication_yesterday_to_help/). Although the anxiety still crops up from time to time, it feels more manageable now. Considering how much I have going on (new born baby and a wife recovering from the c section, all while doing phone screens and all day, in-person interviews) it should have been through the roof, but I've managed to stay positive. Thank goodness I have a strong support system from friends and family, they've been amazing.\n\nAs difficult as this year has been, I'm really trying to look at it as a learning experience, understanding my own emotional needs and not allowing myself to internalize stresses from work. All in all, my new job is a major step up in my career and I am working to approach it in a way that I can maintain long term without impacting my health.\n\nThanks for lending a listening ear during a challenging time.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "UPDATE: Lost my job last month, just as I was starting medication for the first time. Got \"back on the horse\" as you all recommended. Happy to say I received an amazing job offer last week with an amazing company.",
            "url": "http://www.reddit.com/r/Anxiety/comments/154cq2/update_lost_my_job_last_month_just_as_i_was/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1355552674,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14vv6x/was_supposed_to_go_on_a_date_tonight_first_in/",
            "gilded": 0,
            "id": "14vv6x",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14vv6x/was_supposed_to_go_on_a_date_tonight_first_in/",
            "retrieved_on": 1413288989,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "Hey everyone! My original thread was [here](http://www.reddit.com/r/Anxiety/comments/14t0bd/was_supposed_to_go_on_a_date_tonight_first_in/), and I just wanted to give an update on how it went.\n\n**It was fantastic**. I spent a good three hours just feeling like complete and utter shit, decided to man up, and just start going. I got cleaned up, went out to my car, and started driving toward her house. I told myself (if I can't make it another 5 minutes, I'll turn around). Sure enough, before I knew it I was there. The drive even took a lot shorter than I thought! \n\nShe introduced me to her parents, who really seemed to like me, and then we went out for dinner and a long walk through this gorgeous river-side park. I rolled into my house around 3am. It was absolutely incredible, and we can't wait to see each other again. \n\n**For everyone else out there:** My biggest problem with anxiety is anticipation, and waiting. The longer I wait and anticipate something, the more bad thoughts and images form in my head and drive my anxiety to an extent that I become crippled by it. Just start to do it, and keep telling yourself that if it gets too bad, you can always come back home. But at least, *start* it. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Was supposed to go on a date tonight (first in almost 8 months), but I'm sure I'll have to cancel it [Update]",
            "url": "http://www.reddit.com/r/Anxiety/comments/14vv6x/was_supposed_to_go_on_a_date_tonight_first_in/",
            "user_reports": []
        },
        {
            "author": "pete6563",
            "author_created_utc": 1342631531,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8dg44",
            "created_utc": 1355892697,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/153d1c/i_learned_a_method_for_calming_myself_and_i/",
            "gilded": 0,
            "id": "153d1c",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/153d1c/i_learned_a_method_for_calming_myself_and_i/",
            "retrieved_on": 1413278841,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I call this the \"Alphabet game.\" You pick a topic; I personally like cities, countries, and hockey players. Then, you think of all the countries (for example) that start with \"A\" (Azerbaijan, Algeria, Albania, Argentina etc). When you can't think of any more, move on to \"B\" (Brussels, Belgrade, Belize, etc). Eventually, your mind will start to wander. I find this especially helpful for when I am trying to sleep, or when I am in public spaces. *This isn't meant to replace any sort of professional help* Do you have techniques for staying calm/ managing stress?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I learned a method for calming myself, and I thought I would share.",
            "url": "http://www.reddit.com/r/Anxiety/comments/153d1c/i_learned_a_method_for_calming_myself_and_i/",
            "user_reports": []
        },
        {
            "author": "frozen_coyote",
            "author_created_utc": 1292930296,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4n3v0",
            "created_utc": 1356069553,
            "domain": "tryingtocreate.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/157pl6/i_have_panic_disorder_and_agoraphobia_in_august_i/",
            "gilded": 0,
            "id": "157pl6",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/157pl6/i_have_panic_disorder_and_agoraphobia_in_august_i/",
            "retrieved_on": 1413272206,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/9tvOKMwWt1Wf4zvS.jpg",
            "title": "I have panic disorder and agoraphobia. In August I travelled 3,000 miles to California and Yosemite. Here's the story.",
            "url": "http://tryingtocreate.wordpress.com/2012/12/21/california-and-yosemite/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1355587209,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14wbi4/can_anyone_share_about_how_cutting_out/",
            "gilded": 0,
            "id": "14wbi4",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 41,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14wbi4/can_anyone_share_about_how_cutting_out/",
            "retrieved_on": 1413288389,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I've decided that I need to get serious about anxiety management. In fact, right now, it needs to be the number one priority in my life.\n\nI want to be happy and I want to live a fulfilling and rewarding life.\n\nTherefore, I'm stopping drinking alcohol and any caffeine completely as of today.\n\nI'd love to hear others' stories about how - if at all - this may have helped in your life. Did you notice a big difference?\n\nAlso, I know that meditation is a great way to alleviate anxiety. Want to know the last time I meditated? Probably 2 months ago or more. I need to start doing this at least 10 minutes every day. I WILL start doing this every day.\n\nAnxiety is a serious issue in my life and I'm deciding to be as selfish as I need to be to look after me. I'm putting my needs front-and-centre and I'm going to meet them.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Can anyone share about how cutting out alcohol/caffeine has affected their anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/14wbi4/can_anyone_share_about_how_cutting_out/",
            "user_reports": []
        },
        {
            "author": "ukuleletroll",
            "author_created_utc": 1324315306,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6gzd7",
            "created_utc": 1355703443,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14ys7m/the_fear_of_having_a_panic_attack_might_give_me_a/",
            "gilded": 0,
            "id": "14ys7m",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14ys7m/the_fear_of_having_a_panic_attack_might_give_me_a/",
            "retrieved_on": 1413285108,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "So...yeah. I've been suffering from depression for quite a while now.  I'm not sure whether this belongs here or in /r/depression , but I need to talk to *somebody* about it.\n\nSometimes in the middle of the night, without any warning, I'll have the most awful panic attacks imaginable. I'll be in the pitch dark, and I can't breathe properly because I'm hyperventilating, and sometimes can't even move to put the light on. Then I'll be scared that I'm dying, which makes me panic more.\n\nNormally if I can't recover from a panic attack I'll go and wake up one of my housemates to calm me down.  It's really unfair, I know, and I feel really pathetic every time I do it. I appologise every time and each time I do it I tell myself it's the last time.\n\nA few nights ago I had the worst panic attack of my whole life.  I'd been on a massive low for the entire day and nothing could pull me out of it.  I'd also seen my counsellor that day, which always makes me more emotional, and I'd yelled at a priest, which made me feel worse about myself.  I was lying awake in bed thinking, *I can't go on like this any longer*.  And then I thought, *If nothing has changed by the new year, I'll kill myself.*\n\nI'd had suicidal thoughts before, but never something as final or drastic as that.  And the idea that I could feel that bad about myself pushed me over the edge into full-on panic attack.  Sweating, shaking, writhing. Palpitations and hyperventilation. I had a loss of control, a sense of impending death I'd never felt before.  I was also face-down in my bed, face in my pillow, and I couldn't move because it was so intense.  My breathing was getting faster and shallower. I was going to suffocate, and I was trapped in my own panicking body.  There was no escape.\n\nI managed to pull my arm out from underneath me and reach for my phone, and called my housemate, who I have as my first speed-dial.  I wasn't able to speak. I tried to say I was having a panic attack but my breathing was too fast to say anything. My memory gets fuzzy at that point.  I think he asked where I was and I might have managed to get out \"bed\". Next thing I know he's in my room and the light is on and I've been pulled into a sitting position and he helped me to breathe.\n\nIt took a while for me to calm down, and much longer to get to sleep. When I called him, he thought I'd done something stupid. I feel horrible. For waking him up, for scaring him, for being a terrible, ineffectual, selfish mess of a human being.\n\nI'm pretty sure if I hadn't managed to phone him I'd have died.  That scares the hell out of me.  And confuses me.  The reason I had the attack in the first place was because I wanted to die.  Was my body fighting my head, trying to get me to live?  I don't know whether I want to live or die any more.  For now, I just exist.\n\nBut what if he wasn't there?  What if I had nobody?  At the moment, my house is empty. I'm alone, in the middle of the night, in an empty house.  If I had another attack that bad, I might not be able to calm myself down.\n\nI began panicking about that, and it almost turned into another panic attack.  Then I decided to write this post. And writing about it has calmed me down a little, and made me feel less pathetic.  Thank you for reading.\n\nPlease, don't worry about me too much. I'm seeing a counsellor, and trying to remember that people care about me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The fear of having a panic attack might give me a panic attack.",
            "url": "http://www.reddit.com/r/Anxiety/comments/14ys7m/the_fear_of_having_a_panic_attack_might_give_me_a/",
            "user_reports": []
        },
        {
            "author": "missbedlam",
            "author_created_utc": 1336957965,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7pogw",
            "created_utc": 1355706856,
            "domain": "2012hoax.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14yvkh/relaxing_awesome_website_that_disproves_every/",
            "gilded": 0,
            "id": "14yvkh",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14yvkh/relaxing_awesome_website_that_disproves_every/",
            "retrieved_on": 1413284978,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/AraJu0ukArodva0U.jpg",
            "title": "[Relaxing] Awesome website that disproves every 2012 theory.",
            "url": "http://www.2012hoax.org/",
            "user_reports": []
        },
        {
            "author": "commanderjade",
            "author_created_utc": 1343548014,
            "author_flair_css_class": "",
            "author_flair_text": "GAD/Social Anxiety/MDD",
            "author_fullname": "t2_8hmh7",
            "created_utc": 1355881002,
            "domain": "self.Anxiety",
            "edited": 1355890714,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15316q/does_anyone_else_here_with_anxiety_startle_easily/",
            "gilded": 0,
            "id": "15316q",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15316q/does_anyone_else_here_with_anxiety_startle_easily/",
            "retrieved_on": 1413279284,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "It drives me nuts but when I'm focussed on something and someone comes up to me or calls my name I'm really easily startled (kinda feels like a mini panic attack). It's happened 3 times this week.\n\nEDIT. Sorry. Forgot to mention I have Social Anxiety and Generalised Anxiety Disorder.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else here with Anxiety startle easily?",
            "url": "http://www.reddit.com/r/Anxiety/comments/15316q/does_anyone_else_here_with_anxiety_startle_easily/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356111694,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/158izp/how_do_i_convince_my_mind_i_am_safe/",
            "gilded": 0,
            "id": "158izp",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/158izp/how_do_i_convince_my_mind_i_am_safe/",
            "retrieved_on": 1413271038,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I've been having anxiety problems for about 3 months now, and i finally went to a therapist yesterday. He told me about the fight or flight response humans develop when the mind perceives a threat. I was thinking about that in the shower yesterday and it really put everything into perspective. I realized i was making up all these things that where wrong in my head to make sense of my anxiety, and as a result that was causing me more anxiety because the things i convinced myself were wrong with me were unfix-able. So in short I'm in this Fight or flight limbo. Anyway do you guys have any advice on how to convince my mind i'm safe now? I ask because I've convinced myself that i have to fight now and i'm projecting my anger unto things and people and that's making anxious as fuck because i don't want to hurt the things i'm convincing are causing the problem, and shit even i know these things aren't causing the problem. That's the thing too; I realize that i'm safe in theory, but a part of me can't come to accept that. \n\nTL;DR: How do i convince my subconscious i'm safe and there's nothing wrong with me.    ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do i convince my mind i am safe",
            "url": "http://www.reddit.com/r/Anxiety/comments/158izp/how_do_i_convince_my_mind_i_am_safe/",
            "user_reports": []
        },
        {
            "author": "enjoimnt",
            "author_created_utc": 1332447550,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_78nl5",
            "created_utc": 1355977702,
            "domain": "well.blogs.nytimes.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/155fde/phys_ed_why_exercise_makes_you_less_anxious/",
            "gilded": 0,
            "id": "155fde",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/155fde/phys_ed_why_exercise_makes_you_less_anxious/",
            "retrieved_on": 1413275928,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Phys Ed: Why Exercise Makes You Less Anxious - NYTimes.com",
            "url": "http://well.blogs.nytimes.com/2009/11/18/phys-ed-why-exercise-makes-you-less-anxious/",
            "user_reports": []
        },
        {
            "author": "seeker135",
            "author_created_utc": 1197267204,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_31st6",
            "created_utc": 1355723545,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14zbpl/wrote_this_in_response_to_a_post_in_rdepression/",
            "gilded": 0,
            "id": "14zbpl",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14zbpl/wrote_this_in_response_to_a_post_in_rdepression/",
            "retrieved_on": 1413284334,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "Maybe someone can find some positive to take away.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Wrote this in response to a post in r/depression.  It belongs here.",
            "url": "http://www.reddit.com/r/Anxiety/comments/14zbpl/wrote_this_in_response_to_a_post_in_rdepression/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1355850090,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/15240a/medication_helped/",
            "gilded": 0,
            "id": "15240a",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/15240a/medication_helped/",
            "retrieved_on": 1413280511,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I realize this post will be relevant to a small number of people on this subreddit. Not everyone wants or is able to get medication for their anxiety. I'm posting this for those that are on the edge about looking to get medication.\n\n\nI suffered anxiety symptoms for many years. I left it unacknowledged and simply assumed that I was acting and feeling how I should in certain situations - I could never admit, nor did I want to, that I might actually have a problem.\n\n\nRelationships, heavy traffic, large crowds of people, and quotas at work would give me pressure/pain in my chest, shallow and rapid breathing, increased heart rate, and sweating. I would feel afraid, reckless, violent, hopeless, and sometimes wanting to cry or lash out. I experienced cyclical, indomitable, irrational thoughts that I couldn't vanquish with any amount of reasoning or attempts at relaxation.\n\n\nI've ruined many relationships with panic that was induced by the fear of loss. I've done many reckless and stupid things in traffic in desperate efforts to escape from it. I've shoved / knocked people down when trying to get out of large crowds. I've broken things in a rush to meet quotas at work while panicking over the unfounded fear of losing my job. These things affected my everyday life and yet I only wanted to blame myself for them - \"A problem? No, this is just how I am... There's no helping that. Medication? I don't need medication when I should just learn to pull myself out of these situations.\"\n\n\nI didn't want or even think I needed medication. I still doubt whether I need it. I can't deny, however, that it has helped. Those situations are no longer a problem. I'm able to see them for what they are, take a deep breath, and calm myself. I still worry - who doesn't? I still get uncomfortable in those situations - it's natural, I don't like them. They don't make me panic anymore, I don't feel the need to do irrational things. My thoughts are my own and I can finally choose not to worry and not to panic. \n\n\nI encourage anyone that suffers anxiety symptoms to talk to a doctor. Life is hard but it's meant to be enjoyed - Your anxiety doesn't have to make it harder for you. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Medication Helped",
            "url": "http://www.reddit.com/r/Anxiety/comments/15240a/medication_helped/",
            "user_reports": []
        },
        {
            "author": "heapsofleaps",
            "author_created_utc": 1336186707,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7n1ne",
            "created_utc": 1355944065,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/154ems/rant_as_a_person_living_with_anxiety_i_am_getting/",
            "gilded": 0,
            "id": "154ems",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/154ems/rant_as_a_person_living_with_anxiety_i_am_getting/",
            "retrieved_on": 1413277407,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "Everything will kill you, trust no one, the world will end. Conspiracy conspiracy conspiracy. Don't look down, don't look up. Natives will eat you alive. You're dog will eat you alive. You're cat will eat your dog and then they'll all get sucked up by a gigantic black hole. The media will cover this and call it an apocalypse, then blame it on the arabs. So don't even bother taking a space craft to gtfo because it's just going to get blown up anyway.\n\nIt's all well and good to give someone a prescription and a sachet of pills to numb them, but shouldn't we just work on being more peaceful and helping people rather than this extra stuff that's going on. \n\nWhere is the love?? seriously, where is the love. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] As a person living with anxiety, I am getting really tired of living in a fear mongering society! :@",
            "url": "http://www.reddit.com/r/Anxiety/comments/154ems/rant_as_a_person_living_with_anxiety_i_am_getting/",
            "user_reports": []
        },
        {
            "author": "searadz",
            "author_created_utc": 1352103251,
            "author_flair_css_class": "",
            "author_flair_text": "GAPD",
            "author_fullname": "t2_9ib16",
            "created_utc": 1355714476,
            "domain": "self.Anxiety",
            "edited": 1355718511,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14z30j/anxiety_makes_me_a_quitter/",
            "gilded": 0,
            "id": "14z30j",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14z30j/anxiety_makes_me_a_quitter/",
            "retrieved_on": 1413284695,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "Whenever something is hard, I get anxiety attacks and I give up on it. Everything in my life has been like that. I dropped out of high school, quit two jobs, and gave up on many things I liked.\nSometimes I don't think I'm good enough, or that I can't do it. It's just easier not to do anything than to try. What if I try and I fail? \nAt least if I don't try, I can't fail. but being a quitter is worse than being a failure because I didn't even try. \nI'm in this vicious cycle and I don't know how to get out. \nMy anxiety used to be so bad that I couldn't sleep because I was so scared I wouldn't wake up. I'm on a medication that took away all the severe symptoms like that, but everything just seems like it's too much and I can't do it.\nMy parents convinced me to try taking an easy class I would enjoy at a local community college, so I did. but after a while, I stopped going to that too. \n\nI'm making myself miserable. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety makes me a quitter.",
            "url": "http://www.reddit.com/r/Anxiety/comments/14z30j/anxiety_makes_me_a_quitter/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1355731665,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14zhad/i_think_my_therapist_dumped_menow_what/",
            "gilded": 0,
            "id": "14zhad",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14zhad/i_think_my_therapist_dumped_menow_what/",
            "retrieved_on": 1413284124,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I've been going through one hell of a crisis over the past week.  I lost my dream job as a teacher.  My husband handled the news horridly.  I don't even want to get into that.  My former employer jerked me around tirelessly last week. Panic attacks and breakdowns were frequent.\n\nSo I go to my therapist on Tuesday.  We have this incredible session where he really gets under my skin and made me really think for days after my session.  I go back to see him on Saturday and tell him that I really need to be pushed more.  I really want to break down barriers and cycles and get to the root of all of these issues I have.  He just looks at me and said, \"I think we've gone as far as we can.\" And makes an analogy about how you can only so many classes from your favorite professor in college before you learn everything that professor can teach you.\n\nI was in shock.  I'm still in shock to be perfectly honest.  is my therapist really breaking up with me in the middle of a crisis?  What am I supposed to do now?  I am not at a point where I can not be in therapy.  I have another appointment scheduled with him on Friday.  I'm just so lost, so confused.   Help!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I think my therapist dumped me...now what?",
            "url": "http://www.reddit.com/r/Anxiety/comments/14zhad/i_think_my_therapist_dumped_menow_what/",
            "user_reports": []
        },
        {
            "author": "missbedlam",
            "author_created_utc": 1336957965,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7pogw",
            "created_utc": 1355852923,
            "domain": "thoughtcatalog.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1526zq/why_your_fears_wont_come_true/",
            "gilded": 0,
            "id": "1526zq",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1526zq/why_your_fears_wont_come_true/",
            "retrieved_on": 1413280401,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/Dj0xRU-nL6O2eYMQ.jpg",
            "title": "Why Your Fears Won't Come True",
            "url": "http://thoughtcatalog.com/2012/why-your-fears-wont-come-true/",
            "user_reports": []
        },
        {
            "author": "scaredofflights",
            "author_created_utc": 1355674970,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9wrgw",
            "created_utc": 1355675735,
            "domain": "self.Anxiety",
            "edited": 1355676207,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14y1oy/this_morning_i_boarded_a_flight_vomited_before/",
            "gilded": 0,
            "id": "14y1oy",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14y1oy/this_morning_i_boarded_a_flight_vomited_before/",
            "retrieved_on": 1413286106,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I am a a male teenager, who has a fear of flying. Pretty much every time I fly, I will throw up a few times. \n\nAs I get to the airport, my stomach already starts to feel horrible. It gradually gets worse, until I eventually throw up. I was originally going to the US from Australia, which is about 26 hours in total (2 transfers). I've never travelled so far, and I think this is the reason I was so fearful of the flight.\n\nAs I sat down in my seat on the plane, I began to feel extremely nauseous, and then promptly threw up. I was shaking quite violently at that point. I went to the back of the plane to see the flight attendant, who helped me clean myself up. Then, I threw up again while at the back of the plane.  I was told that I was not allowed to fly, as the airline was concerned that I had such a long way to fly, and that I would not be able to last through it all. I was told to see a doctor before flying again. 12 hours after that experience, I still feel horrible. \n\nI have always known I was scared of flying to a certain degree, but this just got out of hand. Please, I need help. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This morning I boarded a flight, vomited before take-off and was not allowed to fly. Please help with my fear of flying. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/14y1oy/this_morning_i_boarded_a_flight_vomited_before/",
            "user_reports": []
        },
        {
            "author": "StolenStella",
            "author_created_utc": 1337325522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7qypb",
            "created_utc": 1355625748,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14x9lx/this_shit_is_ruining_my_life/",
            "gilded": 0,
            "id": "14x9lx",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14x9lx/this_shit_is_ruining_my_life/",
            "retrieved_on": 1413287126,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "This is all new for me. I dont know what I'm supposed to do. I'm mostly sure that whatever I do, if I do anything at all, will be wrong. Or, at least, someone will think its wrong and will be disappointed. \n\nThis isn't supposed to happen to me... All I'm trying to do with my life is get through college; how hard does it really have to be? \n\nI graduated community college with a 3.89 GPA, and transferred to one of the best 4-year schools in the country. Suddenly, I can't focus on anything or take a relevant note to save my life. \n\nI've been to a psychologist twice, to be evaluated for ADD or ADHD. The psychologist seems to think that I did, in fact, have a severe case of ADHD as a child, but because I was always well-above grade level in literally -everything- in school, I've compensated for it, and it was never really a problem. I filled out a number of surveys, and he said that I scored very high for anxiety, which is probably triggering the ADHD symptoms. I'm currently within normal limits for ADHD -- He doesn't think its the primary issue. \n\nOf course, the psychologist couldn't help me, because I don't have text-book symptoms. He referred me out to a psychiatrist. A real-live, for reals, serious, went-to-med-school-and-everything diagnoser of crazy. \n\nHello, anxiety over having something actually *wrong* with me. I've been to all sorts of doctors before, for all sorts of things. But this is scary. I can't even think about it without crying. \n\nI've had two incidents in the last few months that are a bit alarming to me, and I've mentioned them to the doctor. I'm not sure I'd call them panic attacks. They both happened at totally normal, run-of-the-mill social gatherings. Both times, I got really nervous and scared and started crying for no fucking identifiable reason. None at all. The first time, I literally just got up, left, and took a cab home crying. The second time, I had some tequila, and I managed to sit quietly alone with my eyes shut for a few minutes and re-center myself, a little. \n\nLike I said, this is new for me. And I don't know whats brought it on. [I'm not the expert -- This is why I'm seeing a psychiatrist.] I feel like I've exhausted and frustrated every person who is close enough to me to actually know whats going on, and I've successfully hidden it from the rest. \n\nI wish someone understood that I don't need or want anyone to solve my problems for me. I want someone to sit silently beside me when I freak out, and just let me fucking process, without interjecting their own opinions, or saying things that dismiss or invalidate the way I feel in that moment. I don't need to hear yet -another- person telling me \"Everything will be fine, don't worry, this is silly, it will all work out, etc.\" \n\nI feel alone, stupid, and lost. I feel like a complete fucking nut job. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This shit is ruining my life. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/14x9lx/this_shit_is_ruining_my_life/",
            "user_reports": []
        },
        {
            "author": "Subhazard",
            "author_created_utc": 1267261658,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_3wsrx",
            "created_utc": 1355743162,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14zmlm/anxiety_sufferers_on_the_path_to_recovery_for/",
            "gilded": 0,
            "id": "14zmlm",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14zmlm/anxiety_sufferers_on_the_path_to_recovery_for/",
            "retrieved_on": 1413283917,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I think reading some success stories would make me feel better, maybe give me some hope that there's a light at the end of this tunnel.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety sufferers on the path to recovery.  For those of us still in that dark, terrifying hole, please impart with us a glimmer of hope: Tell us about your journey away from anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/14zmlm/anxiety_sufferers_on_the_path_to_recovery_for/",
            "user_reports": []
        },
        {
            "author": "SarElle",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1356072640,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/157s6x/relaxing_any_kind_of_art_medium_is_one_of_the/",
            "gilded": 0,
            "id": "157s6x",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/157s6x/relaxing_any_kind_of_art_medium_is_one_of_the/",
            "retrieved_on": 1413272094,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "As someone who has suffered from pretty severe anxiety, I have tried a multitude of things to help me manage my worries. Here's a list of what has worked best for me:\n\n*I apologize if some seem kind of obvious or I'm being redundant* \n\n\n* Simply listening to music is a great way to start, it gets your brain focusing on something other than what's making you anxious\n* Singing or playing music is a step above that, no matter what it is, you want to be doing something that's distracting and stress relieving, so depending on your anxiety I wouldn't suggest trying to play or practice something that might frustrate you further, an easy judgement call you can make at the time.\n* Writing. Often times, when I am the most anxious, I write in a journal to organize my thoughts, this - 100% of the time, gives me a better outlook on the situation and makes things seem more manageable. \n* Dancing is by far, without a doubt, my favourite way to blow off some steam. Even if it's only for 5 minutes by myself in my bedroom, I am able to put on some music and just completely let myself go. Once you're able to get over the awkward-factor, because let's face it, we're all a little too anxious to not feel silly dancing our hearts out by ourselves, and this is where you just have to push yourself out of your comfort zone and remember that it **doesn't matter**. You're alone and there is no one there to judge you! Dancing help you get your mind off things, the music will put you in a better mood and you've done some cardio to boot!\n\n\n***Hope this helps!***",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] Any kind of art medium is one of the best ways to get out of your head and rationally thinking",
            "url": "http://www.reddit.com/r/Anxiety/comments/157s6x/relaxing_any_kind_of_art_medium_is_one_of_the/",
            "user_reports": []
        },
        {
            "author": "Mo3",
            "author_created_utc": 1281251919,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_48mg3",
            "created_utc": 1355946719,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/154hz5/guys_i_found_an_incredibly_effective_and/",
            "gilded": 0,
            "id": "154hz5",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/154hz5/guys_i_found_an_incredibly_effective_and/",
            "retrieved_on": 1413277275,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "Diagnosed with GAD 5 Months ago, my life has been terrible since then. Anyway, a few weeks ago I read somewhere that hypnotherapy is a very effective way of treating anxiety disorders so I thought \"Why the fuck not, I've got nothing to lose.\". Went on Youtube and found a few self-hypnosis sessions for anxiety. I tried out all of them and found one that touched me in particular. The first time listening to it.. was a BLAST. I felt so very much at peace and was completely worry-free. So over the course of the next 10 days, I listened to it every day before bed. And now the clenching anxiety I used to have is just.. almost completely gone. I still have trouble believing it. I don't usually believe in spiritual crap like that, but self-hypnosis is the biggest gift I could've ever been given.\n\nThis is the session that I use (yes, the woman looks great, but it's the best video I could find, believe me - she is amazing): \n\nhttps://www.youtube.com/watch?v=syL1fyEQKJs&amp;feature=youtube_gdata_player\n\nHow to use: Lay down on your back, put earbuds in, turn the lights off, just listen, follow the instructions, imagine everything she says as if it was true and just put your worries aside for a few minutes - you can continue worrying afterwards if you still feel like it.\n\nPlease try it out and report back :) Love you guys.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Guys, I found an incredibly effective and beautiful way to fight my GAD/hypochondria.",
            "url": "http://www.reddit.com/r/Anxiety/comments/154hz5/guys_i_found_an_incredibly_effective_and/",
            "user_reports": []
        },
        {
            "author": "holdmykeysimgoingin",
            "author_created_utc": 1339809639,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_80es9",
            "created_utc": 1355688291,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/14ycww/help_anytime_i_talk_i_feel_anxiety/",
            "gilded": 0,
            "id": "14ycww",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/14ycww/help_anytime_i_talk_i_feel_anxiety/",
            "retrieved_on": 1413285681,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I hate talking and it's really limiting me. The moment I open my mouth and sound comes out, I get really anxious and uncomfortable. I start thinking of how ugly I probably sound, how my voice is probably too deep and low, and I feel some sort of a strain that doesn't go away until I stop talking. Anyone else have any experience with this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[HELP] Anytime I talk I feel anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/14ycww/help_anytime_i_talk_i_feel_anxiety/",
            "user_reports": []
        }
    ]
}