{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328923813,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pk7kh/how_i_feel_when_doing_anything_not_just_leaving_a/",
            "id": "pk7kh",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pk7kh/how_i_feel_when_doing_anything_not_just_leaving_a/",
            "score": 151,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How I feel when doing anything, not just leaving a store (x-post from r/funny)",
            "url": "http://i.imgur.com/OCZBn.png"
        },
        {
            "author": "DMHReaper72",
            "author_created_utc": 1320321805,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_66763",
            "created_utc": 1328639785,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pezbm/flooding_how_i_deal_with_panic/",
            "id": "pezbm",
            "is_self": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pezbm/flooding_how_i_deal_with_panic/",
            "score": 80,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/vcEwC14AyZmAPGoh.jpg",
            "title": "Flooding  - How I deal with panic",
            "url": "http://imgur.com/8zmMH"
        },
        {
            "author": "sophietrophy",
            "author_created_utc": 1328913184,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6w4h7",
            "created_utc": 1328992087,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pl4il/i_never_have_anything_to_say/",
            "id": "pl4il",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pl4il/i_never_have_anything_to_say/",
            "score": 65,
            "selftext": "Maybe it's due to social anxiety or something else, but in new social situations I can't think of anything to say and feel really stupid as a result. Does anyone else experience this?\n\nI'm a great listener, but when it comes to keeping a conversation going, or moreso starting one, I always struggle to come up with something to say. I am shy, yes, but I do genuinely like hanging out with people and generally don't like to be a loner (&amp; stay at home all the time wishing I had plans). I find it incredibly hard to make friends when I come off as aloof or disinterested, when I'm actually just unsure of what to say next.\n\nI'm so envious of people that can shoot off funny one-liners and tell good stories. I feel like I have no good stories!\n\nThis ultimately convinces me that I'm just a boring person with nothing to offer the world and no passions. I let my shyness and uncertainty get in the way to trying new things and exploring possible passions. \n\nI guess I'm looking to connect with other folks who may feel this way or similarly. I have always wanted to be outgoing and have felt happiest in my life in the rare times I've been comfortable enough to be and had a lot to say. The other 99% of the time I'm shy, quiet, and feel like I thus make others uncomfortable and not want to be around me. It's like I'm an extrovert (who needs the energy of social interaction) inside the thick shell of an introvert.\n\ntl;dr- I feel like an extrovert trapped in the shell of an introvert and wish I had more things to say(one-liners, stories, small talk) to break the ice and thus my introvert shell. DAE feel this way?\n\n**EDIT: Thank you all for your responses. It helps to know there are others who feel this way and that I'm not alone. Feel free to pm me if anyone wants to continue the discussion/commiserate. I don't know of any support groups in my area (Boston) so I thought this would be a good place to start. Thank you all again for taking the time to comment.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I never have anything to say.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pl4il/i_never_have_anything_to_say/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329241900,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ppcy9/oh_no_no_no_no_no_no_no_no/",
            "id": "ppcy9",
            "is_self": false,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ppcy9/oh_no_no_no_no_no_no_no_no/",
            "score": 64,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Oh, no. No. No no no no NO NO!",
            "url": "http://imgur.com/CVF2j"
        },
        {
            "author": "oogie20",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328698081,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pg3tm/i_finally_figured_it_out/",
            "id": "pg3tm",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pg3tm/i_finally_figured_it_out/",
            "score": 50,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/ef-xt6B0_WRyy5EZ.jpg",
            "title": "i finally figured it out",
            "url": "http://imgur.com/9mUhR"
        },
        {
            "author": "starrynightgirl",
            "author_created_utc": 1313686493,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ou1u",
            "created_utc": 1329097989,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pmtkw/massive_anxiety_just_for_looking_at_job_postings/",
            "id": "pmtkw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pmtkw/massive_anxiety_just_for_looking_at_job_postings/",
            "score": 48,
            "selftext": "Hello\n\nI will be honest. I have graduated from a \"good school\" about close to 4 years ago, but my depression kicked full gear in school and I graduated with a 2.9 with a \"artsy\" major.\n\nIt was 2008 when I graduated, and I realize that when I graduated, that I was graduating in the middle of the worst economic recession since the 1920's.\n\nSo I bailed on my future. My anxiety rose up, and I spend a year doing nothing but job applying. My first job interview, I fucked up. I was criticized for my clothes not being professional enough. At least they told me. The other rejections came, but they never told me why. I started to get hung up on my looks (I look 17 on my best days, 16 on most days since I am short with a baby face) After all of those fiascos, I applied for temp jobs, working on and off (mostly off) for about 3 years now.\n\nI want a stable income and a stable good enough job. But here's the kicker: This anxiety shoots up inside of me whenever I look at job postings.\n\nThis is how the process is:\n\n1) looks at job postings (the few times in the year that I do, it takes soo much out of me to do this part btw)\n\nThe thoughts start to race: *god, I don't like these jobs*, *god, I don't qualify for anything*, *i am obviously going to get rejected*.\n\nThen my heart starts pumping like I am in a marathon.\n\n*fuck*. Then I feel so fucking worthless and helpless.\n\nI want a job, I really do. But I guess not good enough, since I can't fucking get over looking at job postings without being hit with this massive anxiety.\n\nWriting resumes/cover letters is also horrible. I can't think of anything to say. I become a blank page.\n\nGlad to get this off my chest.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Massive Anxiety just for LOOKING at job postings!",
            "url": "http://www.reddit.com/r/Anxiety/comments/pmtkw/massive_anxiety_just_for_looking_at_job_postings/"
        },
        {
            "author": "Nokwatkwah",
            "author_created_utc": 1306339381,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5aa8j",
            "created_utc": 1328998466,
            "domain": "quickmeme.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pl8wn/pleasejust_stop/",
            "id": "pl8wn",
            "is_self": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pl8wn/pleasejust_stop/",
            "score": 36,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/TIcGF8lXYq_OOzK8.jpg",
            "title": "Please...just stop.",
            "url": "http://www.quickmeme.com/meme/361svi/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328822270,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pibt7/anybody_have_both_anxiety_and_adhdadd/",
            "id": "pibt7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pibt7/anybody_have_both_anxiety_and_adhdadd/",
            "score": 23,
            "selftext": "I was recently diagnosed with adult ADD (i am a 20 year old college student). I've gone my entire life dealing with it, struggling with my schoolwork, and finally decided to get tested. It's incredibly frustrating because, at the risk of sounding conceited, I know I'm a smart guy. Yet, my grades are not a good indicator of my intelligence. I was able to make my way through high school using my \"common sense\", but the college workload is now overwhelming for me. \n\nNow, the psychologist who did my ADD testing simply recommended a stimulant medication (adderall, vyvanse, etc.). However, once I told him that I suffered from anxiety and panic attacks he said that stimulants often exacerbate both of those things. So I'm stuck. Ive tried natural supplements for concentration, tutors, everything possible. I feel like the medication is the only thing that could potentially help my attention defecit, but i don't want to have to go through more panic attacks if i have to. Needless to say, they terrify me.\n\nAs far as my anxiety goes, it's only been a problem for me for the past six months or so. In the beginning I was plagued with feelings of derealization, as if I was going crazy and losing my sense of what was real. I've since learned some coping skills, and the panic attacks have become less frequent; only about twice a month or so. The general anxiety feeling is still there, but the \"going crazy\" feeling is gone. Now i'm simply anxious about having the panic attacks themselves, it's a sort of vicious cycle of thinking.\n\nTo get to the question, can anybody with anxiety here take a stimulant medication without it triggering a panic attack or making your anxiety worse? I have taken a friend's ADD medicine during high school (i know, i know) before my anxiety began, so i know what it feels like. I'm trying so hard to find a solution, any advice would be helpful. \n\nedit: word choice",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anybody have both anxiety and ADHD/ADD?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pibt7/anybody_have_both_anxiety_and_adhdadd/"
        },
        {
            "author": "DocSkillz",
            "author_created_utc": 1328722700,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6vezj",
            "created_utc": 1329159949,
            "domain": "overthecounteranxietymedication.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pnt7i/10_over_the_counter_anxiety_medications/",
            "id": "pnt7i",
            "is_self": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pnt7i/10_over_the_counter_anxiety_medications/",
            "score": 20,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/cO5hD-IORjmZDpMU.jpg",
            "title": "10 Over The Counter Anxiety Medications",
            "url": "http://overthecounteranxietymedication.org/"
        },
        {
            "author": "H00ded",
            "author_created_utc": 1323676832,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6f85v",
            "created_utc": 1328812773,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pi3mm/how_do_you_explain_your_anxiety_to_other_people/",
            "id": "pi3mm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pi3mm/how_do_you_explain_your_anxiety_to_other_people/",
            "score": 18,
            "selftext": "Most of the people I explain it to, don't get it at all. Mostly my parents. I'm in my mid 20's and trying to explain it to my Dad doesn't work at all. He just says, \"just get up, go and do stuff, get your mind off it\" It's infuriating trying to explain it, especially when he lives overseas. Mum lives in another country too and tries to understand, but is it a case of, you don't get it, unless you got it? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you explain your anxiety to other people?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pi3mm/how_do_you_explain_your_anxiety_to_other_people/"
        },
        {
            "author": "sraje5",
            "author_created_utc": 1295959518,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4rjvy",
            "created_utc": 1328821235,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/piaxn/for_all_you_people_with_anxiety_like_me_i_offer/",
            "id": "piaxn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/piaxn/for_all_you_people_with_anxiety_like_me_i_offer/",
            "score": 16,
            "selftext": "I have been dealing with anxiety and depression for 5 years on and off depending on what is going on in my life it worsens and gets better and I know for those of you who feel like you have no one to talk to I would like to offer a nice chat. Just a person to talk to whenever you feel like you're depressed or anxious, my skype address is ssraje so feel free to add me or message me here, I will listen and will try and help. \n\nI AM NOT IN ANYWAY MEDICALLY TRAINED. I am just offering a service for anyone who wants to vent or feels like they have no one to talk to, I can only offer my personal account on my own experiences and what has worked for me to overcome it at times. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "For all you people with anxiety like me, I offer you as much help as I can possibly give. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/piaxn/for_all_you_people_with_anxiety_like_me_i_offer/"
        },
        {
            "author": "yourbasicdude",
            "author_created_utc": 1326208094,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6mo7b",
            "created_utc": 1328766009,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/phfze/lonely_anxious_depressedwhat_do_i_do/",
            "id": "phfze",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/phfze/lonely_anxious_depressedwhat_do_i_do/",
            "score": 15,
            "selftext": "I haven't had a good friend in 7 or so years and I am almost a 21 year old man. I suffer from pretty bad anxiety whenever I talk to people or even leave my home, I'd talk to a psychologist but I don't know if I can do that. Together these are making me pretty damn depressed.\n\nSome days I don't feel so bad, some days I don't feel like a freak. I used to exercise but I injured myself and haven't been able to get out much. Whenever I even consider doing certain things it's like I hit a wall, my anxiety blocks me off and I immediately start to feel shitty about it, which worsens my depression. I don't have any friends I can talk to about this.\n\nPart of the reason I think I got so anxious is that I stopped making friends years ago. I can't really fathom why, but I just hated the idea of making new friends when I got to middle/high school, I clung to my best friend until he started getting involved in drugs/vandal shit and I didn't want to. For some reason my other friends kind of disappeared at this time, stopped calling, stopped talking to me. At the time I thought all the other kids at my new school were stupid, that they weren't as mature as me; why should I open myself up to these kids I might not even like? I dunno, maybe it was some sort of pride thing, at the time I was nervous but I really didn't want to be friends with most of them. I had older siblings that I was close to that kind of shaped my tastes, so I didn't share much with my peers, or so I thought. Years later as the other kids became more relaxed and outgoing in school and freely exercised their personalities in public I found that some of them were actually pretty cool, which only furthered my depression as I realized that I had missed out on becoming friends with them.\n\nAnyway, I pretty much became a loner around 9th grade and that was when the anxiety started pouring in, when I lost any friends to talk to in class, when I didn't have anyone to sit with at lunch. I had placed myself above everyone else and then when I needed friends I was too proud and too nervous to actually make friends. For me to go and sit at a group that seemed alright and talk to them just didn't seem possible, I wasn't going to be some supplicant or impose myself on them. I had already created an impression, a mould, in their minds that I couldn't force myself to break. I found myself living to a script that my perception of the public, my anxiety, had made for me. One of the funniest things is that people did reach out to me, offered me friendship, but I turned them down, almost arrogantly. I wanted to seem happy with my solitude, and I guess that's how it looked; I wasn't the typical outcast, I wasn't physically awkward in any way. Everyone in school, even the outcasts, had a group of friends but me, I was truly alone, and it was a self imposed exile.\n\nAs I said, this was when the anxiety really awoke in me, when I would get sick in my stomach as I arrived at school, a feeling that wouldn't go away for an hour or so. I avoided any social event, and anything social forced on me was torture. Any period where other kids would talk to their friends was a period of self loathing and withdrawal for me. Anytime they looked at me, whether it be someone from my grade or below me, I would just imagine the derision in their minds and become bitter. Class was the only time I felt ok, I was still so nervous that my hands were always sweaty, but the structure of it usually precluded social interaction and allowed me to not be so stressed. I never spoke in class and would freeze for a moment when the teacher would call on me, this was agony. Without any kind of social support I felt like I was adrift at sea, slowly drowning.\n\nEventually the anxiety just started seeping into all the other parts of my life. I've been unable to make even simple decisions, like what sort of drink to get at a store or restaurant. I can't drive, the fear of traffic and getting hit are too much for me. I struggle with classwork, with email, any area that is not a comfortable retreat offers me a barrier that I just can't get the energy to climb over. My anxiety has become like my shadow, like a version of myself that follows me everywhere. He holds me down, he whispers into my ear, and he has only become stronger and more convincing as time goes on. He feeds on my weakness, he grows from my sorrow. He has poisoned my mind and my soul. I don't think I'm suicidal, but at my worst I just don't feel like living. I wouldn't commit suicide, but I want to just lie under my blankets and not get out.\n\nI think I may have some natural inclination towards anxiety, there has been a history of it in my family I think. One of my parents suffers from panic attacks, I have an uncle who used alcohol to cope I believe, he's a recovering alcoholic and I have heard that he needed it to be social. I don't know if this affects anything, but if it helps it was worth mentioning. I have the jitters just sitting here typing, revealing these things to you, an anonymous group that I will never know. I can't imagine what it would be like to reveal any of this to a person face to face, let alone one I know personally. Anyway, what do I do?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Lonely, Anxious, Depressed...what do I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/phfze/lonely_anxious_depressedwhat_do_i_do/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329230471,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pp4ad/making_positives_out_of_negatives_long_post/",
            "id": "pp4ad",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pp4ad/making_positives_out_of_negatives_long_post/",
            "score": 15,
            "selftext": "*Hope this post makes a difference in somebody's life or at least makes somebody smile today.*\n\nBack when I was 12-14 I was overly aware that I wasn't right, I wasn't normal, I was different. I didn't go out with friends, I didn't go over to friends' houses, I panicked over school functions and first days of school were absolute HELL. I never tried new foods, I never tried a new activity, I never joined a team, I never raised my hand in class. I knew that everyone else wasn't like this, where friends would be laughing and talking about what they did over the weekend, I'd always just be sitting quietly at the end of the table.\n\nBeing so hyper-aware of my anxiety *(not that I knew what it was at the time)* made me miserable. I hated myself. I hated that the very idea of leaving my house for anything other than school terrified me. I hated finding excuses to not go places, to not participate in things, to not function as a teenager should. I became really depressed, I felt like I wasn't even alive, I did a lot of crying and a lot of sleeping, I even tried cutting myself but I found no release in it. Then I started day-dreaming about not existing anymore, when I'd be out walking I would imagine what it would be like to step out in front of a car and just die. I wrote a lot of mock suicide letters that I cried over and then destroyed. Getting the emotions out on paper made me feel better for a while, but the thoughts were still there. I remember dropping hints to my mom, trying to tell her what it was I was dealing with but she told me that she didn't want to hear any of it. It wasn't like she was a bad mom, but she went through a lot of this stuff with her mom, my grandma, who had schizophrenia and attempted suicide quite a few times so it just scared her, I think. So I felt very alone.\n\nThe only thing that kept me alive was love. I loved kids, still do, it was always a joke that I was a kid-magnet and they remember me years later and I apparently make quite an impression and become a role model. It always made me laugh that someone as dysfunctional as myself was a role model for any kid, poor them! And then there was the fact that being alive might hurt me, my daily fight with anxiety was painful beyond belief, but it would hurt my family and those kids and my few friends so much more if I died. I have a real knack for putting the world before myself so I actually couldn't be so selfish and die like that.\n\nAnyways, I eventually turned it around and looked at all my negatives and put a positive spin on it. By approaching my mom about my suffering *(despite pretty much getting shut down)* I helped prepare her to be more understanding when my sister developed a thyroid condition that had anxiety as a symptom. And my other sister, who suffers from OCD. I made it easier for her to listen to them, to understand, and to get them help where I didn't.\n\nDealing with my anxiety helped me be able to reach out to the kids where I volunteer, when it was their very first day at our program and they were scared. I understood what they felt and helped make them more at ease. Even with my dogs and their anxieties, when a storm is rolling in I will sit in my dog's \"safe space\" *(my closet)* and hold her until she goes to sleep, because I know what it's like to panic over something and not be able to calm down.\n\nI helped my sister through her anxiety while she had her thyroid trouble and I can understand my sisters compulsions and that makes me feel good about myself. I love being able to help them where even our parents can't. And my anxiety makes it hard to hold a job that isn't a work from home position, so I am available to babysit whenever somebody needs it and somebody usually does. \n\nI've had anxiety literally all my life, I don't remember a day when I wasn't terrified of something. So the positive spin on that is that I don't know what it's like to feel what normal people feel every day, I have never not been this way so I don't suffer from anxiety hitting me in the middle of my teen years or 20's and ruining what I had going for me.\n\nThere is always a positive in the darkest things in life, sometimes it just takes a real long time to see. It took me a few years to acknowledge and find things that are pluses from anxiety. I'd never be so understanding or compassionate or so careful with the feelings of others if anxiety hadn't made me so hyper-aware and sensitive where my own feelings and fears were concerned.\n\nSome quotes to that effect: \n\n*“A pessimist sees the difficulty in every opportunity; an optimist sees the opportunity in every difficulty.”*\n\n*“The positive thinker sees the invisible, feels the intangible, and achieves the impossible.”*\n\n*“You've done it before and you can do it now. See the positive possibilities. Redirect the substantial energy of your frustration and turn it into positive, effective, unstoppable determination.”*\n\n*“Once you replace negative thoughts with positive ones, you'll start having positive results.”*\n\n*“Instead of thinking about what you're missing, try thinking about what you have that everyone else is missing.”*\n\n*“There are always flowers for those who want to see them.”*",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Making positives out of negatives. [Long post]",
            "url": "http://www.reddit.com/r/Anxiety/comments/pp4ad/making_positives_out_of_negatives_long_post/"
        },
        {
            "author": "MrsPumpkincrook",
            "author_created_utc": 1293322276,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4nlh4",
            "created_utc": 1329063812,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pm4wj/scumbag_brain/",
            "id": "pm4wj",
            "is_self": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pm4wj/scumbag_brain/",
            "score": 14,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/2CJ69l68o_68Dk1I.jpg",
            "title": "Scumbag Brain",
            "url": "http://i.imgur.com/uzvon.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328649505,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pf7gw/registered_for_a_class_this_semester/",
            "id": "pf7gw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pf7gw/registered_for_a_class_this_semester/",
            "score": 14,
            "selftext": "I have 17 classes left before I have my degree in Mathematics, and my anxiety has been severe on and off (mostly on) for the entirety of my secondary education.\n\nLast year, I \"dropped out.\"\n\nMy husband encouraged me, and I registered for an online class. I still have a few general classes left that I can take online (phew!).\n\nI thought things were hopeless, but baby steps.\n\nIt feels great. Scary, but great. I have been lurking here for awhile, and I wanted to say thank you. You all make me feel so un-alone and hopeful.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Registered for a class this semester!",
            "url": "http://www.reddit.com/r/Anxiety/comments/pf7gw/registered_for_a_class_this_semester/"
        },
        {
            "author": "dweckl",
            "author_created_utc": 1253638522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3n51i",
            "created_utc": 1329101595,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pmwc6/your_anxious_brain_is_nothing_but_a_compulsive/",
            "id": "pmwc6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pmwc6/your_anxious_brain_is_nothing_but_a_compulsive/",
            "score": 14,
            "selftext": "Ever been anxious or have a panic attack about something, and the fear never came to pass?  Probably pretty often...in fact, I would guess that nearly every anxious incident or panic attack has at least some fear involved that never comes to pass. \n\nIf you answered 'yes' to this question, then your brain literally has been lying to you, maybe for years.  That time your brain convinced you that you were dying of cancer?  Liar.  Or that time you were just sure you were going to fail that test?  Lies. \n\nHow about the time you were anxious for days about a work task you were sure you couldn't finish or would mess up terribly, and then you got it done and everything went okay?  That lying brain again...\n\nRemember the anxiety you had about a confrontation with someone, and your mind created a video-prediction of a brutal fistfight with you losing and being embarrassed in front of the whole school/bar/party?  Didn't come true, did it? \n\nYour brain is a compulsive liar.  Treat it that way.  The next time you have really anxious thoughts or panic attacks, let your mind say whatever it wants, because you know it can't be trusted and compulsively lies. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Your anxious brain is nothing but a compulsive liar - treat it as such...",
            "url": "http://www.reddit.com/r/Anxiety/comments/pmwc6/your_anxious_brain_is_nothing_but_a_compulsive/"
        },
        {
            "author": "mdm2266",
            "author_created_utc": 1218335002,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_37qw7",
            "created_utc": 1328925539,
            "domain": "ru.memegenerator.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pk8oz/hypochondria/",
            "id": "pk8oz",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pk8oz/hypochondria/",
            "score": 12,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/4c1BteI9fQi52H1u.jpg",
            "title": "Hypochondria",
            "url": "http://ru.memegenerator.net/instance/14421888"
        },
        {
            "author": "MrBloopDaWoop",
            "author_created_utc": 1328577072,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6uvml",
            "created_utc": 1328739459,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pgvqf/anxiety_as_an_immigrant/",
            "id": "pgvqf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pgvqf/anxiety_as_an_immigrant/",
            "score": 12,
            "selftext": "Hello all,\n\nHere's my pathetic story, I have no one to talk to so I thought I would make a new account and spill the details.\n\nI've had anxiety ever since I was around 14, it was mild then. I could still go outside with friends and have fun. Then I moved to Canada, Canada is an amazing country, the people are great, the weather is nice, the houses are big and crime is low. I should be so happy but I can't be.\n\nEvery time I walk by someone I think to myself \"That person hates me because I'm an immigrant, I bet they think I own the place as I'm walking by them.\" It's terrible, I can't speak to anyone as I know they're thinking \"Oh no, another immigrant, why don't you go back to your own country.\" My rational brain is telling me that's bullshit as I know Canadians don't think that way but I can't stop it.\n\nI also hate my accent, I'm Scottish so it's pretty strong and hard for Canadians to understand, I try my hardest to not talk at all, I just wish I was born here, I wish I was normal. I have no friends, I can barely walk out the front door. \n\nI can't see a therapist or doctor because I think Canadians need help before I do as I'm an immigrant here, I don't want to go to a therapist of doctor complaining of anxiety when there are people that need real help. I've been thinking about suicide a lot, I doubt I would have the courage to actually do it but it's always there, in the back of my mind.\n\nI don't have any prospects, I'm 19, I don't go to college (I wish I could), the job I had let me go at Christmas and I just don't know what to do. I'm so scared.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety as an immigrant. :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/pgvqf/anxiety_as_an_immigrant/"
        },
        {
            "author": "webcrawler89",
            "author_created_utc": 1323809741,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6flo9",
            "created_utc": 1328732866,
            "domain": "reddit.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pgpyl/xpost_from_getmotivated_but_i_thought_we_could/",
            "id": "pgpyl",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pgpyl/xpost_from_getmotivated_but_i_thought_we_could/",
            "score": 12,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/VRWzrsZ_oWHyPhry.jpg",
            "title": "x-post from GetMotivated, but I thought we could maybe use it too.",
            "url": "http://www.reddit.com/tb/pgm2n"
        },
        {
            "author": "minusidea",
            "author_created_utc": 1249438160,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3kpa7",
            "created_utc": 1328859433,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pj3zj/i_cant_deal_with_this_anymore/",
            "id": "pj3zj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pj3zj/i_cant_deal_with_this_anymore/",
            "score": 10,
            "selftext": "I just woke up from a cramp in my left calf and my brain is connecting it with a dream I had a few days about about my daughter dying while dressed up as a ninja. Yeah it was a fucked up dream... So naturally my head says \"You have a DVT\". Yes I'm fat and yes I sit a lot but besides a cramp that's the only symptom I have.\n\nAnyway I just can't deal with this shit anymore... if I get heart burn it's a heart attack, if something feels out of whack it's something else. It's like I am trapped inside my own head with every fucking illness in the book. And the thing is I don't know how I got here.\n\n7 years ago I wasn't like this. 5 years ago my father died from a cardiac arrest and they said I had PTSD. But I'm scared of everything now. When I drive on the highway I count mile markers in case I need to call 911 because of a heart attack. I ask my kids constantly \"do you know where you're at?\" or \"what do you do if something happens to me?\". I won't fly because the plane will crash. I am scared to take care of myself like getting on an elliptical because I'm sure I'll die while I am on it or right after I get off it.\n\nI can't deal with this anymore... I deal with it everyday and I don't want to deal with it tomorrow.\n\n11:32AM 2/10/12 : Thank you guys for the support and emails. I will respond shortly I've been going all day with work and haven't had 20 minutes to respond. I will get back to you guys soon though. Thank you very much, it was awesome to wake up and realize that I'm not alone.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't deal with this anymore... ",
            "url": "http://www.reddit.com/r/Anxiety/comments/pj3zj/i_cant_deal_with_this_anymore/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329240313,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ppboj/i_feel_like_im_trapped_with_no_way_out_im_not/",
            "id": "ppboj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ppboj/i_feel_like_im_trapped_with_no_way_out_im_not/",
            "score": 10,
            "selftext": "I'm on medical leave from school right now. Since late middle school I've had troubles with attendance due to my ever-increasing anxiety, and ever since then my mother has been on edge. I know she cares for me and it hurts her to see me in pain, but the way she deals with it makes me want to kill myself.\n\nI can't ask her to stop putting me down with a list of things I haven't done, \"You NEVER walk the dogs. You NEVER do the laundry. You NEVER take out the garbage.\" I tell my parents to stop doing these things for me then, so I can learn what it's like to live without those benefits and do them myself, but they don't.\n\nShe'll just continue on her daily tirades of reminding me of all my failures and then turning around and saying to me \"Are you going back to college? You're not anxious, just stop thinking about that.\" This goes on for the rest of the week.\n\nI can't say anything to her that would get her to stop. I just feel like doing nothing, until I slowly build up the courage to go outside. Then when I feel good about making baby steps, my mom is there to remind me of everything I *could* have done but *haven't.*\n\nIf I try to talk to her and explain how she makes me feel, she goes into a tirade of how I'm blaming her for my problems and to stop making excuses.\n\nI can't deal with this anymore. She always gets angry when I ask her not to say things so negatively to me, and she'll go hit the floor or throw something really hard. My dad tells me to just deal with it, but I'm at the edge.\n\nTo top it off, I'm expected to see a psychiatrist today for my appointment, but I don't see the fucking point because I'm going to see another soon. I hate everything about my life and feel like I have no control over it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I feel like I'm trapped with no way out. I'm not suicidal, but I can't deal with my mom anymore.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ppboj/i_feel_like_im_trapped_with_no_way_out_im_not/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329110776,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pn3bo/was_calling_a_psychiatrist_the_right_thing_to_do/",
            "id": "pn3bo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pn3bo/was_calling_a_psychiatrist_the_right_thing_to_do/",
            "score": 9,
            "selftext": "I have been dealing with anxiety my entire life but it got extreme very recently.\n\nBasically my situation is that I graduated from college last year and got a job in a different field.  I was miserable going into work every day and I knew that this job wasn't for me.  I started having anxiety attacks and it got so bad that I told them I was leaving.  \n\nA lot of my anxiety stems from the fact that I have no idea what I want to do in life, I am living at home, I have no friends here, and now I'm jobless.  \n\nMy anxiety makes me freak out over taking phone calls, driving on the highway, going to places like bars and clubs, etc....\n\nMy mom got the number of a psychiatrist but she wasnt in so I left a message.  Should I have went to my GP first?  If she calls should I book an appointment?  Idk haha.  Now I'm having anxiety over this.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Was calling a psychiatrist the right thing to do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pn3bo/was_calling_a_psychiatrist_the_right_thing_to_do/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329102092,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pmwpz/just_got_back_from_the_emergency_room_how_did_you/",
            "id": "pmwpz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pmwpz/just_got_back_from_the_emergency_room_how_did_you/",
            "score": 9,
            "selftext": "Had a heartrate of 150 and could barely breathe. After a few tests, the doctor said it was due to my anxiety. I was also a little malnourished and dehydrated because I just haven't had the motivation to eat or drink (depression).\n\nA pretty shocking reminder to get back on my medication. I guess sometimes we get so caught up in our mental illness that it seems perfectly normal, right? The usual.\n\nWhat about you? Did you know you needed meds, or did someone tell you? Has a situation in the past just made you think, \"Wow, I need to get this under control before something really terrible happens\"?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just got back from the emergency room. How did you know you needed medication?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pmwpz/just_got_back_from_the_emergency_room_how_did_you/"
        },
        {
            "author": "Throwaway7615",
            "author_created_utc": 1329067556,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6wlwh",
            "created_utc": 1329212738,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/powz7/anxious_over_girl_fear_that_i_wont_get_over_it/",
            "id": "powz7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/powz7/anxious_over_girl_fear_that_i_wont_get_over_it/",
            "score": 9,
            "selftext": "This'll partially be the same story as in\nhttp://www.reddit.com/r/ihaveissues/comments/pm78n/broken_heart_first_time_physical_problems/\nBut since I know some more now (and have more questions), I'll ask a bit more. This'll probably also be partially just writing things down for myself.\n\nShort story: Whenever I think of or talk with with a girl (who is one of my best friends) who has rejected me, and is now going with one of my other best friends, I start to get really.. Anxious, probably.\n\nSweating, trouble with breathing, nausea, throwing up, tension on belly, and just being really nervous or something. It comes down that I pretty much completely shut down. I also hardly eat anything anymore.\nI see this girl and guy every day at uni (we do the same study, same everything), and I'm alright that she doesn't like me, but my body doesn't agree with it, or there's something deeper.\n\nI went to my GP, and he told me it was stress/anxiety (I told him the whole story), and prescribed me Propranolol.\nI took one yesterday, and it seemed to help somewhat, but I still couldn't talk with her over Skype, or just get in the group chat we usually have (~10 people) without getting really sick. He said I should take 1 each day, does anyone know when it starts to work and when it wears off?\n\nI tried going to uni today, but I had to leave after around 15minutes, since the trembling and nausea was too much for me to handle. I didn't even talk to her in that time, just sat with the rest of the group.\n\nI'm kinda afraid that this will never go away, so should I see a therapist or something? Or while just time heal this? I've had this shit since last friday, and it's been constantly shit since. I just want to be able to talk to my friends again, and be able to just follow classes without problems.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxious over girl, fear that I won't get over it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/powz7/anxious_over_girl_fear_that_i_wont_get_over_it/"
        },
        {
            "author": "Feided",
            "author_created_utc": 1318817367,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_621q4",
            "created_utc": 1328643892,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pf2o3/i_have_severe_anxiety_i_found_out_i_have_ptsd/",
            "id": "pf2o3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pf2o3/i_have_severe_anxiety_i_found_out_i_have_ptsd/",
            "score": 9,
            "selftext": "Im 21 years old, male, living in los angeles.\n\nOne day in November of 2010 i got robbed at gun point, a week after my best friend shot himself in the head infront of me. Ever since those  events i developed a disorder that did not allow me to even leave my bedroom, and when ever i was out it was very difficult because i experienced multiple anxiety attacks fearing for my life.\n\nAt the moment, i dont feel the random attacks as much anymore, but any time that i am driving on the freeway, if i feel a small stomach pain or a little head ache i trip out instantly assuming a bullet hit me and its just taking a second to sink in for me to feel the pain and realize that it went inside me, so i start padding my body down looking for blood etc. Also the worst of them all is when i hear a sound that sounds like a gun shot, or a muffled gun shot... that right there is the worst and i get a crazy shock wave-ish sensation in my body to the point where its very unbearable, the last time this happened my jaw instantly started hurting really bad soon as that shock traveled through my spine. ive been given low dose of xanex but this is not helping me get over this feeling... \n\nby the time the anxiety fades away the drug kicks in when i dont need it to. If anyone with a similar experience or anyone who knows what i can do to become better, or live my life better please share your personal thoughts with me, thanks guys!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have severe anxiety, i found out i have PTSD",
            "url": "http://www.reddit.com/r/Anxiety/comments/pf2o3/i_have_severe_anxiety_i_found_out_i_have_ptsd/"
        }
    ]
}