{
    "data": [
        {
            "author": "curiouser2",
            "author_created_utc": 1254343691,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3nkxs",
            "created_utc": 1328058352,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p5e6z/whenever_i_get_bad_anxiety_seeing_this_is_the/",
            "id": "p5e6z",
            "is_self": false,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p5e6z/whenever_i_get_bad_anxiety_seeing_this_is_the/",
            "score": 65,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/fVTpp_i-2Cce3xdL.jpg",
            "title": "Whenever I get bad anxiety, seeing this is the most relaxing [pic]",
            "url": "http://imgur.com/gct3m"
        },
        {
            "author": "favor_cut",
            "author_created_utc": 1328221801,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6toen",
            "created_utc": 1328295040,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p9ks9/how_the_heck_am_i_going_to_function_in_this_world/",
            "id": "p9ks9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p9ks9/how_the_heck_am_i_going_to_function_in_this_world/",
            "score": 46,
            "selftext": "I've been homeless now for about 9 years. I've not been able to keep a job to save my life. Every time I get a job I just end up getting into an argument with someone or someone says something smartass and I get this anxiety panic and I have to walk out. I can't talk to anyone for long without having some kind of panic or being able to focus on what they are saying. I can't talk to a therapist, a doctor or anyone. I probably won't come back to this post in fear of what people will say. Today I really just sat around the library and thought about how much I won't be able to do because of the way I act. I've screwed my life up for so long now I fear that even if I did get over it and got a job I couldn't make enough money to retire. I'll be working to the day I can't work and that day who knows what will happen to me because I won't be able to afford medical care.\n\nI don't think modern society or mankind is something that was meant for me. I fear I will die just like I've been living for the last 9 years. Homeless, alone, scared and sad.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How the heck am I going to function in this world when I hate being around people so much?",
            "url": "http://www.reddit.com/r/Anxiety/comments/p9ks9/how_the_heck_am_i_going_to_function_in_this_world/"
        },
        {
            "author": "ThrowawayMcSocksalot",
            "author_created_utc": 1315084012,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5sabu",
            "created_utc": 1328054541,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p5b5g/anxiety_preventing_me_from_getting_help_for_my/",
            "id": "p5b5g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p5b5g/anxiety_preventing_me_from_getting_help_for_my/",
            "score": 41,
            "selftext": "One of my worst anxiety triggers is talking to people I don't know on the phone. I get panicky when my phone rings and a number I don't recognize pops up, and making calls myself is even worse. I have to write out exactly what I'm going to say beforehand, and even then it sometimes puts me in tears and usually means I'm just not up for dealing with people at all for the rest of the day.\n\nNeedless to say, this puts me in a pretty shitty position for getting any sort of treatment, since finding a doctor involves lots of phone calls. Added to this is the fun of having never received my new insurance card when my company switched carriers last year (I know I'm covered, because it shows up on my paycheck), so I need to call *them*, too, and the fact that my parents won't give me my medical records and keep telling me to \"just call\" the psychiatrist I saw when I was in college and ask for my file and don't seem to understand that there is no such thing as \"just\" calling someone for me.\n\nBut my anxiety is getting worse, and it's gotten to the point where it's prevented me from doing important things like going to the dentist and getting medical care for semi-serious injuries, and a few times in the last couple of months, I've been close to not being able to convince myself to leave the house for work. So, I know I need help, but I have no idea how to get it. Any suggestions would be really appreciated.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety preventing me from getting help for my anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/p5b5g/anxiety_preventing_me_from_getting_help_for_my/"
        },
        {
            "author": "TherapeuticTherapist",
            "author_created_utc": 1327104707,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6pp6z",
            "created_utc": 1328411561,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pbeng/5_breaths_technique/",
            "id": "pbeng",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pbeng/5_breaths_technique/",
            "score": 30,
            "selftext": "I do this when I have anxiety building inside of me, and it works. Something about focusing on the breath and the feeling of belly breathing in and out just totally overwhelms my anxiety with calm, and I feel much better.\n\nThe way to do this:\n\n1. When you have a feeling of anxiety coming on, pause and notice it. Tell yourself \"I feel anxiety/panic/etc. coming on.\"\n\n2. Take a moment and put your awareness, focus your attention, on your belly.\n\n3. Begin to draw in a breath into the belly. Keep your attention on the sensation of the breath going in. The depth of the breath is not as important as focusing on the sensation of breathing. It is better to breathe slowly rather than quickly, however this can take time if you are feeling serious panic building. It might take you a few breaths to work up to slow breathing, but give it a chance. \n\n4. Exhale slowly. If you can, extend the exhale, and then pause (briefly) at the end of the breath.\n\n5. Repeat (at least) 4 times more. The trick is to keep your awareness on the sensation of breathing, on the feeling of your belly moving in and out. You will notice when you are panic breathing that your breathing takes place in your chest, not your belly. There is a physiological response with shallow breathing that increases the likelihood of an anxiety attack. Use some more breaths if 5 isn't enough. Five is somewhat of a magic number, though, and it works pretty much every time for me.\n\nI swear takes me to a different state of mind every time. Just one more tool in your toolbox. Good luck out there!\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "5 Breaths Technique",
            "url": "http://www.reddit.com/r/Anxiety/comments/pbeng/5_breaths_technique/"
        },
        {
            "author": "rmm45177",
            "author_created_utc": 1273115428,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_41i1k",
            "created_utc": 1328108756,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p663q/a_trick_that_has_helped_me_with_anxiety_and/",
            "id": "p663q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p663q/a_trick_that_has_helped_me_with_anxiety_and/",
            "score": 24,
            "selftext": "For a couple months now, I've been chewing gum all day in school. It helps me concentrate and keep my mind from wandering. I haven't had that many panic attacks or breakdowns recently and I think its really helping. Try it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A trick that has helped me with anxiety and depression.",
            "url": "http://www.reddit.com/r/Anxiety/comments/p663q/a_trick_that_has_helped_me_with_anxiety_and/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328257259,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p91e6/whenever_i_do_well_in_social_situations_i_kind_of/",
            "id": "p91e6",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p91e6/whenever_i_do_well_in_social_situations_i_kind_of/",
            "score": 21,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Whenever I do well in social situations I kind of feel like...",
            "url": "http://i.imgur.com/xyNPz.jpg"
        },
        {
            "author": "Delimorte",
            "author_created_utc": 1326477086,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6nobi",
            "created_utc": 1328399310,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pb77h/for_those_who_have_conquered_anxiety_does_it_feel/",
            "id": "pb77h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pb77h/for_those_who_have_conquered_anxiety_does_it_feel/",
            "score": 19,
            "selftext": "...where it takes all this time to build a tower that only takes one bad move to crash?\n\nWhile I can hardly say I've been depression and anxiety free over the last 3 years, CBT has completely changed me. I went from being completely non-productive(no job, no apartment, can't drive, no friends or SO etc.) to having a great job and girlfriend, owning my own house and car, and am currently attending college with a 4.0 average right now. I also generally feel great.\n\nThe problem is that when something bad happens that pushes my anxiety past a controllable point all the terrible thoughts and behaviors come rushing back and it feels like the stable person I have been lately is just window dressing on a horrible, broken person. Thankfully, I refuse to allow myself to wallow in that for more than a few days or so or otherwise I would probably regress.\n\nHow the hell do you deal with it?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "For those who have conquered anxiety: \nDoes it feel like you're playing a game of Jenga with your emotions...",
            "url": "http://www.reddit.com/r/Anxiety/comments/pb77h/for_those_who_have_conquered_anxiety_does_it_feel/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328469433,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pc42h/good_days_and_bad_days/",
            "id": "pc42h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pc42h/good_days_and_bad_days/",
            "score": 18,
            "selftext": "I have been struggling a lot lately with my anxiety disorder. I have days were I am full of hope and think once I am able to afford therapy this summer I will learn to cope with this disorder and lead a more normal life. I have had the urge to travel lately which is something new for me. I think being housebound may be the reason for the sudden urge to travel.\n\nOn the other hand I have days where I have zero hope, that I will be forever broken and housebound and not get to travel or do normal things like shopping etc. (My agoraphobia is on the extreme side and I can go months and months without leaving the house.)\n\nAnyone out there that can relate and how do you deal with it? The last four days have been extremely rough on me. I normally will have one bad day and recover pretty fast but this last week has been kicking my mental butt. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Good days and bad days",
            "url": "http://www.reddit.com/r/Anxiety/comments/pc42h/good_days_and_bad_days/"
        },
        {
            "author": "guardgirlx3",
            "author_flair_css_class": "",
            "author_flair_text": "People don't like me",
            "created_utc": 1328319471,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pa358/i_had_a_breakdown_and_had_to_leave_in_the_middle/",
            "id": "pa358",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pa358/i_had_a_breakdown_and_had_to_leave_in_the_middle/",
            "score": 16,
            "selftext": "Hey this is my first post, been lurking for a while. I'm 15, in hs. So yesterday I had a breakdown in class, like it had been a stressful day and when I had to sing by myself (it was chorus class, haha) like I just got so nervous I walked out crying. How do explain what happened, etc. when I have to deal with everyone next class? \n\nEdit: Thanks guys (:",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I had a breakdown and had to leave in the middle of class. How to deal with the aftermath?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pa358/i_had_a_breakdown_and_had_to_leave_in_the_middle/"
        },
        {
            "author": "Forlish",
            "author_created_utc": 1328151601,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6teun",
            "created_utc": 1328153881,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p76k5/anxiety_over_peeing/",
            "id": "p76k5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p76k5/anxiety_over_peeing/",
            "score": 16,
            "selftext": "The title says it all. Whenever I go out, I get alot of anxiety over going out because I am worried that I will have to pee when a bathroom is not available or it would be innoprotune to leave to pee, ex: car/bus rides, in the middle of class. The reason I get anxiety over this is because when I know im not near a bathroom, I get the physical sensation that I have to pee. The feeling is completely indistinguishable from the actual feeling of needing to pee, which makes it very nerve wracking not knowing if it is anxiety or not. In my mind, god forbid it is the real deal and not anxiety, i am fucked, and that in itself generates alot of anxiety.\n\nI had an experience earlier in my life where I peed in my pants and i am almost COMPLETELY certain that my anxiety stems from this. The whole experience was extremely embarassing and although i felt like i really needed to pee, i ignored it, and that is why i wet myself. So now, likely in response to that, my body/mind makes it so that if im ever in a situation that could ever happen that was similar to the time i wet myself, i feel like i have to pee automatically in order to make myself go to the bathroom, in my minds attempt to potentially avoid a very embarassing situation. it works like a defense system, in the way your body feels pain to keep you from doing stupid things. In other words, it is my bodies way of saying, \"hey, remember last time you felt this way? of course you do, and you dont want what happened last time to happen again so go to the bathroom right now just in case\" Except this happens in situations other than when i would really have to pee. If it has been an hour since i have peed and am put in a situation where i cant pee, i automatically feel like its been hours and hours since ive went to the bathroom. Essentially, the longer its been since ive gone to the bathroom, or the more inacessable a bathroom is, the more i feel like i have to pee and the more anxiety is generated. When time since i last peed and bathroom inacessability are both inopprotune, it leads to terrible anxiety attacks.\n\nNeedless to say, it has had a very negative impact on my life. It makes me scared to go out in public or hang out with friends, and i am terrified of long car rides (understandably the worst fear, because that is where the initial incident occured)\n\n I was wondering if anyone has had the same problem and has any advice to offer. I am a high school senior and i truly want this to stay behind with my high school life as i go to college. I hear over and over again that college is the best time of your life, and i cant express how dissapointed i would be if i let this ruin the \"best years of my life\"\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety over peeing",
            "url": "http://www.reddit.com/r/Anxiety/comments/p76k5/anxiety_over_peeing/"
        },
        {
            "author": "trohl",
            "author_created_utc": 1314133534,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pvfs",
            "created_utc": 1328219169,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p8acy/who_else_has_anxiety_about_their_health/",
            "id": "p8acy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p8acy/who_else_has_anxiety_about_their_health/",
            "score": 15,
            "selftext": "I've heard people freaking out about their breathing, bowel movements, etc.\n\nDoes anyone else have \"funny\" feelings in their head before an episode? Like, they fear they're about to have a seizure, or that their mind will have a sensory overload and black out or something?\n\nSometimes I feel like my mind can't stop thinking and then I start freaking out. I've convinced myself I have a brain aneurysm or something retarded... \n\nI just want to know if other people can relate, or what they specifically freak out over....",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Who else has anxiety about their health?",
            "url": "http://www.reddit.com/r/Anxiety/comments/p8acy/who_else_has_anxiety_about_their_health/"
        },
        {
            "author": "oceanicwhitetip",
            "author_created_utc": 1314553859,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qsyz",
            "created_utc": 1328218915,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p8a4l/im_dreading_the_biggest_party_on_earth/",
            "id": "p8a4l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p8a4l/im_dreading_the_biggest_party_on_earth/",
            "score": 15,
            "selftext": "So I moved to New Orleans 7 months ago, after having been off meds for about 5 months, (thus making it a year med free.) Here's the thing: my depression and anxiety have been rearing their ugly heads and I live in mortal fear of Mardi Gras. It will be my first ever but the prospect of the crowds, the noise, the excitement, the girls, the drinking, etc. has me wishing it was over already. I feel pathetic and I'm afraid I'm just setting myself up for what I'll feel was a disatrous couple of weeks. I should also add that I've been single for a long time, remain a virgin, have had problems with alcohol and drugs in the past, and am currently unemployed. Not sure why I'm posting this, but none of my friends seems to understand why I'm not psyched for what could prove to be the best party of my life. Thought you guys would understand.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm dreading the biggest party on earth",
            "url": "http://www.reddit.com/r/Anxiety/comments/p8a4l/im_dreading_the_biggest_party_on_earth/"
        },
        {
            "author": "MissTorrie",
            "author_created_utc": 1309400516,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5g4qm",
            "created_utc": 1328534314,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pd4k0/anxiety_is_taking_over_my_life_im_a_total_mess/",
            "id": "pd4k0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pd4k0/anxiety_is_taking_over_my_life_im_a_total_mess/",
            "score": 14,
            "selftext": "A very bad anxiety month has culminated in me having several anxiety attacks at work. I've been demoted as a result and several of my co-workers are spreading a rumor that I've been faking my attacks to get out of work/bad tables/whatever. I work as a server, for a bombastic man who's an expert in Finding Fault. In my \"ok\" states, I can brush this off, but the last month has been a blur of anxious thoughts and he's triggering me. It's hard because otherwise I love my job. Now, I'm just sick all the time. I can't think of a single scenario regarding my job that doesn't end with me living in a box and never seeing my children again. \n\nIt's 8:05 in the morning, and despite the fact that I work nights, I'm up. I'm up because I barely slept last night, I was shaking so bad and kept having to get up to throw up. I don't sleep in general. I shake all the time. I'm irritable, and so not myself that I'm just terrified. I feel sorry for my fiance, for my children. I feel sorry for anyone who's stuck with me, this broken, mess, failure as a human being. I can't even do my serving job without causing problems and being demoted. I couldn't get through cosmetology school. I feel the suicidal thoughts creeping in again, something I thought I'd conquered long ago. \n\nMy father died when I was young and I was left utterly alone by my extended family with my profoundly ill mother. I was 16, and often afraid to go to school because she was threatening to kill herself everyday. I had nightmares about coming home and finding her dead. My fiance went through a period of depression earlier this month that led to him threatening suicide and it did something to me. He's now in treatment and improving and I'm still a mess. \n\nBecause I believe my mother has a big part in why I'm so anxious, I feel so sorry for my children. I'm afraid I'm going to emotionally break them. I want to apologize to my children, my co-workers, my fiance, my roommate, my mother. Everyone who got stuck with me. This is taking over my life so thoroughly that I am finding it hard to see any light at the end of the tunnel, even though my fiance is arranging for me to see a doctor this week. \n\nI freak out if I see certain numbers on a clock, convinced that something bad is going to happen to me as a result. I just looked down and saw that it's 8:13, a bad number, and now I know something bad's going to happen to me today. I'm scared. I just want to go to bed. That's so crazy I can't even believe I'm typing it, but it's something that affects my mindstate daily and has for as long as I can remember. \n\nI don't know why I'm posting this. I just need to get it out I guess. I'm not sure anyone can do anything for me. I want to run away and stop hurting everyone. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety is taking over my life. I'm a total mess. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/pd4k0/anxiety_is_taking_over_my_life_im_a_total_mess/"
        },
        {
            "author": "Baba_Booeys_Teeth",
            "author_flair_css_class": "",
            "author_flair_text": "The Glass Prison",
            "created_utc": 1328387166,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/paz44/physical_symptoms_of_anxiety/",
            "id": "paz44",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/paz44/physical_symptoms_of_anxiety/",
            "score": 12,
            "selftext": "Hey guys.  \n\nLong story short I've been doing much better over the past week. However, yesterday morning for whatever reason when I woke up I felt the need to check my heartbeat. No physical symptoms at that time. And by \"check my heartbeat\" I mean, placing my hand/fingers on top of where my heart is and feeling it beat. I know this is the WORST thing you can possible do, but I can't help it sometimes. I'm paranoid. After doing that, I went to my counseling appointment, and told my counselor that I was doing much better, which was true. \n\nAfter my counseling appointment, I got some lunch and returned to my dorm. As I was eating my lunch I noticed the physical symptoms came on. And by physical symptoms, I mean, feeling like I lose my breath for a second, or feeling my heart beat (palpitation).  I've had this feeling before so it didn't freak me out or cause me to panic, but it was very uncomfortable. I ended up taking a .5mg ativan to relieve those symptoms, which angered me because I haven't needed an antivan in over a week. \n\nToday I woke up, everything was totally fine. As a prepared to go out and grab some lunch, I noticed myself becoming slightly anxious, and then i started getting those physical symptoms again..  I have never experienced chest pain with these, and I feel really bad for those who have experienced \"worse\" symptoms.  HOWEVER  I'm hoping some of you guys can relate to what I'm going through, and maybe offer some tips? \n\nI'm now looking into going to see a psychiatrist, to go along with seeing my university's counseling services.  \n\nbasically the shortness of breath / palpitation symptoms are the scariest shit ever.  Sometimes it feels like it lasts a few seconds, and sometimes it feels like it lasts a split second.  \n\n\n ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Physical Symptoms of Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/paz44/physical_symptoms_of_anxiety/"
        },
        {
            "author": "IAmABike",
            "author_created_utc": 1314463417,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qm84",
            "created_utc": 1328272105,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p96ac/anxious_redditors_how_do_you_cope_with_your/",
            "id": "p96ac",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p96ac/anxious_redditors_how_do_you_cope_with_your/",
            "score": 11,
            "selftext": "I normally play the waiting game with my excessive anxiety. Whenever I feel my anxiety hit me whether I'm in class or driving I just say to myself that regardless of how I feel or what I think, these uncomfortable symptoms will be gone in 5-7 minutes. So reddit, how do you cope with your anxiety issues?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxious Redditors, how do you cope with your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/p96ac/anxious_redditors_how_do_you_cope_with_your/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328421675,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pbkj6/the_thought_of_relationships_a_girlfriend_drives/",
            "id": "pbkj6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pbkj6/the_thought_of_relationships_a_girlfriend_drives/",
            "score": 10,
            "selftext": "I'm a frequent on the depression reddit but I also have really bad anxiety when it comes to things. I'm 20 years old, in college and I'm in such an odd position. I'm an average looking guy, not muscular and athletic but not much weight either. I'm confident (sometimes) and know how to talk to girls, socialize and make them laugh. I've talked to girls years ago I wouldn't even think I'm worthy looking at. So I have conquered that mountain.\n\nI've been on 3 dates. First two never amounted any further The last one was with a girl I spent about 2 years being a friend with until finally we went out. We'd always cuddle together and such and one time we kissed. After that, anytime I was alone with her I would become physically sick. I'd have to excuse myself to the bathroom and I'd proceed to throw up like crazy.\n\nWhen we finally went out the night went as perfectly as you could have asked it to go. Only one problem, my anxiety would continue to grip me so firmly I had to throw up in the restaurant bathroom, several times. She wanted to go back to her house and spend some time together alone. I knew what that was coming to and my stomach was in complete knots. Eventually she caught on and was confused why every time we were together I got sick. I had to spill the beans, I felt maybe if I told her I'd feel better. I did not. I continued to dry heave the entire night until I left her home\n\nLong story short, we don't talk anymore, I think she found a new guy and I sit here alone. The truth is, relationships scare the living hell out of me. I want one so badly but the thought of one puts my stomach through knots. I look at people who are happily in one, and so casual about it and I just wonder \"HOW?!\" and \"WHY IS IT SO HARD FOR ME?! CAN'T I JUST BE NORMAL! WHYYY!?\"\n\nI hate this. I hate this fear. I would love nothing more then to experience a relationship with a girl, I've been waiting so long. But this grip of anxiety just ruins me. I'm so scared it's going to continue to ruin me.\n\nNeedless to say this does nothing to help me with my depression.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The thought of relationships (a girlfriend) drives me to sickness.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pbkj6/the_thought_of_relationships_a_girlfriend_drives/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328505155,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pcst3/how_do_you_guys_cope_with_specific_people_who/",
            "id": "pcst3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pcst3/how_do_you_guys_cope_with_specific_people_who/",
            "score": 9,
            "selftext": "I'm 27, male, and I've always had some mild social anxiety issues, I think, but they've recently been rearing their head in a big way. I've been having somewhat severe social anxiety and a bit of general anxiety recently. Not currently on any medication, but I'm considering seeking some for those really bad days.\n\nSo my question is, have you discovered a constructive way of dealing with when you have to interact with someone who makes you very anxious?\n\nIn my case, there's this dude at work that I am pretty much terrified of, to be honest. It's military-based, and he's sort of high up on the chain of command. He's a VERY big personality. Just a motor that is always running. It's the position of authority/power and really aggressive personality that make me anxious.\n\nSo how to I manage that fear and anxiety? Are there any methods or tricks that I can employ? Or are gimmicks like that not going to work?\n\nI can't really avoid interacting with this guy sometimes, and it really takes the wind out of my sails even to be around him for a while. So how can I maximize my chances to take part in these encounters with grace and dignity?\n\nI'm also super love-shy. If a pretty girl comes around, I get *super* nervous. This trigger actually set me off on my first panic attack not too long ago. I straight up fainted. Which, like, a pretty girl made me faint. It wasn't funny at the time. It was really fucking scary and humiliating, actually. It's kind of funny now that I'm removed from it a bit more, though. Anyway. Any advice here on how to not freak the fuck out around a confident, pretty girl?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How do you guys cope with specific people who make you very anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pcst3/how_do_you_guys_cope_with_specific_people_who/"
        },
        {
            "author": "SevenStarSonata",
            "author_created_utc": 1322142514,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6azp7",
            "created_utc": 1328577131,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pdxz8/any_advice_on_how_to_handle_schoolrelated_anxiety/",
            "id": "pdxz8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pdxz8/any_advice_on_how_to_handle_schoolrelated_anxiety/",
            "score": 9,
            "selftext": "I've had Major Depression for a few years now - since I was 19 (I'm 23 now, nearly 24). I hate the idea of going on long-term medication, especially since my depression originally started as situational depression that was made infinitely worse with no reprieve over the course of several months, and became more permanent.\n\nI recently, with the help of a good friend, got back into school (after having had to leave due to the same reasons as the onset of my depression). It's been fine for the past semester or two, but lately my depression's been getting in the way, and this week has been an absolute nightmare - I have three midterm exams on Wednesday I'm not prepared for, and another the very next day, not to mention a dentist appointment tomorrow morning that they wouldn't let me cancel. For the past few days I've been in a state of blind panic - every time I think about those exams, or try to study, I freak out. I fall into this horrible feeling of \"Oh my god they're too soon, I don't have enough time to learn the material and I can't do this!!!\", and the only way to stop the panic is to shut it out completely - play a video game and immerse myself for a few hours.\n\nIt feels good to play, but the minute I stop, I realize how much study time I just lost, and I panic again. It's been like this for days, and I don't know how to stop it. My exams are in less than 40 hours, does anyone have any tips on how to stop freaking out and actually get some work done? I've tried arranging group study dates with friends, but none have gone through (either the friend was sick or just didn't want to).\n\nI don't even know if this is the right place for this...I've never experienced anything like this before, and any advice from anyone would be VERY appreciated.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any advice on how to handle school-related anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pdxz8/any_advice_on_how_to_handle_schoolrelated_anxiety/"
        },
        {
            "author": "Samsonite959",
            "author_created_utc": 1315804372,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ubtj",
            "created_utc": 1328068359,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p5mfb/dae_test_themselves_and_their_anxiety_in_turn/",
            "id": "p5mfb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p5mfb/dae_test_themselves_and_their_anxiety_in_turn/",
            "score": 9,
            "selftext": "I have panic disorder and it only happens in episodes, so I have had time without it. I have had episodes in the past and have conquered it before on my own. But, I've been in an episode for the past 3 weeks and it seems to be getting worse so I am trying to find a therapist. In the meantime, I'm trying to cope by myself. \n\nDoes anyone else test their anxiety? A lot of the time, if I notice that I haven't really felt too anxious all day, I will subconsciously think of something to trigger an attack. I will do this before I can even stop myself. It's like I'm checking to see if the anxiety is mysteriously gone. This just makes me anxious and feel out of control, because it's not gone. It's like my own mind is working against me. Then, I start feeling like if I even think about that bad thing, it will cause it to happen to me. Then I try to distract myself, which only makes everything cycle around and make me think about it more. It's a never-ending cycle. \n\nDoes anyone else do this?? And how do you stop yourself from sabotaging yourself?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE test themselves and their anxiety... in turn causing more anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/p5mfb/dae_test_themselves_and_their_anxiety_in_turn/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328385637,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pay2k/does_anyone_suffer_from_health_anxiety_and_how_do/",
            "id": "pay2k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pay2k/does_anyone_suffer_from_health_anxiety_and_how_do/",
            "score": 8,
            "selftext": "I am curious to know. I think about this sometimes...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone suffer from health anxiety? And how do you think you would cope if you were actually diagnosed with a serious medical condition?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pay2k/does_anyone_suffer_from_health_anxiety_and_how_do/"
        },
        {
            "author": "GashcatUnpunished",
            "author_created_utc": 1327431135,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6qsz8",
            "created_utc": 1328613564,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pejvt/ranxiety_how_do_you_deal_with_being_sick/",
            "id": "pejvt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pejvt/ranxiety_how_do_you_deal_with_being_sick/",
            "score": 7,
            "selftext": "I'm home sick today.\n\nI woke up to vomiting and the runs and all that mess.\n\nI can barely deal with it. Last time I was sick like this I was reduced to the point where I was hyperventilating so badly because I couldn't deal with the pain and I didn't want to throw up that I couldn't feel most of my body. Now I am on super high alert and I just can't calm down, I am so upset. Vomiting is the worst thing in the world. I would rather do anything else, anything. I just so can't deal with pain and disgust and illness. I'm a recovering hypochondriac I guess so it is just so difficult being sick, always has been. I have no idea how to deal with pain at all. Not the weird drawn out organ-borne pain of sickness. It triggers all of my escape reactions but of course I can't 'get away', completely trapped and caged, can't do a damn thing and that is the worst feeling in the world, lack of control.\n\nWhat do you do /r/anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "/r/Anxiety, how do you deal with being sick?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pejvt/ranxiety_how_do_you_deal_with_being_sick/"
        },
        {
            "author": "somethingsostupid",
            "author_created_utc": 1328050673,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6t03t",
            "created_utc": 1328051981,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p5904/im_not_sure/",
            "id": "p5904",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p5904/im_not_sure/",
            "score": 7,
            "selftext": "feel inadequate and pathetic. depressed when i think about my life, when i look at myself and see what i look like from doing nothing and eating anything. feel like a coward all the time. unable to communicate properly without inevitably fucking something up with a person i care about a whole lot. the relationship isn't even real in the sense of distance, reality, knowing things will never be like i guess i hope they could.\n\nlying to my psychiatrist about taking the measures to go back to school after i stopped going to classes three years ago and went days without leaving my dorm room during that time. felt like everyone was looking at me in the lectures and tutorials and walking around campus. had panic attacks and felt exposed and somehow restless and exhausted at the same time. didn't fill out the necessary forms to send to the university letting them know what went on, despite my psychiatrist filling out certain forms and her thinking i've sent them in.\n\nbeen living with my parents. been working part-time at the same job for 2 years. almost 23. lethargic and uninspired by anything. been in two CBT groups for social and general anxiety, each group lasting 12 weeks and missing several sessions of each. cancelled my last two appointments with my psychiatrist (and have cancelled a few times before that). have been taking cipralex (lexapro) for a year and wellbutrin before that. distanced from friends, but push myself to hangout once a month or something like that.\n\nnothing seems to have changed despite at times really wanting to be able to. was crying earlier. feeling like an idiot for even posting this.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "i'm not sure.",
            "url": "http://www.reddit.com/r/Anxiety/comments/p5904/im_not_sure/"
        },
        {
            "author": "throw_away_human",
            "author_created_utc": 1328407387,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6uase",
            "created_utc": 1328410607,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pbe34/fear_of_having_a_severe_allergic_reaction_my_story/",
            "id": "pbe34",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pbe34/fear_of_having_a_severe_allergic_reaction_my_story/",
            "score": 6,
            "selftext": "Please forgive my rambling post but, I’d like to give some back story on my fear anxiety. First off I should say there is a history of mental disorder in my family. Specifically with depression, alcoholism, and anxiety. When I was a kid, in junior high I started experiencing symptoms of anxiety. As embarrassing as it is, I would just feel like I needed to poop every time I would go out in public. For a little while I missed out on school and youth group just because every time I left the house I felt anxious, and like I was going to crap my pants. With the help of a guidance counselor we determined that at least in part my anxiety was caused in part by the anticipation of moving from junior high to high school. One day we took a trip to the high school for a tour, and shortly thereafter my anxiety started to subside, and eventually went away.\n\nFast forward several years, after graduating college and working for a few years, I started to develop anxiety issues seemingly out of the blue. There were some external stresses at the time. My sister had been recently diagnosed with anorexia and had been hospitalized struggling to maintain a healthy weight (she is healthy and doing well now). My grandfather had been diagnosed with cancer, and despite aggressive treatment the cancer continued to grow and we knew he would probably pass away soon. I was not stressed at work, but I was generally unhappy and wished my career was moving forward. I felt at the time my career was simply stagnating.\n\nI would say at this time I was depressed. I was more often than not feeling unhappy; unsatisfied with my situation, but completely lacked motivation to do anything about it. I felt tired all the time, and on top of that I started drinking regularly to try to manage my depression. Not drinking a lot (probably 2-3 drinks per night), but enough that I felt like I had a dependency which increased my depression even further.\n\nAnyway back to the anxiety part… One day before work I started feeling anxious. No specific thoughts associated with the anxiety. Just a feeling of fear. Not knowing where the feelings came from I tried to shrug them off hoping I would feel better the next day. A few days passed and the feelings did not go away. I woke up every morning with that feeling of fear, and feeling sick to my stomach. Often I would even dry heave because the feeling of nausea was so apparent.\n\nThen something strange happened. That general feeling of fear developed into a specific phobia. I am allergic to fish/shellfish and have known about it since a very young age. The severity of my allergy has never been determined, but I know I have never had what I would describe as a severe reaction. The worst I have experienced is a very unpleasant from my skin coming in contact with seafood, and when I was younger (before my allergy was known) some itching in my throat from consumption.\n\nRegardless; my general feeling of fear, turned into a phobia about fish. Specifically about being killed by an allergic reaction. I started becoming increasingly paranoid about seafood contaminating my food. Often at meals I would take a few bites, and then my anxiety would cause an itchy, swelling feeling in my throat. I would leave the table, and try to calm myself down. Obviously there was no reaction, but regardless I would remain fearful, and could not finish my meal. This caused me to become more and more cut off from my family and friends, since most social situations involve eating one way or the other.\n\nI refused to go out to restaurants using any excuse I could. I refused hanging out with my friends fearing we would end up in a “food situation.” I didn’t want to visit anyone's house just in-case they had been cooking fish recently. “What if it smells like fish?” I would think to myself “I could have a reaction.” In about a year I lost about 15 pounds due to the inability to finish a meal.\n\nAfter much mental anguish, and month of trying to convince myself there was no problem, I finally got a therapist. Because of my fear I was not even able to tolerate having my therapy sessions indoors (there was a sushi restaurant in the same plaza). My therapist was able to teach me some techniques to help me calm down and manage my fear day to day. Eventually I was comfortable again eating meals in my own home, and was able to function normally at work day to day. While I was able to manage my fear day to day I still had that over arching fear; I could no feel comfortable going to restaurant or to my friends home.\n\nTo this day, nearly 2 years later I still have the same fear. I am still uncomfortable going out to restaurants (though I do manage once and a while), but more importantly I still remain detached from my friends and family. I still have that nagging fear. “What if they’ve cooked fish. If there place has a fish smell I could swell up and die.” “What if we go out to eat and they forget about my allergy, I could swell up and die.” “I could die… I could die… I could die.”  That’s all I hear over and over again in my head. I desperately want my friends and my social life back, but my fear overrides all of that.\n\nThe worst part about it is I recognize 100% the logical fallacy in my fear, but still let it command my life. I have gone 26 years without so much as a “note to the chef” about my allergy without issue. I have sat next to friends eating fish and chips and never experienced a reaction. In fact the only reaction I remember having in recent memory was a rash due to someone leaving stinky fish in the fridge at work and the smell getting on my lunch container. Even then it was just an unpleasant rash which was gone by the next morning.\nNone the less I have this nagging fear which wont go away, and it’s ruining my life.\n\nI only have one clue as to what caused this (aside from general stress in my life). In a short span of time there were several “exposures.” #1) Dropped by a friends house. At the time they were eating fish chowder. Due to the smell I felt the need to leave within a few minutes. #2) Had a meeting at a client site. Someone heated fish in the kitchen. Again I felt the need to vacate within a matter of minutes. #3) The day after the client meeting someone in my workplace heated some strong smelling fish and again I felt the need to leave.\n\nSo now I am. Here, 2 years later. Still anxious, still depressed, still drinking “moderately” every day. Shut in my home isolated from my friends, with this feeling that just wont go away. I’ve lived my whole life with this allergy and is never caused an issue, but now it’s my mind, instead of my body that’s killing me.\n\nI feel like I am ruining my own life and I have no idea what do do about it.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fear of having a severe allergic reaction (my story).",
            "url": "http://www.reddit.com/r/Anxiety/comments/pbe34/fear_of_having_a_severe_allergic_reaction_my_story/"
        },
        {
            "author": "nxqv",
            "author_created_utc": 1321927653,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6aegk",
            "created_utc": 1328175088,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p7in3/what_type_of_doctor_should_i_see/",
            "id": "p7in3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p7in3/what_type_of_doctor_should_i_see/",
            "score": 6,
            "selftext": "Psychologist, psychiatrist, or therapist? What's the difference?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What type of doctor should I see?",
            "url": "http://www.reddit.com/r/Anxiety/comments/p7in3/what_type_of_doctor_should_i_see/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1328297608,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p9mxp/does_anyone_in_this_subreddit_live_in_metro/",
            "id": "p9mxp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p9mxp/does_anyone_in_this_subreddit_live_in_metro/",
            "score": 6,
            "selftext": "Hi guys,\n\nI'm just curious if anyone here lives in the Detroit area, especially the Novi/Milford/West Bloomfield area. It would be nice to have a friend around here who can relate to the things I struggle with. Let me know or feel free to PM me!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone in this subreddit live in metro Detroit?",
            "url": "http://www.reddit.com/r/Anxiety/comments/p9mxp/does_anyone_in_this_subreddit_live_in_metro/"
        }
    ]
}