{
    "data": [
        {
            "author": "FulminatedMercury",
            "author_created_utc": 1317874636,
            "author_flair_css_class": "gun",
            "author_flair_text": null,
            "author_fullname": "t2_5znek",
            "created_utc": 1330155008,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q58xf/does_this_picture_hit_close_to_home_for_any_of_you/",
            "id": "q58xf",
            "is_self": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q58xf/does_this_picture_hit_close_to_home_for_any_of_you/",
            "score": 281,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/m19f5-0cVELvY0Va.jpg",
            "title": "Does this picture hit close to home for any of you?",
            "url": "http://i.imgur.com/tJ5Qb.jpg"
        },
        {
            "author": "aneusoit",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330401269,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q96u9/do_these_thought_patterns_apply_to_you/",
            "id": "q96u9",
            "is_self": false,
            "media_embed": {},
            "num_comments": 39,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q96u9/do_these_thought_patterns_apply_to_you/",
            "score": 129,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/LCrhg4QZ0fyBII9i.jpg",
            "title": "Do these thought patterns apply to you?",
            "url": "http://imgur.com/uW0iQ"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329946119,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q1h3m/anybody_feel_this_on_a_consistent_basis_even/",
            "id": "q1h3m",
            "is_self": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q1h3m/anybody_feel_this_on_a_consistent_basis_even/",
            "score": 125,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/NgclHOYoCAeOt2Y9.jpg",
            "title": "Anybody feel this on a consistent basis even though you know you would never go through with it? x/post from f7u12",
            "url": "http://i.imgur.com/somo4.png"
        },
        {
            "author": "toofaced12",
            "author_created_utc": 1313718910,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ox8l",
            "created_utc": 1330324139,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q7stm/anyone_else/",
            "id": "q7stm",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q7stm/anyone_else/",
            "score": 74,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/9Oxn6aPtiO5bLZ8E.jpg",
            "title": "Anyone Else?",
            "url": "http://i.imgur.com/nAEcf.jpg"
        },
        {
            "author": "another_pseudonym",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330063421,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q3qe3/fellow_anxiety_sufferers_of_the_internet_what_do/",
            "id": "q3qe3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 50,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q3qe3/fellow_anxiety_sufferers_of_the_internet_what_do/",
            "score": 51,
            "selftext": "I cant speak for anyone else but for me one of the most annoying things about anxiety is the difficulty in explaining what it \"is\".  People will ask \"well what are you anxious about?\"...or \"what are you thinking about?\"....or \"well what does it feel like?\".  And there will never be one word or phrase or paragraph in a textbook that will explain it fully, especially since it manifests so differently in so many people (and even within the same people, it will do so differently in different situations). BUT. I found a way to sort of describe the feeling in the back of your head when your anxiety takes up all ability to concentrate.\n\nDoes anyone else feel like theres just \"television static\" in their head?  Not the NOISE from it, not the image or anything like that, just a weird...sensation of \"buzzing\" going on in your mind.  You can't shut it off, and you can't \"change the channel\" to something more rational or more productive...so it's like wasted thoughts.  They're there, they're occupying the space where rational thought and productivity SHOULD be, but at the same time its completely useless. But you can't shut it off.\n\nThoughts? Really seeking people to relate to ATM.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fellow anxiety sufferers of the internet: What do you think of this mini-revelation?",
            "url": "http://www.reddit.com/r/Anxiety/comments/q3qe3/fellow_anxiety_sufferers_of_the_internet_what_do/"
        },
        {
            "author": "Joxn64",
            "author_created_utc": 1330016775,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_700gd",
            "created_utc": 1330016895,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q2p4n/how_do_you_gain_confidence_this_isnt_normal_right/",
            "id": "q2p4n",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q2p4n/how_do_you_gain_confidence_this_isnt_normal_right/",
            "score": 28,
            "selftext": "I'm a girl, 22, in university. I'm pretty quiet/shy unless ppl speak to me first, and then I'm really friendly although kind of nervous. \nI've never been on a date or had a bf before. Guys and girls have said I'm really pretty/cute but still guys don’t really approach me, most just stare, and on the rare occasion when some guy does try to strike up a convo, I’ll screw things up somehow and make them think I’m not interested. (I have trouble making eye contact with strangers especially if it’s someone I’m interested in, and I just can’t smile at guys I like.) Because this is all so hard for me, I’ve come to find “flirting” frustrating, draining, and ultimately just depressing. I want a relationship but the stress, potential embarrassment, and uncertainty is just too much so I tend to avoid anyone I find attractive. (I don’t really crush a lot anyway, maybe 1 or 2/year.)... Honestly I don't see myself asking out guys anytime soon.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How Do You Gain Confidence? This isn't normal right?",
            "url": "http://www.reddit.com/r/Anxiety/comments/q2p4n/how_do_you_gain_confidence_this_isnt_normal_right/"
        },
        {
            "author": "AgentLiquid",
            "author_created_utc": 1247697528,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3jsu6",
            "created_utc": 1330072737,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q3uqc/id_like_to_offer_some_practical_suggestions/",
            "id": "q3uqc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q3uqc/id_like_to_offer_some_practical_suggestions/",
            "score": 25,
            "selftext": "Hello fellow anxietors.\n\nI'm a 30 year-old man who's suffered from moderate-to-severe anxiety for a long long time. My earliest anxiety memories are when I was in 4th grade - I'd wake up in the middle of night thinking that I was going to die. I'd freak out and run to my parents' bedroom where my mom would reassure me that I'm ok. I had anxiety in social situations, and I was extremely anxious when talking to girls. I would get pretty anxious before school exams and events, and usually not eat that day before the test because my heart would be racing and my stomach would be in knots.\n\nAround the beginning of high-school, I developed a severe case of hypochondria. It started from learning about the human body works, and how things can go wrong. I still have hypochondria to this day and it's by far the biggest source of my anxiety. My anxiety is not limited to health though, and I generally obsess and worry about everything under the sun. Some days are better than others. Sometimes (like right now), I feel good. Not superb, but good. Other days I'm miserable and have panic attacks (I had a few of them this last week). \n\nAt any rate, things are much better now than they used to be. I'd like to share the different weapons I've amassed against anxiety. Keep in mind that what may work for me, may not work for you. These are just some suggestions, but perhaps they're a good place to start. Play around with the details and see if they work for you. I tried to find as many different types of weapons in this fight as possible.\n\nHere we go:\n\n* Exercise: I think a lot of people here know about this, but it's tough to do when you're too anxious to go to the gym or even leave the house. Still, working out vigorously has helped me a shit-ton. I try to get some exercise every day. In my opinion, a mix of weights and cardio is the best.\n\n* Medicine: Find a friendly GP and just get a prescription for Xanax (and any other benzo of your choosing). It's not that hard and it completely takes the edge off **in times of need**. Don't rely on it all the time, but have it there as a backup plan for when those shitty anxiety attacks hit. Xanax has been an extremely useful tool for me.\n\n* Supplements: There are ton of supplements out there. Do your research and look for [anxiolytics](http://en.wikipedia.org/wiki/Anxiolytic). I've wasted a lot of money and time trying different ones, but the most potent ones that have worked were: L-theanine, Aniracetam, and Phosphatidylserine.\n\n* Meditation: This is an area where I slack myself, but it really does help. Usually the problem is that you can't even start if you're too anxious.  Still, there are studies after studies that show the calming effect of meditation. It doesn't have to be complicated - just a simple sit-down with a breathe-in, breathe-out focus would probably calm you down a lot.\n\n* People: Try to surround yourself with people that understand what you're going through. If they simply can't understand or can't relate, they're probably not good for you as friends, and you're better off without them. Same goes for significant others - it's better to be lonely than to be with someone who can't understand and help you out with your situation. I know I wouldn't be able to control my anxiety without my wonderful wife. She is truly supportive of my situation and helps me out a lot. In return I try to pay back the favor by trying my best to be an awesome husband. It pays off in the long run.\n\n* Philosophy: Finally, get into some philosophy and try to ponder what the meaning of life is, why you're here, etc. Try to think about why you're so afraid of death, or why you're so afraid of suffering, and question it. An excellent lecture series that has helped me a lot in dealing with death is a free course offered by Yale: http://academicearth.org/courses/death. The professor, Shelly Kagan, is very concise and thorough and the arguments make you think quite a bit. Perhaps it'll help you come to terms with death. There are many courses like this online, for free.\n\nThat's it for now. If you have any questions, please ask. If you have any suggestions, please post them. \nPeace.\n\nTL;DR - take a deep breath and read the post, you might find it useful.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'd like to offer some practical suggestions.",
            "url": "http://www.reddit.com/r/Anxiety/comments/q3uqc/id_like_to_offer_some_practical_suggestions/"
        },
        {
            "author": "Jortastic",
            "author_created_utc": 1326687810,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6obxn",
            "created_utc": 1330311003,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q7jhh/anyone_else_just_want_to_wallow/",
            "id": "q7jhh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q7jhh/anyone_else_just_want_to_wallow/",
            "score": 22,
            "selftext": "I'm just wondering if anyone else feels like they WANT to be anxious and depressed. I don't want to fix it because I don't know what I'd be without it. I have gone to a therapist before, but I've been putting off making another appointment because I don't want to face anything and I don't want to fix anything. \n\nNow I just end up faking it in front of my friends and family, especially my boyfriend. He gets upset when I'm feeling this way, so instead of trying to feel better, I just pretend. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else just want to wallow? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/q7jhh/anyone_else_just_want_to_wallow/"
        },
        {
            "author": "AnxiousAlias",
            "author_created_utc": 1330280312,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_70vej",
            "created_utc": 1330281550,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q6x9d/sometimes_its_like_im_watching_reality_through_a/",
            "id": "q6x9d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q6x9d/sometimes_its_like_im_watching_reality_through_a/",
            "score": 22,
            "selftext": "Sometimes, it's like I'm watching reality through a window. I was in my car the other day, sitting at the park. Getting out of the house. I needed fresh air and time away from the computer. I was staring at the trees and ground through my window, and I realized that that is exactly how I feel all of the time. I rolled the window down, and I still felt like I was looking at the trees through a window. Sometimes, it's like I'm watching me watch me through a window. Sometimes, it's like I'm watching static.\n\nDissociation symptoms from anxiety like depersonalization and derealization have seemingly become better over time, but being \"derealized\" is becoming more noticeable. For the longest time, I have \"doubted\" my reality because I just don't like it too much. I'm only nineteen, but I feel older than that, nowadays. I don't really feel anything.\n\nI step outside, and I don't feel the warmth that I remember feeling. Everything is darker than it used to be. The air doesn't seem as clean and refreshing. Nobody around me feels alive. I don't feel alive. Without these simple sensations every day, I think anyone would doubt their sanity.\n\nSo here I am, doubting my sanity. I keep flip-flopping between two thoughts: \"I'm not insane, but there are reasons to believe that,\" and \"If I doubt my sanity for just one second, I *must* be insane.\" Each day, it's as if the longer I am awake (and not usually for longer than the usual sixteen hours), the faster my thoughts seem to go, the less I seem to feel, until by the time I go to bed, I tell myself that I'm feeling psychotic, and when I wake up the next day, I realize just how \"psychotic\" I really did feel before.\n\nI get that feeling every day I wake up. The feeling that the day previous was bullshit, that I was insane, that I was not in my right mind, and I can find a million reasons to convince myself of this.\n\nSo Reddit, I ask you for your help. I *know* I have dealt with a lot of anxiety, and over time, the way it has affected my perception and senses has become quite noticeable. Now, I'm doubting my sanity because of it. Could it be possible that I'm getting a bit of schizophrenia? Sometimes I hear things, and sometimes I see things in my head, and sometimes I tend to attribute behaviors or entire days to delirium because of that \"next day\" feeling I get every day. Is my anxiety just getting ridiculous? Has anyone else experienced anything like this before? The \"not feeling anything\" and \"doubting sanity\" stuff, it's been really bugging me lately.\n\nThanks for any replies, and I can go into more detail about this \"psychosis\" I've been feeling if I need to. I have been diagnosed with GAD.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sometimes, it's like I'm watching reality through a window.",
            "url": "http://www.reddit.com/r/Anxiety/comments/q6x9d/sometimes_its_like_im_watching_reality_through_a/"
        },
        {
            "author": "delly1234",
            "author_created_utc": 1329502424,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6y6p2",
            "created_utc": 1330204725,
            "domain": "squidoo.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q5v1l/10_myths_about_psychotherapy/",
            "id": "q5v1l",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q5v1l/10_myths_about_psychotherapy/",
            "score": 21,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/jkTdA99IV2SKbZFN.jpg",
            "title": "10 Myths About Psychotherapy",
            "url": "http://www.squidoo.com/10-myths-about-psychotherapy"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330368553,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q8f8a/boyfriends_parent_playing_therapist_last_night/",
            "id": "q8f8a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q8f8a/boyfriends_parent_playing_therapist_last_night/",
            "score": 21,
            "selftext": "Last night my boyfriend, his parents and I were planning on going to a music show. I had told his mother weeks before that venues are one of the places I get pretty bad anxiety even though I used to love going to shows. \n\nUnfortunately I found out that I had an assignment that I looked over that was due today + laundry and other things I needed to do to prepare for the week. I decided that it was probably going to be inconvenient and unpleasant for me to go to the show and I should stay home. I wasn't anxious about the show itself at this time. My boyfriend said he'd like to stay at home with me and have a relaxing Sunday.\n\nWe went ahead and told his mother that we didn't want to go and the reasons why. She had a shocked look on her face and then told us that we could talk about it after dinner. THATS when I started getting anxious. I have a particular problem with waiting for confrontation. \n\nAfter dinner she said she thought I was lying, that I was anxious to go to the show and that I should go face my fear and get better. This is in front of my BF and his Dad. They kept saying its not a big deal as she went on and on about how I just need to go and get over it. I told her what it really was and she just thought I was lying. The worst part is that she said \"How are you supposed to help people when you cant help yourself?!\"(I'm going to school to become a therapist). She then proceeded to beg us to come for at least half the show. I ended up going along with it even though I felt terrible and angry about the whole thing. \n\nI guess I just wanted to share this. I ended up talking to her about it later... not sure if she got it completely. She never apologized.  How would you deal with the situation?!\n\nShe also told me that I was making my BF miss out on a good experience, like I was trying to make him stay home, even though he freely said he'd LIKE to stay home. \n\nEDIT: I talked to my SO's Mom recently after she had a chance to sleep on it. She understands that she was too pushy and realizes that I won't make progress with my anxiety unless I call the shots. She apologized for being invasive and rude. THANKS FOR ALL THE COMMENTS! It really helped to hear from you guys and make me feel much less alone.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Boyfriend's parent playing therapist last night.",
            "url": "http://www.reddit.com/r/Anxiety/comments/q8f8a/boyfriends_parent_playing_therapist_last_night/"
        },
        {
            "author": "tikhalii",
            "author_created_utc": 1301455941,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_516yb",
            "created_utc": 1329986698,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q2aed/anxiety_induced_hypochondria/",
            "id": "q2aed",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q2aed/anxiety_induced_hypochondria/",
            "score": 19,
            "selftext": "Hi. \n\nI've posted a few threads here before and atm I need a little help because its 3:30 am where I live so no one is awake. I don't know who else to talk to so I'm writing here. \nI had anxiety attacks in the past and then they got better.  Then I developed Hypochondria from it...\nUsually my thoughts go to cancer and whatnot. I'm constantly on my phone or WebMD looking for symptoms of something I KNOW I don't have but...I still think I do for the moment. \n\nLast thursday I thought I had epilepsy.  I don't.  At least I don't think so. \n\nThis week, I'm getting over a cold. No fever, just bad congestion. And just a little while ago, I woke up with sharp pains in my chest on the right side. I've had these pains before, last year when I was getting over a cold. My brain went straight to Pulmonary Embolism. I NEVER would have thought of it, if my boyfriend's mom didnt mention it on Monday (she was talking about someone else)\nI woke up and it took everything in me to not grab my phone and look up symptoms of P.E.'s  I was freaking out. I still am.\n\nI don't know what to do. I don't have health insurance yet (still pending : /) and I don't want to go to the hospital, but my irrational mind wants me to...\nSo obviously I haven't seen a mental health doctor yet, either.\n\nI don't know where else to turn. I'm sick of feeling like this. You guys have given me amazing advice before and I know I can't keep coming here for help, I need to see a doctor soon but I can't help this right now. \n\nWhat are some things I can do to help myself until I can see someone?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety Induced Hypochondria",
            "url": "http://www.reddit.com/r/Anxiety/comments/q2aed/anxiety_induced_hypochondria/"
        },
        {
            "author": "keepingscore",
            "author_created_utc": 1287580359,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4g2as",
            "created_utc": 1330447036,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q9u6y/do_you_get_anxiety_induced_chest_pains_where_from/",
            "id": "q9u6y",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q9u6y/do_you_get_anxiety_induced_chest_pains_where_from/",
            "score": 19,
            "selftext": "I get chest pains occasionally that normally are slightly left or slightly right from the center of my chest vertically positioned around nipple level. Can feel like a short/medium duration pinch or a quick stab. Sometimes they happen else ware.\n\nEvery time it freaks me out and I instantly assume its my heart despite having several EKGs and blood tests. Currently seeing a doctor about GERD so I try to remind myself that its probably anxiety or gerd. But it can send me into a tail spin.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you get anxiety induced chest pains? Where from and how does it feel?",
            "url": "http://www.reddit.com/r/Anxiety/comments/q9u6y/do_you_get_anxiety_induced_chest_pains_where_from/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330241364,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q6hqf/tip_keep_some_sort_of_graphcharttimeline_of_your/",
            "id": "q6hqf",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q6hqf/tip_keep_some_sort_of_graphcharttimeline_of_your/",
            "score": 16,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Tip: Keep some sort of graph/chart/timeline of your history with anxiety and notable events. That way it is easier to share with a doctor without getting flustered or confused. [Mine is linked]",
            "url": "http://i.imgur.com/w6YKO.jpg"
        },
        {
            "author": "ArchitectOfInception",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330331782,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q7why/just_wanted_to_say_this/",
            "id": "q7why",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q7why/just_wanted_to_say_this/",
            "score": 16,
            "selftext": "A lot of times when I'm freaking out and in the state where its full blown anxiety, if I can get one rational thought into the stream of freaking out what I do a lot of times is control my breathing by closing my eyes and breathing in 5 times and letting it out slowly. Then I ask myself is this thought rational at all and will it actually happen (seriously), and 99% of the time its nope nothing will happen. So this is just my two cents on what I do to stop anxiety attacks and what not.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just wanted to say this...",
            "url": "http://www.reddit.com/r/Anxiety/comments/q7why/just_wanted_to_say_this/"
        },
        {
            "author": "Legit_GFX",
            "author_created_utc": 1317608172,
            "author_flair_css_class": "",
            "author_flair_text": "Here to help.",
            "author_fullname": "t2_5yxcn",
            "created_utc": 1330133309,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q4w7i/does_therapy_really_help_as_much_as_you_guys_say/",
            "id": "q4w7i",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q4w7i/does_therapy_really_help_as_much_as_you_guys_say/",
            "score": 16,
            "selftext": "I hear you guys mentioning therapy, I wanted to know if it works, and how well it works. I have gone through it before but it still had it's ups and downs. Can you guys give me a little insight? I can't get medication until I am 18 because the place I have to go to is terrible and have a bad reputation.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does therapy really help as much as you guys say it does? Sometimes I feel skeptical about it...",
            "url": "http://www.reddit.com/r/Anxiety/comments/q4w7i/does_therapy_really_help_as_much_as_you_guys_say/"
        },
        {
            "author": "JenReeRee",
            "author_created_utc": 1328900821,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6w2nb",
            "created_utc": 1330208520,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q5xqh/i_want_to_go_to_college_but_i_get_anxiety_just/",
            "id": "q5xqh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q5xqh/i_want_to_go_to_college_but_i_get_anxiety_just/",
            "score": 15,
            "selftext": "I just moved for the first time in my life across the country. I feel so out of place. I'm stuck at home all day. Can't find a job. I really want to start school, but whenever I begin to look into it I have panic attacks. I think I'm not smart enough. I don't know what to do.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I want to go to college, but I get anxiety just looking at the website.",
            "url": "http://www.reddit.com/r/Anxiety/comments/q5xqh/i_want_to_go_to_college_but_i_get_anxiety_just/"
        },
        {
            "author": "americanslang59",
            "author_created_utc": 1314412467,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qizz",
            "created_utc": 1329922811,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q0y93/anxiety_has_literally_taken_over_my_life_help/",
            "id": "q0y93",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q0y93/anxiety_has_literally_taken_over_my_life_help/",
            "score": 14,
            "selftext": "I've had anxiety for about 8 years but its gotten really horrible in the past month or two. I can't work, I can't drive, I can barely leave my house unless I am drunk. I find myself almost falling over because I have to catch my breath. I have nervous habits like chewing on my collar and tossing things in the air constantly. I have to sleep on the ground and I only sleep for 3-4 hours. Where do I begin recovery?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety has literally taken over my life. Help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/q0y93/anxiety_has_literally_taken_over_my_life_help/"
        },
        {
            "author": "3amRadio",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329921427,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q0xdb/memories_from_time_before_anxiety/",
            "id": "q0xdb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q0xdb/memories_from_time_before_anxiety/",
            "score": 14,
            "selftext": "About a week back it was evening and I was standing on the porch. The birds were singing spring songs, the grass was slowly getting back to green (I am in Georgia) and suddenly. Wham. I got a memory from\ntime before anxiety.. \n\nI was transported about 4800 miles to where I was born (Finland) and 21 years back in time.. I remembered the spring of 1991.. And for a while, it was not me, the anxious wreck watching at the birds.. Sensing the spring.. It was the me from time before anxiety..\n\nThe thing is. I got anxious. As probably a lot of you people out there. Because my senses are hyper sensitive. I used to connect to a moment in a very deep way. Feeling chills on my spine as the wind drew breath. \n\nOnce some bad things started going down. (family went bankrupt, dad went to jail, uncle committed suicide, grandma died, a thief broke into house and held me and my little brother captive while ransacking the house.. You know the.. Usual stuff) \n\nThat sensitivity.\n\n What could be considered a blessing, turned into a curse. Instead of using it to connect to spring nights. I was looking at the world and concentrated on all the bad things that had happened to me. Slowly that process turned me anxious and bitter..\n\nBut on that day a couple weeks back.\n\nFor the rest of that day I walked around in awe of that moment. Because I could remember the mental freedom I used to have. Being 17. Watching at the sky and listening to the birds, feeling one with the world, instead of being riddled with anxiety symptoms and pain..\n\nNow. I could take it two ways. I could compare my life now to back then and make my pain even worse. But. Instead of doing that. I held on to the feeling here and there for the rest of the day. Accepting the difference, realizing how deeply anxiety has changed me. Accepting anxiety, accepting this life. Happy to have that memory from time before anxiety.\n\nAll you sensitive young people out there. Do not dredge the poop of the world into your brains. Because what ever you concentrate on, you will become. If you only look at how much the world sucks. Well. That is how you will start to feel on very deep level. And at that point. When you build your core being as a person who is negative and sees everything negative.. Anxiety happens.. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Memories from time before anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/q0xdb/memories_from_time_before_anxiety/"
        },
        {
            "author": "TTTweak",
            "author_created_utc": 1327957946,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6sn6c",
            "created_utc": 1329863702,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pzyv5/has_anyone_here_had_all_the_symptoms_of_a_serious/",
            "id": "pzyv5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pzyv5/has_anyone_here_had_all_the_symptoms_of_a_serious/",
            "score": 14,
            "selftext": "In the last 2 months I've had so many work-ups done by my PCP (primary care physician), a trip to the ER, and a consultation with a cardiologist.  All of this was the result of what I would later learn to be anxiety/panic attacks.  Even after my examinations I was convinced I had congestive heart failure.  How about you guys?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone here had ALL the symptoms of a serious condition, only to find out Anxiety was behind it?  ",
            "url": "http://www.reddit.com/r/Anxiety/comments/pzyv5/has_anyone_here_had_all_the_symptoms_of_a_serious/"
        },
        {
            "author": "keepingscore",
            "author_created_utc": 1287580359,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4g2as",
            "created_utc": 1330043780,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q3bn9/when_and_how_did_your_symptoms_start/",
            "id": "q3bn9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q3bn9/when_and_how_did_your_symptoms_start/",
            "score": 14,
            "selftext": "I was 26. Had just switched jobs and was sipping on my ice coffee with soy from starbucks and bam! felt light headed, arms tingly, legs felt heavy, heart racing, felt like I couldn't catch my breath. my first panic attack! Thought I was dying. Its so weird how before I used to chug energy drinks and coffee and now if I even drink one cup of black coffee/tea it can send me into a panic attack.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "When and how did your symptoms start?",
            "url": "http://www.reddit.com/r/Anxiety/comments/q3bn9/when_and_how_did_your_symptoms_start/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329888218,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q0ivk/warning_if_you_clench_your_teeth_too_much_while/",
            "id": "q0ivk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q0ivk/warning_if_you_clench_your_teeth_too_much_while/",
            "score": 13,
            "selftext": "So I have anxiety and it has given me tmj. Just a warning that if you do clench a lot when you're anxious it can dislocate your jaw and lead to nasty inflammation. If you notice you clench, stop. If you clench and your jaw hurts/you get headaches along the sides of your head/you have earaches it could be tmj caused by clenching and you should probably get a mouthguard.\n\nShit sucks.\n\nEDIT: I also find ritalin a contributing factor to the clenching so keep an extra eye out if you're anxious and on a stim",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Warning: if you clench your teeth too much while anxious it can give you tmj",
            "url": "http://www.reddit.com/r/Anxiety/comments/q0ivk/warning_if_you_clench_your_teeth_too_much_while/"
        },
        {
            "author": "Robot64",
            "author_created_utc": 1311580254,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5kawi",
            "created_utc": 1330061258,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q3oy7/has_anyone_heard_of_a_link_between_vitamin_b12/",
            "id": "q3oy7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q3oy7/has_anyone_heard_of_a_link_between_vitamin_b12/",
            "score": 12,
            "selftext": "My anxiety has been getting steadily worse over the last few months, everything seems to trigger me. My major symptom has been feeling nauseated almost constantly. This is completely exhausting, as I feel like I'm almost always fighting not to throw up. I went to get some blood tests done to make sure that it wasn't something physical, and all that came back was a Vitamin B12 deficiency. I'm taking supplements now, but nothing I've read about B12 deficiency talked about nausea and I kind of feel like I'm not treating the symptoms. I was wondering if anyone knew anything about links between anxiety symptoms and B12? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone heard of a link between Vitamin B12 and Anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/q3oy7/has_anyone_heard_of_a_link_between_vitamin_b12/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330053399,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q3j13/an_anonymous_poll_on_anxiety_and_self_injury/",
            "id": "q3j13",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q3j13/an_anonymous_poll_on_anxiety_and_self_injury/",
            "score": 12,
            "selftext": "When I posted a while back I asked what are small things you do to release anxiety and a few people posted about physical harm to themselves.\n\nSo I was just wondering if this was a trend for us. I posted three options below:\n\n* a. Yes, I have cut myself, breaking the skin.\n\n* b. Yes/No, I have harmed myself physically in some ways, but never breaking the skin (pinching, hitting, etc is this category).\n\n* c. No, I have never physically self harmed.\n\nSo just go ahead and upvote the one that applies to you please (no need to try to downvote the other options if they don't apply) \n\nYou can also respond for a discussion if you would like, but this is more for my curiosity.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "An anonymous poll on anxiety and self injury...",
            "url": "http://www.reddit.com/r/Anxiety/comments/q3j13/an_anonymous_poll_on_anxiety_and_self_injury/"
        },
        {
            "author": "czerniana",
            "author_created_utc": 1302787222,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_53q54",
            "created_utc": 1329885404,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/q0gql/i_love_waking_up_from_a_deep_sleep_in_a_panic/",
            "id": "q0gql",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/q0gql/i_love_waking_up_from_a_deep_sleep_in_a_panic/",
            "score": 12,
            "selftext": "Venting time.  I am calming down now, and can probably try to sleep again in a few minutes, but DAMN.  If there is anything more terrifying than waking up with a panic attack, i don't know what it is.  And i have many several phobias.  I don't even think i was dreaming yet.  At least i don't remember a dream.  I remember thinking about school before i fell asleep though, so that's definitely a possibility for a reason.\n\nShit's been getting worse lately.  Depression is kicking my ass, and basically i'm mentally sabotaging my schooling with crappy attendance, and not studying at home.  Or even looking at my books at home.  I need to break the cycle and quickly. Midterms are in a week or two.  \n\nSo i guess i just wanted to say 'FUCK ANXIETY!!'  to get it out.  In a crowd that would understand.  Cause damn, it sucks. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I love waking up from a deep sleep in a panic....",
            "url": "http://www.reddit.com/r/Anxiety/comments/q0gql/i_love_waking_up_from_a_deep_sleep_in_a_panic/"
        }
    ]
}