{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329502995,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pu5ym/hi_everybody_i_just_came_here_to_say_its_okay/",
            "id": "pu5ym",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pu5ym/hi_everybody_i_just_came_here_to_say_its_okay/",
            "score": 50,
            "selftext": "Repeat as necessary:\n\n\nTake your hands off the keyboard and mouse, and repeat as necessary. \n\nBreath in deeply and slowly from your belly button, hold the breath for a moment, now relax and breath out slowly. Now repeat this time a little slower, and close your eyes.\n\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hi everybody, I just came here to say, it's okay :) Here's a pro tip.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pu5ym/hi_everybody_i_just_came_here_to_say_its_okay/"
        },
        {
            "author": "mynamewasfuck",
            "author_created_utc": 1295325557,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4qm3z",
            "created_utc": 1329752472,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pxv2i/tell_me_the_normal_things_you_hate_doing_because/",
            "id": "pxv2i",
            "is_self": true,
            "media_embed": {},
            "num_comments": 136,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pxv2i/tell_me_the_normal_things_you_hate_doing_because/",
            "score": 46,
            "selftext": "I just need to commiserate.\n\nFor me, it's pumping gas. Retail interactions of any kind suck, but this one completely slays me. I'm terrified of fucking up and either humiliating myself by doing it wrong or setting something on fire with static discharge. I'm equally terrified of driving on empty, so when I get to about a quarter tank I just start to freak out.\n\nAlso haircuts, just because of those ten minutes of small talk. When she's like, \"sooo, whatcha doing this weekend?\" I want to say, \"playing video games, drinking, and masturbating, in that order. You?\"\n\nTo say nothing of just driving in general. *Fuck merging*.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Tell me the normal things you hate doing because of your anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pxv2i/tell_me_the_normal_things_you_hate_doing_because/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329337184,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pr5yd/isolated_and_lonely/",
            "id": "pr5yd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pr5yd/isolated_and_lonely/",
            "score": 29,
            "selftext": "I'm struggling.\n\nI'm a 34 year old man.  I weigh 350lbs.  I suffer from panic disorder, anxiety, and depression.  I've been living with this, officially, since 2002, but in the past 2 years it has really spiked, resulting in a 6 week day program 5 days a week to try and pull myself together, followed a few months later by 6 days in a psych ward because I was afraid I was going to hurt myself.  Oh, and I live with my parents.  Fuck.\n\nI haven't worked for 7 years.  In fact the big trigger for my current 2 year spiral was a job interview and immediately going into a panic attack as soon as I was told I'd gotten the job.  This was just some shitty retail job stocking shelves but it sent me over the edge of rock bottom to even rockier bottom.\n\n\nSo why am I telling all you folks this?  I'm trying to make things better for myself.  But it's so hard.  I feel totally isolated.  I don't have many friends, and of those I do have almost all of them live at least an hour away.  I force myself to leave the house most days and go grab a coffee at Starbucks, read a book, just to be around strangers.  I'm so socially awkward and so ashamed of myself that it's nearly impossible for me to even make small talk with the barristas.\n\nI know I'm nowhere close to unique in my problems here.  I come here for advice, for help from people who have dealt with similar things.  I'm at this age where I feel too old to be able to mingle with people in their 20's, but I also feel so sheltered by my anxiety that I can't relate to people with careers and families.  I try and strike up conversations with people on reddit, but I feel it's my responsibility to explain my life, my problems, and that results in never hearing anything again.  But I have to be up front about myself, I can't help it.  I don't know how to meet people, but I crave female companionship.  Not sex, not a relationship, just.. someone to sit on the couch and watch a movie with, someone to grab a coffee or a drink with.  I just get along better with women, always have. \n\nI have no idea why I'm posting this, it's a rambling mess.  10 years ago I could be, in my own opinion, a pretty eloquent writer, now I can barely keep my thoughts straigh long enough to get a sentence down.  I'm really fighting the urge to just delete this, but I'll post it anyways.  Thanks for reading. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Isolated and lonely",
            "url": "http://www.reddit.com/r/Anxiety/comments/pr5yd/isolated_and_lonely/"
        },
        {
            "author": "whytofly",
            "author_created_utc": 1308858984,
            "author_flair_css_class": "test",
            "author_flair_text": null,
            "author_fullname": "t2_5f1wp",
            "created_utc": 1329614039,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pvwd6/things_could_be_worse_xpost_from_rcomics/",
            "id": "pvwd6",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pvwd6/things_could_be_worse_xpost_from_rcomics/",
            "score": 28,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/m_zsC9O0Row4XHfM.jpg",
            "title": "Things could be worse (x-post from r/comics)",
            "url": "http://i.imgur.com/ckWjQ.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329422443,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/psqsu/strangers_staring_when_outside/",
            "id": "psqsu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/psqsu/strangers_staring_when_outside/",
            "score": 25,
            "selftext": "This always manages to ruin my entire day.\nIt usually happens when I feel really confident with myself for once.\nAfterwards I feel angry and like everyone is out to get me.\nThen I realize that's silly and hate myself even more for thinking something like that.\n\nDoes anyone recognize this?\n\nI usually don't care if guys stare, but when girls do it it just breaks me down.\nIt feels like they are judging and mocking me.\nEven when I'm walking with a friend they tend to stare at me instead of him.\n\nDo people really stare if you are unattractive/look odd?\n\nSome general info about me: I'm 21 year old male, paranoid, rather skinny, quite tall(6'3\") and I don't know how to properly use semicolons; which I sometimes think is the reason why people stare. At least I'd like to think so. The length I mean.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Strangers staring when outside",
            "url": "http://www.reddit.com/r/Anxiety/comments/psqsu/strangers_staring_when_outside/"
        },
        {
            "author": "FearlessEyes",
            "author_created_utc": 1328761305,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_6vlb3",
            "created_utc": 1329376645,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ps1ee/yes/",
            "id": "ps1ee",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ps1ee/yes/",
            "score": 22,
            "selftext": "I just realized this Reddit exists. Thank God. I'm hoping to get some advice or someone can relate to me. \n\nOne of my major anxieties is being a passenger in a vehicle. There have been a lot of close calls while other people have been driving. Especially on grid roads. When I'm a passenger I start crying and hyperventilating. It's come to the point where I don't even want to THINK about someone else driving. The only traumatic event I can think of that could have triggered this is that one of my close friends was killed in a car accident. Anyone else have anxieties about vehicles in general?\n\nAlso. My family. I'm 21 years old and live on my own. I call my parents and sister EVERYDAY. If I can't get a hold of them right away I begin to freak out and automatically think that something horrid has happened.. Anyone else?\n\nI appreciate all insight and advice. =) Thanks.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Yes.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ps1ee/yes/"
        },
        {
            "author": "artemis56",
            "author_created_utc": 1328713054,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6vdmj",
            "created_utc": 1329664242,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pwgnw/constantly_in_fear_over_things_that_havent/",
            "id": "pwgnw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pwgnw/constantly_in_fear_over_things_that_havent/",
            "score": 21,
            "selftext": "This has been going on for years. My biggest fear is of my family dying. Mainly by car accident. It's getting a bit better but I used to fear this DAILY. The scenario would play through my head down to how I would react, and the reaction was real. I would actually start crying and hyperventilating as it it was actually happening. A sickening though popped in my head a little while ago that stressing myself out is almost a high and I do this to myself on purpose. That scares me. It really does. \n\nNow that I own a home I fear of coming home to someone in the house, the house burning down, or someone breaking in while I'm inside. This is on top of the fears I'm having about my family. \n\nI call them as much as possible to tell them I love them and to drive carefully, thinking it might be my last time speaking to them. Yes, every time I speak with my family I do it like it's the last time I will ever talk to them.\n\nI'm at loss. Even typing about this brings up those feelings. I know this isn't normal. Is there anything I can do aside from seeking professional help or taking medication?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Constantly in fear over things that haven't happened...yet.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pwgnw/constantly_in_fear_over_things_that_havent/"
        },
        {
            "author": "blurghblurghblurgh",
            "author_created_utc": 1329685003,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6yr1k",
            "created_utc": 1329685689,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pwtzi/i_think_ive_hit_bottom/",
            "id": "pwtzi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pwtzi/i_think_ive_hit_bottom/",
            "score": 20,
            "selftext": "I can't remember the last time I've felt this bad. On Thursday I had a horrible panic attack at work and had to leave 15 minutes after I got there. I told my boss for the first time what was going on, and she was really understanding and nice about it but I feel so embarrassed I just never want to go back. I've spent most of this weekend holed up in my cave of a bedroom feeling sick and nauseous almost constantly. I don't think I can take this anymore. There are so many things that I wanted to do with my life, but this constant feeling of physical and mental unwellness sits like a boulder on my chest and keeps me from doing the smallest things. I'm to the point where I have to psych myself up just to go downstairs into my own kitchen. My emotions are completely and totally out of sync with the rational part of my mind, and I can feel it chipping away at me always, even on the \"good days\". The thought of dying scares the hell out of me, but I'm starting to think that suicide would be worth it just to end these horrible feelings.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think I've hit bottom.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pwtzi/i_think_ive_hit_bottom/"
        },
        {
            "author": "BarelyReal",
            "author_created_utc": 1284493092,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ccuk",
            "created_utc": 1329349755,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/prgov/is_it_heard_of_to_have_panic_attacks_when_people/",
            "id": "prgov",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/prgov/is_it_heard_of_to_have_panic_attacks_when_people/",
            "score": 20,
            "selftext": "When I'm in the same room with people who become hostile or one begins to yell at the other my brain begins to shut down, I feel my chest getting tight, and it is harder to breath. If I don't get away I feel as if my body is getting weak and I could collapse. I'm not sure if this comes from the constant fighting my parents did in front of me growing up(mostly over little things, in public, which would often end up in one of them later projecting it onto me). I know, not exactly much or anything, but it is the only thing I can think of.\n\nI was just curious about whether this can be a common trait amongst those who suffer from anxiety and panic attacks. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is it heard of to have panic attacks when people nearby are arguing or yelling?",
            "url": "http://www.reddit.com/r/Anxiety/comments/prgov/is_it_heard_of_to_have_panic_attacks_when_people/"
        },
        {
            "author": "edhughesiv",
            "author_created_utc": 1296691465,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4sonb",
            "created_utc": 1329599620,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pvmxm/i_hate_this/",
            "id": "pvmxm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pvmxm/i_hate_this/",
            "score": 19,
            "selftext": "I just had a panic attack guys and I'm still coming down off of it.  I'm a sophomore in college right now and last semester was my first time dealing with severe anxiety.  It was traumatizing and I went to the doctor so much thinking it might be something wrong with my brain.  I was put on paxil and that worked for a little while but eventually I felt like I just wasn't myself anymore. So once winter break came I decided to ween myself off of it, and I'm happy to say that I got off of it successfully.  I've been back in school for almost 2 months and I had no even slight signs of the anxiety returning, but today during lunch I took some amoxicillin and sudafed for a sinus infection and all of a sudden I felt the anxiety come back after I second guessed myself.  I feel awful and I didn't think it would ever come back :( I went back to my room and threw up everything thinking it might be the pills I took, but I'm not sure :( I don't know what to do now, I think I've lost my trust in any kind of pills because of this. Does anybody have any advice for this?? \n\nTL;DR\nI just had a panic attack after several months without one\nThink sudafed triggered it but I might just be paranoid\nLost all faith in medication. Advice?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate this...",
            "url": "http://www.reddit.com/r/Anxiety/comments/pvmxm/i_hate_this/"
        },
        {
            "author": "kiduntilidie",
            "author_created_utc": 1320878615,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_67q4u",
            "created_utc": 1329842916,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pzhii/this_year_has_fucked_me_over_and_is_still_going_i/",
            "id": "pzhii",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pzhii/this_year_has_fucked_me_over_and_is_still_going_i/",
            "score": 19,
            "selftext": "Here's my story. I was hospitalized last semester in Novemeber for suicidal tendancies and self harm. I am now suspended from my college for a plagarism incident that I still maintain I did not commit. My own parents don't believe me but are trying to be supportive. Honestly I feel like my whole life is under attack for no reason. I might have to transfer schools because I may lose my scholarship and I feel like any possibility of me getting into medical school is kind of fucked. My anxiety and stress is through the roof. I've lost all interest in eating and can barely make it out the front door. I'm seeing a psychiatrist and a therapist but I'm so sick of putting posion in my body on a daily basis. Honesty I just need support and I think this is the only place I'm going to get it...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This year has fucked me over and is still going. I need support, badly",
            "url": "http://www.reddit.com/r/Anxiety/comments/pzhii/this_year_has_fucked_me_over_and_is_still_going_i/"
        },
        {
            "author": "Uphoria",
            "author_created_utc": 1288888502,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4hq10",
            "created_utc": 1329453273,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ptfoy/what_is_a_panic_attack/",
            "id": "ptfoy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ptfoy/what_is_a_panic_attack/",
            "score": 17,
            "selftext": "I know from reading online what the clinical definition is, but I have no real way to compare it. I hear stories here on r/anxiety but I want to know real true opinions.\n\nI just feel like I may have panic attacks but I feel bad for feeling I might because then I feel like I shouldn't take away the seriousness of it by self diagnosing, and then I feel bad about having to feel bad... It never ends.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What is a panic attack?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ptfoy/what_is_a_panic_attack/"
        },
        {
            "author": "willierocks1029",
            "author_created_utc": 1314222805,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_5q3h9",
            "created_utc": 1329325232,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pqvvk/my_anxiety_is_hindering_my_ability_to_make/",
            "id": "pqvvk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pqvvk/my_anxiety_is_hindering_my_ability_to_make/",
            "score": 17,
            "selftext": "I can't talk to anyone, and I'm really socially stupid. I have social anxiety, OCD, ADHD, and MDD. It's really making me sad that I can't/don't have any friends. I did make one over reddit... but my constant anxiety destroyed that within 2 weeks. Basically I don't know how to have a conversation, so I always go on a tangent about all my problems. And then I make people uncomfortable, but I can't tell. Even if I'm not talking about my problems and I am having a normal conversation, something always screws up and I make them feel uncomfortable. They then want space, but don't tell me so my OCD kicks in and I start spamming them cause I'm scared they hate me.... then they really do :(\n\nHelp please? :) I'll respond to everybody",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My anxiety is hindering my ability to make friends in college",
            "url": "http://www.reddit.com/r/Anxiety/comments/pqvvk/my_anxiety_is_hindering_my_ability_to_make/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329281261,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pqa70/does_anyone_find_themselves_having_panic_attacks/",
            "id": "pqa70",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pqa70/does_anyone_find_themselves_having_panic_attacks/",
            "score": 17,
            "selftext": "So, I am new to actually talking about myself and my anxiety. I am a control freak. I am the first one to admit that. I am the type A personality who has to do everything herself because I'm an awful delegater (although I am getting better). I graduated from college last May and moved out in September for a job. I am working with a job that pays me next to nothing and am constantly stressed about money, living on my own, living in a new city, and changing my general work atmosphere from academic to social service, having a long distance relationship, and living in a city where I have only one friend. I am working in a homeless shelter providing direct care to homeless teenagers. They are great and I love hanging out with them. The job, however, is stressful. My office is drama and I have trouble leaving the kids issues at work and not bringing worry home with me. My supervisor is difficult to work with because he is terrible at communicating and for every positive remark he gives he gives 5 criticisms on how you can improve. He is as much of a control freak as I am and uses his position to assert authority whenever he sees weakness. I have the unfortunate habit of crying when I am a: overworked, b: exhausted, and c: stressed. These things also lead me to having panic attacks. I was diagnosed with Anxiety last October when I started freaking out about all of the things that I can't control (the fact that everyone dies, the fact that I am inherently insignificant in the grand scheme of things, the fact that my parents are going to die, the fact that time will continue to go on after I am dead, and the fact that time has been going on forever and will continue to go on forever). I had no control over all of the things that caused me to panic, and the thought of that terrified me. The panic attacks went away for a while but have come back worse than ever recently as they have started coupling themselves with suicidal ideations. I have started to panic about not being able to control my own thoughts and most recently not being able to control my own job performance. My boss confronted me today stating that he was writing me up for using my cell phone (a minor offense, but reasonable and logical given the fact that I was in violation), This was fine, but he then went on to ask me if I valued my job, if I wanted to be in the shelter, and if I really felt like I was meant to be there. I had a lot of trouble grasping all of this, because I interpreted it as \"I am a failure at everything that I do\". I had to walk away from work because I could feel myself having a panic attack. This lead me to walk to the 7-11 and essentially cause a huge scene in the corner as I was gasping for air and trying to talk my way out of it with my boyfriend over the phone. I left 7-11 feeling horribly embarrassed, but not really knowing what to do. I could breathe, but I still felt like I needed to defend my honor as a good worker. I then went to my boss and told him the following-- \"I am sorry if it seems like I don't want to be here or that I am being too distant, but I have been dealing with a lot of stressors and trauma in my life recently and I have been working hard to not bring those with me to work.\" To give you an idea-- I started seeing the Employee Assistance Program last week (free counseling courtesy of HR), I started taking Prozac last friday, I have started exercising every day, I have started regulating my sleep schedule, and I have been working to eat as healthy as possible. I told him all of this and while he was supportive, it wasn't particularly helpful. I guess my question is-- Does anyone else have panic attacks because of negative criticism? This one was bad (for me)-- it took about 20 minutes to come down from, with some of the worst hyperventilating that I have experienced. But I guess I just want to know if this happens to anyone else. \nTL;DR My boss sucks at giving criticism and it causes me to have intense panic attacks that pull me away from work.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone find themselves having panic attacks after receiving negative criticism?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pqa70/does_anyone_find_themselves_having_panic_attacks/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329567131,
            "domain": "self.Anxiety",
            "edited": 1349545355,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pv5v8/whats_wrong_with_me/",
            "id": "pv5v8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pv5v8/whats_wrong_with_me/",
            "score": 13,
            "selftext": ".",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "What's wrong with me?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pv5v8/whats_wrong_with_me/"
        },
        {
            "author": "so_wait",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329781004,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pyhrx/feeling_exhausted_duringafter_social_situations/",
            "id": "pyhrx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pyhrx/feeling_exhausted_duringafter_social_situations/",
            "score": 13,
            "selftext": "This usually happens any time I'm at a party or somewhere with a lot of people around. I usually stay away from \"wild\" parties, but sometimes even if I'm at a get-together with a bunch of people I'm friends with, I'll have a good time for a while and then just hit a wall at which point I feel *very* tired and just want to go home and relax. I have GAD, but I don't really feel any of the usual feelings of anxiety (heart racing, difficulty breathing, shaking, etc) during these situations. It's more like I feel like I'm on stage, or trying to act \"normal\" and after a while, I just feel exhausted, like I over-exerted myself. \n\nDoes this happen to anyone else? Any techniques for dealing with this/making social interaction a little easier?\n\nnote: I do attend therapy, but it seems like this is something that happens no matter how much I try to work through it. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feeling exhausted during/after social situations",
            "url": "http://www.reddit.com/r/Anxiety/comments/pyhrx/feeling_exhausted_duringafter_social_situations/"
        },
        {
            "author": "CptBoots",
            "author_created_utc": 1281229751,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_48ltm",
            "created_utc": 1329818407,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pz5mv/anxiety_and_how_it_effects_my_experiences_with/",
            "id": "pz5mv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pz5mv/anxiety_and_how_it_effects_my_experiences_with/",
            "score": 13,
            "selftext": "Do any of you (like myself) smoke Marijuana? or drink alcohol? I know that the risk of psychological addiction is almost soley present in people with anxiety and depressive disorders. I've dealt with that in my time, and is a whole other cat in a bag that isn't a big problem for me. But what is a big problem is that I find myself enjoying Marijuana way less than my friends, and Alcohol more than my friends. I kind of think both are related to my Anxiety. \n\nWhen I smoke pot, I sometimes experience what I've read is a symptom of panic attack called \"Hyperarousal\" where you feel physically on edge, or ultra paranoid about your sensory experience. My friends who don't have anxiety as bad as myself, or (some of them) at all remind me that I should let the effects calm me, etc... And sometimes I do get calmed (mostly if I'm alone, not if I'm with others.). The Hyperarousal seems to happen soley with Sativa's and never with Indica strains, I should mention. I always find Indicas to be highly congnitive and almost cleansing. \n\nAlcohol however, I enjoy way more than my friends it seems. I often feel like it's a race to forget my own mind, and that everyone else should be so burdened by their ownselves as I am that they should do likewise. My anxiety however MELTS away after one or two beers. I can talk to girls, I can sing or dance. It's amazing the difference. But I sometimes end up trying to keep up with my friends and make a fool of myself. (even if I don't make a fool out of myself, being sober and hungover with anxiety... I am embarrassed to death to hear stories of an unhindered me... doing all sorts of fun.) So I absolutely hate hangovers... but only from a psychological stand point. \n\nDoes anyone relate?\n\nAlso to answer any questions about why it's only separate. If I combine them I have a lot of trouble remembering the next day regardless the amount of either.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety and how it effects my experiences with Marijuana and Alcohol (separately)",
            "url": "http://www.reddit.com/r/Anxiety/comments/pz5mv/anxiety_and_how_it_effects_my_experiences_with/"
        },
        {
            "author": "throwawayman44",
            "author_created_utc": 1329523645,
            "author_flair_css_class": "",
            "author_flair_text": "Phobic101",
            "author_fullname": "t2_6y9pa",
            "created_utc": 1329524016,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pulz9/i_think_that_was_my_first_real_call_for_help_and/",
            "id": "pulz9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pulz9/i_think_that_was_my_first_real_call_for_help_and/",
            "score": 12,
            "selftext": "my email to a professor \n&gt;Dear Prof y,\n&gt;\n&gt;I am in your xxxxxxx class and just wanted to send you this email \n&gt;to talk about something. I don't usually write these sorts of \n&gt;emails, so have taken care to express it properly. I am quite an \n&gt;anxious person, and have been since my mid-teens. My major phobias \n&gt;are presentations and group speaking. I get really anxious before \n&gt;these, which admittedly is normal, but mine used to be more severe. \n&gt;I have been working on it, and have not had any anxiety attacks for \n&gt;quite some time. My last one was in second year, and since then I \n&gt;have been feeling pretty normal and have been happier. I am \n&gt;currently not on medication for it because the attacks are very \n&gt;infrequent and most of the time i can deal with them myself.\n&gt;\n&gt;However this year has been pretty difficult for me, with my father \n&gt;contracting cancer early at the start of this year. I informed my \n&gt;personal tutor at the time, but haven't needed to see her recently \n&gt;as I have been coping. For about a week now i have not been sleeping \n&gt;or eating well, mainly because of this presentation, and as time \n&gt;gets closer the feelings of apprehension intense. I have already \n&gt;handed the finished version in, and I would be more than happy to do \n&gt;the presentation in front of you. But the idea of doing it in front \n&gt;of 60 people fills me with fear. I wanted to send this email \n&gt;earlier, but have been trying really hard not to, but it is Friday \n&gt;night right now, and i really want to sleep tonight and not stay up \n&gt;all night over-thinking it, for it to just get worse.\n&gt;\n&gt;Whenever you get this email i want you to think of the time and \n&gt;context and frame of mind it was written in. I am also happy to talk \n&gt;to you about it before the talk. The main point of this letter was \n&gt;to ask you if you believed this to be an extenuating circumstance. I \n&gt;want to let you know that i know it already and will be as prepared \n&gt;as i can on Monday, in case you want our group to go.  I am grateful \n&gt;for you taking the time to read this.\n \n&gt;student x\n\n\n\nMy reply\n\nDear student x,\n\nPlease do not be concerned. Firstly let's deal with this in our own \ntime so you will not be requested to present on Monday.Secondly I do \nrecognise that all of you together make for a really challenging \naudience. That is why I have taken the opportunity of the timetable \nclashes to split you all up. There will only be around 30 present on \nMonday.I had hoped that was obvious but may be I need to get an email \nout as several of your colleagues will also be worried ,may be not to \nthe same extent.\n\nIt is very far sighted of you to offer to present by yourself. Let's \nfind an opportunity to try this out but only if you really wish.\n\nThe most important issue however is your well being. I am ever so \ngrateful you have written. If you wish I'd be happy to meet to check \nthere are no other issues we need to be resolving.\n\nI am ever so sorry to hear the news of your father . I do hope you \nand your family are coping at such a difficult time  \nprofessor y\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think that was my first real call for help, and response",
            "url": "http://www.reddit.com/r/Anxiety/comments/pulz9/i_think_that_was_my_first_real_call_for_help_and/"
        },
        {
            "author": "zacci",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329368574,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/prw4e/does_anyone_know_how_to_cope/",
            "id": "prw4e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/prw4e/does_anyone_know_how_to_cope/",
            "score": 11,
            "selftext": "I suffer from anxiety (generalized but I show many traits for almost every anxiety disorder out there) &amp; depression (situational). I also have a terribly low self-esteem. I don't want to go into too much detail unless someone asks me directly about anything but is there anyway for me to get out of this slump?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone know how to cope?",
            "url": "http://www.reddit.com/r/Anxiety/comments/prw4e/does_anyone_know_how_to_cope/"
        },
        {
            "author": "jabbajoyo",
            "author_created_utc": 1328664988,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6v7xl",
            "created_utc": 1329637962,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pw9c1/anxious_habits/",
            "id": "pw9c1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pw9c1/anxious_habits/",
            "score": 10,
            "selftext": "I have a problem. One that is so big and so small at the same time.\n\nI cannot stop picking my face. When I notice myself doing it, I stop, but I do it unconsciously, constantly, I think in my sleep or at least when I'm half awake. I wake up and realize that I've been drowsily pawing at my face, unawake and unaware. I run my hands over my face, and wherever there is a bump I scratch it off, until if feels smooth.\n\nI'm not sure why I do this, but I've been doing it for years. I get mild acne, or I used to, I don't know what is going on with my skin anymore. I look like a meth-head, you know, the ones with sores all over their faces. I have to layer on foundation so that I can leave my room, let alone go outside.\n\nPlease please help me, I don't know what to do about this but it just keeps getting worse. It's horrible and I hate it and I just don't know how to stop.\n\nAlso, I was hoping that there was someone else out there who does something like this. Please speak up if you're out there, I feel like a total freak.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxious Habits",
            "url": "http://www.reddit.com/r/Anxiety/comments/pw9c1/anxious_habits/"
        },
        {
            "author": "Scarletharlot",
            "author_created_utc": 1309155330,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5fklk",
            "created_utc": 1329436816,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pt2rg/my_fellow_medicated_redditors_what_is_your_stance/",
            "id": "pt2rg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pt2rg/my_fellow_medicated_redditors_what_is_your_stance/",
            "score": 9,
            "selftext": "This is my dilemma:\n\nI've been taking prozac for about 2 years for my panic disorder feat. Agoraphobia; however, I feel like it isn't doing shit for me. I still have attacks, have general anxiety, etc. \n\nBUT\n\nI'm also in therapy, which has really helped me cope. I feel like I might as well just not be on medication at all, it's a waste of my money and I'm not so certain it isn't making me feel a little bit worse. The main thing stopping me from asking my doctor about going off is my fear of depression. I know it's common for people with panic disorders to suffer from depression/hopelessness because of the severity of the disorder.\n\nDoes anyone else have any experience with this? I'm curious to see what other people's views/experiences are with meds.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My fellow medicated redditors, what is your stance on daily medication for anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pt2rg/my_fellow_medicated_redditors_what_is_your_stance/"
        },
        {
            "author": "Moglz",
            "author_created_utc": 1328894463,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6w1rd",
            "created_utc": 1329246952,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pphak/just_talking_do_any_of_you_have_this/",
            "id": "pphak",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pphak/just_talking_do_any_of_you_have_this/",
            "score": 9,
            "selftext": "Just reaching out to see if I can talk through some of my issues and get idea's for self treatments. \n\nI feel like my anxiety and my compulsions have gotten worse as I've gotten older. 33 now, and I really don't ever remember feeling this anxious in my whole life. I feel like I am making myself anxious. Like the more I think about it and the more I research and try to understand it, the worse it gets. Is anyone else dealing with that? Any coping techniques you've found as you age?\n\nAlso I get very strange urges or compulsions to jump. Jump out of a moving car, jump from the the nosebleeds in an arena, jump of ledges, balconies etc.. I am not suicidal, I dont want to die. And I am actually scared I will do it, like I will not be able to stop myself. Like there is some subconscious barrier that tells you not to jump, it isn't safe, you could hurt yourself, but that barrier will just disappear. I don't know what this feeling is called, so I am having a tough time researching it. Any redditors who have a similar compulsion, or have a good grasp of what it is, I would love to hear, thanks.\n\nGlass is half full everyone. Smile once today :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just talking. Do any of you have this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/pphak/just_talking_do_any_of_you_have_this/"
        },
        {
            "author": "ultimate_zigzag",
            "author_created_utc": 1295501805,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4qwah",
            "created_utc": 1329801072,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pyx8e/overcoming_social_anxiety_induced_by_the_fear_of/",
            "id": "pyx8e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pyx8e/overcoming_social_anxiety_induced_by_the_fear_of/",
            "score": 9,
            "selftext": "Hi, Reddit.\n\nI am a 19 year old male in my second semester of college. I've had the notion of being a pushover and a fraud for quite some time, and I think I just didn't want to face it. I have been willing for far too long to trade my own comfort and peace of mind for others' whims and my constant, brooding social anxiety. I think I can accurately trace the origin of this social anxiety to my elementary school, which I attended for 9 years. It was a private, Christian school in the Louisiana South. In this school, the fear (more like terror) of God was instilled in all the children, and a cut-throat social hierarchy arose, with each person using and abusing his or her social power in whatever horribly corrupt way seemed convenient. One example of the many is an occurrence during art class one day, involving a somewhat annoying boy and a popular girl. The girl got angry at the boy (for some minor offense, the details of which escape me) and, after knocking him to the floor, proceeded to stomp and jump on him in full view of the entire class and even teachers who passed by the door, saw what was happening, and continued on their merry way. In the end, the boy was punished for a week, and the girl for a day. This was the social climate in a class of ~20-30 students for the 9 years I spent there. \n\n\nHow this ties in with me, at least in the most major way that hit me like a ton of bricks today is this:\n\nFirst, in the conservative U.S. South, sex is an especially taboo subject - above all at a private Christian school of ~180 people who know each other very well. With the social hierarchy (and my level of social anxiety), this obviously creates a terrible environment for sexual discourse and acceptance. The slightest inkling of dislike, especially from one of the socially more favored, would illicit immediate tattling, upon hearing any talk of any remotely controversial subject, and a nice chat with the principal or teacher would soon follow, wherein the student would be given again the fear of eternal damnation for mere thought or word crime.\n\nSecond, I have, and always have had, an enormous libido... so, this type of conversation was always interesting to me (as I assume it is to most other children of that age). The thing is, I paid very literal attention to what the teachers were telling me, and took the threat of eternal damnation (from a god who they, in perpetual fits of unnoticed dissonance, asserted loved us all, ftw) very seriously. So seriously in fact that I was in effect emasculated by these vicious, \"innocent\" whistle-blowers, voluntarily avoiding conversation on a subject that otherwise would have been wildly fulfilling and great at that naive age. This was after a few other naive homosexual encounters with my friends between the ages of ~6 and ~8 - actions which had been themselves preached as horrible abominations and grounds for condemnation at this particular hell-hole of a school.\n\nMy father had a very open mind, though, and always tried to instill in me curiosity and inquisition, whatever the subject matter. But he didn't have the scriptural authority of these *qualified* teachers, so on matters involving the divine creator's wrath, I *reasonably* deferred to them, and stopped all inquisition, or guiltily pursued such subject matter in deep secret.\n\nSo, from 1st to 8th grade, I was taught something along the lines of my sexuality being thoroughly evil at this age, and only acceptable after a religious and god-sanctioned marriage. In 8th grade, I started to become indignant at the teachers' naive dismissal of the theory of evolution by scripture and faith, even while knowingly dissonant of the Catholic Church's position on the matter. No, of course they could interpret ancient literature from a southern U.S. worldview better than the pope.\n\nIn 9th grade, I went to a secular, public, magnet high school and was surrounded by much more rational thinkers of more colors than just white. From 9th grade to 12th grade, I lost my ridiculous faith and became vehemently atheist, and the rational side of my mind evolved past the lies told me at my previous school. I had a fairly intense sex life during sophomore and junior year - the polar opposite of what I was taught in elementary school, and likely caused by rebellion against my former oppression. In my personal life, I started giving up former beliefs taught to me by the same kind of otherwise good and well-intentioned people who had instilled such terror in me before, especially thanks to one amazing friend who has probably changed me more than I can knowingly give him credit for. Ironically, it was when I started smoking marijuana and realized the extent to which the propaganda thereof was insanely exaggerated that I *started* to really challenge everything I had been taught. My grades went up, I closed in on my more passionate interests, and starting working hard on a few projects. After this, a wonderful backpacking trip through Europe, a good first semester in college, and starting a new relationship, I thought my progression away from these Christian views was going fairly well, admittedly with faults here and there, sometimes continuous and lingering faults.\n\nToday made me put some things in perspective. I was about to have sex with my girlfriend, and things were going fairly well in regards to foreplay. However, I could not for the life of me get an erection. This made the situation fairly awkward, and we ended up stopping (she said she was a bit sore - don't know how true that is). All I could feel was the same type of shame I felt all throughout elementary school while trying to embrace my sexuality, which is ridiculous because she is a very understanding person, and all it would take to get past something like this is an erectile dysfunction joke and being a bit less tired the next time. I then started thinking about why I felt so ashamed. We have been together for a little longer than 3 months, and the sex at the beginning was intense and great, and then she got house-locked by her overbearing parents for about 2 months. That time was probably the most sexually frustrated I have ever been. I've found that even though I had mostly gotten past these archaic, fear-mongering tendencies taught to me in elementary school, it's still a huge problem for me to adequately express myself sexually to people that expression would make me vulnerable to, without extreme shame and the feeling of guilt-tripping them into sex. I rationally know that this is excessive and paranoid, but it is so insanely hard to believe and act on that knowledge. So she really had no insight into the extent of my sexual frustration, or my feelings of shame and regret at placing so much importance on a single sexual encounter that I actually couldn't even feel aroused.\n\nThis social anxiety isn't so bad with strangers, though there is definitely a notion of it still there. It's the worst with people I am in the process of becoming intimate with. Although, there are still some instances where, for whatever reason, I have refrained from revealing to Christians who I knew before my atheism that I am now an atheist. I am sure the main reason for this is my desire for continued good relations with these people, but there is definitely an aspect of fear/relief at not having to tell them.\n\nToday was eye-opening, and finally brought at least some of my problems to my own forefront. My goal, more than anything now, is to truly get past my social anxiety and be able to express myself without fear or reserve. Otherwise, I feel that any potential accomplishments will always be marred by a disgusting, bigot-induced, and voluntarily-continued impracticality of living.\n\nWish me luck.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Overcoming social anxiety induced by the fear of god and cut-throat social hierarchies",
            "url": "http://www.reddit.com/r/Anxiety/comments/pyx8e/overcoming_social_anxiety_induced_by_the_fear_of/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329458354,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ptj42/tightness_in_throat/",
            "id": "ptj42",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ptj42/tightness_in_throat/",
            "score": 8,
            "selftext": "My first panic attack started with an incredible tightness in my throat, like someone was pushing on the front of my neck. At the time, it felt like my throat was closing and soon I'd be unable to breathe. Since then, the tightness doesn't accompany my panic attacks, but on stressful days it shows up as a sort of physical reminder, even if I'm not feeling emotionally stressed or anxious. Does anyone else have this symptom? Does it ever occur without emotional anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Tightness in Throat",
            "url": "http://www.reddit.com/r/Anxiety/comments/ptj42/tightness_in_throat/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1329617492,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/pvyj8/waking_up_on_a_panic_attacks/",
            "id": "pvyj8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/pvyj8/waking_up_on_a_panic_attacks/",
            "score": 8,
            "selftext": "When I was younger I use to wake up on panic attacks, for a couple of years then thing would go away, but it never did completely. Last week I had my first in years. I woke up from some kind of dream that must have touched something inside my brain and I woke up completely panicked hyperventilating, confused, scared shitless I basically let it go off walking around my house until I could sleep.\n\nOne week after it I have been terribly anxious. I feel uneasy all the time. Today I had to do a bunch of homework, but I couldn't just focus on something or I would start feeling a  little panic, or anxiety. I need to be distracted or else I start feeling a hole in my chest.\n\nWhat do I do?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "waking up on a panic attacks.",
            "url": "http://www.reddit.com/r/Anxiety/comments/pvyj8/waking_up_on_a_panic_attacks/"
        }
    ]
}