{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325622688,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o1hzs/exercise/",
            "id": "o1hzs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o1hzs/exercise/",
            "score": 16,
            "selftext": "Im wondering If anyone on here has tried exercise regularly with medication to help there anxiety and or depression, and im wondering how its worked for you.\n\nIve started running again, It helps put a pattern in my day and has raised my self-estem, i feel like ive been accomplishing something in the day. and instead of waking up on days i dont have to work with tons of free time, it gives me some structure to the day, i wake up and say alright eat breakfast go for run, it takes up time in the day and feels good.\n\nits hard to do all the time, but i push my self to do it because i know ill feel better after.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Exercise",
            "url": "http://www.reddit.com/r/Anxiety/comments/o1hzs/exercise/"
        },
        {
            "author": "bpaustin3",
            "author_created_utc": 1274035646,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_428sr",
            "created_utc": 1325564078,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o0ocu/religiousloss_of_belief_anxiety/",
            "id": "o0ocu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o0ocu/religiousloss_of_belief_anxiety/",
            "score": 15,
            "selftext": "I am 19 and I was born into a strong Christian family. My parents were very loving and did not emphasize a negative, brimestone and hellfire type of belief, however, the concept of going to hell was always there. After going off the college I began opening my mind to a lot of new things and since last summer I have been obsessing over choosing the right religious belief to subscribe to. I went through a Buddhist/mindfulness phase which brought me a good amount of happiness. However, as of the past few months I started thinking more and more about Christianity and hell.\n\n Logically I feel like my fears of hell and the afterlife in general are not rational, yet I always have that little voice that says \"what if?\". I get scared that maybe God is not a good guy and most people will be tortured forever and I especially freak out when I start to imagine the length of an eternity in pain or loneliness. I often resort to trying to force myself to believe in a lie just in order to secure myself in case the bible stories are true.\n\nI feel like many redditers may have had these fears, considering the amount of ex-christians here, so I am hoping for some words of wisdom. Deep down I feel like this is all irrational, but I don't know how to deal with this. In all reality I lean toward agnostic deism, but I am afraid to officially deconvert. Thanks for listening.\n\n**TL;DR: Born in a strong Christian family, would rather be agnostic in my beliefs but I am afraid to deconvert due to my irrational fears of going to hell for eternity.**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Religious/Loss of belief anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/o0ocu/religiousloss_of_belief_anxiety/"
        },
        {
            "author": "SadSeekingAdvice",
            "author_created_utc": 1325810399,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ldc0",
            "created_utc": 1325811721,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o4qm2/social_anxiety_seeking_advice_on_dealing_with_an/",
            "id": "o4qm2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o4qm2/social_anxiety_seeking_advice_on_dealing_with_an/",
            "score": 13,
            "selftext": "I was diagnosed with social anxiety disorder as a teen and have worked very hard to overcome it. I dropped out of school repeatedly from middle - high school to avoid large crowds, I've had very few friends and I hold what friends I have to high esteem. I'm in my late 20's now and I recently got involved with a man who I thought was nice at the time, we used to be friends, lost contact, reconnected, then we dated, then we talked about our future, then he told me he didn't want to be with me. I've dealt with it fine, we have been talking like friends lately, last night while talking online he mentioned how I was obsessed with him. I told him not to flatter himself... I've heard through the grapevine that now he's dating a neighbor of mine and telling people who don't know me that I'm crazy. It's all because I mentioned in passing that for a time period where we lost contact with each other I would think of him sometimes (he used to have depression and was suicidal at one point, of course I thought about him and worried about him). He thought that it was a sweet sentiment at the time, but now he's using that as a basis of me being obsessed with him...\n\nI never did anything to him and it's making me shut down again. He even tried to make me doubt my sanity.\n\n\nI just wish I could find a way to convey to him that he's being immature and it's not fair to me to tell people who don't know me these things about me. I'm just really upset and now I'm becoming more reclusive, especially since he could now be telling neighbors lies about me. I live in a pretty tight-knit neighborhood. I'm worried and paranoid and I am losing sleep at night. I don't think this is fair.\n\nAny and all advice is appreciated. \n\n[edit] fixed tight-night to tight-knit.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Social Anxiety - seeking advice on dealing with an immature guy.",
            "url": "http://www.reddit.com/r/Anxiety/comments/o4qm2/social_anxiety_seeking_advice_on_dealing_with_an/"
        },
        {
            "author": "LangeJames",
            "author_created_utc": 1324426280,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6hbvi",
            "created_utc": 1325795950,
            "domain": "gettingoverthecrazies.blogspot.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o4eip/anxiety_antics_a_look_inside_my_personal_battle/",
            "id": "o4eip",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o4eip/anxiety_antics_a_look_inside_my_personal_battle/",
            "score": 13,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/6J__Gv-fGA08wOXS.jpg",
            "title": "Anxiety Antics - a look inside my personal battle with anxiety and panic disorder. You are not alone. ",
            "url": "http://gettingoverthecrazies.blogspot.com/2012/01/sprial.html"
        },
        {
            "author": "bananical",
            "author_created_utc": 1306301727,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5a7t4",
            "created_utc": 1325402961,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nyef2/does_anyone_else_get_frequent_chest_pains_need/",
            "id": "nyef2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nyef2/does_anyone_else_get_frequent_chest_pains_need/",
            "score": 12,
            "selftext": "I started getting heart palpitations and pains around October for a few weeks and went to get and EKG. Everything turned out fine and the doctor and myself chalked it up to stress. Since then I've frequently felt like my chest was being pinched or bruised and sometimes a dull lingering pain. I keep worrying I have lung cancer but don't know how much testing would cost. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": " Does anyone else get frequent chest pains? Need advice on what to do.",
            "url": "http://www.reddit.com/r/Anxiety/comments/nyef2/does_anyone_else_get_frequent_chest_pains_need/"
        },
        {
            "author": "mandrakewilder",
            "author_created_utc": 1305197864,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_585dz",
            "created_utc": 1325668844,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o2c1j/at_the_tail_end_of_a_relatively_severe_panic/",
            "id": "o2c1j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o2c1j/at_the_tail_end_of_a_relatively_severe_panic/",
            "score": 12,
            "selftext": "I just wanted to vent while I have the chance.  I've known anxiety for the past six or seven years now, and I can attest to the fact that it can be pure, unadulterated hell on its face, but as we can all freely admit during our calmer days, it's an embarrassingly empty threat.  That is why I'm writing this now--because I've decided that this time, I'm hanging on to it.  I'm going to grab this thing by the throat and I'm putting it in the corner, and I'm not letting go again until I'm gone.  I'm going to go the anger route and I'm going to go with a vengeance.  I'm tired of getting over it--the lingering agoraphobia, convincing myself after a few weeks that I can quit with the preventive, burdensome lifestyle because I've once again defeated it--without remembering what it did to me.  How truly helpless it made me feel.  Not for one more day will I ever again let it slide out the back door just because I'm too happy to care.  Anxiety and happiness cannot coexist, but that's only because anxiety can't handle it.  From now on when I'm happy and worry free, I'm going to turn around and show this thing what it's kept from me; all the good days that it's ruined.  It doesn't deserve a free pass again this time.  From now on, I'm getting even.\n\nOn average, I would say I have a panic attack worth remembering about once a year.  Tonight was a pretty damn bad one.  Tomorrow is going to be a pretty damn good one.  It had better be ready for me.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "At the tail end of a relatively severe panic attack right now...",
            "url": "http://www.reddit.com/r/Anxiety/comments/o2c1j/at_the_tail_end_of_a_relatively_severe_panic/"
        },
        {
            "author": "chefmcduck",
            "author_created_utc": 1311857997,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5kwzg",
            "created_utc": 1325616330,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o1dc5/how_to_deal_with_feeling_like_crap_a_lot/",
            "id": "o1dc5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o1dc5/how_to_deal_with_feeling_like_crap_a_lot/",
            "score": 11,
            "selftext": "I have a panic and general anxiety disorder. I was diagnosed about 2 years ago now, right before I got married. I've never figured out what my 'trigger' is, but my doctor believes it could be performance based, or a fear in failing. \n\nOver the course of the last 2 years, I think I've had every test imaginable. Yet - I still struggle with the physical side effects of having these disorders and the hardship in other people not really understanding what my problem is. \n\nI suffer from frequent headaches, head pains, chest pains and stomach trouble. I rarely take off work, because I always just 'assume' it's my anxiety. Which is good, I'm not letting it rule me... but it's still there. I often find myself sighing because of how I always feel 'not right'. \n\nMy wife is a great friend, and she understands that I feel what I feel and it's hard to control but some days I worry that because sometimes I'm hands off she will get tired of my worrysome ways and I'll lose my best friend because of my problems.\n\nI took medicine for a while, but even she agreed that taking something with side effects that also make you feel physical symptoms is not the best idea for me. It made me more anxious.\n\nI guess I'm just asking for a shoulder. People who have had anxiety disorders without a known trigger with physical symptoms - how do you convince yourself you are actually okay ? \n\nFor me, even thinking something may be wrong is a trigger to anxiety and everything just gets worse.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How to deal with feeling like crap - a lot.",
            "url": "http://www.reddit.com/r/Anxiety/comments/o1dc5/how_to_deal_with_feeling_like_crap_a_lot/"
        },
        {
            "author": "RedStarRising",
            "author_created_utc": 1323879146,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ft4h",
            "created_utc": 1325702834,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o2smt/anxiety_while_driving/",
            "id": "o2smt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o2smt/anxiety_while_driving/",
            "score": 10,
            "selftext": "So I was driving to go meet a friend today and it was a farther drive than I'm use to (though I made it a lot during the summer) I was a little nervous before hand. At first I was ok, still a little nervous but getting over it, but after a while on the highway I found it was difficult to breathe and then I just got big pins and needle fuzzy sensation in my body, my heart start racing and some other stuff I feel during a panic attack. So I get off of the highway get some beef jerky and water at a party store and the entire time I was shaking, feeling jittery and just crappy in general. \n\nAfter eating some food and having some water I felt better, but as soon as I started driving it started happening again but to a lesser extent, though at one point my vision started to get a little fuzzy. I've never pass out before but this all feels like how I would imagine it would feel like just before. \n\nThis also isn't the first time this has happened. I had a similar experience last week while trying to drive to the mall on the highway. Both times I never last long than 10mins on the road. Also to give some back ground, I go to school out of state where I don't have a car. I'm home for christmas so this is the first time I have had a car to drive in several months. But I don't think this has much to do with the panic attacks as I didn't have a car last year and when I came back from school for the summer I was fine driving. What makes this worse is that I was gifted the old family car for christmas and was suppose to drive back to school with it instead of taking the train. Now I can't drive it on the highway (which is necessary for me to get back to school) and I won't be able to get a job this summer (or get a job that pays even slighty above minimum wage before summer) if I can't drive. I'm going to try to find help back up at school for this, but please comment.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety while driving",
            "url": "http://www.reddit.com/r/Anxiety/comments/o2smt/anxiety_while_driving/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325725445,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o3a0o/not_sure_if_social_anxiety_or_not/",
            "id": "o3a0o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o3a0o/not_sure_if_social_anxiety_or_not/",
            "score": 9,
            "selftext": "I dont have attacks or anything but its just getting really hard to talk to people.  Over the summer I had a job and it took like the whole summer to be somewhat shall we say comfortable with them and be able to sort of talk to them although i guess i still didnt say much.  Well that job ended, and i just got a new one two months ago about.  Anyway its like everything I worked for to get used to people is gone and Im back to square one.  Now theres a girl at work who I think I like but its probably just because she pays some attention to me.  Shes like the first girl ive even liked since probably middle school.  I have made maybe one friend in the last two years and I stopped seeing her when i left my first school.  I do not talk to my high school friends partly because they were mostly assholes but also because I am seemingly unable to call anyone or even talk to someone without them initiating.  \n\nEdit: I guess I should mention that even posting this made me pretty nervous.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Not sure if social anxiety or not",
            "url": "http://www.reddit.com/r/Anxiety/comments/o3a0o/not_sure_if_social_anxiety_or_not/"
        },
        {
            "author": "iamyoursavior",
            "author_created_utc": 1314821387,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5rjpj",
            "created_utc": 1325882212,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o5urh/anxiety_about_meeting_up_with_exgf/",
            "id": "o5urh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o5urh/anxiety_about_meeting_up_with_exgf/",
            "score": 9,
            "selftext": "I am an anxiety suffererer. I have been for a while. I'm about 5 years removed from college, where in my senior year I started developing bad anxiety with the physical symptoms. Headaches, shaking, stomach aches, chest pains/discomfort, etc. I probably always have had anxiety as it does run in my family, but this is when it got bad. \n\nFast forward to a few months ago. My girlfriend decided to part ways because she was tired of the way I was acting around her. I let her know I had anxiety, but I really wasn't doing much about it and it looked like I was disinterested. I don't blame her, honestly. I probably didn't need to have a gf at that point in time, anyway. \n\nWhat I realized in the time since is that she is the perfect girl (for me, at least) and I basically let a good thing slip away. Life was rough for a bit after the break-up, but I was starting to be able to manage my emotions. Thing is, I could not stop thinking about her and what could have been. When things were good with her, they were *good*. I decided to randomly email her a week ago or so and she got back to me in about 4 hours. She was so happy to hear from me and wants to grab dinner.\n\nShe texted me on New Year's eve hoping I had some fun things planned and what not and wished me a Happy New Year. I texted her back about an hour later and thanked her and wished her the same. I did not realize it until the next day, but she actually texted me at 2AM. \"Joooooooosh!\" she said, but that's all. She was in a different state visiting her family at that time, so it's not like we could have met up or anything. What could that have possible meant? She was thinking about me, I know, but anything else?\n\nI emailed her a couple of days ago and told her that I would love to grab dinner and said a couple of nice things. She gave me the greenlight. We exchanged a few texts yesterday and she actually sent me a gchat today to just double verify the plans and we had a nice little convo.\n\nSo, we are going out next Wed. night and I pretty much want to spill my guts to her. I have a ton of anxiety as I do not want to mess this up at all. Do you guys have any idea what this could all mean and what can I do to alleviate my anxiety?\n\ntl;dr I have anxiety and am having dinner with the ex gf soon. Should I get my hopes up? How do I combat this associated anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety about meeting up with ex-gf",
            "url": "http://www.reddit.com/r/Anxiety/comments/o5urh/anxiety_about_meeting_up_with_exgf/"
        },
        {
            "author": "yousefk",
            "author_created_utc": 1308782673,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ew46",
            "created_utc": 1325898638,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o66h5/health_anxiety/",
            "id": "o66h5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o66h5/health_anxiety/",
            "score": 9,
            "selftext": "Hello,\n\nI'm 16 and have been suffering from health anxiety for the past few years. What happens is, I would get a weird symptom that most likely means nothing. I would start associating that symptom with all the possible diseases related to it. That would cause me to get more scared and I would feel more symptoms related to that disease. This would lead me to believe that I am going to die, causing a panick attack that would last for a few minutes to an hour. I would then be scared and anxious for a while after that.\n\nI have talked to everyone about this, and found out my mother would experience the same exact thing. She told me it was all in my head and that she suffered the same type of anxiety before. She said she wouldnt even be able to get out of bed because of her fears. She told me she finally cured herself and started feeling better after excersizing and then it finally went away.\n\nI ignored the excersizing part and ended up seeing doctors left and right which all told me I was healthy. After getting that reassurance, I started feeling better. Soon my anxiety slowed down to not being scared all the time and rare panic attacks.\n\nRecently these panic attacks have started up again and are getting me scared. I'm at the point where I am terrified most of the time and get panic attacks at least once a day.\n\nI started working out and lifting weights a few days ago hoping it'll help.I am feeling slightly bettter and less terrified. Does anyone have any suggestions? Can anyone relate? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Health Anxiety ",
            "url": "http://www.reddit.com/r/Anxiety/comments/o66h5/health_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325458132,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nz0q2/i_need_help_where_do_i_get_it_from_xpost_from/",
            "id": "nz0q2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nz0q2/i_need_help_where_do_i_get_it_from_xpost_from/",
            "score": 9,
            "selftext": "I've suffered from some degree of depression for around 12 years now and I want to get better, but I don't really know where I should look for. Psychiatrist? Psychologist? Some support group? Meds? No meds? I really have no idea where to get it from.\n\nLong story short:\n\nI'm 20 years old, got bullied from grades 1 to 6 (7-13 years). Attempted suicide at 10 with overdose of medication. I don't have any real friends and find it difficult to make new ones. I have two people that I can talk to about pretty much anything, but both live far away now, and I don't feel like troubling them all the time. Neither can't actually help with the problems, but getting to talk about my problems helps a lot.\n\nI couldn't go to high school because of how bad I felt at the time. I tried going to HS for 18+ year olds in the beginning of 2011, but I felt pretty much the same as 5 years ago. I want to try again, but I just don't know how. My job is OK, but definitely not something I want to be doing for too long. In comprehensive school I had GPA of 9.1/10 without actually studying, so there are lot of doors open for me if I can find the motivation.\n\nI feel anxious and reserved in big groups of people and around new people. I can't ever really let go, I'm constantly thinking about what others might be thinking of me. I feel like I'm not interesting or funny, and I rarely feel like saying my opinion about things or just sharing my thoughts with others.\n\nI may have awesome day, but at some point my thoughts always turn dark. Sometimes I feel like I don't deserve to be happy, or have friends, or have a girlfriend. I might be walking home from work, see a tram, and start thinking if it was foolproof way of killing myself, or would I just get badly hurt if I jumped under it.\n\nFor a long time I wanted to take a another shot (no pun intended) at killing myself, but I knew how bad it would've made my family feel, so I've never tried again. I'm also an atheist, so it all seems little too final. One of the biggest regrets in my life has been how I failed the first try.\n\nI want help but I want it to be real. I don't want to get medication that just makes me feel nothing, and then makes me super-depressed some day when I drop it. I don't think I'm really dangerous to myself at the moment.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I need help, where do I get it from? (x-post from r/Depression)",
            "url": "http://www.reddit.com/r/Anxiety/comments/nz0q2/i_need_help_where_do_i_get_it_from_xpost_from/"
        },
        {
            "author": "zorcandspoon",
            "author_created_utc": 1322104740,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6aw7v",
            "created_utc": 1325455167,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nyyrz/ugh_this_is_the_worst/",
            "id": "nyyrz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nyyrz/ugh_this_is_the_worst/",
            "score": 9,
            "selftext": "I don't know why I'm feeling so anxious, and that is the worst feeling. \n\nI haven't seen my friends in about two months since I have been recovering from unexpected knee surgery and physical therapy. We started making plans to get together this week and I immediately felt nervous. Why? I miss them and I'm excited to see them, so why the anxiety? \n\nAnd really the worst part if I'm on meds that are supposed to help. Do I need to go up a dosage? \n\nI thought if anyone would understand, this subreddit would. Any words of encouragement or empathy are appreciated. Advice is good too!\n\n**EDIT:** Thank you all so much! I'm trying to be more positive and thinking of it as excitement rather than anxiety! Your advice gave me a lot of perspective, which I desperately needed :)  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Ugh, this is the worst...",
            "url": "http://www.reddit.com/r/Anxiety/comments/nyyrz/ugh_this_is_the_worst/"
        },
        {
            "author": "anxiouswife",
            "author_created_utc": 1315177138,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5si70",
            "created_utc": 1325916935,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o6hi8/i_need_advice_for_telling_my_wife_its_time_for/",
            "id": "o6hi8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o6hi8/i_need_advice_for_telling_my_wife_its_time_for/",
            "score": 8,
            "selftext": "Hi. My wife has GAD and has tried the non-medication route for about 2 years(6 months of actually being diagnosed). We have had an incredibly difficult time making any kind of progress, and her dr and therapist both think that medication may help break a downward spiral. \n\nShe has also asked me to be honest with her and let her know if I think she needs to start medication. \n\nSo I had planned a kind of intervention for tomorrow, basically wrote her a letter with my reasoning, and was planning on reading it to her. It says it's my opinion, but ultimately her decision. \n\nHowever, she has gotten a bad cold. Should I wait until she feels better? My concern is that between anxiety related physical symptoms, and cold season, that may not be for a long time. \n\nAlso, I have really psyched myself up for this, as I know it is going to be difficult. \n\nShould I go ahead, or wait for a more ideal time?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need advice for telling my wife it's time for meds",
            "url": "http://www.reddit.com/r/Anxiety/comments/o6hi8/i_need_advice_for_telling_my_wife_its_time_for/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325462095,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nz397/recently_diagnosed_with_avoidant_personality/",
            "id": "nz397",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nz397/recently_diagnosed_with_avoidant_personality/",
            "score": 8,
            "selftext": "i have a vague understanding of what it is. i can't afford meds or therapy, and i would appreciate any words of wisdom.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "recently diagnosed with avoidant personality disorder. help/advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/nz397/recently_diagnosed_with_avoidant_personality/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325431542,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nylxg/just_started_effexor_xr_and_looking_for/",
            "id": "nylxg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nylxg/just_started_effexor_xr_and_looking_for/",
            "score": 8,
            "selftext": "Last night I took my second Effexor XR.  I was reluctant to start on medication because I really want to try to use coping strategies to deal with my anxiety like exercising and eating healthy, focusing on positive thought processes, etc.  At any rate, I went to my doctor (PCP) to talk to him about what I've been trying to do and the frequent worrying and freaking out moments.  \n\nThe trigger seems to be a job that I'm stuck in--teaching high school--that I can't stand, but am committed to until mid-May.  I have a job interview scheduled for this Friday that has also added to the anxiety.  It is irritating because I know that some of what I'm worrying about is ridiculously irrational, but I can't stop it.  \n\nSo, that gets me to the Effexor XR.  My doctor has me taking 37.5mg for four days and then moving up to 75mg.  I go back in two weeks to meet with him. It is basically to help me get through the next 5 months of teaching. I took my second 37.5mg last night and this morning I woke up panicked and couldn't fall asleep.  I think my heart is beating a little faster than normal too.  When I am up and about, I feel a fuzziness--kinda hard to describe.  I'm slightly tired and just sort of--blah.  \n\nAt this point, I'm not sure what is the medication and what is the anxiety morphing into depression (typically the cycle for me).  Has anyone taken Effexor XR before?  Do these feelings go away if I stick with it or is it something I need to just deal with and it will be worth it?  I do know that getting off of the Effexor is basically hell, too.  \n\nTL;DR I just started taking Effexor XR to help me deal with job related anxiety, does it take a while to actually adjust to it or is this something that I need to figure out how to deal with if I'm going to stay on it?    ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Just started Effexor XR and looking for advice/experiences.",
            "url": "http://www.reddit.com/r/Anxiety/comments/nylxg/just_started_effexor_xr_and_looking_for/"
        },
        {
            "author": "mdelow",
            "author_created_utc": 1307551999,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety",
            "author_fullname": "t2_5cjb0",
            "created_utc": 1325520346,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nzuw9/having_a_huge_anxiety_attack/",
            "id": "nzuw9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nzuw9/having_a_huge_anxiety_attack/",
            "score": 8,
            "selftext": "I've been home for the last two weeks - like home visiting my parents, I'm in my last year of university and go to uni about an hour away from my hometown.  In a few hours I'm moving back to my student house and I'm just having a huge anxiety attack about going back.  This week is a relatively slow week, as its the first week of school, and one of my triggers for anxiety is lots of spare time.  I also get anxiety during changes (like moving from here to there), and from being isolated/or just feeling isolated.  My SO who I live with is working this term full time, so he will be gone all day during the week, which normally is no big deal, but going back in to this term I am just having huge anxiety attacks and I can't calm myself down.\n\nI'm on pristiq and wellbutrin, and I have ativan for emergency use but I try to avoid using it. \n\nI physically do not want to go back now, and I'm scared to.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Having a huge anxiety attack",
            "url": "http://www.reddit.com/r/Anxiety/comments/nzuw9/having_a_huge_anxiety_attack/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325839429,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o5853/the_thing_that_makes_me_most_anxious_is_the/",
            "id": "o5853",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o5853/the_thing_that_makes_me_most_anxious_is_the/",
            "score": 7,
            "selftext": "I don't necessarily think I have the worst anxiety in the world, but it is beginning to negatively affect most aspects of my life and I need to make a change. \n\nI struggle with some depression. I think I can attribute this mostly to body-image issues. I have been over weight since early elementary school. This was not a problem, as I was physically active and a multiple sport athlete. Now that I'm in college and not participating in athletics, I have gained weight, and my overall body image is not only making me depressed, but also socially awkward. \n\nI also have a humiliating habit of biting my nails. I bite until they bleed, and I want nothing more than to stop. \n\nI want to seek help from a therapist, but the thing that makes me most anxious is the thought of seeing one... I'm not really sure how to over come this.\n\nI normally am not like this-- I think I'm having a bad night...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "The thing that makes me most anxious is the thought of seeing a therapist and fixing my problems...",
            "url": "http://www.reddit.com/r/Anxiety/comments/o5853/the_thing_that_makes_me_most_anxious_is_the/"
        },
        {
            "author": "zap-actionsdower",
            "author_created_utc": 1298360373,
            "author_flair_css_class": "",
            "author_flair_text": "I Brake For Amygdalas",
            "author_fullname": "t2_4vj72",
            "created_utc": 1325834098,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o55u6/nervous_about_giving_up_cigarettes/",
            "id": "o55u6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o55u6/nervous_about_giving_up_cigarettes/",
            "score": 7,
            "selftext": "Hey guys. I'm 21, been smoking for about 5 and a half or 6 years. Lately I've noticed that I've been coughing a lot, it's harder for me to breathe normally, and I don't really get any pleasure out of it anymore. I just finished what will hopefully be my last cigarette, but I'm really nervous about the whole withdrawal process. I've tried to quit before, and usually end up getting really anxious/panicky around the 12 hour mark which then has always led to me giving in and buying another pack. \n\nAnyone in the same boat with words of advice/commiseration?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Nervous about giving up cigarettes.",
            "url": "http://www.reddit.com/r/Anxiety/comments/o55u6/nervous_about_giving_up_cigarettes/"
        },
        {
            "author": "inequity",
            "author_created_utc": 1313789701,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5p3o5",
            "created_utc": 1325502959,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nzorh/constant_fear_of_being_murdered/",
            "id": "nzorh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nzorh/constant_fear_of_being_murdered/",
            "score": 6,
            "selftext": "So I'll try to make this brief. I know that all of the following is irrational/insane, but when I'm alone at night I can't subconsciously convince myself otherwise.\n\nBasically, I am constantly convinced that my neighbor is preparing or on his way to come down the stairs and kill me. However, this fear is **not specific to my neighbor**. It's been like this in several apartments with different neighbors, and I feel like this way when I'm safe inside of my parents house.\n\nI stay up all night listening to noises coming from his apartment. I convince myself that the dragging noises I'm hearing are bodies being dragged around, and every click is a gun being loaded. Every night. \n\nA lot of nights I will pace back and forth through my apartment holding a knife or bat and high powered flashlight. I often have to go for drives, sometimes 3-4 per night for like 45 minutes each. Sometimes I sit in my car and watch my neighbor's windows, and the lights are always on. (They are actually always on, the guy never sleeps but still I shouldn't feel like this)\n\nI hate the idea of being asleep because the second is asleep is the second I'm not safe.\n\nI can't sleep until the sun rises generally, and feel totally helpless at night because everybody else in the area is asleep. I am a 22 year old, 230lb, 6'3\" guy and don't know why I always feel like this.\n\nI also am a (sober) alcoholic and can't really take benzos because I generally take too many and black out on them. \n\nI don't know what to do and don't have any tools to help myself get through these nights, and it's really starting to fuck me up. Has anybody ever felt like this, or know what I can start doing to move past this? I feel completely fucking insane.\n\nThanks for any help. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Constant fear of being murdered",
            "url": "http://www.reddit.com/r/Anxiety/comments/nzorh/constant_fear_of_being_murdered/"
        },
        {
            "author": "purplesituation",
            "author_created_utc": 1311786485,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5kr77",
            "created_utc": 1325881593,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o5u9e/need_help_with_boyfriends_weight_anxiety/",
            "id": "o5u9e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o5u9e/need_help_with_boyfriends_weight_anxiety/",
            "score": 5,
            "selftext": "My boyfriend and I spent most of the last few months partying pretty hard. He has a history of anxiety in his family and has had success with focusing on weight/exercise, and with all this partying he gained some weight.\n\nNow he has nearly weekly freak outs about his weight, absolutely certain he is obese and disgusting but aware that is how he feels and not how other people see him. But he also gets convinced that I am only with him because I have to be and that there is no way I could want to have sex with him. He consistently freaks out at me about helping him work out because he lacks motivation to do it himself and that I need to help him do it. I cook us super healthy fresh vegetarian food and I support him not drinking and not eating crap, even giving up a lot of that myself so it's not in the house as a temptation.\n\nHere's the thing though, I have anxiety around feeling really guilty I don't like working out. I've had panic attacks in the past and I know exercise will help, but I get really anxious about working out. I like doing cardio in the house and would be really in to a yoga or dance class if I could afford it (it has worked in the past) but I don't have the scrilla. I want to help him, but I think that he needs to get over a lot of this anxiety before losing weight is actually going to help.\n\nHow do I help him without throwing myself in to the anxiety spiral? I have only tried to talk to him about this when he's text panicking and that's never helpful. I know we need to talk it out, but when he's calm he never wants to take it seriously.\n\nI don't know. Maybe this is just venting. But I hate feeling like I can't live up to what he needs and also hate being what he hangs all that on. How do I tell him that and stay supportive?\n\nTL:DR Boyfriend has anxiety around weight, I have anxiety around exercise. How do we help each other?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Need help with Boyfriend's weight anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/o5u9e/need_help_with_boyfriends_weight_anxiety/"
        },
        {
            "author": "sanmari55",
            "author_created_utc": 1325921000,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6lqvl",
            "created_utc": 1325921787,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o6jwj/i_think_i_have_a_serious_problem_yet_paralyzed/",
            "id": "o6jwj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o6jwj/i_think_i_have_a_serious_problem_yet_paralyzed/",
            "score": 5,
            "selftext": "To break it down, I have depression and generalized anxiety disorder. I'm supposed to take Klonopin, but I took too many at a time and my bottle has ran out. I'v been without it for like two weeks since I didn't want to go to the doctor way early to ask for another script. So like two weeks of twice as much as I need, two weeks of none. Not good.\n\nFor years one of my eyes has been blurry occasionally, I thought nothing of it. This year I got optic neuritis, which makes you blind in one eye. I was supposed to get an MRI, but didn't. Doctors didn't say it could be tumor, but more likely MS if anything.\n\nBut, my dad and grandfather both had tumors. I check online. Horrible, horrible mistake. Optic nerve problems? Yeppers. Flashing lights? Sometimes. Ringing in ears? Sometimes. Headaches...\n\nAll signs of brain tumor. So I'm convinced I have a brain tumor. If I get my mind off of it, I'm okay. But say I do hear the ringing. I get so scared. \n\nI drive my poor boyfriend nuts talking about how I'm going to die. He asks why not go to the doctor. So I say, you think I have it? I try to make him swear to me I don't have cancer or a tumor. It's an unrealistic demand. Nobody can tell me, I have to go to the doctor.\n\nI'm too scared to even say  the words to the doctor as if vocalizing it will solidify it. I tell myself I don't wanna know, I don't wanna know. I'm okay. I'm okay. I'm okay. Then seconds later BUT IF YOU'RE DYING DON'T YOU WANT TO CATCH IT EARLY. But what if it's not early and I've waited too long. My eye is so blurry now.\n\nSo I play these games in my head and torture myself. Just go to a doctor, right? \n\nI just need to vent because I had a panic attack tonight. I shook and my teeth chattered and I was talking like a crazy person.\n\nI just want to be healthy, and no I'm healthy. I just want someone to say it's okay! It's okay sanmari55, you're going to live a long and healthy life.\n\nA doctor could say that, or, you have 6 months to live.\n\nAnd I'm shaking and my jaws clattering and I have a headache (tumor) and everyone thinks I'm crazy.\n\nMaybe the tumor is making me ultra crazy?\n\nAnd the panic continues and all I can do is type like crazy.\n\nTl;dr I was supposed to have an MRI, and have factual information that I might have a tumor. But I'm too afraid to see a doctor.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think I have a serious problem, yet paralyzed with fear...",
            "url": "http://www.reddit.com/r/Anxiety/comments/o6jwj/i_think_i_have_a_serious_problem_yet_paralyzed/"
        },
        {
            "author": "LangeJames",
            "author_created_utc": 1324426280,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6hbvi",
            "created_utc": 1325607864,
            "domain": "gettingoverthecrazies.blogspot.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o17mt/anxiety_antics_a_look_inside_my_personal_battle/",
            "id": "o17mt",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o17mt/anxiety_antics_a_look_inside_my_personal_battle/",
            "score": 5,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/-CpNHDfOs-xS3zcF.jpg",
            "title": "Anxiety Antics - A look inside my personal battle with anxiety &amp; panic disorder.",
            "url": "http://gettingoverthecrazies.blogspot.com/2012/01/blame-game.html"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325659536,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o27yk/been_having_anxiety_attacks_for_the_past_few/",
            "id": "o27yk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o27yk/been_having_anxiety_attacks_for_the_past_few/",
            "score": 5,
            "selftext": "Most likely due to stress, I have been having a few anxiety attacks where I flip my shit. I wanted to know this though: can you get physical side effects from them besides the initial deal?\n\n I have been having short little pains across my whole body for a few days now, they usually only occur when I begin to remember them. When I don't think about them or anything like that things stay p.retty normal. They aren't really painful but still annoying nonetheless.\n\nThanks for any help in advace.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Been having anxiety attacks for the past few weeks, advice/help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/o27yk/been_having_anxiety_attacks_for_the_past_few/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1325748229,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/o3p63/what_type_of_jobs_does_everyone_have/",
            "id": "o3p63",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/o3p63/what_type_of_jobs_does_everyone_have/",
            "score": 5,
            "selftext": "Just wondering what type of job everyone has, in college no clue what type of profession would be good for someone with anxiety. Although I do need to tackle the whole anxiety over college / life in general first but whatever. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "What type of jobs does everyone have ?",
            "url": "http://www.reddit.com/r/Anxiety/comments/o3p63/what_type_of_jobs_does_everyone_have/"
        }
    ]
}