{
    "data": [
        {
            "author": "mitzuko",
            "author_created_utc": 1304634946,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5747d",
            "created_utc": 1327338562,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ot21k/i_know_its_not_that_easy_but_think_about_it/",
            "id": "ot21k",
            "is_self": false,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ot21k/i_know_its_not_that_easy_but_think_about_it/",
            "score": 114,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/DFlyy9v-W7xazGOd.jpg",
            "title": "I know its not that easy but think about it.",
            "url": "http://i.imgur.com/iJC6U.png"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327251053,
            "domain": "28.media.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/orker/stay_positive_everyone_you_will_get_through_this/",
            "id": "orker",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/orker/stay_positive_everyone_you_will_get_through_this/",
            "score": 50,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/EilgCK3Y1YVm6Ysp.jpg",
            "title": "Stay Positive Everyone, YOU WILL GET THROUGH THIS.",
            "url": "http://28.media.tumblr.com/tumblr_ly6ufaAnjq1r0mbpqo1_500.jpg"
        },
        {
            "author": "aneusoit",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327494125,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ovyyj/anxiety_worse_in_the_morning/",
            "id": "ovyyj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ovyyj/anxiety_worse_in_the_morning/",
            "score": 25,
            "selftext": "When I wake up in the morning, I usually feel pretty peaceful, but then my brain's like \"Wasn't there something on my mind yesterday?\" and then I'm flooded from ALL my thoughts of depression and anxiety. This first sudden burst of junk re-entering my head gives me even MORE anxiety, and so mornings and the whole morning process really sucks for me.\n\ncan anyone relate?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety worse in the Morning?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ovyyj/anxiety_worse_in_the_morning/"
        },
        {
            "author": "panicmonkey",
            "author_created_utc": 1317661190,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5z1rk",
            "created_utc": 1327431575,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/oust3/drug_hysteria_garbage/",
            "id": "oust3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/oust3/drug_hysteria_garbage/",
            "score": 17,
            "selftext": "Mass antidepressant hysteria.  There's a lot of it here.  Why is that?  Let's take a look at the hysteria and what causes it and why I have such disdain for those who perpetuate it.\n\nWhen I was young, I went to my dad and told him something int he house was broken, I don't remember what.  He responded by saying \"why doesn't anyone come tell me 'hey, the dishwasher is working great'?\"  Obviously, if the dishwasher is working as expected there's no reason to report on it.  Just load it up and hit start.  Get on with your life.\n\nThe situation didn't do anything for me at the time but it stuck with me.  And I'm glad it did, because it comes up often in critical thinking.\n\nIf you Google your drugs, you'll notice a lot of people with problems taking the drug your doctor just prescribed you.  The people who post that stuff are generally the *people who have had problems*.  Count how many there are.  There seems to be a lot.  Now research how many people take the drugs.  Do some math.  Now count how many people report good things.  Do some more math.  Something doesn't seem right, does it?\n\nBecause those who have enjoyed the benefits of the drug they are taking, they are out enjoying the benefits of their medications, and living life possibly free of their symptoms.  They have better things to do than to go post on forums!  They represent what you might be trying to accomplish.  This is simple logic.\n\nYet people grab on to these bad posts and run with them, propagating the hysteria everywhere they see an opportunity.  And that's sad because these bad posts are causing a lot of fear of these drugs.  On nearly every post about Effexor, for instance, you'll find someone who is now afraid to take the med their doctor prescribed because of the hysterical posts by non-doctors.\n\nNow, I'm all for being cautious.  But I have also seen meds save people's quality of life, their way of life, *their life*.  I've had it happen first hand, and I've seen it over and over again.  Data supports this relief people feel using SSRIs and SNRIs.  Do a little digging before giving up on what your doctor told you to do.  And if you still have concerns DON'T POST HERE, GET A SECOND OPINION FROM A PSYCH DOC!  There are only a few docs here, and if they are reputable, they will not diagnose you or advise you here and will recommend seeing a doctor.\n\nOne of the big hysterias that came up recently is that withdrawing from SSRIs and SNRIs quickly or cold turkey is monumentally a bad thing and VERY DANGEROUS!  I have a goal now to show that there are no absolutes.  If your doctor says it's ok, trust them.  If you don't trust them, get a second opinion.  If you're still not satisfied, look at peer-reviewed studies on the subject, and NOT anecdotal information (even mine) posts on forums (even mine) or sites that have a vendetta against big pharma (even mi...wait, I don't have one of those).\n\nJust don't get afraid.  Especially by posts from non-doctors.  And if someone says they are a medical professional, always seek credentials.  Consider the source.  Find out who is saying what is being said.  Doubt, but ultimately decide based on solid information.  \n\nThe drug you wind up taking, even temporarily, may put you back in touch with what it feels like to have a life.  You may have to try a few different meds, but if meds are indicated, make informed decisions about what you are trying. Don't believe the hype.\n\nIf you decide to go the natural route first, good on you!  You might find that your anxiety is something completely manageable through good diet, exercise, meditation, yoga, or spirituality.  Or you might find non-drug approaches like CBT, ACT, or DBT work just fine for you without any drugs at al.  If that's the case, awesome!  I envy you.\n\nBut if all that fails, remember that *you* haven't failed, that there may be medical reasons for your anxiety and depression, and that it's not your fault.\n\nMore often than not, if you and your doctor have decided that meds are the way to go or at least try, you're going to need to try multiple different meds to see what helps with the fewest side effects.  For example, while most people can tolerate Zoloft, it gave me eye twitches that interfered with my ability to work.\n\nI'll continue that example.  Because I need to work, it became necessary to stop Zoloft ASAP.  The eye twitching wasn't dangerous, but it indicated a quick withdrawal because a guy's gotta make a living.\n\nOther times, the side effects of a drug may get into more serious territory.  For instance, I personally know people for whom Effexor worked just fine, but for me it caused side effects that were disturbing, but also indicated there may be medical reasons to get off of it quickly.  Nothing life-threatening, but some possible digestive and sexual dysfunction problems (and I don't mean not being able to get it up, check out \"retrograde ejaculation\").  Plus the med just wasn't doing what it needed to do for me.\n\nStill other times, if your doc feels you can handle it, he may want you to move on to the next drug quickly, because why drag it out?  I work for myself and can take a few days off whenever I want, so this is no problem.  My doctor knows that.  And he knows I've been on the med-go-round for a while now and can handle the abrupt withdrawal.\n\nWhatever the reason, if your doc says \"get off now, today\" or you just can't take the side effects of a particular drug anymore and your doc says it's ok, I want to give a first-hand account that with a doctor's ok and with monitoring, going cold turkey IS NOT MONUMENTALLY DANGEROUS.  It's ok in a lot of cases, and it's not in others.  That's why you check with doc first.  But don't believe this hype that getting off of SSRIs and SNRIs quickly or even cold turkey is going to kill you no matter what.  Again, consider the sources of this information.\n\nThe things I've talked about here, the bad posts, the alarmist attitudes towards things your doctor wants you to try, the absolutist beliefs that it's ALWAYS dangerous to get off SSRIs and SNRis cold turkey only add to the hysteria that these are horrible drugs and have no value or benefit whatsoever.  These drugs have their place.  I've seen them work to great success in my own family and friends.  And I've seen people continue to suffer because they believed the stuff they read on the Internet that said their drug was horrible.  Which road you choose, which information you choose to believe is between you and your doctors.  Trust them, get second opinions if you don't trust yours, read peer-reviewed articles, do whatever it takes to make an informed decision.  Don't go by my anecdotal information, find out for yourself.  And certainly don't believe the drug-bashing hype.  You may be cheating yourself out of a better life.\n\nDISCLAIMER:  Always check with your doctor.  I can't say this enough.\n\nYour mileage may vary.  Void where prohibited by law.  No purchase necessary.  Dramatization.  Actual results may vary.  May cause infertility, bowel obstructions, visual disturbances, dry mouth, restless penis syndrome, fear of farm animals and in rare cases, a complete inability to understand humor or to think critically.\n\nAnd no, I don't work for the drug industry.  I create websites for a living.  I am a socialist who believes the profiting off of the sick is disgusting, vile and beneath any civilized society.  Capitalism mostly sucks.  Sometimes.  A lot.  Not always.  But a lot.  Get the money out of congress and campaigning  and it solves these problems.  But I digress.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Drug Hysteria Garbage",
            "url": "http://www.reddit.com/r/Anxiety/comments/oust3/drug_hysteria_garbage/"
        },
        {
            "author": "dumcat",
            "author_created_utc": 1327216113,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6q28y",
            "created_utc": 1327219849,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/or9tc/im_going_insane/",
            "id": "or9tc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/or9tc/im_going_insane/",
            "score": 16,
            "selftext": "I'm a 24 year old female and I think I have a problem.  I don't know what I want from posting this, I just want to type it out and let it out. \n\n6 years ago, I started university and hoped to become a teacher.  I liked leading and teaching, and thought I would be able to face my fear of public speaking.  In one class, we were put into groups for a project and had to do a presentation.  Weeks before the presentation I started feeling uneasy.  I couldn't eat or sleep and couldn't stop thinking about the presentation.  Presentation day finally came, and it was my turn to speak.  My mouth was so dry and my voice was so small that the professor told me to speak up.  I stopped and began again but I jumbled my words up.  I froze there, standing in front of the entire classroom and I couldn't move.  I couldn't move or speak.  It was the scariest moment of my life.  I felt like I was standing there forever, and it wasn't until people from my group helped me back to my seat and they finished my part of the presentation.  I sat at my table and cried.  I couldn't stop shaking.  Every day after that presentation, I thought about how much I hated myself.  Whenever I took a shower, I just stood there thinking about how great it would be to just get hit by a bus.  I was incredibly depressed.  I stopped showing up to class and dropped out of that university.\n\nSince that presentation, I've avoided many situations that would make me feel uncomfortable.  Since starting university, my high school friends made new friends.  I've stopped seeing them because I felt too uncomfortable around them.  I work part time in an office and I'll call in sick to work every time we had a scheduled meeting, or if we had some office lunch party.  I'd do anything it took to avoid being in uncomfortable situations.\n\nI switched schools and attended a new university with a different career path.  I researched different jobs on google, trying to find one with the least amount of interaction with people.  During the first day of any class, I'd look through the syllabus to see if there were any presentations or group work.  If there was, then I'd drop out of that class and find something else.  If I was forced to take the class, then I'd skip out on the presentation and lose 10% of my final grade.  I've been avoiding presentations since that first terrible presentation.\n\nI'm in a critical thinking class, where we do group discussions every day.  Sometimes the professor picks us out and asks us questions on what we think about articles we're assigned to read.  This class is killing me and every time she picks out random people to speak, I die in my seat.  She's picked me once, and I really thought I was going to die.  I sit in the corner at the back and when she asked me, I answered quickly and quietly and then sat there tearing up and shaking.  I really hope nobody saw me.\n\nIn this critical thinking class, we're assigned to do a presentation.  I e-mailed the professor to tell her in advanced that I would not be doing the final presentation.  She e-mailed back and told me it was required.  I need to take this class in order to graduate.  The upcoming presentation is not for another 3 months and I've been stressing out about it for the last 2 weeks.  I can't eat properly and can't sleep.  I have a terrible, terrible, dreadful feeling in my chest.  I was so close to finishing university without having to do a presentation.  I can't quit and start over again.  I can't stop thinking about it.  \n\nI don't know where I\"m going with any of this.  It took me almost 2 hours typing all this out.  I'm sorry it's so long.  I don't know what I want from this.  Thanks for reading and listening.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm going insane.",
            "url": "http://www.reddit.com/r/Anxiety/comments/or9tc/im_going_insane/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327443034,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ov2mr/osp_obsessive_skin_picking/",
            "id": "ov2mr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ov2mr/osp_obsessive_skin_picking/",
            "score": 16,
            "selftext": "I recently found out and realized I have OSP Obsessive Skin Picking. \nIt is very annoying.\nI have pimples on my face so I pick and pop them. \nTherefore, they turn into scabs…\nI then feel bumps on my face then automatically want to scratch or peel off the scab so there's no but…\nThen I am picking at my face.\nI have bad Anxiety.\nI constantly touch and pick at my face.\nI try to put makeup on to cover them up from the redness.\nThen I just have this big urge to pick at my face still.\nI try to stop but it is hard.\n\nAre there any suggestions on how to help?\nI do it without noticing.\nI do it anytime.\n\nJust telling my self to stop does not work. \n\n\"/\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "OSP: Obsessive Skin Picking",
            "url": "http://www.reddit.com/r/Anxiety/comments/ov2mr/osp_obsessive_skin_picking/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327391601,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ou85q/dae_have_extremely_issues_with_emotional_intimacy/",
            "id": "ou85q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ou85q/dae_have_extremely_issues_with_emotional_intimacy/",
            "score": 16,
            "selftext": "Shit. Typo in the title. Sorry.\n\nI'm 17, and I used to be very good at caring for others. 4 or 5 years ago, it just stopped. I don't feel very connected to others, and I have a hard attaching to 'friends'. To be really blunt: I don't give a shit about others, and it's really lonely. I think it's mostly because of my social anxiety. I reflexively cringe when hugged, and I feel uncomfortable when friends or family say \"I love you.\" (I haven't hugged my mom in about 4 years.)\n\nI think this is because of some combination of a lot of issues I have. (There's mild Autism, Bipolar Disorder, Social Anxiety, Eating Disorder) I'm working with a therapist to work through these, but in the meantime, is there like a step-by-step process to learn how to connect with other people again? Life just feels completely empty with no one to share it with.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "DAE have extremely issues with emotional intimacy and attachment?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ou85q/dae_have_extremely_issues_with_emotional_intimacy/"
        },
        {
            "author": "abcd_z",
            "author_created_utc": 1315631740,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5tww6",
            "created_utc": 1327372380,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/otuev/overcoming_anxiety_the_rpg/",
            "id": "otuev",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/otuev/overcoming_anxiety_the_rpg/",
            "score": 14,
            "selftext": "I was reading an article in Popular Science about \"gamifying\" your life and realized I could use that concept to help me overcome debilitating panic attacks that have been crippling my life for a while.  Cognitive Therapy hasn't made a dent in it, and Behavioral Therapy helped but I couldn't keep the motivation up.  Logging my behavior and creating a reward system seems halfway to a game anyways, so this has a good chance of working.  \n  \nSteps:  \n  \nIdentify goal  \n  \nSplit goal into sub-goals.  \n  \nIdentify smallest possible action that you can do to accomplish the first sub-goal.  \n  \nAccomplish the small action, roll 1d6 for karma gained.  \n  \nIf doing the action accomplished the sub-goal, add a bonus to your karma (2d6 times 2).  If you completed the goal, add a large bonus (3d6 times 5).  \n\nNote that if you did a larger amount than you expected, you can always reward yourself with more karma (roll an extra die and/or multiply the result by a number).  \n  \nExample Goal:  \nGetting a job  \n  \nSub-goals:  \nCreate resume  \nFill out application  \nTurn in application  \nGo to interview  \n  \nRemember: actions must at all times be doable.  Even if it seems ridiculously small, it's better to get a tiny amount done than nothing at all, and it's almost as easy.  \n  \nYou need to have a 6-sided die so you can roll for karma, as well as something to keep track of your current karma.  I'm going to use my cell phone for this: it has a Drafts folder, so I'll just save the current value as an un-sent text message.  You don't have to use a cell phone, so long as you keep the record on or near you as often as possible and can easily update it.  A notebook or scrap of paper with a pen or pencil would also work fine for this.  \n  \nIf there's enough interest I'll let you guys know how well it works.  \n  \nEDIT: You don't have to use the \"roll for karma\" system here.  An alternative is to create a list of rewards for yourself that are small and easy to get, make a point list, and buy the rewards when you get enough points.  \n  \nAlternately, you could just reward yourself whenever you achieve a small action.  \n  \nIn these versions no rolling is needed, just a flat reward for achieving the small actions.  Of course, if you prefer to roll you can still do that in addition to the point-buy list.  \n  \nI created the rolling system because the rewards I came up with weren't motivating me, and I noticed that reddit karma is an effective motivator.  It seemed like a natural combination, though I understand that some people do better with more concrete rewards.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Overcoming Anxiety: The RPG",
            "url": "http://www.reddit.com/r/Anxiety/comments/otuev/overcoming_anxiety_the_rpg/"
        },
        {
            "author": "zolpidamn",
            "author_created_utc": 1314423680,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qjy1",
            "created_utc": 1327703998,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ozr45/being_hypnotized_tomorrow_what_should_i_expectknow/",
            "id": "ozr45",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ozr45/being_hypnotized_tomorrow_what_should_i_expectknow/",
            "score": 13,
            "selftext": "Being hypnotized by my therapist as a treatment for anxiety.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Being hypnotized tomorrow, what should I expect/know?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ozr45/being_hypnotized_tomorrow_what_should_i_expectknow/"
        },
        {
            "author": "Ravenwald",
            "author_created_utc": 1320524320,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_66qvt",
            "created_utc": 1327606446,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/oxz4u/im_afraid_of_my_own_friends_despite_their_support/",
            "id": "oxz4u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/oxz4u/im_afraid_of_my_own_friends_despite_their_support/",
            "score": 12,
            "selftext": "So I'm not sure what to say other than when I'm invited to hang around with my friends (and these are long-time friends) I find myself having massive anxiety both before meeting them and while with them. I'm a Social Anxiety Disorder sufferer, but it usually only peaks when I'm around strangers.\n\nI've become incredibly good at hiding my fear, but the truth is I can't eat, can't think properly, and most of the time lose sleep over this kind of thing. I just thought I'd share and ask if anyone else is afraid of their friends? : \\",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm afraid of my own friends, despite their support.",
            "url": "http://www.reddit.com/r/Anxiety/comments/oxz4u/im_afraid_of_my_own_friends_despite_their_support/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327523901,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/owis8/anxiety_depression_panic_attacks_any_advice_xpost/",
            "id": "owis8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/owis8/anxiety_depression_panic_attacks_any_advice_xpost/",
            "score": 12,
            "selftext": "I've had phases in my life where I would feel \"down\", particularly stemming from days in the seventh grade. I would find a lot of my peers to be intimidating and feel anxious and depressed most days. This trickled a bit into high school but eventually subsided by my sophomore year. I must clarify that I had a happy childhood, though I I did deal with teasing and may have been more cynical than the other kids. But til this day, the manner in which I tend to socialize with people is still outgoing and lighthearted.\n\nOnce I entered college, I had what sometimes felt like depression, but seemed more on a surface level. In my first two years of college, I had dealt with two painful breakups and was feeling more and more anxious about college and my future. I am also disabled with a vision impairment. This greatly affects my self-esteem and an added pressure from myself to be as independent as possible. During this, I was mostly indifferent, living my life and going through the motions. Had insomnia and stayed in bed many days. Was very unproductive but wasn't feeling much.\n\nIn the summer of 2010, I made a new friend who would eventually become my boyfriend. During the next summer, I suffered through severe depression for six months. Many times, I had no idea why I was feeling depressed and would feel even more upset for behaving the way that I did. I don't tend to think that I take things for granted, which is why it upset me that though my life isn't SO terrible, I was still wallowing. But the feeling was always stuck there. Small situations would flip a switch and my mind would be filled with so much negativity and insecurities, I would shut down. Whenever I'd be alone in my apartment, I would cry uncontrollably and have panic attacks. This also came with a lot of suicidal thoughts and the desire to harm myself. My behavior caused a lot of strain on my relationship, which would have been going wonderfully if not for my depression. So I started seeing a therapist. The thing is that before I started seeing her, I had already begun trying to take steps to make myself happier. Not long after that, I got a job that I loved, which made me feel tremendously better about my life. Things started to improve with my boyfriend and I felt as if I was at a wonderful place in my life. I stopped seeing the therapist and things continued to go well. I felt a lot more positive about things. Even looking back at journal entries, I was so genuinely happy.\n\nFast forward to this month: My boyfriend and I have gone on an indefinite break due to recent communication issues. I believe these issues also stem from my anxiety and my inability to function the moment that there may be any conflict. In addition to this, my job no longer needs me to fill the position that they had for me and I'm trying to get my academic career together, though I am quite behind schedule. I'm trying so hard to keep my mind focused on the positive, trying to be proactive in changing my situation, but can't help but feel discouraged in the process of it all.\n\nI've really been feeling overwhelmed lately and I think all the pressure that I've been putting on myself is wearing down on me. Worrying about my relationship (a lot), waiting for job app responses while I continue to apply, hoping to win the \"lottery\" to get into the only math class available... I hate this feeling of being stagnant, and though I'm trying to change the situation, it doesn't seem like I can do much more about it but stick it out.\n\nAnother thing is that I am NOT always feeling depressed. I can still function throughout the day. There are just moments that it will hit me like a ton of bricks and all the progress I have made in the past seems to cease to exist. But there are some days where it feels all consuming.\n\nTonight, I've begun having chest pains for the first time, one in particular which sent me into a panic attack. I think I'm going to go to a doctor tomorrow to see if it is something attributed to the anxiety. I just hate this familiar feeling of pure misery coming back. I really, really, really do not want to fall back into that six month depression.\n\n**TL;DR I've been dealing with a lot of depression, anxiety and panic attacks on and off.**\n\n1) I'm starting to feel like this is embedded into me and that I am never going to be able to permanently shake feeling depressed or anxious. What's more discouraging is that people close to me have expressed the same sentiments—that I'm a negative, pessimistic, disgruntled person who will never see the good and positive sides of life. I'm trying to show them that that's not who I am nor who I want to be by keeping my head up, but it doesn't change how I feel on the inside. I want to be genuinely happy within myself... but is this just engrained in who I am?\n\n2) How can I prevent panic attacks? They happen so quickly and I just feel myself losing control bit by bit until I'm just on the ground hyperventilating.\n\n3) How can I communicate with my boyfriend figure about these types of issues without him thinking that I'm a nut, a Debbie-downer or making him feel overwhelmed with my problems? I know he cares about me and wants me to come to him and open up, but when I try to, I don't feel I get much in return. I want to look to him for comfort but I don't feel that he can or knows how to provide it.\n\n4) Any other suggestions for me? All I want is just to be happy and healthy and to be able to spread good energy to the people around me.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety, depression, panic attacks. Any advice? [x-post from r/depression due to lack of response. :|]",
            "url": "http://www.reddit.com/r/Anxiety/comments/owis8/anxiety_depression_panic_attacks_any_advice_xpost/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327617746,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/oy8t2/im_beating_anxiety_but_some_things_wont_disappear/",
            "id": "oy8t2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/oy8t2/im_beating_anxiety_but_some_things_wont_disappear/",
            "score": 10,
            "selftext": "Edit: Thank you.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm beating anxiety, but some things won't disappear.",
            "url": "http://www.reddit.com/r/Anxiety/comments/oy8t2/im_beating_anxiety_but_some_things_wont_disappear/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327547790,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ox2cw/anxiety_is_affecting_my_work_im_at_the_last_straw/",
            "id": "ox2cw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ox2cw/anxiety_is_affecting_my_work_im_at_the_last_straw/",
            "score": 10,
            "selftext": "Even though I don't like my job, and have been looking for new work, I've been trying not to seem checked out, looking for new ways to keep my interest (being more proactive about certain aspects that I do like). \n\nI've been dealing with a trauma that happened over a year ago. In the past 6 months, I've been exhibiting extreme anxiety and it's affecting my work. I have a counselor, but the PTSD is getting worse because my work performance has been getting worse. It's been affecting my non-work life, but I thought that work wasn't affected. In the past two weeks, I've caught myself noticing that is definitely affecting my work.\n\nI've been written up twice and if I get written up again I'll be 'considered for termination'. On the paper work it says that I don't pay attention to detail and lack communication. I do pay attention, but as my anxiety gets worse, particularly around people, I find it harder to handle the situation (my hands shake, I can't look people in the eye, I'm forgetting information). There are triggers everywhere.\n\nStupidly, it has just now occurred to me it is my anxiety that's interfering and not my disinterest for my job. I'm reaching that point where I'm a bit scared to go to work. Not the people I work with, but the clients who come in and what I will mess up on this time. It's a grab bag, and the last time I had a client who really triggered me, I miscounted some money and was *considerably* off the total (in the hundreds). I got written up for that, obviously. It is also possible he could have taken some of it back when I wasn't looking, but I was in a haze of anxiety, I can't remember. \n\nI guess my question is....would it be too late for me to get a doctor's note or something explaining that I have PTSD and it's affecting my work performance? If I sat down with my boss and explained it, will it seem like I'm making up excuses? The trauma itself is extremely personal, I don't know how well it'd go over to tell her. She seems kind of done with me, I don't know how much longer I have left there. Jobs are currently hard to come by as well, so I'm not having much luck when it comes to submitting resumes.\n\nThanks so much in advanced!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety is affecting my work - I'm at the last straw or else I will be fired. Need help! ",
            "url": "http://www.reddit.com/r/Anxiety/comments/ox2cw/anxiety_is_affecting_my_work_im_at_the_last_straw/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327729639,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p07gu/one_moment_to_rant_please_even_if_you_dont_read/",
            "id": "p07gu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p07gu/one_moment_to_rant_please_even_if_you_dont_read/",
            "score": 9,
            "selftext": "I don't know if my meds are not working anymore or if I'm just going NUTS. I can't slow my thoughts down! I can feel heat just falling from me and like this pressure at the back of my head right where the spine connects. I'm having those \"bad thoughts\" again. I don't go out and befriend people. I'm such a horrible person the only people that can deal with me are my online friends in WoW and this feeling is starting to mess with my gaming. The feeling of I don't belong or no one wants me with them? I mean who the hell feels like that in a video game. UGH!\n\n/endrant",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "One moment to rant, please even if you don't read this",
            "url": "http://www.reddit.com/r/Anxiety/comments/p07gu/one_moment_to_rant_please_even_if_you_dont_read/"
        },
        {
            "author": "Thenakedknitter",
            "author_created_utc": 1309900637,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5h1he",
            "created_utc": 1327592616,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/oxnze/the_panic_attacks_are_back/",
            "id": "oxnze",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/oxnze/the_panic_attacks_are_back/",
            "score": 8,
            "selftext": "4 years ago I was diagnosed with panic disorder.  I was having strings of debilitating attacks that lasted for days.  I did not voluntarily leave my house for months.  Over the last two years I have been doing really well, coping, and getting out and doing the things I needed.  Nearly attack free, I had been suffering infrequent attacks.  \n    The attacks are back. I have been experiencing latent anxiety, and small attacks for the last few weeks, managing to keep them under wraps as much as I could. However; last night I was awoken with one, and now I am terrified.  The doctor weaned me off my meds about a year and a half ago.  I now live in a new city, and I don't really want to go back on medication.  I am in school full time, and can't afford to stay home and isolate myself. \n    Can anyone tell me how they deal with the night panics? I can't meditate, It makes me more anxious.  I end up focusing on the fact that I can stop thinking, and then panic.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The panic attacks are back.",
            "url": "http://www.reddit.com/r/Anxiety/comments/oxnze/the_panic_attacks_are_back/"
        },
        {
            "author": "mitzuko",
            "author_created_utc": 1304634946,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5747d",
            "created_utc": 1327273077,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/os00b/going_back_to_school_tomorrow_starting_with_gym/",
            "id": "os00b",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/os00b/going_back_to_school_tomorrow_starting_with_gym/",
            "score": 7,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/yJ7-0X3lz1N6bjky.jpg",
            "title": "Going back to school tomorrow. Starting with gym. No idea where the class is.",
            "url": "http://imgur.com/GXxqn"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327568217,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/oxeb3/physical_anxiety/",
            "id": "oxeb3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/oxeb3/physical_anxiety/",
            "score": 7,
            "selftext": "I have been coping with depression and anxiety for years. For awhile I have been dealing well with negative thoughts using CBT and making myself useful and doing things I find fulfilling. Negative storytelling and self-doubt is something I think of as in the past for now(or not as prominent). But recently I have been experiencing all of the physical symptoms without any emotional/mental triggers. For awhile I have had a hard time with eating/nausea, sleeping, sweaty palms and just generally calming down. Even after recently starting to exercise more often to try and get rid of tension, these physical problems are still present daily.\n\nDoes anyone else seem bogged down by this type of anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Physical Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/oxeb3/physical_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327370221,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/otslj/my_social_anxiety_has_finally_become_crippling/",
            "id": "otslj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/otslj/my_social_anxiety_has_finally_become_crippling/",
            "score": 7,
            "selftext": "Okay, so I'm a 25 (almost 26) year old law student. I've always had anxiety and problems dealing with people. As a kid, I never got along well with my peers (I consistently got cast as a freak for being \"too smart\" -- no exaggeration). I started exhibiting OCD in 4th grade, and was diagnosed several years later. I also have a long history of panic attacks, nightmares, and other anxiety-related issues. Also, a few months ago I was diagnosed with ADHD (after a few years of being misdiagnosed with bipolar disorder). \n\nIn any case, I never developed the skills that seem to be necessary for communicating with people around me. I don't have any friends and have never really had any close friends to speak of. I am in a committed relationship that I've been in since high school, and honestly, my boyfriend is pretty much responsible for the success there, what with being my total opposite (can talk about anything, befriends people with no effort, super self-confidence). \n\nI guess I've kept expecting things to get better when I get older or have more experience with people, but the exact opposite has happened. I can't even act normal anymore.\n\nLast week, I started a new semester at school. I already knew I wasn't good at being social here (I don't know anyone, never do events or anything) but now I stumble all over myself just trying to say hello or communicate basic information. It's like my brain just starts spitting out whatever words it can jam together and then laughs nervously to punctuate it.\n\nThis is really disconcerting for me; I've always been able to cover up my anxiety with being articulate and funny/quirky, but now I'm so nervous I can't even manage that. \n\nI plan on bringing this up with my psychiatrist the next time I go in, so any suggestions on how to best run that appointment would be appreciated, as would any other comments about this sort of thing. \n\n**TL;DR: Always been anxious, but now so much so that I can't even communicate basic sentences to other people.**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My Social Anxiety Has Finally Become Crippling",
            "url": "http://www.reddit.com/r/Anxiety/comments/otslj/my_social_anxiety_has_finally_become_crippling/"
        },
        {
            "author": "caffeinewhore",
            "author_created_utc": 1318744882,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_61vmi",
            "created_utc": 1327477837,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ovtd5/i_think_im_always_going_crazy/",
            "id": "ovtd5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ovtd5/i_think_im_always_going_crazy/",
            "score": 7,
            "selftext": "i have had diagnosed depression and anxiety disorder since 4th grade, and i know that thinking that i am going crazy is part of the anxiety, but does anyone know any tricks to helping relieve this worry?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think im always going crazy.. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/ovtd5/i_think_im_always_going_crazy/"
        },
        {
            "author": "LangeJames",
            "author_created_utc": 1324426280,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6hbvi",
            "created_utc": 1327243611,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/orgx8/i_need_a_selfhelp_book_desperately/",
            "id": "orgx8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/orgx8/i_need_a_selfhelp_book_desperately/",
            "score": 6,
            "selftext": "This is a cry for help. I want a self-help book, but I am so picky. Please help me find something good. Here are my requirements:\n\n*  I don't want a book full of cheesy quotes.\n*   I want the author to speak with some intelligence, not like a hockey mom.\n*  I don't want books with weirdo exercises like staring into a mirror repeating self-affirmations.\n*  I would like something that can offer some good philosophy, but not religion specific. I find a lot  of self help books are Christian oriented which I do not want.\n\nI am open to suggestions and would love to hear what books you have read that helped you in a big way.\n\nIf you need more background, to help you determine what kind of book would be good for me, I blog about my anxiety. http://gettingoverthecrazies.blogspot.com/",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need a self-help book desperately!",
            "url": "http://www.reddit.com/r/Anxiety/comments/orgx8/i_need_a_selfhelp_book_desperately/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327313094,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ospvb/im_woefully_lacking_in_social_skills_and_life/",
            "id": "ospvb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ospvb/im_woefully_lacking_in_social_skills_and_life/",
            "score": 6,
            "selftext": "I'm 26 years old, male, and I don't know how to get a job, a girlfriend or just friends in general. I was born with a lot of shortcomings, including a very low social intelligence. No diagnosis on that account, but there was suspicions about asperger syndrome. Today my only diagnoses are tentative PTSD and depression.\n\nI did not know how not to be an insufferable idiot until my late teens. I was friendly, but if I decided someone were my friend, I would text them incessantly until they told me to stop and distanced themselves from me. The world was an unfriendly and scary place, because I didn't understand why people would recoil at my forwardness, or why I got into fights. I dressed like a clown, and passers by would often laugh and point at me. \n\nMy social skills have improved vastly since then, but because of my limited experiences and my other weaknesses, like obsessiveness and generally reduced executive functioning, I'm now living in isolation, without any clue about how to change things. \n\nI want get a job, but I don't have an education and work experience. I don't know what kind of job I would be able to get, and how to go about getting it. I've never had anyone to talk to about this, and my parents never cared. \nI look normal today, have good personal hygiene and basic social skills, but I'm afraid I'd be turned down and laughed at. \n\nSeven years ago I experienced a trauma that has left me very 'jumpy' ever since. Any sudden noise or movement, and I react with very defensive body language, staring at whatever scared me. It only lasts for an instant, but by then everyone around me is giving me strange looks. \n\nI often have to explain that I'm not really scared, just jumpy. This will affect my relationship with potential colleagues as well, I just don't know how badly. \n\n\nI don't really know where I'm going with this. Maybe someone has some advice? I know my situation is pretty pathetic, and that I have myself to thank for it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm woefully lacking in social skills and 'life skills', suffering from PTSD with hypervigilance and extreme depression. I'm at the end of my rope. Any advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ospvb/im_woefully_lacking_in_social_skills_and_life/"
        },
        {
            "author": "xvegxheadx22",
            "author_created_utc": 1246330430,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3j3vv",
            "created_utc": 1327774244,
            "domain": "alternet.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/p0oby/embrace_you_selfdestructive_impulses_i_found_this/",
            "id": "p0oby",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/p0oby/embrace_you_selfdestructive_impulses_i_found_this/",
            "score": 6,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/PaeIUOi6_NNfB_e_.jpg",
            "title": "\"Embrace you Self-Destructive Impulses?\" I Found this helpful and thought others might also.",
            "url": "http://www.alternet.org/health/153438/embrace_your_self-destructive_impulses_how_people_can_connect_with_dark_parts_of_their_psyche_for_personal_change"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327461393,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ovi48/any_tips/",
            "id": "ovi48",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ovi48/any_tips/",
            "score": 6,
            "selftext": "Does anyone have any ways that may help get over anxiety about talking on the phone? I have to do it very often for my job and I keep hearing that just exposure will help but I make about 20-30 phone calls a week and my anxiety seems to be getting worse. I just need something I can do (besides meds) that will help when I start worrying...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Any tips?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ovi48/any_tips/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1327542814,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/owyc9/does_music_sound_different_to_anybody_when_theyre/",
            "id": "owyc9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/owyc9/does_music_sound_different_to_anybody_when_theyre/",
            "score": 6,
            "selftext": "When I'm anxious, music loses its pleasurable qualities and sounds different to me. \nI feel like I hear the music much more in the moment instead of hearing it as a continuous composition. I notice all the separate parts of the song separately, but all at once (kind of like when you're high for you stoners out there, but without sounding amazing) and can analyze so deeply that I lose the essential joy of the music. I feel like I hear the music ONLY for what it essentially is as *sounds* instead of *music*. It sounds so empty.\nAnd this happens with bands that I normally love. The Beatles start losing its enjoyability for god's sakes!\nBut luckily, once I get out of that anxious state, it starts sounding good to me again. \nJust wondering if other people experience the same thing.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does music sound different to anybody when they're in their anxious state?",
            "url": "http://www.reddit.com/r/Anxiety/comments/owyc9/does_music_sound_different_to_anybody_when_theyre/"
        },
        {
            "author": "brendanhi",
            "author_created_utc": 1313460790,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5oaoc",
            "created_utc": 1327429493,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/our3f/college_anxiety/",
            "id": "our3f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/our3f/college_anxiety/",
            "score": 6,
            "selftext": "Ok don't know if reddit can help but here it goes. This is my second semester living at college. I had a few bumps in the road with anxiety but last semester turned out to be very rewarding. Now that I'm back for the spring semester I feel like my anxiety is coming back. It feels more like a wave of anxiety and sadness rather than a constant thing. It happens once or twice a day along with stomach issues. I can eat fine but I feel like my stomach is always acting up. I've been reaching out to friends and trying to stay busy so I stop dwelling on it and I'm meeting with a counselor in a few days. I also go home on the weekends, which I did last semester and it helps a lot and I'm comfortable doing it. When this wave comes over me I just feel upset and want to cry and it feels like the rest of the week will last forever and I'll keep feeling like this. Basically I keep focusing on the long term rather than today when I'm anxious. I slowly but surely have been felling better but was wondering if anyone had tips to calm down or to relax a bit. Hope this makes sense and thank you.\n\nEdit: Just wanted to thank you for the responses so far, seeing other people going through similar things and hearing a different viewpoint always helps so thank you all!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "College Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/our3f/college_anxiety/"
        }
    ]
}