{
    "data": [
        {
            "author": "Anxiety_ruined_me",
            "author_created_utc": 1341950955,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8af11",
            "created_utc": 1342740851,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wuf9p/sigh_if_only_i_was_in_the_position_to_not_know/",
            "id": "wuf9p",
            "is_self": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wuf9p/sigh_if_only_i_was_in_the_position_to_not_know/",
            "score": 146,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/lviczFjwj8Jg-yVk.jpg",
            "title": "*sigh* If only I was in the position to not know what these two feel like.",
            "url": "http://i.imgur.com/oTFAP.png"
        },
        {
            "author": "milensk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342613230,
            "domain": "anxietyadventures.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wr7gi/started_a_blog_about_social_anxietynow_starting/",
            "id": "wr7gi",
            "is_self": false,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wr7gi/started_a_blog_about_social_anxietynow_starting/",
            "score": 68,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/Gjmw1J4yHP7a3TKN.jpg",
            "title": "Started a blog about social anxiety...now starting to get social anxiety about blogging",
            "url": "http://anxietyadventures.wordpress.com/2012/07/18/social-anxiety-and-my-first-real-blogging-challenge/"
        },
        {
            "author": "Influx07",
            "author_created_utc": 1284337006,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4c5ly",
            "created_utc": 1342724849,
            "domain": "self.Anxiety",
            "edited": 1342736608,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wty15/a_quick_anxiety_101/",
            "id": "wty15",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wty15/a_quick_anxiety_101/",
            "score": 65,
            "selftext": "I had this writing urge so maybe this may come of use to somebody.\n\nSo you have anxiety, or you think you might have anxiety. No worries, it’s a normal thing. That’s one big thing to remember: it’s normal. \n\nIf you’re the unsure case, well, we need to know what anxiety is. Anxiety defined: a feeling of worry, nervousness, or unease, typically about an imminent event or something with an uncertain outcome.\n\nNow, there are a few different major categories of anxiety. Generalized Anxiety Disorder (GAD) Phobia (Social, Specific), Panic Disorder, Post-Traumatic Stress Disorder (PTSD) and Obsessive-Compulsive Disorder. While it’s never good to self-diagnose, you can probably self-evaluate with a simple Google search to best learn what exactly is going on.\n\nAnxiety is, for the most part, caused by adrenaline. Yes, the same thing that helps you avoid split-second car accidents, and gets your libido on. Some of our brains dump adrenaline at the most inopportune time; it’s too much of a good thing.\n\nOnce you know what’s going on, you can further analyze with behavioral analysis. Ask yourself:\n\n* Stimulation - what were you doing?\n* Thought - what were you thinking?\n* Emotion - what were your emotions?\n* Body Sensation - heartbeat, hot, cold, shaky\n* Joy level - 1 to 5, where 5 is very joyous and 1 isn’t joyous whatsoever.\n* Misery level - 1 to 5, where 5 is miserable and 1 isn’t miserable.\n* Action - how did you act upon when stimulation?\n* Going into the situation, what were your resources/strengths?\n* Going into the situation, what were your vulnerabilities?\n* Trigger - if any?\n* What actions were helpful?\n* What actions made the situation worse?\n\nIf you accumulate enough data, like anything, you can begin to understand it better. \n\nThen, there are some life hacks:\n\n* Avoid caffeine - it’s a stimulant, and stimulants have properties that invoke anxiety.\n* Avoid stimulants - see above.\n* Physical stimulus - do something, be active, even if very simple. Stress ball, taking a walk, wrestling with your puppy. If your temperature goes up, your anxiety goes down.\n* Have food in your stomach - you know how when you’re hungry, you’re often cranky? Yep, same concept applies here.\n* If you’re medicated, make sure you’re keeping a steady habit of taking your medications.\n* Sleep is vital. Don't get too much, but don't get too little. 7-9 hours is great.\n\nNow, in some cases, such as social phobia, there isn’t really enough time to do that 10-step questionnaire (“hold on - feeling an onset of panic - gotta fill out this form!”). Why do we have social phobia? Well, it’s a natural thing. Some of us are just more natural than others. Common characteristics of social phobia is an extreme worry of scrutiny or judgement by others - most often by people around your age. That last bit is very key: by people around your age. For example, I’m great around parents, elders, and little kids, but if you bring someone +- 5 years of me, I’m a shitshow.\n\nThe best way to overcome such situations is desensitizing yourself. Think of it like playing the same song over and over and over (...) until you get sick of it. Well, same applies here: if you do the same thing over and over, soon, you’ll become less sensitive to the situation. It sucks at first, and remember it only gets better after that. Each time you’ll become less and less sensitive.\n\nIf you’re having a panic attack in a relaxed, laid-back environment, and are able to take a timeout, do some four-count breathing:\n\n* In for four seconds.\n* Hold for four seconds.\n* Out for four seconds.\n* Repeat for four minutes.\n\nWhile there is heaps of information out there, and on this subreddit, there is no substitution for a therapist. They are covered by most insurance companies too. Check Angie’s List for some reviews on therapists in your area, or a good ‘ol Google Search will also suffice. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A quick anxiety 101.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wty15/a_quick_anxiety_101/"
        },
        {
            "author": "Gilly-anxietycentral",
            "author_created_utc": 1342384161,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8cb4g",
            "created_utc": 1342434176,
            "domain": "anxiety-central.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wmyv0/list_of_over_100_anxiety_symptoms/",
            "id": "wmyv0",
            "is_self": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wmyv0/list_of_over_100_anxiety_symptoms/",
            "score": 63,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/kCoDJK0xMPbk-QDc.jpg",
            "title": "List of over 100 Anxiety symptoms",
            "url": "http://www.anxiety-central.com/index.php?/page/index.html/_/articles/forum/list-of-over-100-anxiety-symptoms-r16"
        },
        {
            "author": "americanslang59",
            "author_created_utc": 1314412467,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qizz",
            "created_utc": 1342550655,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wpqke/does_anybody_else_get_dizzy_from_their_anxiety/",
            "id": "wpqke",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wpqke/does_anybody_else_get_dizzy_from_their_anxiety/",
            "score": 62,
            "selftext": "I've had an anxiety disorder since I was 13 (early 20s now) but over the past year, my anxiety has become very severe and crippling.\n\nDoes anybody else randomly get dizzy for a few seconds? I'll notice sometimes that I need to hold on to something near me or sit down because I feel like the ground is wobbling or like I can't stand straight.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else get dizzy from their anxiety sometimes?",
            "url": "http://www.reddit.com/r/Anxiety/comments/wpqke/does_anybody_else_get_dizzy_from_their_anxiety/"
        },
        {
            "author": "Phoenix1Rising",
            "author_created_utc": 1322243584,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6b8d0",
            "created_utc": 1342453733,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wnc17/does_anyone_else_bite_or_tear_their_fingers/",
            "id": "wnc17",
            "is_self": true,
            "media_embed": {},
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wnc17/does_anyone_else_bite_or_tear_their_fingers/",
            "score": 53,
            "selftext": "Is anyone else a skin-picker (Dermatillomania)?  I specifically tear--and sometimes bite--the skin around my fingers.  It tends to be my thumbs and index fingers. I'm trying to stop right now but it's hard.  Does anyone else do this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else bite or tear their fingers?",
            "url": "http://www.reddit.com/r/Anxiety/comments/wnc17/does_anyone_else_bite_or_tear_their_fingers/"
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1342385649,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wlwbg/anyone_else_find_themselves_paranoid_about_the/",
            "id": "wlwbg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wlwbg/anyone_else_find_themselves_paranoid_about_the/",
            "score": 39,
            "selftext": "My anxiety comes and goes, and some days are better than others (I'm sure it's like this for most of you). However, I've come to realize that it's making me paranoid about a few things. \n\nReal example: The other day I picked up this neat clock for my room. I had it plugged in all night, and then the next day I was extremely anxious. For some ungodly reason, I thought that it was the clock that had made me sick. Something with it had made my anxiety worse, made me dizzier, made me more nauseous. I know this is crazy to think about, but it just is what I came up with. It's been that way with a few things, if I do or eat or get something and then have anxiety the day after, I blame it on anything that changed in my 'normal' routine. \n\nI'll end up usually avoiding those things, with the fear that my anxiety will be aggravated by it again. Does anyone else experience something like this?  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else find themselves paranoid about the most ridiculous things? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/wlwbg/anyone_else_find_themselves_paranoid_about_the/"
        },
        {
            "author": "pseudohim",
            "author_created_utc": 1333564145,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7cv4n",
            "created_utc": 1342523680,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wp2qv/paper_handcuffs/",
            "id": "wp2qv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wp2qv/paper_handcuffs/",
            "score": 37,
            "selftext": "Hi everyone. Nice to meet you. Here's my idea.\n\nAbout moi: I have severe social anxiety, mild bi-polar disorder, \"pure O\" OCD, and I suffer from depression as well. \n\nFor years, I have let them rule me. I have let them defeat me and steal my joy, rob me of my happiness - daily. Every new morning was a reminder that I was stuck in this cycle...this miserable hamster wheel...my biology having turned against me, making me a pathetic fool in a world full of folks who were living life...while I was losing mine to mental illness. So many days of my youth have been lost in suicidal abandon...sitting inside in the dark, wishing I had never existed, while my contemporaries ran in the sun, making love, earning prestige, and becoming champions in this world.\n\nI tried pills. Prescriptions. They helped, to a degree, but often the cost was not worth the gain. I quit 'em cold turkey.\n\nSince then, I've begun working out regularly. The benefit that regular exercise does for your mental well-being is impossible to under-emphasize. Jogging three times a week has done wonders for me.\n\nThere is a song that some of you older Redditors may recall. [Baz Luhrmann's \"Don't Forget To Wear Sunscreen\"](http://youtu.be/sTJ7AzBIJoI). It was a novelty hit in the late Nineties. Played at graduations and such.\n\nThe line that I prize most from the song is this:\n\n\"Do one thing, every day, that *scares* you.\"\n\nI have taken this to heart. So each day, I endeavor to speak to that girl I'm too shy to introduce myself to. I work to say hi to that sad-looking stranger. I smile at a police officer, or I step out of my comfort zone in one of a million other ways.\n\nSo a few weeks ago, I got my server's permit and applied to work at a bar and grill.\n\nI am naturally introverted. Making friends and being sociable is an effort for me. But I can do it. And the more I do it, the easier it becomes. Almost as if I'm coming out of my shell.\n\nSo I've decided to throw myself into the fire and see how I am forged.\n\nThere will be a few embarrassing weeks' worth of me forgetting customers' names, or misplacing orders, or being anxious and frightened when some burly trucker or an obnoxious dowager becomes irate with me because I brought their steak to them overcooked, or forgot to refill their iced tea in time.\n\nBut this awkward, painful purging of my introversion will be worth it.\n\nFor in a few months' time, I will no longer be afraid to walk up to that unbelievably gorgeous girl in the bookstore. Not ashamed of my appearance, or sabotaging myself with negative, self-effacing thoughts as I approach her. \n\nI will be able to meet someone who will love me. Someone I can give my whole heart to.\n\nWhy is any of this relevant?\n\nI'm honestly not sure. But if I had to summarize, or venture a guess, I'd say this:\n\nFearing your demons gives them power. As soon as you have the balls to fight them head-on, you see them for what they are.\n\nPaper handcuffs.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Paper Handcuffs.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wp2qv/paper_handcuffs/"
        },
        {
            "author": "PoesRaven",
            "author_created_utc": 1322242884,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6b8b9",
            "created_utc": 1342835150,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wwl1b/tonight_i_kick_anxiety_to_the_curb/",
            "id": "wwl1b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wwl1b/tonight_i_kick_anxiety_to_the_curb/",
            "score": 33,
            "selftext": "I am going out tonight, dancing! I plan on being a social butterfly too. I don't know how yet, but there comes a time when you just need to suck it up and do it. I have made a promise to myself to change and this is part of it. Staring down your fears is daunting, but if you want to get anywhere in life you need to do it. It's taken me a long time to admit that. :D",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Tonight I kick anxiety to the curb.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wwl1b/tonight_i_kick_anxiety_to_the_curb/"
        },
        {
            "author": "annachristineAAC",
            "author_created_utc": 1339872537,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_80n14",
            "created_utc": 1342333150,
            "domain": "self.Anxiety",
            "edited": 1342333561,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wl1ap/brother_mom_say_its_in_my_head/",
            "id": "wl1ap",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wl1ap/brother_mom_say_its_in_my_head/",
            "score": 32,
            "selftext": "My brother has been pretty sick for two and a half years with an undiagnosed illness. It's a really long story, but he's frequently having surgeries and being rushed to the ER. \n\nDuring that time and maybe a year or two more, I've been struggling with debilitating panic and depression. To the point where I couldn't go to school without a number of doctor-ordered accommodations. \n\nThroughout that time, my parents have mostly paid attention to my brother's health. Which is understandable, because he's required a significant amount of hospital time and is constantly in physical pain.\n\nThe issue arises here, in that when I need help from my family they blow it off because I'm not obviously hurting. Frequently I'm told that it's all in my head and thus doesn't require their attention or help. This causes a lot of fights and tension that have yet to be resolved.\n\nMy question here is, how can I get them to understand that while my brother's pain is physically obvious and mine isn't, that shouldn't lessen my need for their understanding &amp; help? I hope this made some sort of sense.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Brother &amp; mom say it's in my head",
            "url": "http://www.reddit.com/r/Anxiety/comments/wl1ap/brother_mom_say_its_in_my_head/"
        },
        {
            "author": "milensk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342799671,
            "domain": "anxietyadventures.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wvmov/image_social_anxiety_explained_1_acting_normal_in/",
            "id": "wvmov",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wvmov/image_social_anxiety_explained_1_acting_normal_in/",
            "score": 28,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/a-UsGdyfjFbyZvV0.jpg",
            "title": "[Image] Social Anxiety Explained #1: Acting \"Normal\" in Social Settings",
            "url": "http://anxietyadventures.wordpress.com/2012/07/20/social-anxiety-explained-1/"
        },
        {
            "author": "Abrum",
            "author_created_utc": 1286660021,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4f06q",
            "created_utc": 1342769481,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wv3lx/my_overall_anxiety_increases_exponentially_at/",
            "id": "wv3lx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wv3lx/my_overall_anxiety_increases_exponentially_at/",
            "score": 28,
            "selftext": "I'm not really sure why. In the day, I'm mostly fine. Once night sets in, or usually around 9 or 10PM, I just have this burning apprehension and hopelessness in my chest that sort of leaves me unhappy and unable to enjoy anything. As soon as the morning comes I immediately feel better. Who else is like this and does anyone know a reason for it?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My overall anxiety increases exponentially at night. Is anyone else like this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/wv3lx/my_overall_anxiety_increases_exponentially_at/"
        },
        {
            "author": "random_walk",
            "author_created_utc": 1312074465,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ldup",
            "created_utc": 1342877087,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wx7wg/ssris_and_motivation_also_bonus_rant_on/",
            "id": "wx7wg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wx7wg/ssris_and_motivation_also_bonus_rant_on/",
            "score": 24,
            "selftext": "Hi all,\n\nLast summer, I finally bit the bullet and got fairly extensive treatment for anxiety. I was put on medication (Celexa, then Prozac), and had individual and group counseling (primarily CBT, and some Acceptance Commitment Therapy). By around December, my motivation levels plummeted. I didn't feel like doing anything except watch every episode of Breaking Bad (2x), How I Met Your Mother, and Arrested Development. This continued for several months until I realized that I wouldn't be able to progress in my graduate program if I didn't work on my anxiety.\n\nUltimately, I decided that SSRIs were the primary factor in my lack of motivation, and this seems to be quite true. I weened myself off of the medication, and I feel that I am once again productive and making good progress. Has anyone experienced something similar?\n\nAs one might expect, getting off medication has brought up my anxiety level a bit. I can handle it better having gone through therapy, but I am now bouncing between worrying about having several different diseases (i.e. hypochondria classics such as MS, cancer, schizophrenia, cancer, etc.). Being a grad student, I have access to research journals, which sucks because I find myself looking up \"average age of onset for schizophrenia\" and trying to look for evidence that I am past the age that I am likely to get it. At night just before I go to sleep, I worry that some of my intrusive, random thoughts (not disturbing or violent in nature, just weird and dream-like thoughts) are, in fact, auditory hallucinations and that I am on the cusp of going crazy. Anyone experience this at all? I mentioned it in my group CBT class last fall and the therapist just gave tips on how to deal with anxiety at night (which is understandable and well-appreciated).\n\nAnyway, thanks for reading!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "SSRIs and Motivation (also, bonus rant on hypochondria!)",
            "url": "http://www.reddit.com/r/Anxiety/comments/wx7wg/ssris_and_motivation_also_bonus_rant_on/"
        },
        {
            "author": "OinkOinkthenMoo",
            "author_created_utc": 1315181155,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5silh",
            "created_utc": 1342645976,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ws4jx/control_your_blood_sugar_possibly_gain_control/",
            "id": "ws4jx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ws4jx/control_your_blood_sugar_possibly_gain_control/",
            "score": 22,
            "selftext": "I've lurked here for months since I realized that the 'episodes' I had been experiencing were actually panic attacks. I'm going to premise all of this by saying that my story is purely anecdotal. I'm not \"cured\" but have gotten my symptoms substantially under control. I'll try to be brief and please ask me to clarify if I've missed something.\n\nI've suffered from hypoglycaemia for a long time. It runs in my family but up until 4 years ago I would only have hypoglycaemic attacks if I hadn't eaten for 12 hours or more. 4 years ago I started gaining weight and my blood sugar suffered for it. After nearly passing out during exercise a couple times, my doctor recommended eating a candy bar half way through my workout to keep my levels up. For some reason I translated this into, \"Eat sugary/carby things when you feel it coming on and you'll be alright.\" It makes sense, doesn't it? If your sugar is low, eat sugar!\n\nI packed on even more weight, close to 30 lbs in a little over a year. I was \"controlling\" my sugar by eating every couple hours, usually Nutrigrain bars or something similar. I began to develop a lovely case of health anxiety, bordering on hypochondria. A few other health issues (mysterious sharp head pain no one could diagnose, heart palpitations, etc) combined with a close family member dying of a sudden heart attack solidified my fears. \n\nI started having full blown panic attacks without knowing what they were. Originally I blamed them on my low blood sugar because the symptoms can be strangely similar, but it wasn't until I found this subreddit a while ago that I realized what was happening to me. I was obsessed with every twitch, twinge, and flutter that happened in my body. Like many people, I comforted myself with food. During this time I gave up caffeine, which helped. \n\nA little over a month ago, for reasons completely unrelated to my anxiety, I switched to a paleo-style of eating. If you aren't familiar with it, you basically eat fruits, veggies, meat, fish, and nuts. Clean eating free of sugars, wheat, and grains. Within two weeks my mysterious head pains disappeared and my sinus congestion (which I had thought to be allergies) was gone. After about a month it suddenly dawned on me that I hadn't had a panic attack in a long time. I hadn't even had a panicky thought in a long time! I'm calmer and feel more in control of my body.\n\nCould it be? I looked it up and found [this](http://www.hypoglycemia.asn.au/2011/beating-anxiety-and-phobias/) article. I found others. Stories of people going decades with bi-polar diagnoses, depression, anxiety, suddenly feeling better once they got control of their blood sugar. Google it, they're out there!\n\nI'm sharing what has worked for me, so far. I'm sure I'll have set backs, but I've gotten control and I'm *healthier* for it. All it takes is 30 days to know if it might work for you too.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Control your blood sugar, possibly gain control over your anxiety!",
            "url": "http://www.reddit.com/r/Anxiety/comments/ws4jx/control_your_blood_sugar_possibly_gain_control/"
        },
        {
            "author": "milensk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342364736,
            "domain": "anxietyadventures.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wlf14/restaurant_anxieties_a_list/",
            "id": "wlf14",
            "is_self": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wlf14/restaurant_anxieties_a_list/",
            "score": 19,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/5yD35GLAejHdM9Nw.jpg",
            "title": "Restaurant Anxieties, a List",
            "url": "http://anxietyadventures.wordpress.com/2012/07/15/restaurant-anxieties-a-list/"
        },
        {
            "author": "Bravener",
            "author_created_utc": 1328483170,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6uj87",
            "created_utc": 1342872225,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wx5ym/anxiety_sucks/",
            "id": "wx5ym",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wx5ym/anxiety_sucks/",
            "score": 19,
            "selftext": "I have lived with anxiety for 10 years now. There was a point in my life where I was almost free from it but it came back really suddenly one evening after smoking pot. It was terrible. Now I worry about EVERYTHING \"ill-related\". Every ache or pain I get I think I am getting sick. Every funny feeling I get I feel like I will be sick. I have developed an irrational fear of food poisoning, and it's all kind of ironic because I know how irrational my thinking is but I can't seem to shake it! I have been told to go on medication but I am determined beat it without it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety sucks.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wx5ym/anxiety_sucks/"
        },
        {
            "author": "WaterSnake",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342577025,
            "domain": "self.Anxiety",
            "edited": 1342624843,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wqiuk/my_anxiety_is_destroying_my_stomach_seriously/",
            "id": "wqiuk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wqiuk/my_anxiety_is_destroying_my_stomach_seriously/",
            "score": 18,
            "selftext": "I've had these serious stomach aches for almost 6 months now. They started out as cramping for maybe 2 - 3 hrs after eating in the evening, but turned into having bloating, gas, cramps, diarrhea, and constipation (alternating about every month) all day. I had a particularly bad bout on a school trip, and was unable to participate in any activities. We were in St. Louis for a week. I also had to pass on a work-related backpacking trip, knowing that my stomach would act up (and the wilderness is not a place you want to be when that happens).\n\nWhen I'm with my girlfriend, I will have to spend 1 + hours in the bathroom (total), oftentimes interrupting activities or ruining plans. \n\nIt's also extremely painful. I have my symptoms from when I wake up in the morning until I go to bed at night. It makes working hard, and I've had to sacrifice productivity in order to deal with my issues.\n\nBecause of this, my anxiety gets worse. I'm constantly afraid of a flare up, and experiencing constant guilt about how my condition imposes on others. This in turn makes it worse, and the cycle continues. \n\nI knew I had issues with stress, but I've recently come to realize that I've had serious anxiety issues for the past few years. \n\nI've tried to advocate for help, but my parents are convinced it's all in my head and that I can wish it away. They also think I have some sort of disease, but all medical testing has come back negative. Medicines don't help, nor do supplements.\n\nI want to learn how to manage my anxiety, as well as ask for help with the stomach problems. There was a thread here recently about physical symptoms of anxiety, and bowel issues were a common thread among all posts.\n\nThanks guys!   \n\nEDIT: I'm a 17 year old male, don't drink, do drugs, or smoke.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My Anxiety is destroying my stomach, seriously impacting my life/work",
            "url": "http://www.reddit.com/r/Anxiety/comments/wqiuk/my_anxiety_is_destroying_my_stomach_seriously/"
        },
        {
            "author": "kelseyjeanette",
            "author_created_utc": 1317315652,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5y511",
            "created_utc": 1342328435,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wky38/would_an_anxiety_attack_cause_me_to_have_this/",
            "id": "wky38",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wky38/would_an_anxiety_attack_cause_me_to_have_this/",
            "score": 15,
            "selftext": "First time on r/Anxiety. \n\nAnd first off, I was diagnosed with depression about 5 years ago, but my parents wouldn't medicate me because \"it's just teenage angst\" (I'm almost 19 now).\n\nYesterday, my boyfriend and I got two kittens, he got a haircut (maybe the change in his appearance had something to do with this?), and his best friend was visiting from out of town, so he was acting slightly differently. I was sitting on the couch, when all of a sudden I felt really... off. My brain was making me feel as if my boyfriend and I had broken up and I was just visiting his apartment (which is our apartment), even though that's obviously not true. I didn't think that was actually happening, but it felt like it. \n\nI tried explaining it to a friend, but it's difficult. I was just sitting on the couch, a bit stressed, a little tired (yesterday was a long day), and all of a sudden, looking at my boyfriend, my brain started making me feel as if I was in a scenario where we had broken up and I was coming to visit, but I was in love with him and wanted him back.\nI didn't actually think any of this was going on, but that's what it felt like. \n\nSo I asked my boyfriend to come sit next to me on the couch, which he did, and we held each other for a minute or two. During that time, it was as if my emotions were like they would be if I was living in the reality of my brain's perception, if that makes sense. I felt like we were broken up, and I started to cry, even though I know we're still together, and we live together, etc.\n\nI have a history of panic attacks where I hyperventilate, can't breathe, and I basically have a meltdown. But this was more or less an internal freak-out for no reason, that came on all of a sudden, and lasted long enough that I went to take a nap in our bed to try to grasp reality.\n\nWhen I woke up, I was much better.\nBut I was talking with a friend, and tried using google to figure stuff out, and all I could think was an anxiety attack.\n\nYou guys should let me know what you think.\n\nThanks!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Would an anxiety attack cause me to have this skewed perception of reality?",
            "url": "http://www.reddit.com/r/Anxiety/comments/wky38/would_an_anxiety_attack_cause_me_to_have_this/"
        },
        {
            "author": "Kannath44",
            "author_created_utc": 1309716518,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5gpc2",
            "created_utc": 1342295979,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wk82o/i_leave_for_freshman_year_of_college_on_august_17/",
            "id": "wk82o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wk82o/i_leave_for_freshman_year_of_college_on_august_17/",
            "score": 13,
            "selftext": "I have alot of anxiety about it. I had orientation a few weeks ago and the first few hours I felt like i could vomit at any time. Im sure im not alone, what tips and tricks do you guys have about this, i need some ideas, thanks.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I leave for freshman year of college on August 17, help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wk82o/i_leave_for_freshman_year_of_college_on_august_17/"
        },
        {
            "author": "mrstokiwartoothtoyou",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342334799,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wl2as/i_am_having_a_panic_attack_right_now/",
            "id": "wl2as",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wl2as/i_am_having_a_panic_attack_right_now/",
            "score": 13,
            "selftext": "And I really just need some words of comfort.  I don't want to go on medication because it only happens once every few months.\n\nMy sister was in the hospital since Tuesday because she got in a really bad car wreck.  She got out yesterday afternoon at around 4pm.  I feel fucking awful for her because she is practically a model and she had to get a skin graft for a burn she has, plus she is just in a lot of pain and somewhat traumatized from the accident.\n\nMy Dad works at a hotel and somebody bought the hotel and is firing everybody in the hotel.  He can stay with the company in the city he lives in, making half of his current salary, or move elsewhere with my Mom to try to find a job and somehow rent out the house.  Most likely, he will not do this because he is 61 and says that it will be really hard for him to find a job.\n\nMy lease ends at the end of July, and I am moving in with my girlfriend for a couple of months in BFE West Virginia whilst I apply for jobs.  I graduated with a math degree, but my grades are not that great and I am so nervous about applying for jobs.  I want a job for the EPA or DOE but it just seems sooo unlikely that I will get hired anywhere.\n\nAnd... I don't have a car when I move up to WV.  I can transfer restaurants where I work, but I really have no way of getting to where I need to be, because I will be living 15 minutes away from where I will be working.  I am really into bicycling everywhere, but I don't think I will find the biking community up in WV that I have found here, and the university has let me borrow one of their bikes for the summer, but I won't have that bike once I move.\n\nMy research project for the summer will be ending in August, but my mentor has been out of town and won't be coming back until just before I move.  And I haven't told her I am leaving.  :(  She is the best thing that has ever happened to me in this city.  I sometimes wonder if I am disappointing her.\n\nI have also been seeing this guy for the past 6 weeks, and we decided to be exclusive before I leave, but when I leave, we have to break up.  So that means only two weeks left with him, and I really like him.  Unfortunately, he does not want to make any sort of commitment, which really is a shame because I feel like I am awesome enough for somebody to be able to call me their girlfriend.  I haven't been feeling like that as much because I usually bike like 70 miles a week (two 25-35 mile rides + commuting), but the past few rides that we have had with the bike shops I usually go with have been cancelled because it has been thunder-storming.  I know part of this is because I haven't been working out.  I really need to get back on that.\n\nAlso, I have to save up so much money before I move and I have only really done like 2 hours of research the past week, because I am really just running these iterations on my computer and each one takes like 40 minutes, so there isn't a whole lot to do except to wait until each iteration is over.\n\nThis is very poorly written, I apologize.  There are about a million things floating in my head right now.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I am having a panic attack right now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wl2as/i_am_having_a_panic_attack_right_now/"
        },
        {
            "author": "ArrowFeathers",
            "author_created_utc": 1342374122,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8c9fr",
            "created_utc": 1342375533,
            "domain": "self.Anxiety",
            "edited": 1342385101,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wlna9/starting_a_new_job_tomorrow/",
            "id": "wlna9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wlna9/starting_a_new_job_tomorrow/",
            "score": 13,
            "selftext": "      This is my first post. Feeling anxious about starting a new job tomorrow. I know it will get very bad in the morning before start time. I'm looking for some advice or words of encouragement. I really want this to work out. Mostly I don't feel like I fit in anywhere. But I really want this, need this job.\n      Does anyone have similar stories about starting something new? About working while dealing with anxiety?\n      \nedit: Thank you for the positive comments!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Starting a New Job Tomorrow",
            "url": "http://www.reddit.com/r/Anxiety/comments/wlna9/starting_a_new_job_tomorrow/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342815083,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ww303/should_i_worry_about_tolerance_to_alprazolam_xanax/",
            "id": "ww303",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ww303/should_i_worry_about_tolerance_to_alprazolam_xanax/",
            "score": 12,
            "selftext": "My home doctor gave me **0,5 mg alprazolam** (xanax), to use three times a day for panic attacks (on top of the 150 mg venlafaxine (effexor) I already use). The problem is, I rarely have spontaneous panic attacks. They come when I have stress, and since I'm free for summer, I make sure I have no stress at all. (This is major avoiding, I know.) Because of all the warnings for addiction and tolerance, I only take one or even a half when I visit friends, family, the doctor or when a spontaneous attack does come up. On sunny days like this, with no obligations, I can handle myself quite all right, aside from the constant anxiety that I can live with.\n\n**How much should I worry about tolerance or addiction, considering I only take these alprazolam pills when I need them, which is not even daily?**\n\nAlso, I wrote down a story where I try to make sense of how I developed my panic disorder. It's long though, like 7 or 8 paragraphs. Would you, anxiety partners, be interested?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Should I worry about tolerance to alprazolam (xanax)?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ww303/should_i_worry_about_tolerance_to_alprazolam_xanax/"
        },
        {
            "author": "abcd_z",
            "author_created_utc": 1315631740,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5tww6",
            "created_utc": 1342773611,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wv5q2/success_story_due_to_a_recent_personal/",
            "id": "wv5q2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wv5q2/success_story_due_to_a_recent_personal/",
            "score": 12,
            "selftext": "I had a fucking HUGE breakthrough recently.  \n    \nWhen I was a young teen my mother developed paranoid schizophrenia and left the family.  I held onto the pain to keep her away from me so that I wouldn't be vulnerable to getting hurt again.  Layered on top of this was the panic attacks that would arise to keep me from feeling that pain.  Unfortunately, they triggered (for reasons I'm still not sure about) whenever I needed to do work and be responsible for myself.  \n  \nI'd been working with a behavioral therapist and learned to sit with the emotions without trying to change them.  At some point I realized the source of my panic attacks was avoiding the pain.  The panic attacks stopped, but the subsequent emotional pain was just as bad, maybe worse.  I reached out to a former roommate of mine who has experience working as an AA sponsor.  A lot of his advice didn't help me, but he did suggest forgiving my mother.  I did so out of enlightened self-interest*, and a large chunk of the pain vanished.  Then I decided that mom wouldn't want me to be unhappy, and decided to let go of the rest of the pain.  And that's where I stand right now.  \n  \nThe freaking out, the hyperventilating, the muscle spazzes, the fetal rocking... all of that is gone.  All that remains is an annoying buzzing sensation.  It still puts me off of doing some of the work, but it's not NEARLY as bad as it had been.  If before the discomfort was 10/10, now it's closer to 2/10.  5/10 on my worst day.  \n  \nSo now I'm dealing with a more conventional anxiety.  I've been in my own little coccoon for entirely too long, and now I'm going to start pushing myself slowly but surely to take advantage of this newfound freedom.  It's terrifying, but so long as I keep taking it one step at a time, I should be able to handle it.  \n  \n*It still counts as forgiveness if it's for entirely selfish purposes, right?  ;)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Success Story] Due to a recent personal breakthrough, my anxiety is now massively reduced.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wv5q2/success_story_due_to_a_recent_personal/"
        },
        {
            "author": "getmeaburrito",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1342488935,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wodw2/help_feeling_anxious_about_visiting_a_doctor_to/",
            "id": "wodw2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wodw2/help_feeling_anxious_about_visiting_a_doctor_to/",
            "score": 12,
            "selftext": "I am new here and I am extremely grateful to have found this group.  I have experienced panic attacks for years now. I'm 25.  I have felt this anxiety since I started college 7 years ago.  I have 2 children now and these attacks have gotten much worse and are starting to keep me from functioning normally.  I have cut out a lot of activities that I used to love because of anxiety.  I can barely grocery shop without wanting to crawl out of my skin and scream.  \n\nI need to speak to a doctor and get some help.  I have to take a flight in September so I was originally going to only ask for help with flying but I am certain I need help for every day life as well.  I can't even take the kids for a walk around the block without feeling like something horrible will happen. \n\nMy problem is that I have severe anxiety when it comes to talking about the anxiety.  I have no idea how I am going to be able to speak to a doctor (who will be a stranger that first visit) without having an attack right there.  I am not afraid of doctors, I did deliver two great babies, but I am afraid of facing this problem that is ruining my life.  I'm scared, embarrassed, nervous and stubborn.  Mostly scared. \n\nI really hope someone can help me.  Give me that push to call the doctors office and schedule.  My husband doesn't understand.  He cant figure out why I am avoiding getting the help I need.  I don't think I understand either :( \n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Feeling anxious about visiting a doctor to talk about anxiety.  How do I take that first step?",
            "url": "http://www.reddit.com/r/Anxiety/comments/wodw2/help_feeling_anxious_about_visiting_a_doctor_to/"
        },
        {
            "author": "lael8",
            "author_created_utc": 1341967413,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8ai9k",
            "created_utc": 1342640207,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wry0b/out_the_front_door_with_agoraphobia/",
            "id": "wry0b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wry0b/out_the_front_door_with_agoraphobia/",
            "score": 12,
            "selftext": "I have agoraphobia.  But it was not my first issue.  I was seven years into dealing with bipolar disorder when at a work function at a theme park, I had my first panic attack.  The two issues, anxiety and bipolar worked in tandem to escalate me to the point of being homeward bound for a year.  In many ways the agoraphobia has wreaked more havoc than the bp.  (for those who do not know what agoraphobia is, it's a fear of spaces...so riding in cars, being in crowds, and standing in lines are equally disturbing).  I do not show the top symptom of feeling as through I'm having a heart attack, as is indicative with panic attacks...No, my symptoms immediately culminated in my intestines and issues there...So it was just a lot of fun, fun, fun...\n\nNow, I am Nearly eleven years into the agoraphobia thing, and after finding medication that was not a narcotic to deal...I am able to cope.  I am a psychologist and have done a lot with cognitive reframing, so was able to get myself off the medication for the agoraphobia...My physical body thanked me :)  But I have to work at it all the time...\n\nAn example...My husband and I went to see some of my family for a few days.  I must say I handled the excursion brilliantly, but I have also not left the house except once in the past two weeks.  I find that as long as I have a means of being productive without avoiding the need to go out for whatever reason, I can extend myself that luxury, but since being home I have slept much more than usual and have had problems with flu like symptoms.  This is not new, just part of the animal.  \n\nI have run into people over the years who rail against anxiety, and I understand completely, but doing so only causes much more.  I have learned to accept that I have limitations, to work around them, and to slowly push myself past set parameters.  So, when I find I am avoiding going out the front door, I set a time that I must do just that, and so on and so forth.  I know that I risk a panic attack, but waiting an not continually being on top of the illness only allows an open door for it to come back full force.  \n\nI would encourage anyone with this very debilitating type of anxiety, to be gracious to yourself and to set small goals that you can conquer.  It does work.  It took me a lot of years, but I did it.  You can too.  Here is to stepping out the front door! ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Out the front door with agoraphobia",
            "url": "http://www.reddit.com/r/Anxiety/comments/wry0b/out_the_front_door_with_agoraphobia/"
        }
    ]
}