{
    "data": [
        {
            "author": "PatrckBateman",
            "author_created_utc": 1319268768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_63e4s",
            "created_utc": 1343082309,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x1ga3/does_anyone_get_anxious_just_ordering_food/",
            "id": "x1ga3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 61,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x1ga3/does_anyone_get_anxious_just_ordering_food/",
            "score": 126,
            "selftext": "Today I went to Quiznos since I've never tried it and I started feeling anxiety as the guy made my sandwich. It was taking a long time and so my mind started to drift thinking \"do I look weird just standing here? Where should I be looking at? Should I act interested in the drinks or chips? Should I try to make small talk? What do the other customers think of me?\"\n\nAfter I got my sandwich I calmed down and got mad at myself because of the idiocy of my thoughts. \n\nDoes this ever happen to anyone else? It makes me so frustrated that I get anxiety over the smallest things.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone get anxious just ordering food?",
            "url": "http://www.reddit.com/r/Anxiety/comments/x1ga3/does_anyone_get_anxious_just_ordering_food/"
        },
        {
            "author": "puffytailcat",
            "author_created_utc": 1313783090,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5p2yr",
            "created_utc": 1342923129,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wy793/i_am_not_giving_in_to_anxiety_tonight/",
            "id": "wy793",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wy793/i_am_not_giving_in_to_anxiety_tonight/",
            "score": 59,
            "selftext": "I refuse to do it. I can feel it lurking around the corners of my head, right now--because it's storming, because I tried to distract myself from the storm and my friend wasn't available, because I'm trying desperately to get my life back into some kind of order after my husband left me, because anxiety and depression have stolen the last three years away.\n\nTONIGHT I'M NOT GIVING IN. I am not going to cry, I am not going to feel like I am a worthless, broken piece of shit, I am not going to tell myself that I am alone and will always be alone. I will not linger on the mistakes I've made or the people I've lost. I will breathe deeply and remember the things large and small that were good about today, that are good about my life, and I will keep my fears and problems in perspective.\n\nI am going to take my tiny dose of Ativan, watch a movie, wash dishes. I am going to let a good day end well, without panicking, and I am going to make tomorrow as good a day as I can, too. I am going to try to make the life I want for myself one day at a time. I may not get it anyway, but I will stop being the biggest obstacle between myself and my dreams. \n\nThanks. I needed to get that out. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I AM NOT GIVING IN TO ANXIETY TONIGHT.",
            "url": "http://www.reddit.com/r/Anxiety/comments/wy793/i_am_not_giving_in_to_anxiety_tonight/"
        },
        {
            "author": "pw3nd",
            "author_created_utc": 1323398504,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ehwo",
            "created_utc": 1343483463,
            "domain": "memegenerator.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xaqax/every_day_of_my_life/",
            "id": "xaqax",
            "is_self": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xaqax/every_day_of_my_life/",
            "score": 56,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/R_sDmqNGfpIIzCXP.jpg",
            "title": "Every day of my life",
            "url": "http://memegenerator.net/instance/24084418"
        },
        {
            "author": "AT0M801",
            "author_created_utc": 1338695874,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7vrss",
            "created_utc": 1343080685,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x1eka/hey_ranxiety_this_is_something_that_has_worked/",
            "id": "x1eka",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x1eka/hey_ranxiety_this_is_something_that_has_worked/",
            "score": 53,
            "selftext": "I have struggled with anxiety and depression for most of my life having severe panic attacks multiple times a week. Anyone who has had a panic attack knows the vicious cycle of them, you panic and as there is no actual danger to speak of you think that maybe something is wrong with you (cancer, heart failing, psychosis etc) which in turn makes you MORE anxious extending the panic attack and making it worse. After becoming familar with this feeling after years of attacks I started to notice that all of the symptoms were the same with each attack, and afterwards I would feel almost silly for freaking out so much. I knew this was all in my head and nothing was actually wrong, mostly I was just feeling the physical effects of the panic attack so here's where I got creative. After watching the movie inception I was fascinated by the idea of their totems, the objects they would use to determine if what they were experiencing was real or not. So one day when my anxiety was very, very low I decided to get one. In my current mental state I KNEW that nothing was wrong with me and the feelings I was experiencing were not actually real but,that sometime soon I would loose that perspective and start thinking that there was. I took an old brass key and started creating a mental way point of sorts, when I was having an attack I would hold the key and remeber that in a much better mental state I had determinded that nothing was wrong and that I would be just fine as soon as the attack passed. The key serves as a metaphor for me, I imagine myself shutting a door between myself and the fear that I am feeling and locking it. I then imagine myself turning around an unlocking a door that contains positive thoughts. I found this silly until it actually worked, and has been working every since. I trust that when i'm in the middle of an attack I am in no state to determine if something bad is actually happening and when I'm not having one I find it almost silly I could get so worked up. So I suggest you all try this, find a small object that you can keep on your person and spend some time focusing on it and reminding yourself that you are okay. When a bout of anxiety hits take out your totem and hold it in your hands while taking some deep breaths while reminding yourself that in a much better state you knew you were okay and that this feeling will pass. \nSorry for any grammer mistakes as I am currently on my phone, and if ANY of you need to talk I am here for you whenever, just pm me.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey r/anxiety this is something that has worked wonders for me! An anxiety totem.",
            "url": "http://www.reddit.com/r/Anxiety/comments/x1eka/hey_ranxiety_this_is_something_that_has_worked/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343148649,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x2wjn/my_dad_hit_me/",
            "id": "x2wjn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x2wjn/my_dad_hit_me/",
            "score": 52,
            "selftext": "A few days ago, me and my father went to go and see a major historical exhibition. We were there for a short while before I started to feel sick. As my typical attack sets in (severe angst, nausea, just to name a couple) I need to get out. My parents do know I'm seeing a psychiatrist and psychologist for this but they fail to take me seriously. Anyway, my dad gives me a fair wack, enough to hurt, and tells me to stop faking it. I rush off to the toilet and have a nice long cry session and go back. This time he is really pissed and hits me again. Calling me an attention seeker. Just wondering, DAE have these parental issues?\n\nTL;DR: History, anxiety, pow!, cry, another pow!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My Dad hit me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/x2wjn/my_dad_hit_me/"
        },
        {
            "author": "Joe2478",
            "author_created_utc": 1298203193,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4v8l4",
            "created_utc": 1343472947,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/xam1c/ocd_does_have_its_benefits/",
            "id": "xam1c",
            "is_self": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/xam1c/ocd_does_have_its_benefits/",
            "score": 48,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/SpUURxdDnrUpJz5A.jpg",
            "title": "OCD does have its benefits.",
            "url": "http://i.imgur.com/N9sPa.jpg"
        },
        {
            "author": "whelpltn",
            "author_created_utc": 1338520548,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7v2e7",
            "created_utc": 1343241248,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x570r/my_therapist_told_me_two_words_to_always_remember/",
            "id": "x570r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x570r/my_therapist_told_me_two_words_to_always_remember/",
            "score": 47,
            "selftext": "My therapist told me to always remember two words... Resourcefulness and Resilience\nResourcefulness- you have the power and the resources to help yourself and they are all around you! Go to support groups get on medication or go see a therapist! This stuff really helps. I was on the fence about doing these things for sooo long because I was afraid that people would look down on me or that if I went to a therapist it would mean there was actually something wrong with me! I cannot express to you enough how much people want to help you and will help you if you only ask! You have the power to take your life back!\nAnd most importantly Resilience. Your body and mind are built from the ground up to stand up to anything! That is why humans are the top of the food chain! Survival of the fittest! Your mind is an extremely powerful instrument that can work against you but if you think about it works for you so much more! You are a strong powerful person and if you are reading this you have already taken the most important step and sought out help! So what are you waiting for! Get of the Internet and go take your life back!   ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My therapist told me two words to always remember! They changed my life!",
            "url": "http://www.reddit.com/r/Anxiety/comments/x570r/my_therapist_told_me_two_words_to_always_remember/"
        },
        {
            "author": "mauinion",
            "author_created_utc": 1323851626,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6fr09",
            "created_utc": 1343171257,
            "domain": "self.Anxiety",
            "edited": 1343191523,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x3lu4/my_personal_top_ten_tips_that_really_help_mid/",
            "id": "x3lu4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x3lu4/my_personal_top_ten_tips_that_really_help_mid/",
            "score": 46,
            "selftext": "I get panic attacks all the time, at first they were crippling, but now I have much better control. Here are my best tips on what to do in a panic attack.\n\n1. Make a phone call. Doesn't have to be long, but call someone who is not a friend. Maybe call a restaurant and ask their hours, or call your cell phone company and complain about something. \n\n2. Do a math equation in your head. If my wife notices that I am obviously having a panic attack, she will grab my hand and say 'honey, what is 35 times 17' not like I am rainman or anything, but this really helps. It takes just long enough for my brain to completely change gears.\n\n3. Take a huge breath, and hold it for 30 seconds, while flexing every muscle in your body. Also really helps if while you do this, you think about someone or something that really makes you angry. \n\n4. Diet and exercise. Caffeine has gotta go, also, get out and run until you think you will pass out, or ride a bike up a huge hill. I always feel much better, and this can give a lasting 24 hours of relief. \n\n5. Acupuncture. This helps relax you, and is amazing what a few needles poking at you can change in your mentality. \n\n6. Meditation. Every morning I wake up and pee, then go back into bed in the lotus position and try to meditate for at least 30 minutes. This really helps me keep steady all day. Seriously, google the science behind meditation, and learn it. Its your best tool.\n\n7. Stay away from Xanax. This is a temporary band-aid which over time will make it worse. Try some herbal remedies. \n\n8. Have a couple cocktails.  I find just 2-3 totally takes away the symptoms, and I can do whatever I want then. (don't drive drunk).\n\n9. Don' let your eyes wander around, and don't look at strangers. This can blow the top off of whatever control you thought you had. \n\n10. If you feel you need to bail, set a time limit. So, if I am really not doing well, and need to abort whatever I was doing, look at the time, and add 3 minutes. Say, I am going to abort if this doesn't get better in 3 minutes. Many times it will!\n\nGood luck!\n\nEdit: Here is a bonus tip: When you feel it coming on, try to keep your thoughts restricted to only what is happening in your immediate reality (every second stay in the present moment strictly), also try to keep your consciousness to encompass your whole body, instead of your brain. Then, when you know you have done that, write down what happened, what you did, and how it felt. Beating anxiety is way harder the quitting cigarettes or even cocaine. So, ring the whole army to the battle. But don't get lost in it. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My personal Top Ten Tips that really help, mid panic attack. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/x3lu4/my_personal_top_ten_tips_that_really_help_mid/"
        },
        {
            "author": "momof3spiritedboys",
            "author_created_utc": 1325865768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ljs6",
            "created_utc": 1342991176,
            "domain": "stop-anxiety-panic-attack.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wzchr/25_ways_to_decrease_anxiety/",
            "id": "wzchr",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wzchr/25_ways_to_decrease_anxiety/",
            "score": 43,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/bB2dqSSFJBRJ3nH9.jpg",
            "title": "25 ways to decrease anxiety",
            "url": "http://www.stop-anxiety-panic-attack.com/blog/25-ways-to-relieve-anxiety?utm_expid=5345035-1&amp;utm_referrer=http%3A%2F%2Fwww.google.com%2Furl%3Fsa%3Dt%26rct%3Dj%26q%3D%26esrc%3Ds%26source%3Dweb%26cd%3D1%26ved%3D0CGwQFjAA%26url%3Dhttp%253A%252F%252Fwww.stop-anxiety-panic-attack.com%252Fblog%252F25-ways-to-relieve-anxiety%26ei%3D12oMUPPhC8ji2gWr2Mkf%26usg%3DAFQjCNGh_TuEktU3eBL1gEEaH5peYVTrlA"
        },
        {
            "author": "Dymodeus",
            "author_created_utc": 1328275239,
            "author_flair_css_class": "",
            "author_flair_text": "Social anxiety",
            "author_fullname": "t2_6tuu4",
            "created_utc": 1343386433,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x8pzx/as_requested_beating_the_anxiety/",
            "id": "x8pzx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x8pzx/as_requested_beating_the_anxiety/",
            "score": 39,
            "selftext": "Someone said there were too many negative posts on this subreddit, and not enough positive stories. Therefore I'd like to share this with you all. A little background first.\n\nMy story begins in a land known to many of you, the land of social anxiety. Some 6 years ago (I was 16 at the time) I moved from my quiet little place with a lot of friends, even had some girlfriends (I was a cute kid), to this horrible land. Gradually it got worse, and while I was still in high school, all my friends went off to college and I was left behind, not really capable of making real friends. A year later I myself went to college, moving away and starting a life of my own. The first year was hell. I didn't go to classes, didn't make any exams, I don't even remember how I got through the day really. It was the blackest year in my whole life. I remember one time, I invited someone I knew from high school to my appartment, but once she was there, I had to send her away, because I felt like shit. I never spoke to her since, and I don't think I ever will... But that's a whole other story.\n\nDuring that year, I started going to the university's therapist. But that didn't help at all, so she sent me to the city's mental health institution (ggz) and I started therapy away from school, just before the summer holidays. We spent all summer preparing for the new year, and during that time, I had a sort of epiphany. I was determined to start the year well, at all cost. \n\nSo I met with a psychiatrist and we agreed that I would go all out on my medication the first few weeks (I was on 40mg citalopram, which was raised to 60, and I would take 0.5mg xanax every day). That was, looking back on it, probably one of the greatest weeks of my life. I was so proud of what I did. A new environment, new people, classes, I had it all. \n\nBut of course, it didn't end there. that was 2 years ago now, and I'm still fighting. It did help me get over that one hurdle, and now I'm improving my social skills. I'll never fully get rid of the anxiety, but I can remove it from my daily life. Only when I do something different, I get anxious.\n\nEnding on a high note from last week. For the first time in my life, I asked a girl out on a date. It was one of the toughest things I ever did. Unfortunately, she said no, but that didn't stop me from feeling very proud of myself.\n\nAnyway, I'm sorry for the rambling, it felt great writing this and I couldn't stop. I don't really care if anyone reads this, I feel great now. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "As requested: beating the anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/x8pzx/as_requested_beating_the_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343177194,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x3rvf/to_anyone_who_has_ever_feared_they_where_going/",
            "id": "x3rvf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x3rvf/to_anyone_who_has_ever_feared_they_where_going/",
            "score": 37,
            "selftext": "You are not. It is all in your head and you are not alone. Trust in reality and trust in the people around you. Reality is what it is... REAL.\n\n\nIf any of you out there are like me, and constantly fear that you are going to develop a strong mental illness because of these strange feelings that you've never felt before, or anything like that...\n\nI just came across this post, and I've never felt more understood in my life. \n\n\n\nhttp://ehealthforum.com/health/fear-of-going-crazy-disturbing-thoughts-t250731.html",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "To anyone who has ever feared they where going insane...",
            "url": "http://www.reddit.com/r/Anxiety/comments/x3rvf/to_anyone_who_has_ever_feared_they_where_going/"
        },
        {
            "author": "ella1993",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343020071,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x02tg/i_lost_it_at_work_tonight_and_made_a_fool_of/",
            "id": "x02tg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x02tg/i_lost_it_at_work_tonight_and_made_a_fool_of/",
            "score": 36,
            "selftext": "I was working a pick-up shift at work (a \"gentlemen friendly\" restaurant) tonight when one of my customers made a really innocent comment about my ass. By \"innocent\" I mean he was trying to be friendly/flirty, not perverted/insulting. It should have been nothing. It should have meant nothing. But as I walked back to the kitchen to place his table's order I suddenly found myself out of breath. In a bad way.\n\nI felt my pulse and it was hammering like crazy. I started to get dizzy. But as my therapist always says \"Fight it and remain calm\". So I placed the order and pretended everything was okay. I started to think about this one book I'm reading, trying to calm myself that way and separate my mind you know? But then I heard, or think I heard, another customer say \"Let's be nice to her.. all tits and no brains, not her fault\".\n\nTurns out the runner to that table brought out the wrong flavored wings (it's not her fault, she's new and still learning the table numbers). I apologized but I felt myself sweating. This one guy, probably in his early 20's I'd guess who might have been the one to make the earlier comment, smiled at me and said I should relax. I was obviously sweating. For a brief moment I started to take his advice due to his kind words but then he suddenly grabbed my butt as I turned to go back to the kitchen to fix their order.\n\nThat's when I totally lost it. I had a full blown attack right there in the middle of the bar room. \n\nI couldn't breathe at all. I grasped at my neck and dropped my pad and fell to my knees. Everything was spinning. I was so scared. I didn't lose consciousness but I kept thinking I would as one of the AMs and another waitress tried to help me up. The waitress, by the way, tugged at my shirt though I didn't realize it at the time.\n\nLater I found out that the shirt was torn. I'd been clawing at it so much during my attack that I exposed most of my bra by tearing at the well washed top.\n\nAfter I finally calmed down the AM told me I should go home. But he wouldn't let me drive. He doesn't know that I'm in treatment for anxiety disorder or anything like that and I'm worried he thinks I was on drugs or something. But I wasn't. I honestly wasn't. \n\nThings have been rough for me lately and my psychiatrist has been weaning me off of klonopin b/c she doesn't think it's been helping and she wants to try something else (I don't know what). So maybe that's part of it. But I wasn't drinking and I wasn't on drugs. But for a few minutes there I honestly thought I was going to die. And I lost it. Totally totally lost it.\n\nNow I don't know what to think.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I lost it at work tonight and made a fool of myself and I don't know what to do now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/x02tg/i_lost_it_at_work_tonight_and_made_a_fool_of/"
        },
        {
            "author": "TMDSB",
            "author_created_utc": 1318281716,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_60m6h",
            "created_utc": 1343362761,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x8c9e/has_anyone_beaten_this/",
            "id": "x8c9e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x8c9e/has_anyone_beaten_this/",
            "score": 29,
            "selftext": "Just found this sub today and, as a lifelong anxiety sufferer, it saddens me that the main impression I get of this sub is a pity party filled with ranting, memes, and other generally negative posts. Where is the advice, the progress reports, solutions, etc?\n\nIn my years of dealing with anxiety, I've found that the more you think about it, the more you focus on it, and the more you fight it, the worse it gets. I've found that yoga/meditation have worked wonders for me in helping me develop a more mindful worldview outside of the completely limiting, self-centric one that anxiety locks people into. It trains you to see things for what they are, instead of through a lens of fear. \n\nAnyway, what I wanted to know was have any anxiety-sufferers here conquered it to the point where they reasonably feel like they are getting the things they want out of life and are living up to their potential? For me, personally, I feel like I am not doing what I want in life, whatever I do is never good enough, and that I will never live up to my potential. It's one of my greatest fears, and it would help to hear from someone who has beaten it. For the vast majority of us, out of all friends, family, colleagues, etc it is very difficult to find people IRL to relate to the plight of people with anxiety.\n\nAlso I've been looking into getting some meds, like Xanax. What are people's experiences with it?\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone beaten this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/x8c9e/has_anyone_beaten_this/"
        },
        {
            "author": "tarabluh",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343430694,
            "domain": "autostraddle.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x9u48/ten_ways_to_reduce_stress_in_your_lifeits_a_nice/",
            "id": "x9u48",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x9u48/ten_ways_to_reduce_stress_in_your_lifeits_a_nice/",
            "score": 23,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Ten Ways to Reduce Stress in Your Life.(It's a nice list and a good read)",
            "url": "http://www.autostraddle.com/ten-ways-to-reduce-stress-in-your-life-142166/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343329664,
            "domain": "self.Anxiety",
            "edited": 1343355438,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x7dgk/time_to_debunk_our_fears/",
            "id": "x7dgk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x7dgk/time_to_debunk_our_fears/",
            "score": 20,
            "selftext": "I've been reading a self-help book on ACT (Acceptance and Commitment therapy) and it's been helping little by little. \n\nIn a nutshell, the book is about accepting your anxiety, and learning to cope with it. \n\n\nOne of the exercises in the book made you envision a picture of a yellow jeep, very vividly, and then put the book down for 5 minutes, and try very hard not to think of the yellow jeep. \n\n\nThe is very difficult to do, and within that 5 minutes, I thought of the yellow jeep multiple times, as the more you try to suppress something, the more it comes back to bite you. \n\n\n\nPerhaps if we all start sharing our fears and worries here, we will be able to stop obsessing over them so much?\n\n\n\n\n\nEDIT: I never knew how similar I Was to so many of you. I never listed my biggest fears and anxieties, so here goes...\n\n\n\n\n- Developing a serious mental disorder (Schizophrenia, psychosis, etc.)\n- Losing all touch with reality\n- That this all might be \"just a dream\" that I haven't yet woken up from.\n- Long trips to places I haven't been before.\n- Being in situations I can't control (somebody else driving, etc.)\n- Not being in control of my body (like under the influence of drugs)\n- Not feeling \"normal\"\n- feeling as if I'll never feel like I did before my bad weed experience... \n- My Hypochondria.\n- Feeling as if I'll pass out when I'm hungry or if it's really hot out\n- Fearing losing all control\n- When I think too hard about the world, the meaning of life, etc.\n\n\nSo let's hear it. What spirals you guys into panic and fear? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Time to debunk our fears.",
            "url": "http://www.reddit.com/r/Anxiety/comments/x7dgk/time_to_debunk_our_fears/"
        },
        {
            "author": "BreatheIntoBag",
            "author_created_utc": 1342185193,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8biqv",
            "created_utc": 1343160874,
            "domain": "breatheintothebag.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x3ae0/famous_people_with_agoraphobia/",
            "id": "x3ae0",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x3ae0/famous_people_with_agoraphobia/",
            "score": 18,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/TGlEk6Rngb8Su9li.jpg",
            "title": "Famous People with Agoraphobia",
            "url": "http://www.breatheintothebag.com/famous-people-with-agoraphobia/"
        },
        {
            "author": "T-away12654",
            "author_created_utc": 1342987653,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8eyoq",
            "created_utc": 1342989059,
            "domain": "self.Anxiety",
            "edited": 1343040322,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/wzakn/please_help_emotionally_abusive_relationship_cant/",
            "id": "wzakn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/wzakn/please_help_emotionally_abusive_relationship_cant/",
            "score": 18,
            "selftext": "I am in a long term (six year) relationship which has progressively become emotionally abusive over the last two years and has now hit an absolute limit for me. My partner has become increasingly obsessed with work, other friends, etc and I have slipped so far on the priority list that he constantly makes me feel like it is a chore for him to spend any time with me at all (for example, we spend about one hour a day together on average, and he is constantly telling me that I am too \"demanding\" of his time.. Sorry, but in a six year relationship I do not think that a few hours together a week is too much to want, in fact it is barely enough to keep a relationship going in my opinion). \n\nLast night we got into another huge fight (during which all sorts of past fights, some from more than two years ago, were brought up and re-argued, since we are completely incapable of fighting normally lately). He basically presented me with a list of demands for what HE wanted (never enquired what I needed from the relationship) and said \"if you can't deal with it, just leave\". At several points he said that he didn't care about my emotions, and went so far as to say \"well your feelings are crap\". At one point when I was trying to open up to him about my fear and anxiety I broke down and started to cry, and he immediately began yelling at me for crying and telling me to just \"deal with it\" (my anxiety and social problems).\n\nReddit, no one needs to tell me that this is a toxic relationship. That much is obvious to me. But my problem is that I have severe anxiety about leaving (possibly even greater than my fear of staying). I am living in a country where I literally don't have any social support network apart from my partner, his friends and family. If I leave, the reality is that I will have no one and nothing, and will struggle to support myself financially and probably fail to support myself emotionally. I have zero faith in my ability to cope here completely isolated, and I don't make new friends easily so I am desperately afraid that I will be completely alone forever. Even thinking about all of the consequences of leaving him as I type is, I am crying uncontrollably and having trouble breathing. I don't know what to do as there doesn't seem to be any option at all. I am desperate and am worried I might do something stupid.\n\nEdit: thank you to everyone who has replied so far. I feel completely alone most of the time and it just really means a lot to me that people I don't even know are willing to listen to me and help me. I guess I just got so used to never being able to express myself (as I don't have friends I can open up to and my partner just gets angry when I try to talk about anything emotional), so I assumed that help was completely unavailable. Knowing that there are people I can talk to (even if it's just on reddit) has given me the courage to make an appointment with a counsellor, to try to sort out my anxiety issues and the possibilities for moving forward. I honestly don't know how I went from being an independent young woman to this, but I am not happy. I just hope that I can find myself again through the mess that this relationship has turned me into.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Please help. Emotionally abusive relationship, can't cope woth staying OR leaving, breaking down",
            "url": "http://www.reddit.com/r/Anxiety/comments/wzakn/please_help_emotionally_abusive_relationship_cant/"
        },
        {
            "author": "whytofly",
            "author_created_utc": 1308858984,
            "author_flair_css_class": "test",
            "author_flair_text": null,
            "author_fullname": "t2_5f1wp",
            "created_utc": 1343366933,
            "domain": "reddit.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x8fr7/in_case_you_didnt_see_theres_a_thread_on/",
            "id": "x8fr7",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x8fr7/in_case_you_didnt_see_theres_a_thread_on/",
            "score": 17,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "In case you didn't see, there's a thread on r/askreddit about conversation starters for those of us with social anxiety who want some tips on what to say.",
            "url": "http://www.reddit.com/r/AskReddit/comments/x6quj/reddit_youre_at_a_dinnerpartybar_with_people_you/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343282014,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x6d2m/uncontrollableunexplainable_crying/",
            "id": "x6d2m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x6d2m/uncontrollableunexplainable_crying/",
            "score": 16,
            "selftext": "Anyone have tips on dealing with it? Because I honestly have no idea why I'm doing it. I was just browsing reddit on my phone trying to sleep when I started tearing up and feeling sad for no reason. :/ Would this qualify as an anxiety attack (sorry for asking)?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Uncontrollable/unexplainable crying?",
            "url": "http://www.reddit.com/r/Anxiety/comments/x6d2m/uncontrollableunexplainable_crying/"
        },
        {
            "author": "BreatheIntoBag",
            "author_created_utc": 1342185193,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8biqv",
            "created_utc": 1343222895,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x4oo1/does_other_peoples_anxiety_make_you_anxious/",
            "id": "x4oo1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x4oo1/does_other_peoples_anxiety_make_you_anxious/",
            "score": 16,
            "selftext": "I find that every time I run into a person who seems a bit on the anxious side, I start to get anxious, too.  Is this a healthy reaction or am I just being overly sensitive to other people's feelings and anxieties? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does Other People's Anxiety Make You Anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/x4oo1/does_other_peoples_anxiety_make_you_anxious/"
        },
        {
            "author": "milensk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343045179,
            "domain": "anxietyadventures.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x0g8v/image_social_anxiety_explained_2_making_mountains/",
            "id": "x0g8v",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x0g8v/image_social_anxiety_explained_2_making_mountains/",
            "score": 14,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/uNWMs7nHTrzrGlji.jpg",
            "title": "[IMAGE] Social Anxiety Explained #2: Making Mountains out of Molehills",
            "url": "http://anxietyadventures.wordpress.com/2012/07/23/social-anxiety-explained/"
        },
        {
            "author": "amorexmio",
            "author_created_utc": 1314335456,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qd0r",
            "created_utc": 1343028069,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x08bh/im_awake_its_320am_i_dont_see_sleeping_in_my/",
            "id": "x08bh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x08bh/im_awake_its_320am_i_dont_see_sleeping_in_my/",
            "score": 13,
            "selftext": "I've been here before with posts like this and always am too late when people comment. but I just have a lot on my mind and kind of just need someone to talk to that also might be awake. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm awake, it's 3:20AM. I don't see sleeping in my future either. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/x08bh/im_awake_its_320am_i_dont_see_sleeping_in_my/"
        },
        {
            "author": "Shadeofgray00",
            "author_created_utc": 1339539042,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7z6gm",
            "created_utc": 1343169138,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x3jmh/help_my_choking_anxiety_is_getting_the_best_of_me/",
            "id": "x3jmh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x3jmh/help_my_choking_anxiety_is_getting_the_best_of_me/",
            "score": 13,
            "selftext": "I have been dealing with this problem for about 2 years now on and off. (I have had GAD diagnosed for 7 years, so I know a lot about myself/symptoms). I'm very capable of feeling ok during the day (ignoring, allowing thoughts/fears to pass through me), but when it comes to eating/swallowing my body stops at the last second. It's worst in public, but even happens in private when I take my time. I recently lost 5 lbs last week. I can barely eat liquids. I have been on a mostly ensure diet for the past week or so. I am about to go to the food store to pick up food that is a mix of liquid, and some semi-solid food. I have tried pushing through the thoughts, but the more I try, the harder (more panicky/panic attacks) it is. It's really frustrating because I am actually functioning fine otherwise, but my work days are long (6 - 6 or 7 pm), and I need to be able to eat at work, which I've been avoiding. But this can't keep up forever. I can barely eat at my apartment alone very slowly, so I'm kind of lost. Any help or guidance is greatly appreciated. ESPECIALLY, if anyone could give me a list of good foods for me in this situation for the short-term because I know I need to push through the fears, but I really need to gain weight in the short term, because everyday i feel like i'm going to pass out. Thank you so very much for reading and I hope you all feel well.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[HELP] My choking anxiety is getting the best of me. I have a panic attack everytime I eat, sometimes causing me to vomit. I need short-term help finding a diet that will allow me to work, and a long-term plan.",
            "url": "http://www.reddit.com/r/Anxiety/comments/x3jmh/help_my_choking_anxiety_is_getting_the_best_of_me/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1343165344,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x3fdp/my_anxiety_centers_around_school_and_i_find_it/",
            "id": "x3fdp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x3fdp/my_anxiety_centers_around_school_and_i_find_it/",
            "score": 12,
            "selftext": "I'll start from the beginning. Before college, school came pretty easily to me. I hardly ever had to study but got As in almost everything. I test well, but I procrastinate on everything. I did the first few pages of a \"procrastination workbook\" with one therapist, and it said I had every type of procrastination except doing it to spite people (I hate being an inconvenience). In high school I would sometimes wait until the literal last minute to finish essays, and my breathing would be weird, my chest was tight, I would sweat, etc. I never connected that with a panic attack, but I guess it was.\n\nOn to college. My first year, I had a GPA around 3.0 (I needed a 3.5 for my big scholarship). I wasn't too worried about that, thinking I could just bring it up with summer classes at an easier school... But then I realized I would need 6 As to do it. I took six classes that summer and got 5 As and one B. I was so mad at myself. I did a great job in all of the classes (even the B), but I was just short of keeping that scholarship. I felt really guilty about my parents having to pay for me now.\n\nBack to college for my sophomore year. My grades were falling more as I continued my regular cycle of procrastination/panic. I dropped a class halfway through the semester and failed another. At the end of the year I was diagnosed with ADHD. My parents almost decided against letting me study abroad for the fall semester of my junior year, but I convinced them that I really needed it and the different environment would be good for me. It was - I was so happy there, and I got As and Bs.\n\nThen I came back for the spring semester of my junior year. My grades were terrible. Looking back now, I should have taken a year off then. Hindsight is 20/20.\n\nSenior year. Almost all of my friends were a year older than me, so they had graduated. I only had two close friends left, and both of them had different majors and very different extracurriculars, so we didn't see a lot of each other. I became depressed, and skipped a lot of classes. I just couldn't put forth the effort to get out of bed. I stopped participating in almost all of my clubs (some of which I had leadership positions in), because I felt guilty about having fun when I wasn't doing my schoolwork. I started going to the cafeteria at weird times so I wouldn't have to worry about seeing people I knew.\n\nI sometimes wouldn't answer the phone when my mom called because I was tired of inventing answers when she asked me what I'd been up to. She started freaking out, and I finally told her I was depressed. I got medication for it. In total I think the \"bad\" depression was less than a month.\n\nEven with all my failed classes, my good course planning meant I could have graduated in four years, if I just passed all my classes for the spring semester. Well... I failed them all. I'm finally taking that leave of absence for a year.\n\nBasically, college has been an endless cycle of failure, guilt, anxiety, depression, constantly lowering my expectations... And I still have to go back for that last semester. Today I had to send an email to my school to ask for a copy of some paperwork, and it took a few minutes of just staring at my screen before I felt calm enough to write the two-sentence message.\n\nI just want to be able to go back for my last semester and pass my classes. I want to stop beating myself up over the past, stop feeling guilty about the last four years. But whenever I go talk to someone about all this, I can't say it right. Somehow I never say what I mean to.\n\nTL;DR: College sucks. I need to figure out a way to get through my last semester and finally be free of this.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My anxiety centers around school, and I find it really hard to explain to a therapist. Help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/x3fdp/my_anxiety_centers_around_school_and_i_find_it/"
        },
        {
            "author": "Mantarok",
            "author_created_utc": 1340156119,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_81y91",
            "created_utc": 1343157393,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/x36i1/21_and_cant_makehate_the_idea_of_making_friends/",
            "id": "x36i1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/x36i1/21_and_cant_makehate_the_idea_of_making_friends/",
            "score": 12,
            "selftext": "Let me just first say that I have NO friends. Zero. I also just had my first child, so I feel I am even more isolated, and that maybe people wouldn't be interested in me enough to begin a friendship with me. \nI have a bunch of anxiety problems, and I'm also depressed as shit. \n\nAnyway,\nI recently went to an event in my city and was reminded of why I hate even just thinking about making friends. \nWhen I went I was eager and hopeful that I'd be \"confident\" and start talking to anyone who looked interesting/was near me.\n\nOnce I got there, I noticed it was full of people who seemed to be part of tightly knit groups already. The group was 17-23 years old (I pretty much know where all of these people are from/know most of their names at least) and in the age range that I'd like to make friends in. I talked to 2 people I already knew and remained quiet for the rest of the night.\n\nI'm just baffled...as I was looking around, I didn't like anyone. I couldn't help listening and observing some of them and thinking \"what a fucking tool, why god\" and not wanting to be friends with them.\nI realize this is WRONG. I snapped myself out of it. Yet I was/am still confused over how exactly to approach people I want to talk to or become friends with when they are standing in a circle of people they are already great friends with and talking excitedly about things they have all done together.\nAlso, when I do happen to talk to someone new, I feel like I'm the one pushing to be friends. I feel like they have enough friends and couldnt give a shit if they talk to me or not. I feel like I seem pathetic trying to clamor for friends and that they can tell and pass judgement on me over this.\n\nI've tried talking to people online as well. It's always the same. I'm asking all of the questions, initiating every conversation, and if I stop talking in a conversation, they won't start it back up again. \n\nYoung people seem so egotistical and like they are only into themselves and the people they've known already from school who are similar to them. I feel like I've outgrown this mentality and want to make friends with all types of different people. The events I am interested in in my area and that I have access to (art and music shows) mostly have this same group of 50-60 people (probably more, i cant count) in attendance. (young \"artists\" and musicians)....\n\nwhat am i doing wrong? i don't want to try incredibly hard just to get people to talk to me or be interested in me. i guess i am just really that boring?? does anyone else have a similar problem?\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "21 and can't make/hate the idea of making friends",
            "url": "http://www.reddit.com/r/Anxiety/comments/x36i1/21_and_cant_makehate_the_idea_of_making_friends/"
        }
    ]
}