{
    "data": [
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1340061069,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v8y12/just_a_typical_day_in_the_life_of_an_anxiety/",
            "id": "v8y12",
            "is_self": false,
            "media_embed": {},
            "num_comments": 44,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v8y12/just_a_typical_day_in_the_life_of_an_anxiety/",
            "score": 402,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Just a typical day in the life of an anxiety sufferer",
            "url": "http://i.imgur.com/trFma.png"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339775116,
            "domain": "self.Anxiety",
            "edited": 1339783430,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v3k89/for_the_first_time_in_years_feeling_in_control/",
            "id": "v3k89",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v3k89/for_the_first_time_in_years_feeling_in_control/",
            "score": 42,
            "selftext": "Hey, wanted to post something positive.\n\nI've been suffering from a pretty extreme anxiety disorder for the last four years, and for the last month I have been doing alright and it feels great. \n\nI have a summer job, just part time, but I'm waking up each morning, getting washed and dressed, eating breakfast, and leaving the house each day. They seem like such small accomplishments, but it's a huge improvement for me. \n\nIn the past I would go a week without leaving my house and then only be forced out when I ran out of food. I would spend all my time online just to pass the day and escape. But I have been able to go a whole week with no non-essential internet. \n\nI know I will have more stress when school starts up again, but I'm building up my confidence. I'm showing myself that I can live a normal life, I don't have to feel anxious all the time.\n\nI just wanted to share that with people who would understand. :)\n\nThank you for reading. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "For the first time in years, feeling in control",
            "url": "http://www.reddit.com/r/Anxiety/comments/v3k89/for_the_first_time_in_years_feeling_in_control/"
        },
        {
            "author": "xwtfmitch29x",
            "author_created_utc": 1300831396,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_4zwhh",
            "created_utc": 1340203204,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vbvol/rant_my_dad_was_declined_a_job_offer_because_the/",
            "id": "vbvol",
            "is_self": true,
            "media_embed": {},
            "num_comments": 59,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vbvol/rant_my_dad_was_declined_a_job_offer_because_the/",
            "score": 37,
            "selftext": "So my dad was fired from his job of 12 years last year because they wanted to lower salary and flush out the veteran employees. its total bullshit. they claimed \"lack of performance\" but we all know what's going on here. My dad has been on 2mg Klonopin 3 times a day for the last 20 years. This is not right. Anxiety is not taken seriously enough in main stream society and people like my dad get fucked for it. This pisses me off. I myself am on 1mg Ativan, and it just seems like everyone thinks that someone who is legitimately prescribed medication for an anxiety disorder is some kind of weirdo. if MY dad IS LEGALLY prescribed MEDICATION for a mental disorder, how can these people claim this????? PLEASE HELP ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] My dad was declined a job offer because the employer said his 2mg Klonopin prescription was \"too much for the work place\". Is this even legal?",
            "url": "http://www.reddit.com/r/Anxiety/comments/vbvol/rant_my_dad_was_declined_a_job_offer_because_the/"
        },
        {
            "author": "aerynjbson",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339746089,
            "domain": "self.Anxiety",
            "edited": 1339746332,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v34le/yay_celexa_is_working_far_better_than_my_previous/",
            "id": "v34le",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v34le/yay_celexa_is_working_far_better_than_my_previous/",
            "score": 28,
            "selftext": "I have been on celexa for about two weeks,I haven't chewed my nails in a week and I don't smoke cigs as much. Im  far more relaxed and I laugh alot more.\nI actually wanna go out, socialize and do things around people.\nMy SO even commented today that he was surprised that I wanted to go out and about today,( we went out and saw a movie yesterday, so Im guessing he was expecting me to hermit out for another couple weeks)\nIm feeling halfway alive again.\n\nI was on zoloft for about a year, then the last few months of being on it , it didn't really work.\nThen I got on celexa and within 2 weeks I feel better.\n\nI love drugs, they make it so I can live my life without being a basket case.\n\nIt's amazing.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Yay! Celexa is working far better than my previous \nmeds.",
            "url": "http://www.reddit.com/r/Anxiety/comments/v34le/yay_celexa_is_working_far_better_than_my_previous/"
        },
        {
            "author": "SituationDictates",
            "author_created_utc": 1340143117,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_81voj",
            "created_utc": 1340205025,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vbxbf/anyone_else_so_paranoid_of_subconscious_motives/",
            "id": "vbxbf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vbxbf/anyone_else_so_paranoid_of_subconscious_motives/",
            "score": 25,
            "selftext": "Basically I read the book \"Stumbling on Happiness\" which is based around our inability to predict what will make us happy due to our lack of awareness of subconscious motives and wants. I extended this concept to everything and I worry about why I'm about to say what I'm about to say, do what I'm about to do, and think what I'm thinking. I'm skeptical of my very existence. I struggle talking to my gf and friends for fear my subconscious motivation for what I'm about to say is malicious or hurtful in the benefit of my own ego. I don't think you have to read that book to think like this , that's just what sparked it for me. \nDoes anyone share similar feelings? How can you curb them? I'm so tired of second and third and fourth guessing every breath I take. \n\nTl:DR Extreme skepticism and paranoia of my own thoughts, words, and actions being malicious, hurtful and egotistical.  Thus causing inability to function.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else so paranoid of subconscious motives its hard to get through the day?",
            "url": "http://www.reddit.com/r/Anxiety/comments/vbxbf/anyone_else_so_paranoid_of_subconscious_motives/"
        },
        {
            "author": "MattBootyBulan",
            "author_created_utc": 1306027830,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_59nw0",
            "created_utc": 1340122942,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/va5be/well_tonights_my_high_school_graduation_and_im/",
            "id": "va5be",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/va5be/well_tonights_my_high_school_graduation_and_im/",
            "score": 24,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Well, tonight's my high school graduation and I'm nervous as all hell.  Wish me luck guys.",
            "url": "http://www.reddit.com/r/Anxiety/comments/va5be/well_tonights_my_high_school_graduation_and_im/"
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1339875763,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v5dvi/rant_do_any_of_you_like_myself_desperately_crave/",
            "id": "v5dvi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v5dvi/rant_do_any_of_you_like_myself_desperately_crave/",
            "score": 21,
            "selftext": "Hi everyone, although I have a lot I'd like to say, I'll try to keep this as short as possible.\n\nI grew up (probably like most of you) as a shy, introverted, and somewhat-awkward child. I got good grades, was in gifted programs, won awards for science fairs and various projects, never once got in trouble with anyone and was constantly told how I would go places. I always had strange phobias and fears, and after years of having weird stomach aches, racing thoughts, and et cetera, when I was in my Junior year of high school I was diagnosed with having General Anxiety Disorder and Panic Disorder.\n\nA few medications kept me going through school, until midway through my senior year I thought to myself 'I can't do this anymore'. School was complete nonsense for me at that point. My grades had slipped so bad that I lost all hope of a scholarship, and might have even failed the 12th grade. So I made the decision to sign myself out of the school system, and instead I got my GED through the local college in a month's time.\nDuring the next year I really didn't do anything except tell myself that I would apply to college as soon as I could. The local community college, as something to start off with and prep myself for an actual University. Semester after semester passed, and I kept telling myself that I'll apply next semester, or next summer, or winter, or next year. In the midst of all this I worked at a chain grocery store as a cashier, trying to save up as much money as I possibly could but not really going anywhere with it. The little that I did save up would either have to be put toward an unexpected bill, or our hours would get cut at work so it would dip back down. I pretty much had an average balance of 200 or so dollars at a time in my account.\n\nAround two or so years ago I had a massive string of panic attacks each time I would go into work. I called out sick a few days (which our new manager was furious about, despite previous knowledge of my condition). One day I had to leave early because my heart rate was going crazy and I felt like I just needed to leave ASAP. My manager told me if I left he didn't want me back as an employee, so I told him that's fine and walked out the door. That was the only 'real' job that I have ever had.\n\nSo, here I am now. I'm almost 22, and currently am 'working' as a self-employed freelance web designer and computer repairman. I got into web design after I left the grocery store because I thought there was money in it, and it was something that I could learn about/do in the safety of my own home. Now I've come to realize that this is something that I'm really miserable doing, and that doesn't even get me that much money in the first place. I'm currently averaging around 400/month, and am constantly searching reddit and various other sites to find work. My anxiety is a bit better, panic attacks are few and far between, and I'm not on any steady medication (I do have a prescription of xanax that's for as-needed use only). However, I just feel so absolutely stuck and useless.\n\nI have tons of useful (I think) talents, and a passion to learn, but I have nothing to use these towards. I can program in a variety of languages, I can build front and back ends of websites, I've developed several site projects on my own time. Even though the one that I'm currently working on I feel will fail just like all the others I've tried and be a waste of time as well. I had dreams of becoming a scientist, or an engineer, or a physicist, but with no money, and no education I really don't see that becoming a reality anytime soon. I used to have a good amount of friends that I would constantly hang out with, and no I rarely see anyone at all. The last two close friends that I started doing a large amount of drugs constantly, and wouldn't want to hang out unless I tried it with them, and I don't want to so I never see them.\n\nI used to be so good at work, and at school. When someone told me what they needed to get done and when, I was your man. I could learn anything necessary, and would pour effort into it. Now that I'm 'grown up' and have literally thousands of options of what to do next, I'm completely paralyzed. I take steps down one road or the other, trying to find out which option would be best for me, which would help me reach the goals that I want to reach the quickest and easiest. I just want to be happy, to be comfortable. I don't want to have to worry about not having any money to do anything anymore, I want to have a stable job, I want to travel, to live, and to experience things. I want to control my anxiety and get rid of my constant negative thoughts that whatever I'm doing at the present time is not good enough, and will just end up being a waste of time that could be spent doing something better. I have tried, started, and stopped so many hobbies, projects, sites, 'businesses', etc, it's ridiculous. Most people keep telling me that I need to apply for a job instead of trying to do something on my own, but I'm terrified that if I start another job I'll just have to quit from anxiety, like school and the jobs before. I have been thinking of volunteering though.\n\ntl;dr I just want direction. From friends, family, I'm tired of being cast adrift on my own merits. I just wish for some sort of guidance, for someone to tell me 'You need to do this, this, and this if you want to get started on becoming a scientist.' Sitting in front of my computer day in and day out has helped me relax and helped me to forget about the problems I normally have to face, but I would rather start being successful and contributing something to mankind. Anyone else with me?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] Do any of you, like myself, desperately crave direction?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v5dvi/rant_do_any_of_you_like_myself_desperately_crave/"
        },
        {
            "author": "BornWithCuriosity",
            "author_created_utc": 1323590791,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ezhw",
            "created_utc": 1339807968,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v4byf/how_do_you_all_deal_with_the_effects_of_anxiety/",
            "id": "v4byf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v4byf/how_do_you_all_deal_with_the_effects_of_anxiety/",
            "score": 21,
            "selftext": "I'm looking for some advice for relaxing and dealing with pain. I have general anxiety disorder. It's getting to the point where I have chest pain and feel numb even I don't feel anxious, which then triggers an anxiety attack from the original pain. It tends to feel tight, as if my chest itself is stressed and strained. Does anyone else have these what SEEMS physical problems without feeling anxious, especially the random chest pain? How do you deal with it? I'm only seventeen and I really am sick about genuinely worrying about heart attacks. This anxiety is taking over my life.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you all deal with the effects of anxiety, such as chest/body pain? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/v4byf/how_do_you_all_deal_with_the_effects_of_anxiety/"
        },
        {
            "author": "WildVariety",
            "author_created_utc": 1326432546,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6njzk",
            "created_utc": 1340142496,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vaojk/help_i_dont_think_i_can_cope_anymore_please_help/",
            "id": "vaojk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vaojk/help_i_dont_think_i_can_cope_anymore_please_help/",
            "score": 21,
            "selftext": "I have Panic Attacks. I had one at work last friday, i work nights &amp; i work alone. A drunk, violent customer at the store I work at caused it (I couldnt escape from it, so it made it so much worse). My familys reasoning is, I am 6ft 6, I shouldnt be having panic attacks, especially over 'silly' things like this. I made up some stupid excuse so i didn't have to go to work tonight, because i can't deal with it if he's there again. My nerves are frayed, i am constantly on edge and once again I am in a situation where i am almost afraid to leave the house. Redditors that suffer from panic attacks too, and have been in situations like this, please contact me, i need to speak to someone that understands. I might have lost my job because of this, and I'm currently sitting in my room, worrying over how my family will react if i have lost my job, and worrying about what my managers reaction is going to be tomorrow. \n\nI just read the page you have linked on Anxiety Disorders, and i think i have Panic Disorder with Agoraphobia. Though i've been to my Doctors several times about this, all she's ever done is referred me to therapy. Which did help, but i finished therapy roughly 2 months ago now. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] I don't think i can cope anymore, please help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/vaojk/help_i_dont_think_i_can_cope_anymore_please_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339823015,
            "domain": "self.Anxiety",
            "edited": 1339825403,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v4mkp/any_other_girls_have_anxiety_about_being_pregnant/",
            "id": "v4mkp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v4mkp/any_other_girls_have_anxiety_about_being_pregnant/",
            "score": 20,
            "selftext": "I have GAD and I'm paranoid about everything but the fact that I may be pregnant is constant even when  it's not rational or have any reason to back it up. It's starting to negatively affect my relationship.\nAny advice or suggestions? \n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Any other girls have anxiety about being pregnant?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v4mkp/any_other_girls_have_anxiety_about_being_pregnant/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339990744,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v7hw6/help_how_do_you_deal_with_all_the_emotions_that/",
            "id": "v7hw6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v7hw6/help_how_do_you_deal_with_all_the_emotions_that/",
            "score": 19,
            "selftext": "This is my first serious relationship and he's the first guy I've ever genuinely cared for. He's wonderful, I'm totally happy, and it's going well -- but I'm used to just feeling indifferent about whoever I'm dating so it's all incredibly overwhelming too.  \n\nIt's a goddamn wave of emotions which sends my anxiety through the roof. So, I try to keep my mind busy by running/lifting, reading, watching Doctor Who, and surrounding myself with people so I can shut off my thoughts. \n\nHow do you handle it? Or am I just weird? \n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] How do -you- deal with all the emotions that come with relationships?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v7hw6/help_how_do_you_deal_with_all_the_emotions_that/"
        },
        {
            "author": "miguelon",
            "author_created_utc": 1260549454,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3rmyx",
            "created_utc": 1340164822,
            "domain": "11points.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vb90b/just_gas_thats_what_we_anxiety_sufferers_refer_as/",
            "id": "vb90b",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vb90b/just_gas_thats_what_we_anxiety_sufferers_refer_as/",
            "score": 19,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/mED6nvjx0S7v4EvL.jpg",
            "title": "Just gas: that's what we anxiety \nsufferers refer as chest pain. From \nthe movie \"Idiocracy\".",
            "url": "http://www.11points.com/images/idiocracy/diseases.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339989212,
            "domain": "self.Anxiety",
            "edited": 1339991882,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v7gkk/does_day_after_drinking_cause_you_to_be_more/",
            "id": "v7gkk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v7gkk/does_day_after_drinking_cause_you_to_be_more/",
            "score": 17,
            "selftext": "I realize that I may use alcohol to make me more comfortable in social situations &amp; when those effects wear off its like the anxiety has been saved up &amp; is there still waiting for me. If I go out two nights in a row its like I have three days worth of anxiety at the end. Does anybody else have this problem?\n\nAlso when I have to run errands I freak out.... especially when standing in line somewhere &amp; people are behind me does anyone have advice?\n(I do not want to take medication. at all) \n\nEdit: I knew this was going to happen. Look, I am NOT here to debate my views on Xanax &amp; like drugs. I do not want to take them. end. of. story. Take it somewhere else if youre going probenzos &amp; want to glorify them. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does day after drinking cause you to be more anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v7gkk/does_day_after_drinking_cause_you_to_be_more/"
        },
        {
            "author": "capn_joe",
            "author_created_utc": 1326609782,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6o3fw",
            "created_utc": 1339868810,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v58ia/rant_i_feel_like_shit/",
            "id": "v58ia",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v58ia/rant_i_feel_like_shit/",
            "score": 17,
            "selftext": "I feel like shit. All the god damn time, and I'm absolutely sick of it. I wake up dizzy, my stomach is so cramped and knotty all the time I can't remember the last time I shit normally or didn't get reflux. I feel so fucking weird all day and disconnected. My vision is already bad enough without feeling like I'm in a dream and nothing looks right. The chest pain gets unbearable. I hear my heart, feel it pounding all day. I'm sick of the nervous lump in my throat, or the feeling I get like a bubble moving from my lungs out of my throat. \n\nI try to kick and scream, I try to breathe and be calm. I laugh at it, I sneak in the bathroom to breakdown. I get angry at myself, then I get angry at everyone else. I blame myself, then I blame everyone else. \n\nI'm starting to feel like if I don't try to take something, I'm gonna crash and burn. \n\nKeep fighting the fight. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] I feel like shit.",
            "url": "http://www.reddit.com/r/Anxiety/comments/v58ia/rant_i_feel_like_shit/"
        },
        {
            "author": "KellyGreen802",
            "author_created_utc": 1331594416,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_75md6",
            "created_utc": 1339906941,
            "domain": "self.Anxiety",
            "edited": 1339938513,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v60ul/asked_you_guys_for_advice_a_while_ago/",
            "id": "v60ul",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v60ul/asked_you_guys_for_advice_a_while_ago/",
            "score": 17,
            "selftext": "Told you how anxiety was affecting my work, at a job love doing, and I needed help. If I could find the original post I would link it, but alas I cannot. Just wanted to let everyone know, that your advice has done wonders! I am doing so much better! I am able to talk myself down from my own thought loop of panic, and concentrate on my work! Thank you all so very much!\n\nEdit: never saw that I could go to things I specifically posted (thanks for that did bit. Much easier than sifting through -every- thing I ever said or had said to me) so here is the original http://www.reddit.com/r/Anxiety/comments/t25qb/i_did_an_ask_reddit_and_ranxiety_was_suggested_i/",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Asked you guys for advice a while ago...",
            "url": "http://www.reddit.com/r/Anxiety/comments/v60ul/asked_you_guys_for_advice_a_while_ago/"
        },
        {
            "author": "SometimesRhymes",
            "author_created_utc": 1310632632,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ii5z",
            "created_utc": 1339953754,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v6mrv/i_want_to_go_to_my_doctor_but_it_feels_like_i/",
            "id": "v6mrv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v6mrv/i_want_to_go_to_my_doctor_but_it_feels_like_i/",
            "score": 16,
            "selftext": "I've had hypochondria for the past few months and every time I've thought I had some kind of problem I went to a walk-in doctor to check it out.  My anxiety hasn't really gotten better, and now it feels like I've got some kind of illness and I found a bump near my groin (could just be a vein or artery or something).  The problem is, I feel guilty about going in now, like I'm wasting his time.  Does anyone have any suggestions on how to beat this thing?  Or should I just go in?  Thanks :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I want to go to my doctor but it feels like I bother him too much.",
            "url": "http://www.reddit.com/r/Anxiety/comments/v6mrv/i_want_to_go_to_my_doctor_but_it_feels_like_i/"
        },
        {
            "author": "thejaymansplan",
            "author_created_utc": 1313436455,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5o8d6",
            "created_utc": 1339808022,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v4bzu/i_feel_like_my_anxiety_is_eating_me_alive_long/",
            "id": "v4bzu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v4bzu/i_feel_like_my_anxiety_is_eating_me_alive_long/",
            "score": 15,
            "selftext": "Well, I've noticed that I have developed very, very severe anxiety over the last couple months. I'm almost positive I have pinpointed exactly what has brought this about... when I was 10 years old my dad unexpectedly moved across the country to Oregon for about 4 years. I rarely talked to him in those 4 years. He moved back a few years ago and is trying to mend broken bridges and the like, but it still gets me... but what I think this is directly from is in March of this year I lost my great-grandmother. I was very close to her as she was my babysitter when I was younger, and she was an amazing woman. We saw her death coming from a mile away, but it did sting when she finally passed... that one, as devastating as it was, pales in comparison to the second death I experienced in March... about 2 weeks after my great-grandmother passed, my best friend died unexpectedly due to heart complications. We don't know exactly what yet, because the autopsy results have still not been delivered. But that one really hit me hard. I'm an only child so with no siblings he was the closest thing to a brother that I had. I have a girlfriend; she is nothing but absolutely amazing and has stood by my side through all of this. But lately I've been noticing I'm extremely paranoid about losing her... I don't know why. She hasn't done anything to make me feel this way, and she is more than faithful to me. It eats me alive day in and day out. After losing him, she is the only person I really associate with or talk to or really even spend time with. Even though I have basically figured out what it is, I still hate that I'm even feeling like this, but I don't know how to stop. I don't know what to do. I feel so lost and broken...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like my anxiety is eating me alive... (long)",
            "url": "http://www.reddit.com/r/Anxiety/comments/v4bzu/i_feel_like_my_anxiety_is_eating_me_alive_long/"
        },
        {
            "author": "TTTweak",
            "author_created_utc": 1327957946,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6sn6c",
            "created_utc": 1340237456,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vctid/help_me_ranxiety/",
            "id": "vctid",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vctid/help_me_ranxiety/",
            "score": 15,
            "selftext": "Hey everyone,\n\nI've been doing CBT for almost 3 months, which has helped immensely with the severity and frequency of my attacks.  Until today.  I woke up feeling fantastic until I stepped out of the house to go to work.  Today was unusually hot and humid where I live, but my workplace is climate controlled.  After being at work for an hour, I suddenly started feeling very faint, experienced tunnel vision, I felt like my feet were going to fall out from under me, and I started hyperventilating.  My co-workers gave me some water and cookies, and I took a short break.  I went to the bathroom and cried for about 10 minutes until I gathered myself and it actually made me feel a little better.  I survived the day, but made the mistake of googling what I experienced and scared the shit out of myself with what webmd and mayo clinic were saying.  I've had a full physical at my doctor with blood work/EKG done just last week, but I'm worried he may have missed something.  Help me r/anxiety, I've been under the control of panic attacks and anxiety for almost 6 months now.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Help me r/anxiety ",
            "url": "http://www.reddit.com/r/Anxiety/comments/vctid/help_me_ranxiety/"
        },
        {
            "author": "sternhoward",
            "author_created_utc": 1338231880,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7tyyh",
            "created_utc": 1340032795,
            "domain": "self.Anxiety",
            "edited": 1340407441,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v86gh/just_looking_for_some_kind_words_and_support/",
            "id": "v86gh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v86gh/just_looking_for_some_kind_words_and_support/",
            "score": 13,
            "selftext": "I'm sitting in the ER waiting for a bed to open up in the psychiatric unit.  I've been battling depression/PTSD for the last 10 years.   My whole 20s spent fighting and I feel like I have nothing to show for it.  I've been waking up at 3am for the past week shivering and severely agitated.  I really need this to work.\n\nUPDATE:  Just got out of the hospital today.  Wasn't allowed any internet access.  After a few days of trial and error with meds, turns out that just a little increase in my Zoloft was all it took to make me feel pretty much back to normal.  It was really wonderful to come home to all of your posts; I teared up a bit.  Thanks for taking the time to give a stranger a boost.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just looking for some kind words and support",
            "url": "http://www.reddit.com/r/Anxiety/comments/v86gh/just_looking_for_some_kind_words_and_support/"
        },
        {
            "author": "CptBoots",
            "author_created_utc": 1281229751,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_48ltm",
            "created_utc": 1340145444,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/varfa/combating_my_anxiety_creatively_atleast/",
            "id": "varfa",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/varfa/combating_my_anxiety_creatively_atleast/",
            "score": 13,
            "selftext": "I was talking to a girl on facebook, and we talk a lot it goes well. I wanted to invite her to get coffee with me. I typed out the message but I could not hit enter. My hand was kinda frozen... so I hit it with the other hand. Problem solved. Had to deal with being more forward than my mind wanted... but everything went as well as I expected. Females react to confidence which is sometimes really really impeded by anxiety. What helps me is to realize that most people around me do stupid things, and make stupid choices every moment of the day. I can afford to risk my neck sometimes. Infact if I do not, nothing will ever change. So I hit my hand like a motherfucker and I'm going on a coffee date tomorrow.\n\nKinda a rant, but I hope this helps.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Combating my anxiety creatively atleast...",
            "url": "http://www.reddit.com/r/Anxiety/comments/varfa/combating_my_anxiety_creatively_atleast/"
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1340247328,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vd2r7/how_are_you_doing_today_ranxiety/",
            "id": "vd2r7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vd2r7/how_are_you_doing_today_ranxiety/",
            "score": 13,
            "selftext": "Just curious as to how you all are doing. Relating to anxiety or not. \n\nMe? I'm okay. Still dealing with a bit of dizziness, anxiousness, and nausea, but feeling a bit better than last week. The weather the last few days has been complete shit though so all I feel like doing is laying around in bed. My friend also got hit with a wave of dizziness for no apparent reason, so now she thinks she has anxiety or something wrong with her. I'm also trying to find work, or at least something I can do through my computer to make money, so I can start seeing a proper therapist, getting some new glasses, and just buying some things that I desperately need. It's extremely hard so far, considering how absolutely anxious I've been about finding a job in the physical world. \n\nOn a better note though I'm starting up an old underground music site of mine. Working on the redesign tonight after completing a mockup of it yesterday. Have already started talking to a few people who want to help out and get us on the map. The site was starting to gain popularity after it came out, but fizzled away when my partner found a job. Things are looking up with it though, and I'm excited to get it back up. \n\nYour turn!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How are you doing today r/anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/vd2r7/how_are_you_doing_today_ranxiety/"
        },
        {
            "author": "bedtimeconfessions",
            "author_created_utc": 1249774556,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3kwca",
            "created_utc": 1340175578,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vbh79/how_do_you_deal_with_sitting_though_a_movie_in_a/",
            "id": "vbh79",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vbh79/how_do_you_deal_with_sitting_though_a_movie_in_a/",
            "score": 12,
            "selftext": "I have had a severe panic attack when I've gone to the theater and had to leap out of my chair and leave during the movie. Now each time I go, I'm scared I will have one again. I don't know how to relax during a simple movie. I start to feel my heartbeat against the seat cushion and become hyper vigilant very quickly each time and am worried that it will escalate. Are there any movie theater-focused tips you can give to help? Does anyone else have this problem in sitting still for 2+ hours?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you deal with sitting though a movie in a theater? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/vbh79/how_do_you_deal_with_sitting_though_a_movie_in_a/"
        },
        {
            "author": "Junefrost620",
            "author_created_utc": 1340184762,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8233p",
            "created_utc": 1340186313,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/vbm1y/anyone_else_have_trouble_moving_on_with_life/",
            "id": "vbm1y",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/vbm1y/anyone_else_have_trouble_moving_on_with_life/",
            "score": 11,
            "selftext": "I have in the past few months, for the most part, conquered OCD. It started with a full blown panic attack out of nowhere (minimal anxiety before this), and within 3 months was full blown OCD. It was a hellish year for me and something that i wouldnt wish on my worst enemy. \n\nBut I have been changed for the worst since.\n\nI have become ALOT more socially akward (wasnt to much of a problem before), to the point where i feel akward sometimes even with good friends. I have ruined relationships or have made some worse, simply because i just ignore people because i do not want to deal with them. I no longer have a real deep thought process and have a general dim view on life now. I have problems with self control like no other (food, marijuana, alcohol). I have a hard time keeping up with any responsibilities that involves my personal life, just a hard time taking care of myself in general. The list goes on and on.\n\nSo to anyone on reddit that has overcome a major anxiety disorder, how did you deal with life after (or during) your anxiety disorder?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else have trouble moving on with life after overcoming an anxiety disorder?",
            "url": "http://www.reddit.com/r/Anxiety/comments/vbm1y/anyone_else_have_trouble_moving_on_with_life/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339878015,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v5fqs/pulling_it_together_when_its_important_to_a_friend/",
            "id": "v5fqs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v5fqs/pulling_it_together_when_its_important_to_a_friend/",
            "score": 11,
            "selftext": "Tonight is my best friend's stag and doe party. I am in the wedding party, attendance is **mandatory**. \n\nIt's a much rowdier crowd than I'm used to, and everyone will be very very very intoxicated. I will not know very many people except for the bride and one other bridesmaid.  1. \n\nI don't drink, I don't smoke, and my anxiety is making it so that the one thing I don't want to do the most in the world right now is go to this damn party. \n\nI also feel terribly guilty for feeling this way. I am actually a pretty extroverted person, but I just prefer smaller groups and definitely don't like the mentality of most of the groom's binge drinking friends...\n\nRegardless I'm going to go, and I'm gonna plaster a smile on my face, breathe, and probably take some Ativan when I get there. \n\nAnyone else feel this way, ever? I feel so selfish!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Pulling it together when it's important to a friend?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v5fqs/pulling_it_together_when_its_important_to_a_friend/"
        },
        {
            "author": "avamava",
            "author_created_utc": 1328618239,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6v15w",
            "created_utc": 1340301755,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ve4lt/has_anyone_here_gotten_better_id_love_to_hear/",
            "id": "ve4lt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ve4lt/has_anyone_here_gotten_better_id_love_to_hear/",
            "score": 11,
            "selftext": "I have always had a really anxious temperament and have been seeing therapists and psychiatrists on and off for over a decade.  Lately, things in my life are going pretty well, but my husband and I have a bit of economic/career uncertainty and I am having a really hard time coping with overwhelming anxiety.\n\nI am currently seeing a therapist (cognitive behavioral therapist) and am going to see a new psychiatrist in early July.  I'm not on any medication except for the occasional xanax to manage my most acute symptoms, but I try to go sparingly with those.  I've been on a bunch of antidepressants (Prozac, Wellbutrin, some others I can't remember) but nothing specifically for the anxiety other than xanax or valium.\n\nI have tried progressive relaxation, breathing techniques, CBT, guided meditation... some seem to offer some temporary relief but either I'm not good enough at keeping up with it or it's just not enough.\n\nMy anxiety feels like a cloud just hovering over me about nothing specific, or it can manifest itself about any topic: my pets, my house, my career, etc, which I usually feed by relentless internet researching. My husband says if I ever get pregnant, he is going to take away the computer for nine months and beyond, because I just make myself that crazy.\n\nAll of this is to say that one of my biggest fears FEEDING my anxiety is worry that I will never feel normal.  I need some hope that I can get better, even if it's just a bit better.  I'm really open to trying anything and would love to hear what really worked for you (if it did).",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone here gotten better?  I'd love to hear from you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ve4lt/has_anyone_here_gotten_better_id_love_to_hear/"
        }
    ]
}