{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339163302,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/urjwd/a_bit_of_humour_for_those_in_here/",
            "id": "urjwd",
            "is_self": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/urjwd/a_bit_of_humour_for_those_in_here/",
            "score": 78,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "A bit of humour for those in here",
            "url": "http://imgur.com/8jCeN"
        },
        {
            "author": "SometimesRhymes",
            "author_created_utc": 1310632632,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ii5z",
            "created_utc": 1339263203,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/utduz/saw_this_on_rf7u12_thought_it_would_be_applicable/",
            "id": "utduz",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/utduz/saw_this_on_rf7u12_thought_it_would_be_applicable/",
            "score": 62,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ABiNs8_sAf28T8Pm.jpg",
            "title": "Saw this on r/f7u12, thought it would be applicable here too :)",
            "url": "http://i.imgur.com/wjhFD.png"
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1339697766,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v20l5/does_anybody_else_wake_up_in_the_morning_and/",
            "id": "v20l5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v20l5/does_anybody_else_wake_up_in_the_morning_and/",
            "score": 50,
            "selftext": "It's really hard to explain, but as soon as I wake up I up in the morning, my mind immediately begins reeling on it's own. It's like a ton of questions and passing thoughts hit me as soon as I gain a sliver of consciousness. Things like 'What are you going to do today?', 'Remember that thing that happened yesterday?', and just random thoughts about future and past things, things that usually have a history of making me nervous, anxious, or upset. Does anyone experience something similar to this? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else wake up in the morning and immediately start thinking about a large number of questions and thoughts?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v20l5/does_anybody_else_wake_up_in_the_morning_and/"
        },
        {
            "author": "abcd_z",
            "author_created_utc": 1315631740,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5tww6",
            "created_utc": 1339616992,
            "domain": "self.Anxiety",
            "edited": 1339617189,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v0cgq/lost_my_job_yesterday_anxietys_kicking_my_ass/",
            "id": "v0cgq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v0cgq/lost_my_job_yesterday_anxietys_kicking_my_ass/",
            "score": 36,
            "selftext": "I was working for 2 months at a good job, but I couldn't make it into work two different times, and one day I had a quiet panic attack in the middle of work.  It was a temp to hire, so they just let me go.  \n  \nI have enough money to last me about a month, maybe longer if I stiff my landlord on the rent.  In a worst-case scenario I can move in with a friend to save on rent money, but that's an absolute last-resort scenario.  \n  \nTo-do:  \n* Start [selling water bottles on the street](http://www.nevblog.com/bottled-water-experiment/).  This isn't enough to balance my debts, but it may slow the financial drain.  \n* Check to see if I can get on Social Security disability.  \n* Find out about a small business loan for a vending machine company I want to create. - create an excellent business plan, talk to bank employees.  \n  \n  \nOkay, this all sounds like awesome stuff to do.  Of course, with anxiety it's never that simple.  With my luck I'll only be able to get one small step done towards one of my goals this entire day.  It's better than nothing, but at that rate I'll be out of cash and still nowhere close to where I need to be.  \n  \nI just wish I could take more than just the smallest of steps in any given day without having a panic attack.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Lost my job yesterday, anxiety's kicking my ass.",
            "url": "http://www.reddit.com/r/Anxiety/comments/v0cgq/lost_my_job_yesterday_anxietys_kicking_my_ass/"
        },
        {
            "author": "lutheranian",
            "author_created_utc": 1302645466,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_53fh4",
            "created_utc": 1339535672,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uym5y/anxiety_upon_waking/",
            "id": "uym5y",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uym5y/anxiety_upon_waking/",
            "score": 34,
            "selftext": "Anyone else have any type of anxious feelings upon waking?  Mine is only after waking from a nap, and it's gotten to the point where I\"m afraid to take a nap because I don't want to feel like this.  It just happened again and it sucks.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety upon waking?",
            "url": "http://www.reddit.com/r/Anxiety/comments/uym5y/anxiety_upon_waking/"
        },
        {
            "author": "HeartJuniper",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339359403,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uv0f4/but_its_all_in_your_mind_jimi_hendrix_xpost_from/",
            "id": "uv0f4",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uv0f4/but_its_all_in_your_mind_jimi_hendrix_xpost_from/",
            "score": 33,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/Al8QpnjbsT3Ql2hg.jpg",
            "title": "\"But It's All In Your Mind...\" -- Jimi Hendrix [x-post from r/QuotesPorn]",
            "url": "http://i.imgur.com/Y8mUw.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339184385,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/us1rn/dae_have_a_hard_time_remembering_what_it_feels/",
            "id": "us1rn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/us1rn/dae_have_a_hard_time_remembering_what_it_feels/",
            "score": 33,
            "selftext": "I am currently struggling with a particularly bad anxious week and I am having a hard time seeing myself get out of it and feel \"normal\" again (my anxiety comes in waves, although it feels \"stuck\" this time). The more I think of it, I can't remember what it felt like to not be felling horribly anxious and afraid (\"normal\"). DAE experience this when having bad anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "DAE have a hard time remembering what it feels like to feel \"normal\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/us1rn/dae_have_a_hard_time_remembering_what_it_feels/"
        },
        {
            "author": "milensk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339341426,
            "domain": "anxietyadventures.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uun68/friends_are_important_im_just_bad_at_having_them/",
            "id": "uun68",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uun68/friends_are_important_im_just_bad_at_having_them/",
            "score": 23,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/n-4Vc0YIv55TizQi.jpg",
            "title": "Friends are Important, I'm Just Bad at Having Them",
            "url": "http://anxietyadventures.wordpress.com/2012/06/10/importance-of-a-support-system/"
        },
        {
            "author": "airspark2324",
            "author_created_utc": 1336856065,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7pd7g",
            "created_utc": 1339409562,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uvyde/help_anxiety_keeping_me_scared_to_do_anything/",
            "id": "uvyde",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uvyde/help_anxiety_keeping_me_scared_to_do_anything/",
            "score": 23,
            "selftext": "Somehow I ended up here after a long night of lurking and this reddit seems relevant to me, so thought I would make my first post. \n\nI find myself too scared to do almost anything these days, I'll look for any excuse to avoid leaving my room. Even things I'm passionate about I have a hard time focusing on and an even harder time forcing myself to do them. I have a lot of goals that I want to accomplish but I feel like I have an enormous weight on my shoulders that I just can't shake.\n\nTo give a little background I'm 21 years old and I've dealt with anxiety and depression for five years now. When I was 16 I went through some traumatic experiences and ended up severely depressed. When I turned 18 I got professional help and got myself a GED. Now i'm in college making good grades and happier than I've ever been before. The problem is my anxiety is sticking around as a bad reminder of those dark days and lately it's been getting worse. I want to push myself to accomplish my goals and truly reach what i'm capable of, but every time I try it's almost like an invisible wall stays my hand and keeps me from doing it. I'm currently seeing a therapist but I can't afford to see him as often as I would like and I find that in between visits i'm at my worst. Where do I go from here? I don't want all i've suffered through to be for nothing, I don't want to live a life where I'm scared to go out with my friends, I want to finally be rid of this.\n\nFor those of you with similar experiences, does this ever go away or is it something I need to adapt to and just accept.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[help] Anxiety keeping me scared to do anything productive.",
            "url": "http://www.reddit.com/r/Anxiety/comments/uvyde/help_anxiety_keeping_me_scared_to_do_anything/"
        },
        {
            "author": "redleif",
            "author_created_utc": 1219335413,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_381v9",
            "created_utc": 1339647643,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v14ph/anybody_that_has_recovered_from_social_anxiety/",
            "id": "v14ph",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v14ph/anybody_that_has_recovered_from_social_anxiety/",
            "score": 22,
            "selftext": "I am a very awkward person most of the time. I get better with time but a lot of time is needed for me to feel comfortable in my \"new\" surroundings. The time it takes for me to gain my comfort and confidence makes me feel like others will think I am acting because I have been so awkward for so long. Basically I try not to talk unless I have to which keeps me in my head thinking others probably notice. And when I do talk, I say some weird shit because I am always judging my every word. It is holding me back and I am just so tired of it because I know that I can turn this around. I just need the help. Any suggestoins? I am up for taking meds if need be. Just really need something. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anybody that has recovered from social anxiety want to share their secrets?...",
            "url": "http://www.reddit.com/r/Anxiety/comments/v14ph/anybody_that_has_recovered_from_social_anxiety/"
        },
        {
            "author": "nerdy_birdie10",
            "author_created_utc": 1329714682,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ywn4",
            "created_utc": 1339484429,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uxlc2/relaxing_the_only_thing_that_has_ever_helped/",
            "id": "uxlc2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uxlc2/relaxing_the_only_thing_that_has_ever_helped/",
            "score": 22,
            "selftext": "is marijuana. It keeps me from having panic attacks and calms me down when I am stressed or upset. It bring me down from a really frantic horrible state of mind and makes me functional. Smoking before doing my homework has improved my grades and kept me from dropping out of college. When I smoke I'm also a lot more patient. When I'm really frantic and I smoke just a little, I don't get confrontational or angry with people that don't deserve it like my parents or my friends. Marijuana has done a lot to improve the quality of my daily life.\nThe thing is, trees are the only thing that really work for me. I've tried prescription medications and they all give me really bad side effects and make me sick. Plus they make me hazy, so I can't concentrate on anything and usually end up going to sleep. My mom was addicted to Xanax for a long time, so on top of being really sensitive and reacting badly to these pills, I have anxiety about taking the pills because I have the gene for addiction on both sides of my family.\n\nThe reason I'm telling you this is not because I want everyone to chuck their pills and be stoned all day. I only smoke a small amount for anxiety relief (I smoke larger amounts recreationally) and really all it does it keep away the racing thoughts and constant worry. Its a delicate balance, if I smoke too much when I'm already feeling really down it just makes me unmotivated and I feel worse. If I just enough before I start to feel bad or panicky, it keeps me from spiraling and helps me to focus.\n\nI stopped smoking for a while (for several reasons) and found that within a day or two I was constantly panicked and couldn't get anything done. I was worrying about everything, things that didn't make sense to worry about, getting panic attacks about things that didn't matter. This is what my life had been every day before I found what worked for me, and I never want to go back there again. \n\nAnxiety is a mental illness, which means it can be treated, and more importantly, its NOT YOUR FAULT. Finding a solution to my anxiety and depression problems made me feel like myself again, happy and fulfilled and calm, when for YEARS I was sure that I would feel horrible for the rest of my life.\n\nMarijuana is what works for me. It might be what works for you. It might not be. It took a while for me to work with my therapist to figure out when and how much I should smoke to gain the right effects. I also smoke certain strains that I know help more than hinder me. \n\nJust keep pushing! Looking for an answer and knowing that a happy you is waiting just beneath all the worry, fear and sadness you may feel right now. Things will get better. As someone who was where many of you are a few months ago, I can tell you it sure as hell is worth the fight.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] The only thing that has ever helped me...hear me out...",
            "url": "http://www.reddit.com/r/Anxiety/comments/uxlc2/relaxing_the_only_thing_that_has_ever_helped/"
        },
        {
            "author": "enthusiasticlover",
            "author_created_utc": 1338732091,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7vw3w",
            "created_utc": 1339216014,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/usqxf/started_dating_a_guy_with_anxiety_need_advice/",
            "id": "usqxf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/usqxf/started_dating_a_guy_with_anxiety_need_advice/",
            "score": 20,
            "selftext": "I (38F) recently started dating a guy (also 38) with generalized anxiety disorder.  He's not currently on any medication, although he does acknowledge that it has helped in the past.\n\nI am looking for some advice as to how to be a good friend to him, in regards to his anxiety.  I want him to be himself and I accept him for who he is.  I want to help him in any way I can, while also recognizing that I am not a therapist.  Thus far, I have merely encouraged him to talk about what he wants to talk about and practiced my good listening skills.  \n\nI guess what I'm asking is the perspective of a person with anxiety -- what would be the ideal way for someone you're dating to respond when you share that you're having a particularly bad week with your anxiety?\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Started dating a guy with anxiety - need advice please",
            "url": "http://www.reddit.com/r/Anxiety/comments/usqxf/started_dating_a_guy_with_anxiety_need_advice/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339270201,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/utj9g/the_problem_with_having_gad_is/",
            "id": "utj9g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/utj9g/the_problem_with_having_gad_is/",
            "score": 18,
            "selftext": "That whenever you do actually calm down, you freak out because you aren't used to being calm and relaxed, and you go right back to being worried.\n\nThis is frustrating.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The problem with having GAD is....",
            "url": "http://www.reddit.com/r/Anxiety/comments/utj9g/the_problem_with_having_gad_is/"
        },
        {
            "author": "theloneranger2012",
            "author_created_utc": 1322817476,
            "author_flair_css_class": "",
            "author_flair_text": "Sertraline",
            "author_fullname": "t2_6cux7",
            "created_utc": 1339574375,
            "domain": "scientificamerican.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uzip1/ysk_what_causes_chest_pain_when_feelings_are_hurt/",
            "id": "uzip1",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uzip1/ysk_what_causes_chest_pain_when_feelings_are_hurt/",
            "score": 18,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/INHP64XoFFRZK9Qt.jpg",
            "title": "YSK What causes chest pain when feelings are hurt?: Scientific American (Clumpy linked to this on /r/askscience) So crosspost.",
            "url": "http://www.scientificamerican.com/article.cfm?id=what-causes-chest-pains"
        },
        {
            "author": "kebabulous",
            "author_created_utc": 1338907768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7wl44",
            "created_utc": 1339402775,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uvvuz/i_hate_doors/",
            "id": "uvvuz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uvvuz/i_hate_doors/",
            "score": 16,
            "selftext": "This is kind of a joke, but kind of a serious thing. I'm mostly just wondering if anyone shares my hatred for doors.\n\nI just hate opening doors and walking into rooms,\na) because they sometimes make loud noises which causes people to look at me, and\nb) because when the door is closed I can't tell who's in the room.\n\nIf I can't see into a room, I don't like to go into it, even if I know for sure that whatever/whoever I'm looking for is in it.\n\nI also don't like being at the front of a group of people and having to open a door. That pressure freaks me out. I always think I won't be able to open the door properly, and I'll have to try over and over, and it will be embarrassing and I'll be a nuisance to everyone behind me...\n\nAnyone else have door problems...?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I HATE DOORS.",
            "url": "http://www.reddit.com/r/Anxiety/comments/uvvuz/i_hate_doors/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339513211,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uy08m/please_help_i_just_want_to_disappear/",
            "id": "uy08m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uy08m/please_help_i_just_want_to_disappear/",
            "score": 16,
            "selftext": "I'm male, 31. I keep having paranoid thoughts about my wife with other men. I did the shitty thing of looking at her emails and she seems to have been flirting with a male model she's working with - she's a painter and will be spending the next few years working on paintings of him (from photographs she's taken) and his perfect body and I can't see her not falling in love with him while she does so. I've struggled with anorexia since I was a teenager and this is sending me into a spiral where I know I just can't compete.\n\nI can't stop thinking about death; how terrified I am of getting and looking old, how terrified I am of the moment of death when I'm an old man - it's in a loop in my head and I can't make it stop. I just lay awake all night trying not to cry and praying for anything to happen to take my mind off it all.\n\nIt's got to the point where when I'm driving I get tempted to crash my car to end it all in an instant. I don't avoid injury anymore; an accidental slip where I cut myself or bruise myself badly seems like the only way to take my mind off it all - that wonderful moment of excruciating pain where all that exists is the pain or the panic, but no thoughts of anything else.\n\nI keep crying all the time and I can't hide my sadness from anyone.\n\nI'm a director and I'm set to direct my first feature in a few weeks which is fully funded and all I can think of is how the script has turned from something I love into a pile of crap I wouldn't want my friends to see, because of all the studio interference - and I feel totally worthless and lost.\n\nI've got chronic pain in my hips which I can't hide anymore. I've been operated on and the hospitals say there's nothing that can be done.\n\nI've spoken with a doctor but she doesn't seem concerned. She's put me on 150mg trazodone (I started on 50, then 100).\n\nThe smallest thing triggers me off and I just can't escape myself.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Please help, I just want to disappear",
            "url": "http://www.reddit.com/r/Anxiety/comments/uy08m/please_help_i_just_want_to_disappear/"
        },
        {
            "author": "kidswillbeotters",
            "author_created_utc": 1337639655,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7rxc2",
            "created_utc": 1339469317,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ux9lb/how_do_you_cope_with_public_speaking/",
            "id": "ux9lb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ux9lb/how_do_you_cope_with_public_speaking/",
            "score": 16,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you cope with public speaking?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ux9lb/how_do_you_cope_with_public_speaking/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1339650490,
            "domain": "self.Anxiety",
            "edited": 1339650702,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v16xs/im_a_pathetic_human_being_with_no_drivers_license/",
            "id": "v16xs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v16xs/im_a_pathetic_human_being_with_no_drivers_license/",
            "score": 15,
            "selftext": "This is pathetic and sad. I know, you don't need to tell me. I don't really know what to do anymore about it so I'm asking here. I'm 23 years old and I don't have my drivers license, or temps, or anything. I'm scared to drive. I'm scared of freaking out behind the wheel, or making a stupid mistake like pressing the gas instead of the break, or killing someone, or being killed. I'm just scared. It's pathetic. Things the rest of the public have the easiest time doing I find impossible. One of my siblings is going to be 16 soon and the thought of them getting their license before me makes me sick.\n\nI don't know what to do to get over this fear. I have driven in parking lots, that's it. I'm too scared to get lessons, and my social anxiety doesn't help at all. \n\nNot to mention that's not even the worst of it. I've also never had a job before. Too scared to do that too. I have social anxiety and can't do shit. I'm bad at math. I have no self confidence. I'm scared of getting a job and then not being able to fall asleep the whole night (which happens when I have to set an alarm, used to happen when I was in school), and have to go to work on no sleep. I have no skills. I'm bad with strangers. I'm an awkward fuck.\n\nI don't know what to do anymore. I don't know how it got like this. I feel like the only person who feels this way. Everybody else is \"normal\" but I'm too scared of everything.\n\nI don't want therapy, I don't want to be on medication. I just want to stop being so scared of everything.\n\nWhat do I do? Any advice?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm a pathetic human being with no drivers license or job.",
            "url": "http://www.reddit.com/r/Anxiety/comments/v16xs/im_a_pathetic_human_being_with_no_drivers_license/"
        },
        {
            "author": "Quarkity",
            "author_created_utc": 1295395988,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4qpz6",
            "created_utc": 1339614186,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v09qc/physical_symptoms_are_too_painful_what_can_i_do/",
            "id": "v09qc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v09qc/physical_symptoms_are_too_painful_what_can_i_do/",
            "score": 15,
            "selftext": "My anxiety has gotten *a lot* better in terms of the mental aspect. I can logic and reason about my social anxiety, I can confront my anxiety about irrational fears and it eases my sanity and mind. I am thankful for this.\n\nBut the physical aspects are somehow worse, longer and more painful. All it took today was to imagine some hurtful scenario that has not happened, will not happen and has *no basis in reality.* Mentally, I could challenge it and realize \"That's just fear-mongering, I have no need to worry about that.\" (In the past those little thought devils would have me worrying about it for hours, days, months. But I was able to stop it today.) However, my body didn't get the memo. \n\nMy chest has been hurting for over an hour. My hands are shaking, my shoulders ache as if I've been lifting heavy weights. My legs feel like jelly. My heart rate has risen, not by as much as it *feels* like, but it's still above average right now if I count it. Mouth is dry and if I take a drink of water, I feel sick and it's difficult to swallow it. Stomach hurts, and I'm feeling nauseous. Haven't eaten today, and I'd like to, but I can't right now. My breathing is too quick, I'm trying to do deep breathing, but that only lasts for the moment. This feels so wrong, I know I'm making progress mentally, but physically, I feel much, much worse to the point where I'm a bit scared right now.\n\nIt's too much, this hasn't subsided yet. Sometimes this pain lasts for a few minutes, sometimes hours, sometimes it'll carry over until morning. My body feels like it's at war. This hurts, physically, more than it should. I have no idea what's wrong or how to help it.\n\nBeta blockers are just for blood pressure/heart right? What about just general pain? It's *everywhere*, mostly in my chest, arms and stomach. I'm not the biggest fan of medication as I often have averse side effects, but I want something for these physical symptoms. It is too much to handle. I know this is going to last all night, I know the rest of my day is going to be spent doubled over in pain. I want to just lay down and cry, it's not going away. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Physical symptoms are too painful. What can I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v09qc/physical_symptoms_are_too_painful_what_can_i_do/"
        },
        {
            "author": "themetz",
            "author_created_utc": 1321165409,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_68fsg",
            "created_utc": 1339444863,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uwnkv/can_we_go_yet_mind_dump/",
            "id": "uwnkv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uwnkv/can_we_go_yet_mind_dump/",
            "score": 15,
            "selftext": "I think I can sum up my anxiety by those four words- Can we go yet? \n\nAs a kid, I remember going places with my parents, friends, and relatives and being overcome by an intense disinterest in the activity we were doing. Maybe we had been shopping too long, driving too far, in the sun getting too hot, or whatever. I would start whining that I wanted to leave, to go home. I know most children experience this feeling. I hear kids asking their parents to go home all the time. From what I have seen with my nieces and nephews, they can handle the response of \"We will leave in a few minutes.\" When this would happen to me as a child, when I could not leave, I would start to feel sick to my stomach, to cry to myself, and become increasingly uncomfortable until I would experience an anxiety attack or until my parents would take me home. I never threw temper tantrums though; it was a very internalized thing and not a way to control others around me. Once i would get home, I would take me hours to calm down to normal. Once I was old enough to stay home alone, I all but ceased going on family outings.\n\nAt 36, I still remember the intensity of that feeling of wanting to go *away*. I don't know why I made the connection today between the way my anxiety feels as an adult and that type of anxiety I felt as a kid, but the more I think about it, the more I realize that symptomatically and cognitively they are very similar. \n\nWhen I feel panic/anxiety coming on, I Immediately want to stop what I am doing and leave from where I am. Just go somewhere else. This even happens when I am at home. Usually the desired destination is home, my safe place. So when I have panic/anxiety at home, it is doubly intense. I am the type of person who cannot go on vacations because of the fear of panic attacks. What is that except for a manifestation of me asking \"Can we go yet?\" and getting a big fat \"NO\" for an answer? I also must be the person driving. I simply cannot stand to be a passenger in a vehicle. Again, that would imply a \"NO\" to my anxiety's plea to flee. I cannot work full time because I can't handle being out of a safe zone so long and being required to ask for permission to leave. \n\nWhat does this all mean and what do I do with it? Is it an indication that i suffered from an anxiety disorder starting at a young age? Did all the times that I could not escape an uncomfortable situation as a child build up and form an anxiety disorder? Does this mean that something really bad happened to me as a kid that I can't remember? Is recognizing this even useful in helping me overcome my anxiety and living a normal life where I can go on vacations, let someone else drive, give up the control of maybe not being able to get home if panic strikes? \n\nThanks for reading if you made it this far. I would be interested to hear if anyone else had these kinds of experiences as a child.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Can we go yet? [Mind Dump]",
            "url": "http://www.reddit.com/r/Anxiety/comments/uwnkv/can_we_go_yet_mind_dump/"
        },
        {
            "author": "PatrckBateman",
            "author_created_utc": 1319268768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_63e4s",
            "created_utc": 1339476143,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uxfje/it_takes_too_much_work_to_be_happy_after_thirteen/",
            "id": "uxfje",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uxfje/it_takes_too_much_work_to_be_happy_after_thirteen/",
            "score": 15,
            "selftext": "I have spent so many years unhappy with myself thinking I should accomplish more. Suddenly, I landed a good job. I have been working as a medical biller for the last two and a half years.\n\nI make enough to live my life and also buy some luxury items but when I tell people what I do, they act like it's beneath me.\n\nI never aspired for great things, I want to be left to my business most of the time. Why the fuck is everyone so demanding of you to achieve greatness?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "It takes TOO much work to be happy. After thirteen years of anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/uxfje/it_takes_too_much_work_to_be_happy_after_thirteen/"
        },
        {
            "author": "LTJ889",
            "author_created_utc": 1282598555,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_49vvk",
            "created_utc": 1339603804,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uzzlh/does_anyone_else_feel_trapped_in_some_places_and/",
            "id": "uzzlh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uzzlh/does_anyone_else_feel_trapped_in_some_places_and/",
            "score": 14,
            "selftext": "Hi :) I am slightly freaking out here. I have general anxiety and social. But recently I've become more anxious in situations that I can't easily get out of, for example, classroom, cinema, bus, plane, meeting, train, waiting room. I avoid things like this now but I have a 12 hour flight this weekend, and I can't avoid classes and things. I am attending a clinic and stuff but I don't have a meeting before the flight and I'd like to hear from people who know what it feels like? Please help..thanks :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel trapped in some places and what do you do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/uzzlh/does_anyone_else_feel_trapped_in_some_places_and/"
        },
        {
            "author": "KnittedOwl",
            "author_created_utc": 1339043266,
            "author_flair_css_class": "",
            "author_flair_text": "Generalized Anxiety Disorder",
            "author_fullname": "t2_7x8mh",
            "created_utc": 1339557400,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uz6f1/help_anxiety_over_wether_or_not_to_report_my/",
            "id": "uz6f1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uz6f1/help_anxiety_over_wether_or_not_to_report_my/",
            "score": 14,
            "selftext": "Basically I'm transferring to real college in the spring. Now, I can report myself as having mental illnesses which I have which would give me some advantages that I could use probably. But I feel that if I do report it, people are going to judge me. The main advantage for me is in housing. I need a single room when getting a dorm and well this is harder to do. I don't know if it's worth it. I also would make sure I have a psychatrist from school check in on me periodically but I don't know if I want that either. I'm really in a whole mess of what to do. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Anxiety over wether or not to report my \"mental illness\" as a disability to my college",
            "url": "http://www.reddit.com/r/Anxiety/comments/uz6f1/help_anxiety_over_wether_or_not_to_report_my/"
        },
        {
            "author": "areohbeewhyin",
            "author_created_utc": 1320249714,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_65yw5",
            "created_utc": 1339386130,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/uvlts/paranoid_and_anxious_about_my_relationships/",
            "id": "uvlts",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/uvlts/paranoid_and_anxious_about_my_relationships/",
            "score": 13,
            "selftext": "I know this is a common theme with those of us who suffer with anxiety, but it seems to be getting worse lately. I pretty much operate under the suspicion that everyone hates me. \n\nIt starts with the simplest things. It could be someone's tone of voice, or a fleeting look of confusion or disapproval that absolutely sets me off. I will leave and obsess over it for days. I'm scared to talk to people because I don't want to give them more reasons to hate me. I always second guess myself when I speak. \n\nMy anxiety usually takes the form of an impending sense of doom. I become restless and feel as though something horrible is going to happen. Sometimes my heart feels like it's going to explode out of my chest.  I also have obsessive thoughts. I can't stop thinking things like \"you should be embarrassed of yourself\", or \"I hate myself\". I just feel overcome by shame over the stupidest things.\n\nLike, okay. This morning, as I was leaving church, I complimented the pastor on his sermon. He thanked me. That was the extent of our conversation. I don't know him well- we've only spoken a couple of times. He is a very nice man. So why do I think I saw a flash of annoyance in his eyes? I just felt so embarrassed of myself, like I shouldn't have said anything. He didn't do anything wrong, I'm sure he was genuinely appreciative. What is wrong with me? Why can't I trust people to be honest about the way the feel about me? Why do I care if they think I'm annoying or stupid?\n\nI just assume that people think very lowly of me. Even the ones who are closest to me. When people compliment me I think they're lying or making fun of me. I have a hard time talking to people about it. I confessed this to one of my closest friends recently, and he was very reassuring that he cared about me a lot. I believe him logically, but why don't I FEEL like it's true?\n\n\nAnyways, any thoughts or advice is welcome. I've never taken any medication for anxiety but it seems to become more of an option every day...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Paranoid and anxious about my relationships",
            "url": "http://www.reddit.com/r/Anxiety/comments/uvlts/paranoid_and_anxious_about_my_relationships/"
        },
        {
            "author": "i8afisch",
            "author_created_utc": 1316572960,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wb2j",
            "created_utc": 1339653196,
            "domain": "self.Anxiety",
            "edited": 1339711704,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/v18un/my_so_is_fed_up_with_me_not_being_able_to/",
            "id": "v18un",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/v18un/my_so_is_fed_up_with_me_not_being_able_to/",
            "score": 13,
            "selftext": "\nEDIT 1: I just wanted to thank everyone who has helped me thus far. It's been less than 24 hours and I have already received so much support. You are a wonderful group of people and wish you all well. Thanks again!\n\n\nI don't know where else to turn at the moment. My SO had a rough year with his  anxiety, resulting in a rocky time for the two of us. Over the past few months I've been there for him literally 24/7, doing whatever I can to help alleviate his symptoms, panic attacks, etc. and for a while it seemed to have been helping.\n\nLately, he hasn't been going to therapy or to class and is either staying up until 8AM playing games or wanting me to drive him around until he feels some relief. He doesn't want to watch tv, but he wants to be entertained. He doesn't want to go outside, but he doesn't want to stay cooped up indoors. He wants me to talk to him, but he doesn't like anything I have to say.\n\nI feel like I can't win. He is obviously at his breaking point with literally anything and everything. He's been shouting at me if I make even the slightest mistake and breaking things out of frustration. I try to do whatever he says, but nothing is making him happy.\n\nDoes anyone have any advice? He's been having so many unfortunate circumstances piling up on him and I'm at a loss here. I don't want to keep making life harder on the both of us by not knowing what I can do to help him.\n\ntl;dr : My boyfriend is having terrible anxiety control issues, leading to spouts of anger, aggression and avoidance of responsibilities. What can I do to help him through this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My SO is fed up with me not being able to understand his anxiety. What can I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/v18un/my_so_is_fed_up_with_me_not_being_able_to/"
        }
    ]
}