{
    "data": [
        {
            "author": "Captain_Porque",
            "author_created_utc": 1321757910,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_69yjp",
            "created_utc": 1331153974,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qm906/results_of_the_ranxiety_survey/",
            "id": "qm906",
            "is_self": false,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qm906/results_of_the_ranxiety_survey/",
            "score": 104,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/XhOh7Ni7XqNRIQKE.jpg",
            "title": "Results of the r/anxiety survey",
            "url": "http://i.imgur.com/CPb6p.png"
        },
        {
            "author": "keepingscore",
            "author_created_utc": 1287580359,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4g2as",
            "created_utc": 1331224157,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qngrh/i_love_you_all/",
            "id": "qngrh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qngrh/i_love_you_all/",
            "score": 96,
            "selftext": "I am so thankful to have a community of fellow anxiety/panic suffers. You all are awesome. I am glad you are here sharing your symptoms, problems and triumphs. Thanks for being a part of my life.\n\nI also want to pass on a message... Everything is going to be okay. When I was younger all I wanted more than anything was for someone to tell me that. As I got older I realized that no one was going to come and tell me that. More importantly I didn't have to wait, I could tell myself this. So, don't wait tell yourself everyday that everything is going to be okay. And try to truly believe it.\n\n**Everything is going to be okay.**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I love you all.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qngrh/i_love_you_all/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331481077,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qrl0w/we_need_more_successes_around_here_i_went_to_a/",
            "id": "qrl0w",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qrl0w/we_need_more_successes_around_here_i_went_to_a/",
            "score": 61,
            "selftext": "I posted [this \"wish me luck\"](http://www.reddit.com/r/Anxiety/comments/qn7ff/wish_me_luck/) thread a few days ago and just wanted to update everyone and say that I was fine!\n\n I knew I was going to be fine, but I didn't have a full blown panic attack. A little bit of anxiety here and there, but I consider it a success!\n\nWhytofly: 1\n\nAnxiety: 0 (Technically it has more than this, but lets just say 0 =))",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "We need more successes around here! I Went to a conference and stayed overnight two nights with no panic attack!",
            "url": "http://www.reddit.com/r/Anxiety/comments/qrl0w/we_need_more_successes_around_here_i_went_to_a/"
        },
        {
            "author": "defendor71",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331327257,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qpebg/so_my_doctor_prescribed_me_klonopin/",
            "id": "qpebg",
            "is_self": false,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qpebg/so_my_doctor_prescribed_me_klonopin/",
            "score": 37,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/eCi21Rpk7nHTXSZ1.jpg",
            "title": "So my doctor prescribed me Klonopin...",
            "url": "http://i.imgur.com/SJIlt.png"
        },
        {
            "author": "dweckl",
            "author_created_utc": 1253638522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3n51i",
            "created_utc": 1331350395,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qputr/thought_i_would_share_my_anxiety_story_im_a_38/",
            "id": "qputr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qputr/thought_i_would_share_my_anxiety_story_im_a_38/",
            "score": 23,
            "selftext": "...father of two.  My son is about 3 and his new daughter is 4 months.  I've been married 4 years and have a great career that keeps me busy.  \n\nOn a day-to-day-basis, I would say my anxiety is anywhere from 0-2, with occasional flare ups.  I don't really get anxious about meeting people anymore, I don't get nervous about speaking or presenting in public, and even serious issues cause me to think analytically and not react emotionally. \n\n20 years ago I had significant **Generalized Anxiety Disorder.**  But back then it had no name; restlessness is what I termed it.  Particularly in the morning, when I would wake up with my heart racing concerned that I had to get up and get things done.  \n\nAfter college, I worked my first job constantly anxious as I sat at my desk.  I was \"shifty\" and \"fidgety,\" as my body reacted to the chemicals my nervous brain fired out.  I would sometimes wake in the night and shift for hours, tired in the head but racing in the body. \n\nI tried **traditional psychotherapy** for years.  There's a veritable collective of psychoanalysts who could write my biography, and none helped me with my anxiety in the slightest.  I tried EMDR, hypnosis, massage, yoga, and other approaches to try and cure my anxiety.  The best I experienced was very short-term relief.  I suppose this is why anxious people literally can spend decades in traditional psychotherapy.  \n\n**Then, I discovered it.** I had this friend 10 years ago, a really smart, great guy who would cave under the weight of any size stressor.  He had the only \"nervous breakdown\" I've ever witnessed, and submitted to an out-patient treatment program after being hospitalized for a week.  \n\nIn that treatment program, my friend learned **Rational Emotive Behavior Therapy.** That's all I knew: the name, nothing more.  He came out of a few-week long program (2-4, can't remember) a changed man.  His mind was able to address potential stressors and keep things in balance. \n\nI took to the Internet to learn about REBT.  I looked on Pubmed and other sites, and learned that REBT was the precursor, to a degree, of what is now known as **Cognitive Behavioral Therapy.** I knew nothing about its approach; I knew only that more and more studies were establishing its effectiveness for treating - even curing - certain anxiety and depression disorders. \n\nI found a guy at a major teaching university and started going.  The very first session, which I would compare in my world to finding Jesus, went like this: \n\nME:  Every day I am anxious. \n\nHIM:  About? \n\nME:  Work, I think. \n\nHIM:  What are you thinking about at work? \n\nME:  I have thoughts that I **cannot** get my work done, and I have **too much to do,** and I'm **going to mess something up,** and **I am overwhelmed.**\n\nHIM:  In the 4 years you have been doing your job, tell me exactly how many times you:  **could not** get work done, had **too much** to do such that you did not get the work done, **messed something up,** or were so **overwhelmed** you could not function? \n\nME:  (thinking for a few minutes).  None. \n\nHIM:  Does it strike a chord in you to know that you literally have been lying to yourself every day at work?  That these things you tell yourself \"will, are going to, must, shall, and were likely to\" happen have never happened?  \n\nI realized that the cause of my anxiety was my thoughts.  My specific thoughts.  \n\nI read and read and worked diligently at CBT exercises.  I became very good at locating, analyzing, and defeating many thoughts I have had for years that have caused anxiety and other problems in my life.  \n\nIn order to improve my interpersonal relationships, I also got a book on couples CBT and a lot of material - surprisingly - on pick-up artists and social theory.  I'm very happily married and love my wife, but learning about how people attract each other has a positive impact on non-sexual relationships, as well.  There is a core to pick up artists that teaches the foundation of success and good relationships: confidence, belief in yourself, composure, addressing self-defeating beliefs, and communicating on deeper levels. \n\nI have previously made a few posts about the approach I'm very familiar with and my interest in helping others learn it and apply it.  Would love to help or answer any questions. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thought I would share my anxiety story.  I'm a 38 year-old man...",
            "url": "http://www.reddit.com/r/Anxiety/comments/qputr/thought_i_would_share_my_anxiety_story_im_a_38/"
        },
        {
            "author": "demaney",
            "author_created_utc": 1310967958,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5j490",
            "created_utc": 1331155651,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qmae5/mlpfim_fluttershy/",
            "id": "qmae5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qmae5/mlpfim_fluttershy/",
            "score": 22,
            "selftext": "Does anyone else here relate to Fluttershy? She's scared of everything, but she has good friends that help her. When she needs to, she can overcome her fears. It might sound sad, but she's kind of inspiring and encouraging to me.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "MLP:FiM Fluttershy",
            "url": "http://www.reddit.com/r/Anxiety/comments/qmae5/mlpfim_fluttershy/"
        },
        {
            "author": "arieleislittle",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331573491,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qt5cj/to_go_on_meds_or_to_not_go_on_meds/",
            "id": "qt5cj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 75,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qt5cj/to_go_on_meds_or_to_not_go_on_meds/",
            "score": 21,
            "selftext": "Well, my anxiety/depression is pretty bad. Pretty debilitating.\n\nPros of going on medication:\n-It fixes the problem\n-Maybe I really need it\n-The reason why they invented medication is to help people like me\n\nCons of going on medication:\n-Dependent on them for the rest of my life?\n-It's just a quick fix\n-I'll be an unemotional zombie\n-There is a chance they could make the disorder worse\n\nHere's my dilemma, Reddit:\nDo I go on medication and accept that I need them forever?\nOr, do I work through it by myself and learn how to deal with my issues and come out as a stronger person in the end?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "To go on meds, or to not go on meds?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qt5cj/to_go_on_meds_or_to_not_go_on_meds/"
        },
        {
            "author": "dweckl",
            "author_created_utc": 1253638522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3n51i",
            "created_utc": 1331695765,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qvn14/some_insight_into_the_anxious_brain_and_the/",
            "id": "qvn14",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qvn14/some_insight_into_the_anxious_brain_and_the/",
            "score": 19,
            "selftext": "If you start thinking of your mind as containing \"layers,\" you can start applying principles of **Cognitive Behavioral Therapy** and **Mindfulness.**  (you can search for scientific articles at http://www.ncbi.nlm.nih.gov/pubmed?term=cognitive%20behavioral%20therapy)\n\n At their core, both approaches theorize that your **emotions are caused by your thoughts.**  In other words, the reason you feel sad, anxious, angry, frustrated, guilty, embarrassed, etc., is because you have certain negative thoughts that are commonly associated with these specific emotions.  \n\nThe negative thoughts that cause negative emotions commonly pass through our minds extremely quickly and repeatedly, without our being fully aware of them.  For example, if you were in class and the teacher told you that you were the first to give your presentation that day, your stomach might drop and the adrenaline would pump.  At the semi-conscious level, you would be thinking things like \"I'm not ready,\" or \"I'm going to mess up,\" or \"I hate speaking in front of people,\" or \"I'm going to look like an idiot.\" \n\nThese types of thoughts bounce in our heads all day long (and at night, when we're trying to sleep).  Is it any wonder anxious people cannot sleep when their brains are repeatedly telling them that they are going to be failures, or alone forever, or embarrassed in public if they leave the house tomorrow?  \n\nThe key to ending anxiety is to understand how your brain works.  Your intellect, consciousness, and reasoning skills evolved well after your ability to run, fight, perceive danger, and react thoughtlessly in order to survive.  Your intellectual brain does not have the ability to logically analyze thoughts of danger - you literally cannot just do it without learning how.  \n\nFor example, if you have thoughts that people \"are going to laugh at you\" if you try to be social, your upper brain cannot just 'reason' those thoughts away.  What happens instead is that your brain asks the **wrong kinds of questions** in response, such as \"I shouldn't be anxious like this\" or \"This is embarrasing to be anxious like this** or **There is something wrong with me for acting like this.**  As you can imagine, these conscious thoughts serve only to increase your negative emotions and cause more anxiety!\n\nHere is how Cognitive Behavioral Therapy and Mindfulness approach the problem with your brain reacting emotionally to automatic, semi-conscious thoughts:  \n\nCognitive Behavioral Therapy teaches you to identify those thoughts, put them into words, list them out on paper, and then, when your upper brain has a chance to review them fully, only then do you analyze those thoughts and eventually learn that they are false, exaggerated, unsupported by facts, or have some other distorted, irrational portion. \n\nSimilarly, Mindfulness teaches you to identify the same thoughts, but instead of trying to analyze them and lend them little weight because you realize those thoughts are false, you learn to separate your emotional reactions from thoughts.  You learn to accept thoughts as merely 'thoughts,' nothing more, and you maintain your conscious focus on the real world that you are perceiving here and now.  \n\nImportantly - **neither of these methods requires you to fight your thoughts.**  In fact, that appears to be a mistake that just causes more anxiety.  You can't consciously fight these thoughts.  You have to learn to destroy them logically through CBT or distance your conscious brain and emotional reactions from mere thoughts through mindfulness. \n\n\nI highly recommend **audiobooks** for your car, iPod, etc. to teach you these methods and explain them, especially if you have trouble focusing or reading. \n\nGood luck, happy to answer questions. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Some insight into the anxious brain and the theories of two treatment modalities. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/qvn14/some_insight_into_the_anxious_brain_and_the/"
        },
        {
            "author": "Anxiousx3",
            "author_created_utc": 1331660668,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_75uq4",
            "created_utc": 1331661191,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qutpu/anxiety_on_a_daily_basis_is_affecting_my_social/",
            "id": "qutpu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qutpu/anxiety_on_a_daily_basis_is_affecting_my_social/",
            "score": 18,
            "selftext": "I'm a 17 year old girl in high school, and I've been dealing with social axiety and random panic attacks for about three years now. Everyday at school I struggle to stay normal, and try to pay attention but it's extremely difficult to fight against your own scumbag brain. I go to the bathroom or find some way out of the classroom atleast 8 times a day, because of this. And I find it mentally straining as hell to be in a situation where I can't go to the bathroom, almost trapped. If it gets bad I'll ask to be picked up. But this isn't helping me in the long run and I know that. This worries me about the future and finding jobs, going to interviews, college, and many other things I want to accomplish in life that involves interacting with people. \n I've been on lexapro, paxil, and vistaril before, but none worked. Honestly the only thing that's helped was xanax. But I dont have a perscription and have to go to my friends which I don't like doing,  but i'm desperate.  I've asked my parents to bring me to a doctor for months, and even when I emphasize how bad it is, they tell me that no doctor will perscribe benzos to a teenager. (I asked a question about xanax on here before)\n\n Lately when I've been having panic attacks I can't help but think it would be easier if I ended it all... because it's a never ending cycle of mental suffering, yet I would never attempt anything like that. I understand that I won't get the help I need unless I do something crazy, because my parents refuse to bring me to the doctor. Please.. any advice?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety on a daily basis is affecting my social and school life, nobody will help me. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/qutpu/anxiety_on_a_daily_basis_is_affecting_my_social/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331550916,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qsrzb/worried_my_anxiety_is_negatively_affecting_my/",
            "id": "qsrzb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qsrzb/worried_my_anxiety_is_negatively_affecting_my/",
            "score": 16,
            "selftext": "I have been in a relationship with the most amazing girl for almost a year. Everything is great... she's caring, patient, faithful, beautiful, etc.\n\nBefore I met her, my anxiety was so bad that I couldn't drive my car without having a panic attack. I also couldn't be social without alcohol.\n\nFinally something clicked and I felt better. I was more confident, I started driving my car everywhere, and just generally felt better about myself. That's when we met and things have been great.\n\nBut lately I feel like I'm having those old feelings again. I am constantly worrying about her being unfaithful, not loving me, finding someone better than me, etc. Logically this doesn't make sense because she isn't doing anything that should make me worried. She's completely honest with me about everything. \n\nSo far she has been really patient with me when I have an anxiety attack... but I don't think that will last forever. Part of me wants to get medication, even though there could be side effects... it can't be worse than losing her.\n\nEdit: Something occurred to me as I started writing this. I used to go to the gym a lot a year ago, around the time when my anxiety was a lot lower. I don't go to the gym at all anymore. Is it possible that exercise is what helps me keep the anxiety at bay?\n\n**UPDATE: I went to the gym! This is a big deal to me because it's a new gym that I've never been to before. I get anxiety when it comes to going to a new place or doing something for the first time. I jogged on the treadmill for 30 minutes and I already feel so much better. My anxiety gives me a tightness in my chest and I feel like I can't breath all the way in. After jogging, I feel like I can take huge deep breathes and that feeling is amazing. :)**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Worried my anxiety is negatively affecting my relationship",
            "url": "http://www.reddit.com/r/Anxiety/comments/qsrzb/worried_my_anxiety_is_negatively_affecting_my/"
        },
        {
            "author": "uhleckseee",
            "author_created_utc": 1314316283,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qbaf",
            "created_utc": 1331289795,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qor10/i_get_nauseous_from_any_burst_of_emotion_positive/",
            "id": "qor10",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qor10/i_get_nauseous_from_any_burst_of_emotion_positive/",
            "score": 14,
            "selftext": "I have been telling people that I have had stomach problems for a couple of years now, since maybe 2007 or so. I got food poisoning from a frozen pizza, and since then I had just been getting nauseous from what seems like no reason. When I thought more about it, I have always had nausea problems, just not this severe.\n\nWhen I was a kid, I used to frequent a local theme park. I had an annual pass, so it was a thing for me to go almost every weekend just to hang out. When I would get home and try to sleep, my mind would be stuck in theme park mode. My mind would make me feel like I was riding the rides, feeling the excitement. It would keep me up at night, crying that I couldn't sleep, and throwing up constantly. I never thought too much of it, except for the fact that I might be prone to motion sickness.\n\nFast forward to after the food poisoning incident where I was getting nauseous about every couple of weeks. I noticed a trend that it was whenever I had a surge of emotion. If I were anxious, excited, nervous, upset, happy...anything...I would get nauseous and vomit. This would ruin the rest of my day/night. I would start shaking and would pass out from exhaustion eventually for the night. This still happens every so often, but I've gathered a routine that kind of helps when I feel something like this come on.\n\nObviously this causes problems in my daily life. I've tried seeing a doctor, but he hasn't figured much out since it's not really a physical thing. He gave me stomach relaxers at some point and they worked wonderfully, except for the fact that I would always take naps. After the prescription ran out and I had researched the topic, I got into smoking cannabis. This helps out wonderfully most of the time. Every once in a while it'll make things worse, but usually I smoke before bed so I just go to sleep anyways. Before this, I started taking Dramamine (a motion sickness medication sold over the counter, usually at 7-11's or drugstores) to calm my stomach down. This helps, but it knocks me on my ass because it's a drowsy formula.\n\nEnough of the ranting. Really, what I'm trying to figure out, is if anybody else here has had anything similar to this happen to them and what they did to alleviate the nausea. I meditate every so-often, but not enough to work. I'm 22, female, and am only on birth control. Stress makes my stomach go crazy and I think myself sick most of the time. :( I just don't know what to do anymore. I apologize for how long this is and if I'm rambling. It's late here, I have work in the morning in about 3 hours and can't sleep because I feel my nausea coming on. I can't take anything that'll knock me out because it won't wear off by the time I have to be at work. So I'm a little delirious at the moment, my apologies. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I get nauseous from any burst of emotion - positive or negative.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qor10/i_get_nauseous_from_any_burst_of_emotion_positive/"
        },
        {
            "author": "CoronelAurelito",
            "author_created_utc": 1328135116,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tbv5",
            "created_utc": 1331146783,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qm2yj/how_can_i_stop_being_a_peoplepleaser/",
            "id": "qm2yj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qm2yj/how_can_i_stop_being_a_peoplepleaser/",
            "score": 13,
            "selftext": "Hi reddit!\n\nI'm a 22 year old guy, and I was a victim of pretty severe bullying since before I started elementary school all the way until I got into college. I was a *very* smart kid, and I didn't have great self-esteem, so that made me an easy target for the bullies. I think being picked on every day created an environment for me where I felt totally invalidated, like I had no right to be my own self. I felt like I always needed someone's permission to do what I liked to do. I felt like I had to somehow learn to meet the universe's standards instead of just going out and doing what I liked to do. And I started to believe that being smart was the only thing I was good for. I still believe that, to be honest. I honestly feel like I don't know how to have a \"normal\" conversation with people, and I feel really ashamed about that. Does anyone else feel the same? And do you have any advice for me?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How can I stop being a people-pleaser?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qm2yj/how_can_i_stop_being_a_peoplepleaser/"
        },
        {
            "author": "FYULABA",
            "author_created_utc": 1331394085,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_74y96",
            "created_utc": 1331434074,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qr1w8/i_need_help_reddit/",
            "id": "qr1w8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qr1w8/i_need_help_reddit/",
            "score": 13,
            "selftext": "Hi!\nMy fiance and Mother of my 2 year old child just got home from a girls night out and she had the worst anxiety / panic attack I have seen yet.\n\nBecause she had to much to drink she poured her heart out about her problems.\n\nHere are some of what i could gather.\n\nFirst off, I knew she has anxiety problems, she has even said so herself. I just never realised how big of a problem this was for her until now.\n\nToday I learned she has been to her doctor to try and get help, but he said he couldnt prescribe her anything to help but set her up with a shrink who might, but because of her anxiety she just went once because she thought the shrink might have laughed at her after she left.\n\nSome of the things she said scared me. Suicide was a topic, one that she thinks about daily. She thinks both me and our son would be better off without her. She talked about how scared she is that our son might grow up with her problem.\nShe also mentions other things like how she wishes no one knew who she is, she doesnt want people to talk about her. She wants to move to a place where no one knows who she is. \nShe is positive people still remember and talk about the \"stupid\" things she did 10 years ago. Little things like a conversation with a co-worker where she might've said a thing wrong sticks with her for years. She wants to be \"invisible\". \n\nEvery day when I drive to work she's positive im gonna be in a car crash and die so she start planning life without me, how she's going to support our son and who's going to take care of them when im not around.\n\nShe is terrified of going to the basement in our appartment complex to wash our clothes because someone might have hung themselves down there. \n\nHer father passed away over a year ago, and he had some pills in a briefcase along with some other personal stuff that she brought home but she's to afraid to throw the pills away incase they are narcotics and the police might trace it back to her. Oh, and her clothes that are hanging next to the briefcase she hasnt used since she discovered the pills since they might smell like drugs and a drug dog could smell it on her which would cause a scene and people would stare at her/talk about her. \n\nThere was so many more things she talked about. Stuff I or someone might've said years and years ago that i couldnt even remember, she still thought and worried about.\n\nI have told her in the past to perhaps she should try and get some help for her anxiety, but today i realised i need to help her get some help.\n\n\nI myself dont know anything about anxiety, or what type of problem this is. We've been together for 10 years now but it seems to have gotten alot worse during the last couple of years. \n\nSo Reddit please, how can I help her? \n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need help Reddit",
            "url": "http://www.reddit.com/r/Anxiety/comments/qr1w8/i_need_help_reddit/"
        },
        {
            "author": "icanhasanxiety",
            "author_created_utc": 1328148829,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tebq",
            "created_utc": 1331271374,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qoivr/panic_attacks_about_my_birthday_what_the_fuck/",
            "id": "qoivr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qoivr/panic_attacks_about_my_birthday_what_the_fuck/",
            "score": 12,
            "selftext": "I really don't know where these stem from. Part of the reason why I'm posting is because I'm lonely and depressed and last time I posted I felt better afterwards.\n\nI'm sitting here listening to Ellie Goulding. \n\nBut anyway, it's not like I don't have friends because I do. I'll be 21 on Sunday (whooooooooooooooooooooooooo legality), and the idea of it causes me panic attacks. I cried while driving home after thinking about the idea. I'm about to panic by writing this. \n\nI seriously don't fucking get it.\n\nI don't have that \"core\" group of friends like a lot of people. I have randoms here, randoms there. No real group or clique. \n\nI guess it might be because I've never really had anyone celebrate my birthday. #brokenhome\n\nI just don't know. Why am I writing this? Fuck.\n\nThis time of year sucks anyway. Seasonal affective disorder can lick my taint. But at least there's no snow on the ground (Minnesota)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Panic attacks about my birthday. What the fuck.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qoivr/panic_attacks_about_my_birthday_what_the_fuck/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331636021,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/quds4/oh_those_lovely_slippery_slopes/",
            "id": "quds4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/quds4/oh_those_lovely_slippery_slopes/",
            "score": 11,
            "selftext": "-- where what's triggering your anxiety would've turned out much better if you had just faced it head-on, earlier, but you couldn't because you were feeling too anxious/staving off panic attacks, so you avoided the problem but it got worse because you avoided it... \n\n...and then finally you faced it head-on because you had no choice, and it turns out it wasn't as bad as you thought, but now it's a bit too late to be like \"oh well now there's no damage done, I can just do this\"...\n\nit's always worse when it involves people who don't know me well, and now I feel pretty terrible for potentially letting down my entire presentation group. must also now prevent myself from falling into the \"aaaaand wonderful, I'm a fuckup\" self-recrimination that keeps me from doing anything about it while I (barely) still have time to do something about it.\n\nI have this bad habit of making self-fulfilling prophecies. I need to break out of my own thought cycles, seriously, before it gets too ridiculous. Starting to wish I hadn't been all \"nah, I'm okay!\" and scheduled my therapist's sessions once every *three* weeks. My mind's whirling. blaaargh.\n\n//getting things off my chest",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "oh, those lovely slippery slopes",
            "url": "http://www.reddit.com/r/Anxiety/comments/quds4/oh_those_lovely_slippery_slopes/"
        },
        {
            "author": "worrieddreamer",
            "author_created_utc": 1331528147,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_75ec8",
            "created_utc": 1331621245,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qu89x/worried_about_a_friend/",
            "id": "qu89x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qu89x/worried_about_a_friend/",
            "score": 11,
            "selftext": "Not sure if this is the right place to post this but its a start. I have a very close friend who has anxiety. It's crippling . She has a lot of symptoms that are scary to both of us . She gets shaky . She gets chest pains and she feels she's having palpitations. She clenches her teeth. Her whole body hurts and she has her while body go numb . We have gone to the er over the chest pains. They told is that she was in the verge of going into a stage 3 anxiety attack where her muscles will lock up for some time . I know she's scared and I am to . She is on medication for it. I don't know what they are off hand. I think most of them are natural stuff . And I have got her to see a doctor and theses things helped for a time . Now it seems to be coming back worse . She's getting to the point where she wants to give up . I don't know what to do to help or if anyone has any tips for relaxation or if anyone has experienced anything similar to this and how they overcame it even if its just a little more easer to bear. I apologize for any spelling and hopefully this made seince . Thank you in advance for any advice . ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Worried about a friend ",
            "url": "http://www.reddit.com/r/Anxiety/comments/qu89x/worried_about_a_friend/"
        },
        {
            "author": "frendlyguy19",
            "author_created_utc": 1330217830,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_70p2s",
            "created_utc": 1331147726,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qm3nm/hey_im_gonna_be_on_from_around_9pm_est_4am_est/",
            "id": "qm3nm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qm3nm/hey_im_gonna_be_on_from_around_9pm_est_4am_est/",
            "score": 10,
            "selftext": "We can skype or IM or whatever you like \nThere's no need to feel shy or like your problems aren't worth listening to.\ni'll listen to anyone who needs it.\n\nAnd i realize that it might be dificult to talk to somebody you know nothing about so here's a little about myself. I'm a 19 Y/o male. i've suffered from depression in the recent past. I live in new york. I'm agnostic. and im a good listener. lets talk =)\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey, im gonna be on from around 9pm est - 4am est tonight if anybody would like somebody to talk to.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qm3nm/hey_im_gonna_be_on_from_around_9pm_est_4am_est/"
        },
        {
            "author": "naboothatswho",
            "author_created_utc": 1298007739,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ux1i",
            "created_utc": 1331253653,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qo53p/severe_hypochondria/",
            "id": "qo53p",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qo53p/severe_hypochondria/",
            "score": 10,
            "selftext": "I am constantly afraid of cancer. All it takes is seeing a reference to cancer, especially on reddit,before my day is ruined. I try not to look on WebMD too much, and that helps, but I still think every pain is a tumor. Not to mention, anxiety has started to cause aches in me, which are totally fine as far as pain goes, but incredibly frightening. \n\n\nI almost feel like I am destined to have cancer and die. Usually my hypochondria switches in a few days, like when I think I have MS, or something, but I am always afraid of cancer. This started about a month ago when I heard (trigger warning if you are like me, stop reading if you will take on symptoms) someone had their hand feel \"off\" and it turned out to be brain cancer. So immediately I had my hand feel \"off,\" whcih is still does if I think about it. I interpret every sensation as a risk. \n\n\nI don't know what to do. I am going abroad to study for a couple months in the summer, and would rather not have to worry about medication. I was  medicated for panic attacks for a year, and haven't gotten them back, but while I was medicated I was still anxious, just not about health stuff. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Severe Hypochondria",
            "url": "http://www.reddit.com/r/Anxiety/comments/qo53p/severe_hypochondria/"
        },
        {
            "author": "throwawayirish",
            "author_created_utc": 1331684115,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_75y9n",
            "created_utc": 1331684751,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qvduj/afraid_to_get_help/",
            "id": "qvduj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qvduj/afraid_to_get_help/",
            "score": 10,
            "selftext": "This is a throwaway account, just looking for some advice...\n\nI've had my run-ins with anxiety and panic attacks before but got through them - usually on my own, depending on how bad it was. I've been ok for a while now but I'm afraid I might be starting to go back to that place ... and I don't think I can go back there and get myself out ... so I might actually have to ask for help but I'm really afraid to!\n\nThis isn't helping my anxiety of course as I'm sure you can all imagine ... but I don't know what I should say or who I should say it to ... if I have to get professional help how much will it cost? It all feels really overwhelming at the moment ... so I'm just scared to do anything... I'd really like some advice or I dunno something from someone who knows where I'm coming from.\n\nThanks ... :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Afraid to get help...",
            "url": "http://www.reddit.com/r/Anxiety/comments/qvduj/afraid_to_get_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331205771,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qn7ff/wish_me_luck/",
            "id": "qn7ff",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qn7ff/wish_me_luck/",
            "score": 10,
            "selftext": "One of my main triggers is staying away from where I normally sleep, it takes about 2 weeks to get used to a place so I am comfortable with it. \n\nTonight and tomorrow night I will be staying in a hotel to go to a teachers conference. I am absolutely terrified even now, hours before I leave. Usually in these situations I stay at home then leave really early to take a long drive, but with a 4 hour drive, that is just not practical. =(\n\nTrying all my techniques for staying calm and whatnot, but its a struggle. \n\nAlso, I have a runny nose =(",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Wish me luck! =/",
            "url": "http://www.reddit.com/r/Anxiety/comments/qn7ff/wish_me_luck/"
        },
        {
            "author": "3amRadio",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331480757,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qrkur/so_i_found_out_that_the_i_am_feeling_odd_going/",
            "id": "qrkur",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qrkur/so_i_found_out_that_the_i_am_feeling_odd_going/",
            "score": 10,
            "selftext": "So.. When we feel odd.. Like we were going crazy.. I just found out that it is perfectly normal part of anxiety.. Called rerealization / depersonalisation.. I found the explanation on this website to be extremly comforting and interesting: http://www.panicend.com/de.html \n\nIve noticed I am checking on this feeling constantly. And I guess I am feeding the feeling due to it.. Now day after I learned what it is.. It is really comforting to know it is just a normal part of anxiety.. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So I found out that the \"I am feeling odd / going crazy\" feeling is called derealization / depersonalisation.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qrkur/so_i_found_out_that_the_i_am_feeling_odd_going/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331456530,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qrd8j/anxiety_in_the_morning/",
            "id": "qrd8j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qrd8j/anxiety_in_the_morning/",
            "score": 9,
            "selftext": "I don't know the cause but for months now I have been waking to the  feeling of being extremely panicked. I usually wake short of breath, shaking and feeling that I am about to vomit. After taking a shower I usually feel a little bit better but for hours afterwards I still feel like adrenaline is surging through my body... Sometimes it never stops.\n\nI am an anxious person on a normal day... But this is kinda new and I'm wondering if it is something I can put a stop to... \n\nAnyone else have this? Advice? \n\n:/\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety in the morning?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qrd8j/anxiety_in_the_morning/"
        },
        {
            "author": "ceilingdweller",
            "author_created_utc": 1312077879,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5le2r",
            "created_utc": 1331311549,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qp1sk/can_somebody_who_has_gone_through_therapeutic/",
            "id": "qp1sk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qp1sk/can_somebody_who_has_gone_through_therapeutic/",
            "score": 9,
            "selftext": "I posted a question [here](http://www.reddit.com/r/Anxiety/comments/qmmfm/i_need_advice_regarding_college_and_pursuing_a/) a few days ago. I fear that people didn't read it because it was too long.\n\nI'm just looking for some insight and perspective from somebody who has gone through some sort of therapeutic or CBT-based treatment for anxiety. The questions are at the bottom of the thread. Please provide some info if you can!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Can somebody who has gone through therapeutic treatment for anxiety give me some advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qp1sk/can_somebody_who_has_gone_through_therapeutic/"
        },
        {
            "author": "JustinSweats",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331244233,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qnxg2/has_anyone_here_successfully_minimized_their/",
            "id": "qnxg2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qnxg2/has_anyone_here_successfully_minimized_their/",
            "score": 8,
            "selftext": "I've been going to therapy for a few years now and I don't feel any better than when I started. If anything, my anxiety is progressing as the days go by. I used to be much more social in High School but now it is a very challenging endeavor in college. I barely have any friends in college and I'm terrified of joining a club, as bad as I want to.\n\nIn general, no matter what's going on in my life, there is always a level of anxiety that never ceases. It sucks because when I'm finally enjoying myself, which is rare, the anxiety builds up till I'm back to my usual gloom. \n\nI know most of you can relate to this, but is there anyone here who has improved their general state of mind? What did you do and how did you maintain your motivation?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone here successfully minimized their anxiety to a significant degree?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qnxg2/has_anyone_here_successfully_minimized_their/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331356459,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qpydz/i_really_need_some_advice/",
            "id": "qpydz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qpydz/i_really_need_some_advice/",
            "score": 8,
            "selftext": "I dont know if thi is some sort of anxiety, but my doctor diagnosed me with major depressive disorder with psychotic features. also i have social anxiety which caused me to drop out of college. but at home im feeling really weird right now. i feel irritated all the time and nothing seems to feel right. sometimes i think about trying to end it all, again. i just cant seem to focus on anything because always this feeling of \"nothing right\" is storming my head. i just cant take it anymore. i want to scream and destroy everything around me. is this some sort of anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I really need some advice",
            "url": "http://www.reddit.com/r/Anxiety/comments/qpydz/i_really_need_some_advice/"
        }
    ]
}