{
    "data": [
        {
            "author": "aglet",
            "author_created_utc": 1263100208,
            "author_flair_css_class": "",
            "author_flair_text": "kicking anxiety's ass",
            "author_fullname": "t2_3tfy6",
            "created_utc": 1330801670,
            "domain": "fbcdn-sphotos-a.akamaihd.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qg63s/presenting_anxiety_girl/",
            "id": "qg63s",
            "is_self": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qg63s/presenting_anxiety_girl/",
            "score": 204,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Presenting..... Anxiety Girl!!",
            "url": "https://fbcdn-sphotos-a.akamaihd.net/hphotos-ak-ash4/430217_3137317924316_1605914342_4396981_2081423503_n.jpg"
        },
        {
            "author": "wolf-lover66",
            "author_created_utc": 1327105094,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6pp92",
            "created_utc": 1331082948,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qkzxz/anxiety/",
            "id": "qkzxz",
            "is_self": false,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qkzxz/anxiety/",
            "score": 170,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/YI8nyUeN6OWooEbT.jpg",
            "title": "Anxiety",
            "url": "http://imgur.com/By9a5"
        },
        {
            "author": "psYberspRe4Dd",
            "author_created_utc": 1328723014,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6vf1i",
            "created_utc": 1331060698,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qki1z/kind_of_like_this_can_we_get_more_art_in_here/",
            "id": "qki1z",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qki1z/kind_of_like_this_can_we_get_more_art_in_here/",
            "score": 81,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/SX2AWS1IXcHUfhZx.jpg",
            "title": "Kind of like this (can we get more art in here?)",
            "url": "http://i.imgur.com/c0gwq.png"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330966802,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qiqt9/ita_all_in_your_head_my_least_favorite_phrase/",
            "id": "qiqt9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qiqt9/ita_all_in_your_head_my_least_favorite_phrase/",
            "score": 66,
            "selftext": "I was over at a friend's place with some other people when I felt a panic attack coming on. I started having all these rushing thoughts of how I was awful and no one could love me and everyone was only putting up with my company out of pity. \n\nI ran to his room to get away from other people and curled up into a ball. It was the first panic attack I'd had in a month so it was very jarring.  \n\nHe came in latter to check on me. I told him that I had been feeling panicked and anxious and he said the worst thing, \"I don't see what the issue is, isn't it all just in your head?\"\n\nIt hurt me how he didn't get it. Of course it's in my head; where else would it be? But this isn't a mood that I can just think my way out of, it's an illness. I'm not making a choice to feel this way. \n\nI just get frustrated. I feel lonely when there's no one who gets it, no one who I can go to when I'm anxious. I don't expect them to \"fix\" me, I would probably get annoyed if they tried. But I just want a friend who understands what I'm battling everyday.  Does anyone else feel the same way?   ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "\"It'a all in your head\" my least favorite phrase",
            "url": "http://www.reddit.com/r/Anxiety/comments/qiqt9/ita_all_in_your_head_my_least_favorite_phrase/"
        },
        {
            "author": "Captain_Porque",
            "author_created_utc": 1321757910,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_69yjp",
            "created_utc": 1330647619,
            "domain": "docs.google.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qdpl8/hi_ranxiety_out_of_curiosity_i_made_a_simple/",
            "id": "qdpl8",
            "is_self": false,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qdpl8/hi_ranxiety_out_of_curiosity_i_made_a_simple/",
            "score": 28,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Hi r/anxiety, out of curiosity I made a simple survey for anxiety disorders. Take a moment to answer? I'll post the results in a few days.",
            "url": "https://docs.google.com/spreadsheet/viewform?formkey=dG5wdGpXMlNOckRiaTJsWlk1NkNSSVE6MQ#gid=0"
        },
        {
            "author": "xracquellyy",
            "author_created_utc": 1299180207,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4wzqt",
            "created_utc": 1331057387,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qkfdh/today_despite_me_be_terrified_i_complimented/",
            "id": "qkfdh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qkfdh/today_despite_me_be_terrified_i_complimented/",
            "score": 25,
            "selftext": "I have had anxiety since I have been 12 years old. I am going on 21 in July and it is mostly of people. I am on medication, Effexor 37.5mg and have been since September 2011. Yes, I hadn't been on medication for very long despite me having anxiety for as long as I have. I hated the fact of being on it, but it has helped me despite me hating it.\n\nToday, I went for a work out and after I was done and in the change room, there was a girl with this dress that I really liked and after getting everything from my locker, I finally decided to compliment her after contemplating it for 3 minutes or so. She said thanks with a smile and I have never been so proud of myself. I just said, \"Let's challenge yourself today\" and I did it! I hope that that compliment helped her too because it helped me even though she most likely doesn't know it.\n\nJust thought I would post it to give some people hope that even if you've had anxiety for years, if you challenge yourself enough, you are able to do anything. \n\nWorking out DEFINITELY helps you with your anxiety. Oh man, does it ever. You sweat everything out. You get all of your energy out and you are just completely exhausted and you feel SO good after despite you being completely exhausted. Today was the first time I worked out in a while and man, I feel awesome. I also had a big breakfast too which helped (scrambled eggs, toast and bacon and tea)!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Today, despite me be terrified, I complimented someone on their dress today and I felt proud.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qkfdh/today_despite_me_be_terrified_i_complimented/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330626295,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qd7q4/once_i_feel_anxiousstart_doubting_myself_in/",
            "id": "qd7q4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qd7q4/once_i_feel_anxiousstart_doubting_myself_in/",
            "score": 22,
            "selftext": "Does anyone else ever have this problem? Is there anything I can do to make it better?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Once I feel anxious/start doubting myself in social situations, I start acting funny. This is turn makes me feel even MORE anxious and doubtful of myself, which makes me act even more awkwardly. Its like a snowball effect and I can't stop it! Suggestions? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/qd7q4/once_i_feel_anxiousstart_doubting_myself_in/"
        },
        {
            "author": "waterdownthedrain",
            "author_created_utc": 1329663561,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ynx9",
            "created_utc": 1330698008,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qegwr/sometimes_what_you_hear_on_the_radio_can_punch/",
            "id": "qegwr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qegwr/sometimes_what_you_hear_on_the_radio_can_punch/",
            "score": 21,
            "selftext": "I am getting ready for work today and NPR's story board comes on and it's this little kid with cancer. He was diagnosed with it when he was like 16 months old or something and after three operations he's finally cancer free and is now a 12 year old.\n\nI am not a 12 year old, I am a 30 year old who was just diagnosed with GAD and have been working through it with a variety of methods, therapy, medicine, breathing exercises and stuff like that. It seems to be working but i have my days and sometimes it's hard to get up in the morning. Who am I fucking kidding? Getting up in the morning, getting showered, dressed, fed and out of the fucking door to go to my job is one of the hardest points in the day. The safest I feel is about 10 p.m. in bed knowing that I am going to have sleep for the night, mayby.\n\nSo this kid on the radio says something, and I paraphrase here, that he never knew how precious/important/great life was until he almost died, and I started crying. Ever since I have been having recent massive panic attacks and got diagnosed and on meds I have not had an epiphany like this. It makes me feel that all the anxiety I have over problems are really in the long run just a bunch of bullshit chemical imbalances and not really legit and that I am kind of being a pussy about it.\n\nAnyone with this knows that anxiety literally makes a mountain out of a molehill, no matter what. I can look at that little hill and I can say in my mind \"yeah, that is a mole hill, that isn't anything that I can't handle, I'm a strong man.\" But then my brain says \"No, fuck you, that's mount fucking Everest, you have no oxygen and you know what you're going to die if you try to tackle it. Just try it, go ahead.\"\n\nMy therapist describes people as having \"scouts\" inside of a person. He said the scouts are there to protect you and they delight in their job. If you're walking across the street and a car comes crashing out of the middle of nowhere your scouts will pull you back, it's your instincts that he's talking about. He said the scouts have done their job, they're sated and they've done a good job.\n\nHe said my scouts are always on alert ALWAYS no matter what, so if I get a weird phone call or if I hear a noise at night or a car go by, my scouts are on full alert that the worst possible case is going to happen and I need to hunker down because it's going to be a dangerous and bumpy ride.\n\nI don't know where I am really going with this post. I know that the meds and the therapy have helped me in these weeks, and helped me realize that I have had this problem for a long time, but I just want to say \"fuck you anxiety, seriously, fuck you. I am sick of you and I don't want to have you around fucking up my life anymore. I am a grown man and I should be able to conquer you, I want to conquer you and goddamn it I am going to do anything in my humanly fucking power to do it. Go to hell.\" \n\nThanks for listening to my rant folks.\n\nTL;DR NPR had be a sobbing mess over a bowl of cereal. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sometimes what you hear on the radio can punch you in the guts.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qegwr/sometimes_what_you_hear_on_the_radio_can_punch/"
        },
        {
            "author": "missdeathlyhallows",
            "author_created_utc": 1300379290,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4z44o",
            "created_utc": 1330792540,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qg0cu/vitamin_d_and_anxiety/",
            "id": "qg0cu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qg0cu/vitamin_d_and_anxiety/",
            "score": 19,
            "selftext": "About 5 months ago I started feeling extremely sick, and starting having extreme anxiety. Every morning I'd wake up anxious and start crying. I could barely handle work, I had panic attacks, once I started crying I couldn't stop, I was miserable. I finally got some anxiety pills from my doctor, which helped, but I still felt really anxious.  I finally got some bloodwork done and it turns out my vit. d was really low, I started taking 10,000 mg a day and even after a week I could feel the difference. I've been on it for a month now and I feel so much better. \n\nI thought I would post this on here to share because I know how much it sucks to feel that way. So you might look into getting your levels checked, doesn't hurt to check and maybe it will help you as well. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Vitamin D and anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/qg0cu/vitamin_d_and_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331036387,
            "domain": "google.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qk2dt/in_college_i_tried_to_commit_suicide_several/",
            "id": "qk2dt",
            "is_self": false,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qk2dt/in_college_i_tried_to_commit_suicide_several/",
            "score": 14,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "In college I tried to commit suicide several times to escape the painful effects of severe anxiety and now I hope to convince people otherwise, please ask me for advice.",
            "url": "http://www.google.com/imgres?um=1&amp;hl=en&amp;sa=N&amp;biw=1600&amp;bih=742&amp;tbm=isch&amp;tbnid=GGidhiFXSBXtrM:&amp;imgrefurl=http://blogs.psychcentral.com/angst-anxiety/2012/01/the-stress-connection-to-anxiety-depression-and-suicide-riskpart-three/&amp;docid=WHOtvegIjf2ROM&amp;imgurl=http://blogs.psychcentral.com/angst-anxiety/files/2012/01/depression.jpg&amp;w=350&amp;h=299&amp;ei=1gBWT7qwDeSYiALMuNTWBw&amp;zoom=1&amp;iact=hc&amp;vpx=774&amp;vpy=143&amp;dur=211&amp;hovh=207&amp;hovw=243&amp;tx=71&amp;ty=223&amp;sig=114092927875807310260&amp;page=1&amp;tbnh=134&amp;tbnw=157&amp;start=0&amp;ndsp=33&amp;ved=1t:429,r:4,s:0"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330574195,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qcfb7/i_try_not_to_hate_people/",
            "id": "qcfb7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qcfb7/i_try_not_to_hate_people/",
            "score": 14,
            "selftext": "I'm not a bad person. In fact, many people would argue that I'm the exact opposite. I've been teaching special ed for ten years. I'm kind, generous, and helpful. However, I do possess a fatal flaw, which has been slowly, deteriorating my soul. I can't say, no. I am a people pleasing fool, and it's a constant struggle for me to set limits. \n\nMy job requires such intense intervening, teaching, supervising, and interacting with people, that it causes me to resent others who don't have to work as hard. My classroom is Grand Central Station. I'm so burnt out. I've been running on empty, and I feel like my engine is going to die. My tolerance is diminishing. I don't care when people share with me about their lives. I don't want to talk on the phone to anyone when I get home. I rarely return texts. I pick fights with my patient, boyfriend, (who is the absolute love of my life). But, even he has had enough with my job. I feel that my inability to set boundaries combined with the impossible, endless, demands of my job, is sucking the life out of me. \n\nThe district provides little support and expects a whole hell of a lot of demands. I used to think my students suffered the most, as there's no way one teacher, one person, can meet their individual needs. Of course, me, being the teacher I am, I stretch myself thin everyday, barely meeting the needs of half my caseload. \nNow I think I'm the one suffering, perhaps more than my students. Kids are resilient. Not that they don't deserve the most appropriate, individualized education. They not only deserve it, but, as the law states, are entitled to it. \n\nI've shared my concerns and even cried to my principal. Everyone advises me to leave on time, \"leave my work at work\". \"You can't be everything to everybody\", is another common response to my issues. However, how the hell do I even begin to provide effective instruction to these kids with special needs when I am not prepared? I don't have time during my paid hours to plan. I hardly have time to do all the required paperwork. I usually leave for work around 7 am and arrive home after 6 every night. I got home a little over an hour ago, and I still have to plan half my day tomorrow. Without any plans, how do you teach effectively? Do you just say, \"Fuck it\" and have kids do worksheets all day long?\n\nSo, my dilemma is this: do I leave at a reasonable time everyday, and provide the minimum, knowing that I'm not doing the very best I can? Or, do I continue working as hard as I possibly can, draining my every last drop of energy? As an advocate for kids with special needs, I would be going against everything I stand for if I decide to go with the first option.\n\n I just don't know what to do. I don't enjoy life anymore. I'm isolating myself. I'm not me anymore. However, when I do have a teachable \"ah ha\" moment with a student, I can't see myself doing anything else. At what point do I say, \"Enough is enough?\" \n\nHas anyone else reached this point of overload? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I try not to hate people.",
            "url": "http://www.reddit.com/r/Anxiety/comments/qcfb7/i_try_not_to_hate_people/"
        },
        {
            "author": "Im_Gonna_Say_No",
            "author_created_utc": 1326484651,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6npdk",
            "created_utc": 1330618779,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qd1sd/going_to_a_therapist_today_any_tips/",
            "id": "qd1sd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qd1sd/going_to_a_therapist_today_any_tips/",
            "score": 13,
            "selftext": "So ive been to a therapist or two before but those were when i was a kid and i had no idea what i was doing there. Now recently ive decided i should start seeing one again because my anxiety is starting to interfere with my life a little more now.\n\nSo i ask you guys, any tips on what to do/how to act/what to say for the first day evaluation and on-words??\n\nTo give some background info im 19 with self-diagnosed GAD, neruosis and lately ive been becoming derealized or whatever it is, i feel like ive been under Solipsism for a while now too. What i think is the root of this is being a highly sensitive person who was given a shit childhood cause all my peers were assheads. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going to a therapist today, any tips?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qd1sd/going_to_a_therapist_today_any_tips/"
        },
        {
            "author": "mks351",
            "author_created_utc": 1324019899,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6g9b7",
            "created_utc": 1330556752,
            "domain": "memegenerator.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qc0vm/great_success_success_kid/",
            "id": "qc0vm",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qc0vm/great_success_success_kid/",
            "score": 12,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/u-zchQanfYuBhRza.jpg",
            "title": "Great Success! [Success kid]",
            "url": "http://memegenerator.net/instance/15414999"
        },
        {
            "author": "Bunnyjager",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330747881,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qfhus/jaw_clenching/",
            "id": "qfhus",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qfhus/jaw_clenching/",
            "score": 11,
            "selftext": "Anyone else have trouble with unconciously clenching your jaw? Do you know ways to stop it or relieve it?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Jaw clenching",
            "url": "http://www.reddit.com/r/Anxiety/comments/qfhus/jaw_clenching/"
        },
        {
            "author": "TheKittenButcher",
            "author_created_utc": 1309275733,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ftth",
            "created_utc": 1331136159,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qluib/driving_anxiety/",
            "id": "qluib",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qluib/driving_anxiety/",
            "score": 11,
            "selftext": "20 year old female here, with driving anxiety. Riding in someone's car, on a cross country road trip, I am perfectly fine. But driving, two miles from my house, I'm a mess. Certain routes, like my drive to work, have become routine, and don't bother me as much. But if I have to deviate from it whatsoever, even to get gas, I am incredibly uncomfortable. I have had full blown panic attacks at the thought of driving somewhere new. I'm so envious of everyone that can just go for an enjoyable drive, and not worry about every little thing along the way. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Driving anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/qluib/driving_anxiety/"
        },
        {
            "author": "afraid2stop",
            "author_created_utc": 1303829508,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_55f6l",
            "created_utc": 1330973067,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qivwi/i_drink_because_im_anxious/",
            "id": "qivwi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qivwi/i_drink_because_im_anxious/",
            "score": 11,
            "selftext": "I'm anxious (partially) because I drink.  Sigh....",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I drink because I'm anxious...",
            "url": "http://www.reddit.com/r/Anxiety/comments/qivwi/i_drink_because_im_anxious/"
        },
        {
            "author": "psychosomatick",
            "author_created_utc": 1300847559,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4zxvs",
            "created_utc": 1330752719,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qfkt7/effexor_xanax_beta_blockers_opinions_requested/",
            "id": "qfkt7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qfkt7/effexor_xanax_beta_blockers_opinions_requested/",
            "score": 10,
            "selftext": "Currently, I am on Effexor-XR 150 milligrams (mg) for trait social anxiety. Previously I had tried a few different anxiolytics (e.g., Lexapro) but the side effects outweighed the benefits. At my previous university, I found that the Effexor-XR 150 for trait and Xanax 50 mg for state anxiety resulted in a relatively stable mode of living, but have recently started a graduate program at a different university where the clinicians are more negatively biased toward medication-based solutions.\n\nAfter starting my new program, the university health services physician  told me that they were uncomfortable prescribing Xanax and told me to try behavioral methods to control my panic attacks. After a few months of performing *terribly* during my academic/research/any social presentations (including, at times, simply talking to other people casually), and employing multiple techniques to reduce my social anxiety, I called uncle and met with her earlier this week to request my Xanax back. During that time, she *strongly* suggested that I consider taking beta-blockers instead, or increasing my Effexor-XR daily dosage (I have never gone above 150 mg).\n\nIn a beautiful, perfect world, I would have found a behavioral solution that reduces my social anxiety without medication. Currently, I cannot afford to regularly undermine my credibility as an academic and embarrass my research group by becoming discombobulated nearly every time I present. Thus, my questions for you (patient) souls are;\n\n1) Does anyone have experience/advice in regards to increasing the daily Effexor dosage to assuage general social anxiety both in casual situations and/professional presentations? \n\n2) What are the benefits of beta blockers in comparison to Xanax from a physician standpoint? From a patient standpoint?\n\n3) At my previous university, with my standard medication, I **\nloved** giving presentations (albeit, when at the beginning of having a panic attack, I had a Xanax). It is only after I recently began my graduate program that I become overwhelmingly anxious. Would this be most easily remedied by some of my options [a) attempt calming behaviors and use Xanax as a last resort, b) increase Effexor dosage, c) start using beta blockers]\n\nSorry for the verbose post and thanks for your patience.\n\n**TL;DR: Should I increase my Effexor-XR dosage, switch from Xanax to beta-blockers, or see if I can get away with a career in academia experienced from the fetal position?**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Effexor - Xanax - Beta Blockers - Opinions Requested",
            "url": "http://www.reddit.com/r/Anxiety/comments/qfkt7/effexor_xanax_beta_blockers_opinions_requested/"
        },
        {
            "author": "straw_dog",
            "author_created_utc": 1306780819,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5b2p2",
            "created_utc": 1330624928,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qd6nm/i_have_had_really_bad_anxiety_in_the_past_and_i/",
            "id": "qd6nm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qd6nm/i_have_had_really_bad_anxiety_in_the_past_and_i/",
            "score": 10,
            "selftext": "I am a 20 year old female college student. I'm not sure what information is necessary, but I have no problem filling in the blanks. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have had really bad anxiety in the past and I have recently started taking zoloft to combat anxiety and depression. I was wondering if you all had any tips or warnings for being on medication?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qd6nm/i_have_had_really_bad_anxiety_in_the_past_and_i/"
        },
        {
            "author": "3amRadio",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330904585,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qhrlc/changing_anxiety_symptoms/",
            "id": "qhrlc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qhrlc/changing_anxiety_symptoms/",
            "score": 10,
            "selftext": "My main anxiety symptom for years was becoming conscious of my breathing to a level where if it would happen, I would mess up my breathing and became woozy.. I learnt to live with that.. There would be months when I did not have it.. Then it would come back. I was not sure that it was anxiety at the time.. But now I know it just has to be.. \n\nThen last april I got a cold pneumonia and with that I hit a new peak of anxiety in which I was \"introduced\" to a whole new slew of symptoms: feeling like I had to pee, burning of the skin, chest, stomach.. Mental waves of fear going through me..\n\nNow. After last springs anxiety break. I have been getting better. First with ssris for six months and last 5 months without.. It has not been easy.. But I am now at a level where I can have days when I sleep pretty normal and have no skin burning sensations.. \n\nBut as of late.. I have noticed that when I sleep well.. Days when  I have no other symptom.. I am hit with mental anxiety attack about mid day.. It has happened 3 times in the last 2 weeks.. So. I sleep well.. Wake up. Drowsy and feeling well rested.. But then I start feeling this \nrestlessness in my thoughts. Feeling like I am going crazy.. Like the world is caving in (usual panic attack right?).. And it lasts a few hours and goes away. \n\nActually there was one I had last week that I was able to stop really fast by drinking a little bit of coffee.. Which made me think that this could be related to caffeine withdrawal.. \n\nThe weird thing is that every time when I sleep bad these days.. I actually do not get panic attacks.. It is almost like I am too tired for them to start.. Which is a real mind ef because I like to sleep well.. But if sleeping well triggers panic attacks.. I just do not know.. \n\nSo I guess my question would be. Has anyone diagnosed with severe anxiety disorder ever got better.. And as they have.. Did you notice the changing anxiety symptoms.. Did they slowly just get less and less?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Changing anxiety symptoms..",
            "url": "http://www.reddit.com/r/Anxiety/comments/qhrlc/changing_anxiety_symptoms/"
        },
        {
            "author": "TTTweak",
            "author_created_utc": 1327957946,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6sn6c",
            "created_utc": 1330962706,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qinr9/i_hate_to_keep_bothering_everyone_in_this/",
            "id": "qinr9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qinr9/i_hate_to_keep_bothering_everyone_in_this/",
            "score": 10,
            "selftext": "Hey everyone,\nFirst, I feel like I make a post here almost once a week and I hate feeling like I'm being a bother.  I'm trying my best to deal with these anxiety issues and I've definitely made some progress since January, but once in a while I do need r/anxiety!  Anyway, I woke up this morning with such a sharp pain in my upper right abdomen which seemed to travel to my lower right and eventually left abdomen.  The pain has been cycling through those positions for about 2.5 hours now.  I eventually made it to school and my first class is a 3 hour Biology lab which students may not leave for any reason whatsoever (except for a bathroom break).  The thought of being trapped made me nauseous and now I'm thinking I have appendicitis or there's a problem with my spleen or gallbladder.  My friends (unaware of the problem) are talking and joking around with me, but I feel like I'm in another world.  I'm trying to convince myself it's nothing serious and is probably just gas, but I'm on the verge of a serious attack.  The only thing keeping me calm is typing this post from my phone, in the bathroom.  Thanks everyone",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate to keep bothering everyone in this subreddit, but I'm in class now and I've worked myself up beyond my threshold ",
            "url": "http://www.reddit.com/r/Anxiety/comments/qinr9/i_hate_to_keep_bothering_everyone_in_this/"
        },
        {
            "author": "Captain_Porque",
            "author_created_utc": 1321757910,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_69yjp",
            "created_utc": 1330740434,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qfctv/quick_question_does_anyone_have_increased_anxiety/",
            "id": "qfctv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qfctv/quick_question_does_anyone_have_increased_anxiety/",
            "score": 9,
            "selftext": "I've noticed over that over the past four or so years my anxiety symptoms wax and wain depending upon the time of year. You see, while I get anxiety and panic attacks if I'm in an unfamiliar place, or surrounded by a lot of people, sometimes I would have week-long periods of anxiety that seemed to come out of nowhere, and disappear in a week or two. It was then that I noticed that these episodes come and go around two to three times a year, all at the same time. \n\nI would wake up and just feel completely drained. My heart would race all day, I would have racing thoughts, clammy hands, I would have hot flashes, a spaced-out feeling, my ears would be full, and I just felt really really off. The littlest things would send me into a panic. It was by complete chance that I decided to look up the pollen level for my area. It was almost the maximum reading.\n\nNow, I have known all my life that I've been affected by increased pollen. Usually it was a runny nose, stuffiness, cold-like symptoms, etc. My entire dad's side of the family has the same symptoms. They also suffer from the same anxiety problems that seem to come and go randomly during the year. Last week the anxiety started creeping up on me again, and I could feel it. I know what's coming, so I'm usually able to contain it well and just ride it out, even though it's pretty uncomfortable for me. I also have a take-as-needed prescription of Ativan if it gets too bad. I checked online, and sure enough, my entire state is completely red with pollen from three different sources. Right now it's so bad that everyone's car is a about three shades yellower. \n\nRight now my dad is on the couch, saying he's not feeling well. He finally told me that he's been having really bad anxiety symptoms (racing heart, stress, worrying), and he's afraid there's something wrong with him. He told me that it comes and goes during the random times of the year for around two or three weeks. Then I mentioned the pollen thing, and he told me that the last time he went and saw a doctor for these symptoms (a few years back) that they told him it could be a correlation with your sinuses. Pollen inflames our sinuses like no tomorrow, and we get pretty annoying headaches, aggravation, and stuffiness from them.\n\n**tl;dr** Does anyone suffer anxiety when there's an increase in pollen levels? Could this be a cause for why I get random episodes of higher-than-normal anxiety levels for around two weeks during the same times of year?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Quick question, does anyone have increased anxiety as a result of increased pollen levels, or problems with your sinuses? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/qfctv/quick_question_does_anyone_have_increased_anxiety/"
        },
        {
            "author": "Ireallyjustneedahug",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331069322,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qkoz1/new_to_r_anxiety/",
            "id": "qkoz1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qkoz1/new_to_r_anxiety/",
            "score": 8,
            "selftext": "I never used to have anxiety. I used to always be happy, go-lucky, and fun.\n\nI'd have to say that my anxiety and depression reared it's ugly head in middle school. I grew up in a home with an insecure mother and a mean drunk as a step father. The abuse was terrible, especially from my step father. Emotionally. Physically. Sexually. \n\nMy mother, at the beginning of high school, divorced him. But got back with him after a year, blaming me for not supporting her enough during her tough time. I told her I couldn't stay with him around, so I gave her a choice. Him or me. She chose him.\n\nAt 18, I moved out and in with a friend. It's been 4 months. Friend hates me now. She's tired of my face. Won't even look at me. Her mom is the only one really supporting me staying there. I'm Not welcome back to my moms. She wants nothing to do with me.\n\nEver since then my anxiety has been getting worse. Ive started giving up. I'm not going to pass senior year of high school. My weight has soared. My attacks are happening more frequently than they ever have. I can never calm down enough to enjoy myself, and I'm in constant panic. \n\nThis is a throwaway. I know too many people on reddit. I came to /r/anxiety because I need help and support to get through this. I just want some reassurance that I'm not alone. \n\nI just needed to get that out. Thanks for  letting me vent.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "New to /r/ anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/qkoz1/new_to_r_anxiety/"
        },
        {
            "author": "arieleislittle",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1331045792,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qk6vm/this_is_what_im_anxious_about_am_i_really_all/",
            "id": "qk6vm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qk6vm/this_is_what_im_anxious_about_am_i_really_all/",
            "score": 8,
            "selftext": "I'm anxious about almost everything, but some things make me much more anxious than most. One of those things is the general future of humanity. I've heard countless times that one must \"look out for oneself,\" and though I agree with it to some degree, I feel like this statement is just.. so *selfish*. All my life I've been pretty altruistic. I'm willing to go out of my way to help others because that's what makes me happy. But lately, I feel like my actions go unnoticed or are simply pointless. (I'm talking about people who are my friends, not only random strangers).\nMy mindset is shifting toward the belief that most people nowadays have lost sight of what's really important, and only display disgusting, rude, or impulsive behavior and fulfilling one's own immediate needs without regards to others' feelings or the future. I feel as though most systems of power are corrupt and greedy and that the people who *should* be leaders are being trampled by those who value materialism.\nI see this everywhere: the government, \"reality\" TV, the fellow students in my university, the people who *run* my university, any large company, teenagers, doctors, EVERYONE. All anyone cares about is money and screwing others over to get more. Nobody wants to help those in need, and the people that do go unnoticed or are ignored. Everyone's lazy. I feel like I should be living in a past era.. But am I just being delusional? Has the world always been like this? If so, why would I want to live in a world like that?..\n\n**TL;DR My mindset is shifting toward the belief that most people nowadays have lost sight of what's really important, and that most people are impulsive, greedy, and corrupt. Am I delusional or do I have a legitimate basis for feeling anxious?**\n\nEDIT: Branching off that is the fear that soon --because of these types of people-- we will be living in some sort of authoritarian/police state (like N. Korea or something) or that a nuclear apocalypse will occur and there will be no hope. Does anyone else ever think this or am I slowly driving myself insane for no reason?\n\nANOTHER EDIT!: I just thought of another thing. The link between the overuse/misuse of antibiotics and diseases that have evolved to become antibiotic-resistant. Thanks to assholes who don't listen to their doctors and take their meds correctly &amp; the use of antibiotics in animal farming, one day there's gonna be some ridiculous super-illness like the Black Plague that wipes out a good portion of humanity. I'm afraid that's gonna happen in my lifetime and if it does, I'll die from it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This is what I'm anxious about; am I really all that crazy?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qk6vm/this_is_what_im_anxious_about_am_i_really_all/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1330750338,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qfjdf/just_had_a_major_relapse/",
            "id": "qfjdf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qfjdf/just_had_a_major_relapse/",
            "score": 7,
            "selftext": "It’s just so hard sometimes, I’m booked in with my Doctor this week I’m going to have to speak about everything. I’m a stubborn person by nature and I have always surrounded myself in a bubble of putting other people before my own welfare, then people say that they are there for me and my face changes to that happy smile because I hate people knowing what I think.\n\nThen when I try to offer comfort I think people dislike it when I always compare it to my own problems, I can’t relate to people without comparing.\n\nI’m my own worst enemy and I hate myself for it. I don't know what it is lately but I just feel terrible, I'm on Citalopram 20mgs but I don't know if they're helping or not. I've gone back to feeling sick every time I eat something and that's never a good sign for me, it just feels like I'm going into a vicious circle that I can't escape out off.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Just had a major relapse",
            "url": "http://www.reddit.com/r/Anxiety/comments/qfjdf/just_had_a_major_relapse/"
        },
        {
            "author": "nthenwhat",
            "author_created_utc": 1330572822,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_72212",
            "created_utc": 1331082062,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/qkz82/how_to_stop_clenching_teethjaw/",
            "id": "qkz82",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/qkz82/how_to_stop_clenching_teethjaw/",
            "score": 7,
            "selftext": "Hi reddit, not sure if this is anxiety related but I thought it had the best chance of finding an answer here.\n\nI find myself clenching my teeth a lot these days without realizing it. It happens a lot when I am focusing on something else, like counting pills at work or scrubbing a dish. It also happens, well, all the time! I'm afraid I'm going to give myself TMJ.\n\nI stop as soon as I realize it, but a few minutes later I can be right back at it! Have you found any way to stop doing this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How to stop clenching teeth/jaw?",
            "url": "http://www.reddit.com/r/Anxiety/comments/qkz82/how_to_stop_clenching_teethjaw/"
        }
    ]
}