{
    "data": [
        {
            "author": "awaythrow62456",
            "author_created_utc": 1332856170,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7a49c",
            "created_utc": 1332856801,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rfuc7/how_many_of_you_use_the_internet_as_an_escape/",
            "id": "rfuc7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rfuc7/how_many_of_you_use_the_internet_as_an_escape/",
            "score": 188,
            "selftext": "For a long time now, I've been absolutely addicted to the internet. If I don't have something I NEED to do, I'm on the internet. This includes most of my time at work. When I'm not on the internet, I'm restless, anxious, and can't focus on anything, including conversations with people. I get extremely impatient, and even a little angry, internally, when someone engages me in small talk. The only thing that seems to help a little is drinking coffee, which doesn't really erase the anxiety, just gives me a little motivation. When I actually can make myself work on a project (such as music, drawing, cleaning, etc.), I lose attention within 30 minutes. I think it's anxiety-induced ADHD. I know I'm wasting my life spending so much time on the internet, and I really want to be able to accomplish things, but I can't break the habit. \n\nDoes anyone else have experience with this that they can share?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How many of you use the internet as an escape from anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rfuc7/how_many_of_you_use_the_internet_as_an_escape/"
        },
        {
            "author": "0bsessive",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1332469319,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r9ddr/anyone_else_feel_like_their_iq_is_declining_as/",
            "id": "r9ddr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r9ddr/anyone_else_feel_like_their_iq_is_declining_as/",
            "score": 108,
            "selftext": "Every time I go through a rough patch in life I feel like I get increasingly more stupid. I'm just graduating from university (~5 years part time), trying to find academic positions... I can't concentrate, never read, my writing sucks. I know I'm smart, other people say I'm smart, but my brain is so damn foggy or flighty most of the time.\n\n\nIt sucks and it's frustrating. I'm afraid to get any academic position for fear of coming across like a fraud - I built up a degree and now I just feel useless. Hoping the meds help with this...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else feel like their IQ is declining as the anxiety continues?",
            "url": "http://www.reddit.com/r/Anxiety/comments/r9ddr/anyone_else_feel_like_their_iq_is_declining_as/"
        },
        {
            "author": "Hyoioyh",
            "author_created_utc": 1307673274,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5crr8",
            "created_utc": 1332667772,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rcjde/never_have_a_childrens_cartoon_do_such_a_good_job/",
            "id": "rcjde",
            "is_self": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rcjde/never_have_a_childrens_cartoon_do_such_a_good_job/",
            "score": 93,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/Q6Dwiy4l2vkHQ0Zi.jpg",
            "title": "Never have a children's cartoon do such a good job depicting how I've felt over the past two years.",
            "url": "http://i.imgur.com/dcTQZ.gif"
        },
        {
            "author": "xracquellyy",
            "author_created_utc": 1299180207,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4wzqt",
            "created_utc": 1332535207,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rahrl/i_am_completely_proud_of_myself_and_what_i_just/",
            "id": "rahrl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rahrl/i_am_completely_proud_of_myself_and_what_i_just/",
            "score": 83,
            "selftext": "So, I am an anxiety sufferer for 8 years. I have not stood my ground for myself ever in the twenty and a half years I have been here on Earth and today I did. I realize that I may have been wrong in saying what I am about to say, but, I didn't think it was right.\n\nI sold an Xbox 360 to someone and they ripped me off huge. HUGE. The next couple days, I go onto the site to look at ads and I find ALL of my stuff on that site. I am PISSED. I wanted someone to legitimately enjoy those games, not try and sell them for profit. So, I call the guy up and start talking to him about it and I said I want it back because I want someone to legitimately have fun with this stuff and not pawn it off to make profit. He said it was his stuff (which, he IS right, but I still decided to make a statement) and that he can do whatever he wants. Which, I was like, fine, you make a good point, but whatever. After talking back and forth a bit, I just \"Whatever, just have a good life\" and hung up. \n\nI started crying because I was upset and I was shaking from just standing up for myself. It was the first time I had ever done that. I then had a realization that positive things overrule negative ones because the previous day, a couple of people did really nice things yesterday and they were strangers and I just went instantly to thinking about that after what this guy had just done to me.\n\nI am so scared of people. I am borderline agoraphobic and ya, I just wanted to post this because I have never felt so proud of myself. Also today was the first day that I was able to publish articles on a gaming website and get myself out there. Everyone loved my work and ya, I am just proud of what I had done today, and thought this was the appropriate place to post it,\n\nThanks for reading.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I am completely proud of myself and what I just did.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rahrl/i_am_completely_proud_of_myself_and_what_i_just/"
        },
        {
            "author": "Ireallyjustneedahug",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1332360536,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r78i7/to_anyone_having_an_attack_right_now/",
            "id": "r78i7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r78i7/to_anyone_having_an_attack_right_now/",
            "score": 64,
            "selftext": "Breathe. Just breathe.\n\nYou're going to be okay. You're going to get through this.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "To anyone having an attack right now",
            "url": "http://www.reddit.com/r/Anxiety/comments/r78i7/to_anyone_having_an_attack_right_now/"
        },
        {
            "author": "llamas1355",
            "author_created_utc": 1301550762,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_51dbn",
            "created_utc": 1332729902,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rdlrm/i_just_created_a_subreddit_to_post_things_like/",
            "id": "rdlrm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rdlrm/i_just_created_a_subreddit_to_post_things_like/",
            "score": 38,
            "selftext": "[/r/TimetoRelax](http://www.reddit.com/r/TimeToRelax/) please join me in my quest to find all things comforting.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just created a subreddit to post things like videos, songs, and pictures that calm you down.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rdlrm/i_just_created_a_subreddit_to_post_things_like/"
        },
        {
            "author": "asw91",
            "author_created_utc": 1311055222,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5jarf",
            "created_utc": 1332707120,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rd3hv/does_anyone_else_feel_extremely_anxious_the/",
            "id": "rd3hv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rd3hv/does_anyone_else_feel_extremely_anxious_the/",
            "score": 36,
            "selftext": "Does anyone know why this happens or what I can do to prevent it?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel extremely anxious the morning after a night of drinking?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rd3hv/does_anyone_else_feel_extremely_anxious_the/"
        },
        {
            "author": "oupxzy",
            "author_created_utc": 1332415044,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_78ixh",
            "created_utc": 1332415145,
            "domain": "niceblogex.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r880u/look_its_my_new_best_friend/",
            "id": "r880u",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r880u/look_its_my_new_best_friend/",
            "score": 25,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/JkjPRVw1dsUEWtmS.jpg",
            "title": "Look, it’s my new best friend.",
            "url": "http://niceblogex.tumblr.com/post/19728102452/alone-in-neverland-look-its-my-new-best"
        },
        {
            "author": "Legit_GFX",
            "author_created_utc": 1317608172,
            "author_flair_css_class": "",
            "author_flair_text": "Here to help.",
            "author_fullname": "t2_5yxcn",
            "created_utc": 1332637698,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rc3yj/what_is_your_safety_blanket/",
            "id": "rc3yj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 93,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rc3yj/what_is_your_safety_blanket/",
            "score": 22,
            "selftext": "In my English class when I was a sophomore, out teacher told us that when we are in panic, distress, anxiety, and/or depression, we usually go to a \"safety blanket\" that keeps us going, and basically tells us, sub consciously that we will be fine. He called this a \"safety blanket\" because when young kids are scared, anxious, and/or sad, they will usually go to their blanket when makes them feel better. \n\nNow fast forward to this week. Our sink was broken so whenever water was used the pipes underneath would leak. To hold all the water that leaked, for the sake of not ruining the cupboards and keeping away mold, we had to use the \"puke bucket\" to catch all the dripping water. The \"puke bucket\" is the bucket we take out and place by our bed when we feel like we are going to be ill or have been ill prior. To my best understanding a lot of people have a said \"puke bucket\". This week I realized that the \"puke bucket\" is my form of a \"safety blanket\" because a lot of my anxiety is emetophobia (fear of throwing up) and the \"puke bucket\" kind of eliminated the uncomfortable feeling to throwing up into a toilet. Not having this option was in the back of my mind most of the week and kind of enhanced my anxiousness a lot. \n\nSo I guess my question to you guys is, what is your \"safety blanket\"? Whether it be a medicine, stuffed animal, person, etc.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What is your \"safety blanket\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rc3yj/what_is_your_safety_blanket/"
        },
        {
            "author": "jnethery",
            "author_created_utc": 1294599082,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4pgm8",
            "created_utc": 1332820651,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rfd7j/dae_experience_existential_anxiety/",
            "id": "rfd7j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rfd7j/dae_experience_existential_anxiety/",
            "score": 22,
            "selftext": "Relatively frequently, I find myself experiencing terrible anxiety when I think about the nature of existence. Questions such as \"why do I exist?\", \"where did it all come from?\" and \"what is consciousness\" keep me tossing and turning at night and at times make me sick to my stomach. \n\nJust wondering if anyone else has this... almost *fear* of existence and if anyone knows how to cope with these kind of thoughts. Thanks. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE experience existential anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rfd7j/dae_experience_existential_anxiety/"
        },
        {
            "author": "throwawayman44",
            "author_created_utc": 1329523645,
            "author_flair_css_class": "",
            "author_flair_text": "Phobic101",
            "author_fullname": "t2_6y9pa",
            "created_utc": 1332791073,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/renbi/my_timetable_for_the_last_day_before_a/",
            "id": "renbi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/renbi/my_timetable_for_the_last_day_before_a/",
            "score": 21,
            "selftext": "i am pretty sure i don’t suffer from GAD, it is more a phobic thing.  In my last post to you guys,  i copied and pasted an email conversation between a lecturer and myself [here.](http://www.reddit.com/r/Anxiety/comments/pulz9/i_think_that_was_my_first_real_call_for_help_and/)\n\nThere is a lot of backstory here, but I want to make this a long story short as I do not want to make this a megalong post, I have a fear of presenting, and I get anxious about any presentation as soon as I hear that I have to do it, even if it is months away, and the last week before it happensis excruciating. This is all about a presentation I had to deliver after a week’s worth of lab work.\n\nneedless to say the week was fucking stressful, and i knew that my usual bailing out wouldn't work. And that's when shit started to get real.\nI realised I would need some medicinal help, and after getting hold of the right contacts, I had access to citalopram, xanax, diazepam and illegals. \n\nall i could think was that there must be a reason that most of these are difficult to get hold of even with a doctor. I made the decision to use xanax, as it was the only one I could feel safe taking and not passing out or falling asleep. Here is my timetable for the last day, although most of the days of that week felt like this.\n\n\n**6.00am**- wake up, try to watch tv, but feel shaky and like adrenaline is being hosepiped into my veins\n\n**7.30am** – force food down my neck, have to try hard as my stomach and brain aren’t helping. I do this so there is a base for the xanax\n\n**8.00am** – take 0.25mg xanax\n\n**9.00am** – arrive at uni, still feel tense as fuck, but start practising my presentation (I have already been practising for ages but have to do more)\n\n**11am**- take 0.25mg xanax. I still feeling fucking edgy, but now it feels like backburner nerves, which is like a vacation in comparison to the full blown version. Practise some more\n\n**12.30pm**- attempt to eat lunch, at this point any talk with other individuals is difficult, i just can not concentrate on anything other than the presentation\n\n**1.00pm**- take last 0.25mg Xanax. If this bitch doesn’t work, Im fucked\n\n**1.00pm-1.50pm**- practise some more\n\n**2.00pm**- get to class in which presentation is held, there are 80 people in there. feel on even keel\n\n**2.01pm** – class starts, there are many groups to go, so I find out I have to wait till we can present, so just sit there and listen to other groups presentations.\n\n**2.01-2.40pm** – that even keel feeling vanishes. my body feels like it is on fire, WHY ARENT YOU WORKING XANAX! contemplate bailing and just running out the room, fuck the grade, fuck my group. But reason told me not to.\n\n**2.41pm** – our group gets called up to go, I stand up thinking “oh holy shit” and repeat that sentence in my head until I turn to face everyone. 80 faces are looking at me\n\n**2.41pm and a few seconds** – somehow, I switch off, my body lets go, I stop feeling nervous and it feels like a switch has changed in my head. I don’t question it, it feels great.\n\n**2.47pm** – my turn to start talking (we are a group and have different sections of the presentation to talk about). I open my mouth and talk like you would talk to your friends, my brain remembers everything and I put my notes down while speaking (I made it obvious- to let the lecturers and guest lecturers see that I got this)\n\n**2.52pm** – I stop talking, and feel like I have achieved something impossible, my fucking everest.\n\nThe rest of the story is incidental, but I want your opinions on the matter\n\n**TL;DR – trials and tribulations of a 5 minute presentation for an anxious person**\n\n**TL;DR point 2 – Xanax doesn’t help you with a presentation until the last fucking second**\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My timetable for the last day before a presentation",
            "url": "http://www.reddit.com/r/Anxiety/comments/renbi/my_timetable_for_the_last_day_before_a/"
        },
        {
            "author": "vatwxq",
            "author_created_utc": 1332771601,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_79sdx",
            "created_utc": 1332771681,
            "domain": "savedouble.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/re7pa/i_feel_like_mr_giraffe/",
            "id": "re7pa",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/re7pa/i_feel_like_mr_giraffe/",
            "score": 21,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/bzFx948XXochWrC4.jpg",
            "title": "I feel like Mr Giraffe. ",
            "url": "http://savedouble.tumblr.com/post/19953311147/notsofine-i-feel-like-mr-giraffe"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1332708305,
            "domain": "anxietyfriends.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rd4hn/i_started_up_a_new_anxiety_related_site_it_is_a/",
            "id": "rd4hn",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rd4hn/i_started_up_a_new_anxiety_related_site_it_is_a/",
            "score": 14,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I started up a new anxiety related site. It is a forum but we are trying to make chat the emphasis. ",
            "url": "http://www.anxietyfriends.org/"
        },
        {
            "author": "MrImSoGreat",
            "author_created_utc": 1267423748,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3wwl8",
            "created_utc": 1332727391,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rdjov/does_anyone_have_similar_physical_symptoms_as_me/",
            "id": "rdjov",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rdjov/does_anyone_have_similar_physical_symptoms_as_me/",
            "score": 14,
            "selftext": "I've got chronic anxiety attacks that seem to manifest physically... And they've only gotten worse since I was diagnosed with a brain lesion about 2 months ago. I'd like to know if anyone else experiences these kinds of symptoms as well so that I know there's nothing physically wrong. \n\nFaintness. Chest pain. Excessive yawning. Sudden urge for bowel moment. And then basically the big one is the fact that it feels as if my body is shutting down. It feels as if I'm on the verge of the feeling escalating and then I'm going to pass out or die. \n\nI really need help but can't afford a psychiatrist right now. Anyone out there that has experienced this? Please tell me I'm not alone... ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone have similar physical symptoms as me? This is ruining my life... ",
            "url": "http://www.reddit.com/r/Anxiety/comments/rdjov/does_anyone_have_similar_physical_symptoms_as_me/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1332939855,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rhh18/its_currently_12am_and_i_just_woke_up_having_a/",
            "id": "rhh18",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rhh18/its_currently_12am_and_i_just_woke_up_having_a/",
            "score": 13,
            "selftext": "I have a history of them and thought I had it all figured out. I now feel like a total failure and I dunno what to do :(",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Its currently 12am and I just woke up having a panic attack for no reason.... please help :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/rhh18/its_currently_12am_and_i_just_woke_up_having_a/"
        },
        {
            "author": "shewolfe",
            "author_created_utc": 1308942776,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5f7ai",
            "created_utc": 1332367001,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r7e34/attention_students_of_ranxiety_if_your_documented/",
            "id": "r7e34",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r7e34/attention_students_of_ranxiety_if_your_documented/",
            "score": 12,
            "selftext": "I'm working on a blog post with some thoughts on academic accommodations and it occurred to me that some of the information might be useful to you guys as well.\n\nI'm a first-year college student with several conditions that have the potential to interfere with my academic performance, and having accommodations in place has been an absolute lifesaver on more than one occasion. Unfortunately, a lot of my classmates and friends at other schools seem to have no idea that you can apply for accommodations without having a more \"conventional\" learning disability, like ADD or dyslexia. This is not the case at all. If you have a condition for which you can provide documentation and reasons why it is a factor in your academic performance, you are entitled to accommodations.\n\nMy accommodations are in place for issues related to generalized anxiety, OCD, and bipolar disorder. They all have their own effects on my ability to perform--the anxiety makes me paranoid about other people finishing before me, time constraints, and randomly getting accused of cheating; the OCD makes multiple-choice bubble sheets absolute hell; and in hypomanic phases of bipolar exams tend to take longer than they should because I can't focus very well. My accommodations reflect these concerns: I get time-and-a-half so that I'm not as worried about not being able to finish and I have more time to get my act together if I'm having concentration issues or obsessively rechecking answers, and I get private testing space to reduce distraction and assuage my weird concerns about other people finishing before me or being wrongfully accused of cheating.\n\nThe dean in charge of my accommodations is absolutely wonderful. She's incredibly sympathetic, and during my first semester when I had a terrible anxiety attack the night before a midterm she answered the phone in the middle of the night and helped me arrange a private space for the next morning. I can't possibly express how helpful it is to have someone in the dean's office on your side and aware of your situation when things are out of control.\n\nAnd for those of you who don't have a formal diagnosis or the means to get the required documentation, still go in and talk to someone about it. Because I didn't have the kind of neuropsychiatric testing that my college requires to formally document a mental illnesses, my dean gave me temporary accommodations for this year until I could get testing done. And as if that weren't enough, she applied for and secured funding from the college to cover my neuropsych evaluation costs, which would have been quite pricey otherwise. Thanks to her, I'll have testing that's up-to-date enough to get me the accommodations I need through undergrad and possibly even grad school depending on when I choose to go.\n\nEven if you don't always use them, if you are eligible, **get the accommodations to which you are entitled.** You never know when you might need them. It is not \"special treatment\" in the way that some people imply, as if you're getting an advantage over other students. By definition, academic accommodations are intended to allow students to perform as well as they would be capable of performing were their disability not a factor in their ability to succeed. You deserve to have the same shot at success as anyone else, and accommodations can help make that a reality.\n\ntl;dr: **Academic accommodations are an amazing resource that you should take advantage of if your anxiety (or any other condition) is affecting your academic performance. Don't be shy, it's your legal right to have them!**\n\nFeel free to comment/message me if you have any specific questions about types of accommodations, documentation, talking to your deans and dealing with university bureaucracy, etc. I hope some people find this helpful!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Attention students of r/anxiety: If your documented anxiety condition affects your performance in class, on assignments, or on exams, you are entitled to academic accommodations. Take advantage of them!",
            "url": "http://www.reddit.com/r/Anxiety/comments/r7e34/attention_students_of_ranxiety_if_your_documented/"
        },
        {
            "author": "Ireallyjustneedahug",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1332714910,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rd9qy/cortéz_and_his_burning_ships/",
            "id": "rd9qy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rd9qy/cortéz_and_his_burning_ships/",
            "score": 12,
            "selftext": "My dad told me something interesting last week.\n\nDecide comes from a latin root that translates to \"cut off\". When you make a decision, you \"cut off\" all other options. When Hernán Cortéz landed in Cozumel during the Spanish Conquests, he burned all his ships so neither he nor his crew could turn back. He made a decision, and in making it had cut off any escape from that choice. \n\nI can't get what my dad said out of my head. It's a scary concept, right? Once you choose something, BAM, no turning back. Still, it gives a sense of power. \"This is what I'm going to do, and I'm only going to look forward.\"\n\nI'm not sure if it makes much sense, but it's kind of helped me.\n\n\nTwo weeks ago my long term boyfriend broke up with me... And last night I had sexy times with a guy I've had an incredibly complicated past with. Our dynamic changed. My life has changed. Everything, even non-romantic, has changed. I'm in a transitional part of my life right now.\n\nAfter last night, he told me he had no regrets. He asked me how I felt, and I told him that when I closed my eyes I saw Cortéz and his burning ships.\n\nThere's no turning back, and I'm blindly moving forward. That's not entirely a bad thing.\n\nI'm not sure how much sense this made, but I just needed to let that out.\n\nIf anyone ever needs a shoulder, I'm here, /r/anxiety. &amp;lt;3",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Cortéz and his Burning Ships",
            "url": "http://www.reddit.com/r/Anxiety/comments/rd9qy/cortéz_and_his_burning_ships/"
        },
        {
            "author": "Shotty772",
            "author_created_utc": 1283988529,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4brru",
            "created_utc": 1332469410,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r9dgo/anxiety_success_story/",
            "id": "r9dgo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r9dgo/anxiety_success_story/",
            "score": 10,
            "selftext": "Warning: Long story, but helpful if you are struggling at the moment\n\nI am a 23 year old male and since December 14, I have been suffering from what is known as a \"Nervous Breakdown\". It started out as a weird feeling, like a light-headedness that would never go away. I knew it probably due to anxiety because it was my finals at my university, and told myself it would go away after the finals week (which was the next week).\n\nSo, after finals week the feeling did not go away, it actually go much worse. I started feeling disassociated from myself (almost like I was watching my life happen from afar). Then, I started getting a constant headache. It felt like a burning feeling going from my temples to the base of my neck. Christmas came and went and it was not getting any better. In fact, it was getting much worse.\n\nI started getting depressed every night. I would think about dying and it would make me cry for no reason. I always had the feeling that someone in my family was in trouble, or going to die. It was such a terrible time. I knew I needed to seek help, so I made a list of my symptoms (which came out to be over 20!), and went to the doctor.\n\nThe doctor started me out on Celexa 20mg and it started helping within the first week. After 6 weeks, almost all my symptoms were gone, except the darn light-headedness and depression! So, I returned to the doctor on Monday, and he upped my dosage to 40mg and ALL MY SYMPTOMS disappeared! \n\nI just wanted to share a success story and let anyone out there know that if you are struggling, it is going to get better! Just make the effort to get help!\n\nTL;DR Hooray for science!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety Success Story!",
            "url": "http://www.reddit.com/r/Anxiety/comments/r9dgo/anxiety_success_story/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1332820254,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rfcvw/how_can_i_tell_if_i_actually_have_an_anxiety/",
            "id": "rfcvw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rfcvw/how_can_i_tell_if_i_actually_have_an_anxiety/",
            "score": 10,
            "selftext": "I'm a 15 year old male. I live in a stable middle class family, I have lots of friends, and get plenty of exercise. However, I've been really depressed and anxious recently. It's gotten to the point where I think about suicide multiple times a day and have panic attacks almost every night for no good reason.\n\nMy parents are the only people that know about this because I'm pretty good at hiding it (I'm sure you're all aware of the stigma that comes with having emotional/mental problems, especially if you're a guy). They just tell me that it's part of being a teenager and that I'll be fine in a couple years if I just work harder. I'm aware that hormones are fucking with my brain at this point in my life, but it seems a lot worse than what most people are dealing with right now.\n\nAnyway, is it possible to tell if I should get help or just man up and deal with it? I used to take pills for anxiety when I was 7-10 years old, but I've been okay for the most part until the past year. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How can I tell if I actually have an anxiety problem or if it's just me being a teenager?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rfcvw/how_can_i_tell_if_i_actually_have_an_anxiety/"
        },
        {
            "author": "Losinggriponsanity",
            "author_created_utc": 1332934471,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7afjx",
            "created_utc": 1332941133,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rhhqc/whats_wrong_with_me_long/",
            "id": "rhhqc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rhhqc/whats_wrong_with_me_long/",
            "score": 10,
            "selftext": "First off, I know I need to see a professional but I can't afford it. \n\nI have these fantasies of myself an loved ones dying or being seriously hurt. Not a fantasy I want to have but an uncontrollable nightmare when I'm awake. I've had issue with that for as long as I can remember and it's worst at night and when I drive. It gets so bad that I cry as if it really happened. Sometimes I have to pull over because the feeling is do overwhelming, I can't breathe and feel like I'll pass out. Driving in general causes a strong sense of panic in me that's almost unbearable. \n\nLately I'm finding that these fantasies are becoming for frequent and set off by little things. For example, when my boyfriend is at work we text throughout the day. There are several times he goes a whole without texting because he is working. I know this and it's never been an issue before but recently it sends me into a crazed state of mind. I start thinking all sorts of horrible things have happened. It happens with friends too, like if I call or text and try don't answer I go into one of my day nightmare things. \n\nAlso, when things don't go according to plan, even a five minute offset will send me into this insane whirlwind of chaos. I feel like my world is collapsing. I call what I feel a wild fire because it starts so small and quickly escalates to the point here I feel like I should just stop existing. I have no intentions on killing myself. I know what I have to live for and I know these thoughts are absurd and temporary. The problem is that they become very frequent at times. I'll go a while without them, though still having the occasional panic feelings. But they always come back strong. \n\nI'm also having a lot of paranoia that everyone is hiding stuff from me and trying to make me out to be a fool. It's strongest in my relationship with my boyfriend, mainly because I talk to him the most. I completely trust him and every time I've had suspicious, completely unwarranted suspicions, I've been proven wrong. I don't question him because I know it's all in my head. Again, I experience the same thing with friends and family, hell even complete strangers. I sometimes question everyone's motives for any interaction I have with them. It's almost to the point where I want to run away and hide from the world. I force myself not to. \n\nI am generally a very happy bubbly goofy person. I love life and everyone in mine. I believe I am a very insightful and smart person. It's as if there are two of me and we are constantly at war. Is this anxiety, depression, or something more? Is there anything I can do to avoid these feelings? I know therapy is needed but like I said, I can't afford it right now. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What's wrong with me? (Long)",
            "url": "http://www.reddit.com/r/Anxiety/comments/rhhqc/whats_wrong_with_me_long/"
        },
        {
            "author": "dweckl",
            "author_created_utc": 1253638522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3n51i",
            "created_utc": 1332464456,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r99ba/anxious_frustrated_or_unhappy_take_a_closer_look/",
            "id": "r99ba",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r99ba/anxious_frustrated_or_unhappy_take_a_closer_look/",
            "score": 9,
            "selftext": "Everyone has internal rules that they use to constantly \"ping\" against.  For example, you have internal rules about when you can be happy, and those rules probably are very different from mine, another person, or those who live in other cultures. \n\nIf you've ever watched Real Housewives, you've seen a number of people whose internal rules require money, youthful looks, or expensive clothing before they can be happy.  This is a stark contrast to the homeless man on the street, or the child starving in another country, whose internal rules permit them to be happy if they have a warm meal and some shelter. \n\nA real problem arises when your internal rules require something impossible, highly improbably, or totally unpredictable before you will feel happy, relaxed, or good about yourself.  The student whose rule is that he cannot be happy with anything less than all \"A's,\" and the approval-seeking person who cannot be happy unless *everyone* likes him, are examples of people likely to remain anxious and disappointed in their lives.  \n\nTake a look at your rules.  Ask yourself what you value internally, and whether you have rules that cannot be met or are unpredictable.  Ask yourself how you would feel if things were not perfect, or if someone didn't like you, or if you failed at something, or if you said something stupid a couple of times in front of other people.  If your rules require perfection in this areas, then you are playing a game that you simply cannot win.  Stop playing and change the rules.  \n\nA closing semi-quote:  I recall some funny quote/metaphor used to demonstrate the pointlessness of trying to win an 'unwinnable' argument.  I think it also works to show how pointless it is to set internal rules that you can never meet.  Something like \"It's like trying to play chess against a pigeon; it will jump on the board, knock over the pieces, take a shit on the table, and strut around like it just won.  Why?  Because it doesn't play by the rules.\"  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxious, frustrated, or unhappy?  Take a closer look at your inner \"rules.\"  ",
            "url": "http://www.reddit.com/r/Anxiety/comments/r99ba/anxious_frustrated_or_unhappy_take_a_closer_look/"
        },
        {
            "author": "linksfan",
            "author_created_utc": 1297108460,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_4te9i",
            "created_utc": 1332692496,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rcs83/this_afternoon_i_emailed_my_lecturer_and/",
            "id": "rcs83",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rcs83/this_afternoon_i_emailed_my_lecturer_and/",
            "score": 9,
            "selftext": "All I did was send him an email asking if he'd be able to help me but I was worrying about what he would think of me if he found out I don't know the stuff. Worried so much that I was considering just struggling through it and possibly failing.\n\nThen of course I started panicking about failing the course and that seemed to overcome my fear of my lecturer being disappointed in me.\n\nEveryone else I know would just do it. Makes sense, doesn't it? Doesn't matter if the lecturer is disappointed as long as you get help.\n\nSo what seemingly small things (to people without anxiety) have you accomplished recently that you couldn't before, for whatever reason?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This afternoon I emailed my lecturer and basically admitted that I don't know how to do my coursework. What seemingly small things have you accomplished recently that anxiety was holding you back from?",
            "url": "http://www.reddit.com/r/Anxiety/comments/rcs83/this_afternoon_i_emailed_my_lecturer_and/"
        },
        {
            "author": "bootsinowski",
            "author_created_utc": 1191634927,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_2x48g",
            "created_utc": 1332440010,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r8ol9/bit_the_bullet_and_it_tasted_good_new_medicine/",
            "id": "r8ol9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r8ol9/bit_the_bullet_and_it_tasted_good_new_medicine/",
            "score": 8,
            "selftext": "This ain't gonna be much of a post, quality-wise.  It's too early to tell if I'm really getting better or not.  But I feel like I might be, and having that new hope is a great, great thing to have with problems such as we have here.\n\nSo I got a therapist.  I live in a smallish town, so I don't know how good she is.  But I'm going every two weeks, and we're talking about ways to manage these intense negative and sometimes surreal feelings.  I also went to a psychiatrist.  I don't know much about his credentials, but I can tell he is a special man: he is in his eighties and still very dedicated to his art (he called it an art, specifically, which impressed me since I have always felt that way about medicine in general).  He put me on Vybriid, a new-ish antidepressant, and then also Abilify, which is a mood stabilizer.  The Abilify completely overwhelmed me with nausea the first day, and I felt somewhat like I just couldn't take it anymore. But I took some time out the next day (just in case I got sick again) and tried it again, and this time, the nausea was gone.  I felt a little weird but overall, kind of relaxed and not too shabby at all, really. \n\nSo I'm on my seventh day of this new regiment, and things are looking up.  I still have some anxiety centered around school; today is my \"hell day\", as I have work all day and then school until 9:30 pm, so more or less a 14-15 hour day. I don't know for sure, but I feel like I might just make it through today pretty well.  And if not, I always have some klonopin to see me through - though my goal tonight is not to need them at all.  I'd really really enjoy being able to tell my folks and my wife that I got through a night of school without feeling like my world was collapsing around me, or that I would disappear forever, or however many other lame scenarios pop into my head when anxiety rises up.\n\nAnyway. I'm remaining cautiously optimistic, because I know I've got a ways to go.  But I just look outside at this beautiful Georgia spring weather, and I soak in the sun for a few minutes, and I think to myself, damn, apart from all these kooky conservatives, today is a really really fine day!  I hope things are looking up for all of you soon too, and I hope we continue to just keep getting better and better. Thanks for reading.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Bit the bullet, and it tasted good.  New medicine, new doctors, A+++ would do again.",
            "url": "http://www.reddit.com/r/Anxiety/comments/r8ol9/bit_the_bullet_and_it_tasted_good_new_medicine/"
        },
        {
            "author": "tinkertaylor",
            "author_created_utc": 1332419074,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_78jjb",
            "created_utc": 1332419113,
            "domain": "succeedsocially.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/r89m8/article_on_overall_attitudes_for_handling_anxiety/",
            "id": "r89m8",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/r89m8/article_on_overall_attitudes_for_handling_anxiety/",
            "score": 8,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/XnLA-d70H9AGNUSg.jpg",
            "title": "Article on overall attitudes For handling anxiety",
            "url": "http://www.succeedsocially.com/anxietyattitude"
        },
        {
            "author": "MeadowlandFan",
            "author_created_utc": 1326421171,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ni4y",
            "created_utc": 1332625781,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/rbvvb/new_here_anxiety_sufferer_for_years_and_years_and/",
            "id": "rbvvb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/rbvvb/new_here_anxiety_sufferer_for_years_and_years_and/",
            "score": 8,
            "selftext": "So I'm on my own, 28 years going on 29, in grad school, thousands and thousands of miles away from my family.  Nuclear family split up, parents both loving and supportive but far away and married to new people.  I keep going through cycles where I'm on top of things, but then I nosedive right back down.  I haven't checked my mail in weeks, I am afraid to listen to my voice messages, and I'm in a constant state of panic over things that in reality I know aren't a big deal.  I tried to get help through the school, but they just told me they'd send me a list of therapists and never did.  I haven't had the time since to follow up - too much work to do at school.  \n\nMy one coping mechanism is food.  In the past year, I've gained 15 lbs, and while I'm not quite in the realm of \"fat\" yet, weight has been a lifelong struggle for me.  A few years ago I finally got active and was down to 165, now I'm back up to 180 and climbing and I sometimes feel like food is my only friend.  I don't have any other vices (pot makes my anxiety worse and I can't afford it or alcohol, which isn't worth the hangovers).\n\nMy girlfriend situation is worse.  She's got her own problems, and I knew I had to break it off because we were both miserable but she's a good kid at heart and she cried her eyes out and felt very bad, and now I feel worse because of it.  I just want to call her and tell her everything's okay, but it's not, because she slept with her ex boyfriend and has had the occasion to turn physically abusive (punching, etc) when she gets mad (bipolar?).  \n\nI'm now petrified she'll find this and tell everyone at school...I realize this is all kind of one big run on sentence but when you're too afraid to pay your bills and leave your darkened apartment for NO GOOD REASON it kind of gets to you.\n\nAll of this was exacerbated by a very, very bad breakup a year ago with someone I really really liked.  Maybe the only person (I've dated a lot of girls) I've ever felt that strongly about.  I'm still working through it.\n\nHelp?  What in hell do I do?  Time is short because in one year I have to literally be lucratively employed or be destroyed by student debt (private and govt) and this anxiety is hurting my ability to do work, get a good reputation, and then get a job in my industry.\n\nTL;DR - I'm having anxiety issues.  I'm glad this isn't 4chan.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "New here.  Anxiety sufferer for years and years and it's finally starting to destroy me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/rbvvb/new_here_anxiety_sufferer_for_years_and_years_and/"
        }
    ]
}