{
    "data": [
        {
            "author": "sosallycanwait17",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1336516189,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tdo2m/anyone_else_avoid_using_a_word_if_you_arent_100/",
            "id": "tdo2m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tdo2m/anyone_else_avoid_using_a_word_if_you_arent_100/",
            "score": 82,
            "selftext": "I'm just terrified of looking stupid.  There have been times when I have pretended to forget what word I want so that I can manipulate someone else into saying it and then copy them.  Lucky for me, I'm forgetful anyway, so no one ever suspects.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else avoid using a word if you aren't 100% sure how to pronounce it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/tdo2m/anyone_else_avoid_using_a_word_if_you_arent_100/"
        },
        {
            "author": "Mylifesuckswah",
            "author_created_utc": 1335116173,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7j00z",
            "created_utc": 1337019050,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tms3b/i_cant_go_to_school_has_anyone_else_felt_this_way/",
            "id": "tms3b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tms3b/i_cant_go_to_school_has_anyone_else_felt_this_way/",
            "score": 67,
            "selftext": "I'm 17, in grade 12. I just can't get myself to school. Sometimes I'll go several days in a row, but lately I've been missing almost every day. I wake up, remember that I have to go to school, then I'm overcome by a sense of dread, so I just roll over and go back to sleep. When I wake up later I feel so guilty for not going.\n\nI don't have any particular fear about school. When I do go, the day goes by without any problems. I have no problem sitting in class, hanging out with my friends at lunch, etc. I just can't get myself there.\n\nMy psychiatrist knows about the problem, but he just told me I need to get more sleep. But I kow that's not the problem; sometimes when I do get out of bed and get to school, I don't enter the building and just go sit in the park instead. \n\nOh and I think I might have depression, but my psychiatrist doesn't think so.\nPlease tell me that some of you have dealt with this before??",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't go to school. Has anyone else felt this way?",
            "url": "http://www.reddit.com/r/Anxiety/comments/tms3b/i_cant_go_to_school_has_anyone_else_felt_this_way/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1336575354,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/terch/i_feel_like_i_hold_myself_back_too_much_due_to/",
            "id": "terch",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/terch/i_feel_like_i_hold_myself_back_too_much_due_to/",
            "score": 39,
            "selftext": "I guess you can say I am an overly \"cautious\" person. I'm always on the safe side, never really taking risks. My mother always drastically told me to be careful like a broken record (sometimes she says it twice real fast before I end a phone conversation or leave the house). Those two words just run through my head constantly. Every time I would think about taking a risk or breaking a rule I'd get way to overwhelmed to go through with anything. When I did, I always had a strong sense of guilt. I feel like most of the time, my anxiety holds me back from living my life to the fullest. In a way it seems like I'm missing opportunities and I'm stuck in the corner in a fetal position. I wish my friends understood anxiety sometimes. I know it really annoys and bothers them a lot, but I can't help it! I always feel awful when I have a complete panic attack and they have to see a side of me I would never want them to witness. I can't stop it when it happens, and it just bugs me to no end. I wish I didn't have anxiety, or feel the need to question every single thing I do, or overanalyze it. I think too much about \"what could go wrong\" and turn it into \"this WILL go wrong, and here are the possible outcomes (which are the worst case scenario).\" I hate you anxiety I really do. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like I hold myself back too much due to anxiety. Anyone else feel this way?",
            "url": "http://www.reddit.com/r/Anxiety/comments/terch/i_feel_like_i_hold_myself_back_too_much_due_to/"
        },
        {
            "author": "cosjas",
            "author_created_utc": 1237542470,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3f2g7",
            "created_utc": 1336665083,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tgm33/rant_brain_fog/",
            "id": "tgm33",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tgm33/rant_brain_fog/",
            "score": 29,
            "selftext": "God... I hate how I feel. The constant anxiety, the depersonalisation and derealisation. The worst though is probably the brain fog. Not being able to understand things, not being able to remember what somebody told me a few minutes ago. I hate it so much :( I'm a young guy. I used to be really quite smart, but now I feel so incredibly mentally crippled. I fucking hate it :(\n\nFeel so hopeless about it all.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[rant] Brain fog :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/tgm33/rant_brain_fog/"
        },
        {
            "author": "thisguysthrowaway23",
            "author_created_utc": 1319241670,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_63bpa",
            "created_utc": 1336444510,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tc9xc/i_really_really_hate_it_when_people_ask_me_about/",
            "id": "tc9xc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tc9xc/i_really_really_hate_it_when_people_ask_me_about/",
            "score": 28,
            "selftext": "Whenever people try to make small talk with me, they always, without fail, ask me \"What are you going to school for?\" (always those exact words, every time.) To which I reply \"a computer science degree.\" And I always get a terrible feeling about it, because I know it's something I'm should be giving a shit about, but it's so hard for me to do so.\n\nWorse still is when they ask me how long I've got left (my parents in particular are fond of this question), and I can't even give them a straight answer. I've completed my fifth year for what was supposed to be a four year degree, with still no end in sight. And it doesn't help that I only took two classes this semester (they were the only two from their stupid flowchart that I could find available) and they were both in the evening (morning/afternoon classes would fit my life way better, but NONE of the classes I needed were offered in that timeframe).\n\nTo top it off, I'm positive I've failed one of those classes, and there's a fair chance I'm going to fail the other, too, because it's so goddamn hard for me to concentrate because I don't give a shit about anything they teach. I can concentrate on Skyrim and Reddit and anime without a problem, sure, but when it comes to shit I actually have to do, shit I keep dumping thousands and thousands of dollars into, I can only focus on it for maybe ten minutes before I get distracted for hours. I have only myself to blame for this, too, because it was so easy for me to coast through high school with that mentality, and I can't seem to break my old habits and fit them into a college lifestyle.\n\nI hate school so much. I hate that I chose to go to such an expensive school, to learn things I'm only going to forget once I'm finished with the final exam, things that I can easily Google on the offchance that I actually need them in the real world. I hate that I'm putting myself close to $100 thousand in debt and yet I STILL can't focus enough to not fail classes left and right. I hate that some fat cat is lining his pockets because of my stupid choices. I hate that I'm pretty much stuck having to complete this, otherwise I've sunk almost 100 grand for absolutely nothing. I hate that all this is really going to get me is a slip of paper that some fat guy in a suit is going to consider for ~30 seconds, before hiring me into a job I'm probably going to hate, but be stuck in for the rest of my life because I have to pay off the school loans that got me through a school I hated so I can get a decent-paying job to pay them off. I hate how all my high school teachers insisted I go to college, and I, young and naive, did exactly that, and by the time I was old enough to realize how fucked up the system was and how universities are just corporations that give more of a shit about lining their own pockets than actually providing a quality education, they had already caught me in their disgusting trap.\n\nI hate the system.\n\nThe worst part is, I don't even get to experience the fun part of college. I drive there twice a week, I talk to literally no one, I sit in class, I browse Reddit instead of paying attention to the lecture, and I go home. I never go to any college parties, I never hang around cute girls, I never joined any fraternities, I never joined any clubs, none of that. I have no friends there (although I do have non-college friends, at the very least). I know they have stuff going on at least once a month, like movies and comedians and shit, but it's usually on Thursdays or Fridays, when I only have classes on Mondays and Wednesdays, and I can't rationalize making the 40 mile one way commute just to watch a movie and not talk to anyone since I don't know anyone in the first place, and I really, really don't have the ability to walk up to a random person and strike up a conversation.\n\nIt just feels like I'm wasting my youth on bullshit.\n\nSorry for the wall of text. This is just something I really needed to get off my chest, and I don't really have anyone to talk to about it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I really, really hate it when people ask me about school. [Rant]",
            "url": "http://www.reddit.com/r/Anxiety/comments/tc9xc/i_really_really_hate_it_when_people_ask_me_about/"
        },
        {
            "author": "gsm228",
            "author_created_utc": 1321641568,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_69oes",
            "created_utc": 1336833263,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tjo1t/anxiety_sufferers_of_reddit_aside_from_medication/",
            "id": "tjo1t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tjo1t/anxiety_sufferers_of_reddit_aside_from_medication/",
            "score": 27,
            "selftext": "Mine have been [mindfulness](http://www.youtube.com/watch?v=3nwwKbM_vJc), and more specifically thinking of the physical tension of anxiety as a sort of muscle twitch, without meaning. What are yours?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety sufferers of Reddit. Aside from medication, what specific techniques have you found most effective for dealing with anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/tjo1t/anxiety_sufferers_of_reddit_aside_from_medication/"
        },
        {
            "author": "jumpingtheship",
            "author_created_utc": 1321839686,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6a5dv",
            "created_utc": 1336421596,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tboi9/lets_talk_about_the_positives/",
            "id": "tboi9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tboi9/lets_talk_about_the_positives/",
            "score": 27,
            "selftext": "I know anxiety sucks and I'm sure many, if not all, of us has googled \"overcoming anxiety\" or \"anxiety success stories.\"  And sometimes, we just need to see the positives and know that other people who have suffered have pulled through and overcome this.  It's a long road, but we need to remember we use to be worse off than we are now and we are strong.\n\nSo what are your positives?  What goal, small or large, have you achieved recently?\n\nI'll start:\n\n- Six months ago, I had trouble just waiting 20 minutes to get my Rx filled in the middle of the day during the week when Target is not busy.  Now I can spend a couple hours in a crowded mall shopping.\n\n- Now I workout regularly and eat healthy.  I've lost 33 pounds in 8 months.\n\n- I can now wait in long lines (sometimes, I need to do deep breathing and distract my mind but it's a whole lot better than before when I'd have a full on attack when I just even saw the long lines).",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Let's Talk About the Positives",
            "url": "http://www.reddit.com/r/Anxiety/comments/tboi9/lets_talk_about_the_positives/"
        },
        {
            "author": "SometimesRhymes",
            "author_created_utc": 1310632632,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ii5z",
            "created_utc": 1336993901,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tmb1t/does_anyone_else_feel_like_theyve_got_a_lump_in/",
            "id": "tmb1t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tmb1t/does_anyone_else_feel_like_theyve_got_a_lump_in/",
            "score": 27,
            "selftext": "I've had this problem for a couple days now, and as a newly diagnosed sufferer of anxiety every new change in my body scares me.  It only really happens when I think about it, but when it does it's quite annoying.  It does not affect my eating/drinking, as the lump sort of \"goes away\" while swallowing food.  Does this happen to anyone else?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel like they've got a lump in their throat, making it more difficult to swallow?  ",
            "url": "http://www.reddit.com/r/Anxiety/comments/tmb1t/does_anyone_else_feel_like_theyve_got_a_lump_in/"
        },
        {
            "author": "dbvapor",
            "author_created_utc": 1322159999,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6b16f",
            "created_utc": 1336572786,
            "domain": "askdoctork.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tepd7/has_anyone_here_gone_through_cognitive_behavioral/",
            "id": "tepd7",
            "is_self": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tepd7/has_anyone_here_gone_through_cognitive_behavioral/",
            "score": 24,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/8-tg8TtgEtKx1BtZ.jpg",
            "title": "Has anyone here gone through cognitive behavioral therapy?",
            "url": "http://www.askdoctork.com/how-is-cognitive-behavioral-therapy-used-to-treat-anxiety-201205071763"
        },
        {
            "author": "willmilll",
            "author_created_utc": 1335033432,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7iqp2",
            "created_utc": 1336923916,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tl1pd/65yr_old_needs_soothing_and_advice_about_treatment/",
            "id": "tl1pd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tl1pd/65yr_old_needs_soothing_and_advice_about_treatment/",
            "score": 22,
            "selftext": "I am 65yr-old and recently I was diagnosed with atrial fibrillation and one month ago I had a transient ischemic attack *(TIA - a minor stroke). \n\nSince then, I've been told by my doctor to take Xarelto 20mg (an oral anticoagulant), aspirin, a beta-blocker (Pindolol) and an antidepressant (Lexapro or Escitalopram) . I have no known risk factors (idiopathic? early ageing?), I'm physically very active for my age, but I have suffered a lot due to anxiety and depression, mostly after I lost my wife (6-yrs ago) and started unhappy liasions with young women since then. \n\nWhat worries me most is the feeling of being alone and undersupported by my fellow doctors (I am a pathologist and teacher in this branch of medicine). I need to sleep well since this is the only way to calm down my heart. \n\nAbout the sleeping matter there has not been agreement between the neurologist and the cardiologist that are taking care of my case. The first one advised me to replace Alprazolam (better known as Xanax) by Zolpidem (Ambien) in order to avoid addiction. The other one advised me to take Alprazolam (better known as Xanax), since according to him I have a profile for that.\n\nWhat troubles me most are my almost constant chest discomfort and breathlessness, which increase in the afternoon. Sometimes I have a feeling of helplessness because my doctors don't call me back, since I need to be advised more frequently, and this situation is leading me almost to take entire charge of my own care, even if it risks me of self-inflicted side-effects, addiction or overdose accident, even death. I need to be relieved of my physical pain, anxiety and anguish.\n\nI woud like to have the advice of the reddit colleagues, specialists or not, about ways to help me. I need urgently to have something to relieve my breath distress and inner chest pain, mostly during the afternoon. Is it possible to associate Clonazepam (Klonopin) during the day, with Zolpidem (Ambien) at night?\n\nMy condition is very stigmitizing and sometimes I have the feeling of being deprived of support, even by my psychoanalist. My cardiologist told me that I would be benefitted by an AF ablation procedure, so I decided to go to São Paulo (I live in Brazil) at the end of this month in order to be examined by a great specialist in heart arrythmias.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "65-yr old needs soothing and advice about treatment",
            "url": "http://www.reddit.com/r/Anxiety/comments/tl1pd/65yr_old_needs_soothing_and_advice_about_treatment/"
        },
        {
            "author": "throwsadwife",
            "author_created_utc": 1336752060,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7p22m",
            "created_utc": 1336753548,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ticqg/wife_is_having_a_breakdown_i_want_to_help/",
            "id": "ticqg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ticqg/wife_is_having_a_breakdown_i_want_to_help/",
            "score": 22,
            "selftext": "My wife and I got married about a year ago. We are very happy with each other and there seems to be no problems between us. We share everything and never keep secrets. \nWhen we were still dating years ago, she started a week long panic attack that didn't seem to go away. (feeling of encroaching death, diarrhea, loss of appetite, helplessness, anxiety focused towards the next attack, sobbing, complete and utter fear). She got on medication (something related to Lexapro), started exercising, etc. and eventually the symptoms subsided for the most part. She has been generally better and has not had a serious panic attack since. \nRecently though, she has been wanting to get off of the medication due to birth defect warnings (we may want a kid soon) and her general attitude which makes her want to be able to handle this on her own. She talked with her doctor and they decided to try to step her down off of it. Didn't work so well. She basically tumbled into the same week long panic attack that she had experienced in the beginning of this. She has been waking up with panic attacks in the very early morning and can barely make it to work (her work doesn't seem to take the illness seriously and thinks she is just flaking out which adds to her stress level even more). \nNow she typically gets panic symptoms when she is about to go to work, at work, thinking about work, and then the non-consistent panic attacks that we can barely attribute to anything very significant. She has increased her dose in steps back up to the original amount she was taking previously and seeeeems to be doing better. I say seems because  it still seems like she is fighting demons off in her head and she may just be able to cope with it better, or a combination of both. \n\nShe also has picked up a new source of anxiety based on the fact that she may never be able to get off of her medication without losing control of her life. \n\nAre people with this chronic anxiety ever able to get off of medication? Does anyone have any advice for coping while reducing dosage? Has anyone completely stopped taking meds for their anxiety and feel good about it? I am taking meds for my own case of anxiety and depression which is no where near the intensity she feels. My opinion is that I wish I had never started taking it as i would't have to deal with the 'lightnings' I feel when I am without the meds and other reasons. I don't think other more severe cases can do that as easily. \n\ntl;dr wife tried to get off anxiety meds, relapsed badly \n\nOn a side note, I read this subreddit a lot and it really helps me gain perspective for both my anxiety and my wife's. Thank you everyone here for posting, you make us feel less alone. \n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Wife is having a breakdown. I want to help. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/ticqg/wife_is_having_a_breakdown_i_want_to_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1336645157,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tg9tg/my_first_real_acceptance_that_i_suffer_from/",
            "id": "tg9tg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tg9tg/my_first_real_acceptance_that_i_suffer_from/",
            "score": 21,
            "selftext": "So I guess I'll start with the fact that I'm 32, and have had some medium success in my job as an artist.  I married a wonderful woman this past year.  But in the last few weeks, I feel like my life is coming apart at the seams.  Money has always been a problem for me.  I bought a townhome about 6-7 years ago at peak market value and have come to find out that despite all my hard work in making my mortgage payments- this townhome is now worth maybe 40% of what I bought it for.  I'm so far underwater that I will never be able to get out of this place and raise a family with my wife in a proper home- one with a yard and a good school district.  So I'm weighing my options of foreclosure or possible bankruptcy.  The crushing shame that bankruptcy brings to my mind makes me feel like I've failed as an artist- failed to make enough to even survive some months.  And while I have managed to make enough to get by most months, without my wife's income I would have sunk long ago.  I've also been suffering from a crippling lack of motivation to get into my studio or make phone calls that could produce work.  My fear and anxiety has gotten the best of me.  My wife can see this, and has tried to help me, but I also fear that she will eventually realize that she could do much better than me.  In past times, she's told me that I am not affectionate enough, and has questioned my ability to go on with my career... that maybe I should seek out a regular job.  This is tremendously difficult to hear, when my whole life has been working towards trying to be a successful artist, and the one person who should be encouraging me is doubting me.  Also, my job can be so rewarding to me when I create something beautiful, but sometimes I honestly cannot even bring myself to even try. And the only explanation I can come up with for it is crippling FEAR.  I carry a lot of shame for some of the things I've done in the past.  Before we were married, I wasn't as faithful as I should have been to my wife.  I'm ashamed of some things that I did, and afraid that at any moment it could come back to ruin my marriage.  I realize that I did these things because I'm insecure and egotistical.  The attention that I got made me feel good at the time, but it was empty.  A person I work with has decided to wage an email campaign of hate against me, via mutual acquaintances.  He's called me every name in the book, worst of them being LIAR.  I've always made it important to myself to be honest with people I'm talking with, with my friends and coworkers especially.  In fact, sometimes, I've been too honest.  The only people I've had to truly lie to are my wife (about my past infidelity), and myself.  This word \"liar\" is ringing in my ear all the time, and although this person who I can't stand, and do not care about is the one who is trying to recruit the world against me, I have been so deeply bothered by it.  I've gone through bouts of depression before- some of them months long, and never thought of myself as the type of person that might need professional help- someone to help make sense of it, or even pharmaceutical help.  I feel like I'm going down a deep spiral, and if I don't get help before I start to go down, I could ruin what's left of my life, and there won't be anything left when I finally manage to climb out.  Sorry, I know this was long.  If you managed to make it this far, thanks for listening.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My first real acceptance that I suffer from anxiety and depression and that I might need help",
            "url": "http://www.reddit.com/r/Anxiety/comments/tg9tg/my_first_real_acceptance_that_i_suffer_from/"
        },
        {
            "author": "eugal",
            "author_created_utc": 1320872321,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_67pc3",
            "created_utc": 1336456550,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tcjij/dea_feel_friendships_are_mostly_one_sided_help/",
            "id": "tcjij",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tcjij/dea_feel_friendships_are_mostly_one_sided_help/",
            "score": 20,
            "selftext": "I wasn't sure where to put this I thought about putting in it /r/adhd but ill put it here first. I was wondering if anyone else feels like (although they know isn't true) that in all your friendships they are there for your enjoyment but they dont enjoy being with you? Again I know this isn't true but you still feel it sometimes. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DEA feel friendships are mostly one sided? [help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/tcjij/dea_feel_friendships_are_mostly_one_sided_help/"
        },
        {
            "author": "hamsaurus",
            "author_created_utc": 1311379568,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5jylg",
            "created_utc": 1336440059,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tc5ke/i_sort_of_have_a_weird_way_of_coping_with/",
            "id": "tc5ke",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tc5ke/i_sort_of_have_a_weird_way_of_coping_with/",
            "score": 18,
            "selftext": "When things start to pop up or get really stressful for me, I have a tendency to trace out words with my index finger on one of my hands, over and over.  I trace it out on my thumb, my leg or whatever is handy and it seems to keep me somewhat grounded while I wade through my situation.  For example:\n\nToday I found out some very bad news about my credit situation while I was on the bus (I've got some outstanding debt that is making getting into new credit situations, or maintaining current ones very difficult for me).   When I got off of the phone with the lovely folks at Visa I began to think about how I was going to budget the next few months to try and remedy at least part of the situation that I'm in, and I could feel that overwhelming feeling of anxiety creeping up on me.  Immediately, and without thought, I caught the word \"Edmonton\" on a bus ad out of the corner of my eye and my right index finger began to race the letters of the word over and over again onto my thumb while I budgeted in my head.  Because of this minor, subconscious distraction I was able to budget reasonably without getting too distracted by negative, racing thoughts.\n\nI've been doing this since I was at least 7.  Possibly earlier.  Does anyone else have any really tiny things that they do subconsciously that seems to help them through a minor panic attack?  I think it's neat how the body comes up with its own ways of coping that don't require that you stop and think about it first.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I sort of have a weird way of coping with stress/anxiety when it pops up.  I've done it since I was little.  DAE have any weird little quirks like this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/tc5ke/i_sort_of_have_a_weird_way_of_coping_with/"
        },
        {
            "author": "not_so_violentacrez",
            "author_created_utc": 1267999592,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3xct9",
            "created_utc": 1336858142,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tk4jx/today_is_national_fibromyalgia_awareness_day/",
            "id": "tk4jx",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tk4jx/today_is_national_fibromyalgia_awareness_day/",
            "score": 17,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/CahThzKqat69ShdS.jpg",
            "title": "Today is National Fibromyalgia Awareness Day!! (x-post /r/fibromyalgia)",
            "url": "http://i.imgur.com/HlKYP.jpg"
        },
        {
            "author": "jenniferjuniper",
            "author_created_utc": 1265565253,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3ve94",
            "created_utc": 1336676042,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tgvtm/learn_from_my_mistake/",
            "id": "tgvtm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tgvtm/learn_from_my_mistake/",
            "score": 14,
            "selftext": "I had a decision to make, and I procrastinated making it because it made me anxious to think about.   I knew from day 1 what my choice should have been and I waited a month to make my choice.  By the time I did, my opportunity was missed.  I missed out on something great because I waited.  Life is going to pass us by and not wait for us to always feel comfortable, a lesson I learned today and will take with me as I continue to move forward with my life.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Learn from my mistake",
            "url": "http://www.reddit.com/r/Anxiety/comments/tgvtm/learn_from_my_mistake/"
        },
        {
            "author": "yik8r53U",
            "author_created_utc": 1336705240,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7owk2",
            "created_utc": 1336705553,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/thlrf/just_realized_ive_had_anxiety_my_whole_life/",
            "id": "thlrf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/thlrf/just_realized_ive_had_anxiety_my_whole_life/",
            "score": 13,
            "selftext": "I just realized last week that I have fairly chronic anxiety and have had it since I was a child.  I've always known I was stressed and had a lot of fear, but for some reason the label \"anxiety\" just hit me last week and all of a sudden everything made sense.  I've done years of therapy and meditation and I guess it's helped me a lot but there is always this baseline anxiety.  What has helped you with your anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just realized I've had anxiety my whole life.  :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/thlrf/just_realized_ive_had_anxiety_my_whole_life/"
        },
        {
            "author": "wellidontknowmuch",
            "author_created_utc": 1336617295,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7okx0",
            "created_utc": 1336692044,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/thaiw/obsessed_over_forum_posts_from_years_ago/",
            "id": "thaiw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/thaiw/obsessed_over_forum_posts_from_years_ago/",
            "score": 13,
            "selftext": "I don't know if anyone will be able to relate to this.\n\nYears ago (8-10) I used to post regularly on an internet forum and never really thought twice about privacy or anything like that.  I was an obnoxious attention seeking teenager.  I just cringe at everything I've ever written.\n\nLately, I don't have a whole lot happening in my life and I have a lot of time to be worrying about nothing.\n\nThe thing that bothers me is when I google a couple of my old email addresses it links to some of these forum posts.  I can't login and edit the posts because they're so old they've been archived and those username/accounts don't even exist anymore. \n\nRight now I don't have any friends (online or off) to talk to so everything that happens feels like a big deal.  Not that I really want any friends at the moment. \n\nActually, I feel slightly better now that I've typed it out.  But I really can't stop thinking about it.  I just feel worried and scared all the time.  Even if it's not specifically thinking about this, there's always something. \n\nI try and distract myself but my thoughts always linger back to the negative.\nI don't even know if I should post this.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Obsessed over forum posts from years ago",
            "url": "http://www.reddit.com/r/Anxiety/comments/thaiw/obsessed_over_forum_posts_from_years_ago/"
        },
        {
            "author": "staticgirl",
            "author_created_utc": 1323686277,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6f8r5",
            "created_utc": 1336573131,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tepl1/i_went_to_my_first_yoga_for_relaxation_class_today/",
            "id": "tepl1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tepl1/i_went_to_my_first_yoga_for_relaxation_class_today/",
            "score": 12,
            "selftext": "It was AWESOME. I left it feeling more relaxed and together than I have in a long time. The reason I am posting is because I know meditation is often recommended for anxiety issues, but at the class I tried for that as well as my attempts at home I always get way too aware of my heart beating and it stars racing or I can't get a negative thought out of my head. But the yoga class was different, it focuses on letting go of tension and focusuing on your body and the poses instead of stillness and having a blank mind. Tl;dr: I found q relaxing yoga class better than straight meditation because there was less opportunity to get lost in my own mind.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I went to my first 'yoga for relaxation' class today!",
            "url": "http://www.reddit.com/r/Anxiety/comments/tepl1/i_went_to_my_first_yoga_for_relaxation_class_today/"
        },
        {
            "author": "feioiwa3",
            "author_created_utc": 1336952373,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7pnpw",
            "created_utc": 1336953640,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tlnj1/help_nervous_breakdowns_due_to_life_situation/",
            "id": "tlnj1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tlnj1/help_nervous_breakdowns_due_to_life_situation/",
            "score": 10,
            "selftext": "My brother (18) has been having nervous breakdowns. Judging the way he acts (crying, frustrated, thoughts are cryptic and jumpy, feels crazy etc), I think I have been through similar stress caused by school, relationships etc. His stress could be caused by a number of things such as school, lack of role models, etc but these things haven't really been explored yet.\n\nMy family can tell he's been acting strange, but they also know he smokes weed. Because I have been through the same bouts, and I have never used weed, it makes me think the weed has little to do with it, besides being another thing to worry about. I think it is a scapegoat - \"you're acting this way again, you have started smoking again haven't you\". I believe this is further pushing him away because of the additional worry (\"maybe it is the weed, no it's not I know it's not, but why would they think it is?, I'll quit then, but I have before and I still had issues, they don't understand weed, maybe I don't either, but I do and it's fine\". - basically conflicting thoughts).\n\nAnyone been in a similar situation? I don't want to side with \"weed is not the problem\" because it's taboo and opens up a whole new can of worms.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Nervous breakdowns due to life situation, weed being blamed instead.",
            "url": "http://www.reddit.com/r/Anxiety/comments/tlnj1/help_nervous_breakdowns_due_to_life_situation/"
        },
        {
            "author": "NabeGewell",
            "author_created_utc": 1289956001,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4j2u9",
            "created_utc": 1336820825,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tjj1g/how_many_medications_must_a_man_walk_down_er_try/",
            "id": "tjj1g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tjj1g/how_many_medications_must_a_man_walk_down_er_try/",
            "score": 10,
            "selftext": "Recently I've started the process of taking medications for my anxiety. A huge step for me, especially since I'm uninsured. But with the financial assistance program the local doctor's office offers, health care is extremely affordable and I can finally go to the doctor without fear of racking up huge debt.\n\nTo the main question, how many medications must I try before I find one that doesn't cause me side effects? I'm on either my fourth or fifth now, and it's getting a little discouraging as it feels like throwing rubber darts at a board and hoping one sticks.\n\nI know I'm going to persevere and keep trying. I won't lose to this. But I was wondering if anyone had any similar experiences? How long did it take to find the right medication for you, and how did it improve your life?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How many medications must a man walk down? Er, try.",
            "url": "http://www.reddit.com/r/Anxiety/comments/tjj1g/how_many_medications_must_a_man_walk_down_er_try/"
        },
        {
            "author": "anxiousandhateit",
            "author_created_utc": 1336667599,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7oqxg",
            "created_utc": 1336669586,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tgpyk/health_anxiety_hypochondria_and_i_really_need/",
            "id": "tgpyk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tgpyk/health_anxiety_hypochondria_and_i_really_need/",
            "score": 9,
            "selftext": "It started about one and a half month ago with a random heart palpitations, and I for reason unknown got the idea in my head that something was wrong with me. \n\nI'm just 19 year old, but somehow I thought I was having a stroke or something. I'll try to make this long story short.\n\nSince that day, I've thought I have pretty much all cancers that exist (One at a time of course). I've only been thinking about cancerous diseases and nothing else. The symptoms I've felt have ranged from frequent urination and taking dumps more often. I've had very light, and floating feces, I've had palpitations, sweating, short of breath-feelings, recurring pain in my testicle (which I have a lump on), Pain in the prostate-area, chest pain and stomach pains. I've had a lack of appetite.\n\nI've been trough all those, having had CT scans, blood work, urine test, prostate exam, and other tests.\n\nSome days I'm just as normal, and then I'm back surfing the internet for diagnosis for something I've felt in my body. And the most recent is  the one I'm most scared about. I've had headaches, but a very unusual kind, I feel tightness in my head, and the pains are short and in very located specific spots in the head. I've felt unusual, as a human being, I feel like I can't think straight, I've felt dizzy and very tired. I have also noticed that my pupils are not exactly in the middle of my Iris (Perhaps they've always been like that). I can not enjoy anything right now, and I'm afraid that I have a brain tumor. \n\nIt's hard to explain the feeling, but I feel unreal, and unconnected to everything that happens around me, I feel that I have no feelings except anxiety and fright. I don't feel fully awake and functionable. I'm afraid there's something wrong this time.\n\nI've already contacted the health centre and done cognitive tests and they were all flawless, but somehow I'm still a bit concerned, and this is slowly destroying my life, my relationship.\n\nWhat the hell can I do, should I try to get a scan for my head, is my recent feelings something I should  worry about? I can't go on like this..\n\nIf anyone reads all of this, I'm thankful.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Health Anxiety (Hypochondria) and I really need some help",
            "url": "http://www.reddit.com/r/Anxiety/comments/tgpyk/health_anxiety_hypochondria_and_i_really_need/"
        },
        {
            "author": "Pushpinheart",
            "author_created_utc": 1329296022,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_6xgp7",
            "created_utc": 1336496009,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/td5o6/road_trip_anxiety/",
            "id": "td5o6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/td5o6/road_trip_anxiety/",
            "score": 9,
            "selftext": "In about 24 hours, I will be on the road to South Carolina from Virginia. I haven't been able to sleep properly for two days. It's a trip with my whole immediate family. Grandmother, mother, 2 uncles. So many things can go wrong. From a car wreck to a plane crash to just simply being too anxious to leave the hotel.\n\nI suffer from GAD, Depressive disorder with a dask of agoraphobia and possible mild OCD. The entirety of this trip is making me want to hang myself. I know I will go and have a good time but in between I am climbing the walls.\n\nI had a panic attack a day during the last family vacation. Not counting the issue with being in public with strangers staring at me.\n\nAnyone have advice to help me get through this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Road Trip Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/td5o6/road_trip_anxiety/"
        },
        {
            "author": "CrushNZ",
            "author_created_utc": 1282550917,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_49u7e",
            "created_utc": 1336711935,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/thqft/does_anybody_else_have_issues_with_dependency_of/",
            "id": "thqft",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/thqft/does_anybody_else_have_issues_with_dependency_of/",
            "score": 8,
            "selftext": "I had issues with it over the years with multiple friends. Like, I constantly make sure that their OK/not upset with me and it gets to the point where if I don't see them often enough I get distressed and worried that they might not want to be my friend any more. I normally don't have any justifiable grounds for feeling this way.\n\nDoes anybody have some advice for me? I want to make things easier on myself, and my friends.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else have issues with dependency of friends?",
            "url": "http://www.reddit.com/r/Anxiety/comments/thqft/does_anybody_else_have_issues_with_dependency_of/"
        },
        {
            "author": "anxietythrowaway1111",
            "author_created_utc": 1336709174,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7ox4c",
            "created_utc": 1336709764,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/thp0l/has_anyone_experienced_random_blackouts_because/",
            "id": "thp0l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/thp0l/has_anyone_experienced_random_blackouts_because/",
            "score": 8,
            "selftext": "In the past few weeks, my anxiety level has been a lot higher than normal. I started to experience blackouts. I don't remember doing things that should be memorable. I'll forget an entire chunk of time (about 1-3 hours).\n\nHoping it's anxiety/stress and not something that's physically wrong with my brain. Just want to know if anyone else has experienced this. \n\nI should clarify, these blackouts are not drug/alcohol induced. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone experienced random \"blackouts\" because of anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/thp0l/has_anyone_experienced_random_blackouts_because/"
        }
    ]
}