{
    "data": [
        {
            "author": "psYberspRe4Dd",
            "author_created_utc": 1328723014,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6vf1i",
            "created_utc": 1337888842,
            "domain": "fc03.deviantart.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u38zk/social_anxiety_by_dogwalla/",
            "id": "u38zk",
            "is_self": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u38zk/social_anxiety_by_dogwalla/",
            "score": 131,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/Nk6N-Pc9frO1J_di.jpg",
            "title": "Social anxiety by dogwalla",
            "url": "http://fc03.deviantart.net/fs71/f/2011/138/0/c/social_anxiety_by_dogwalla-d3gmp9j.png"
        },
        {
            "author": "NeilOhighO",
            "author_created_utc": 1325099730,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6j5b9",
            "created_utc": 1337810143,
            "domain": "rainymood.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u1p6g/relaxingrainy_mood_a_great_site_to_help_calm/",
            "id": "u1p6g",
            "is_self": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u1p6g/relaxingrainy_mood_a_great_site_to_help_calm/",
            "score": 112,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[relaxing]Rainy Mood - a great site to help calm yourself down, meditate, go to sleep. ",
            "url": "http://www.rainymood.com/"
        },
        {
            "author": "larisschwa",
            "author_created_utc": 1332258578,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_77wm5",
            "created_utc": 1337989620,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u59t0/i_did_it/",
            "id": "u59t0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u59t0/i_did_it/",
            "score": 70,
            "selftext": "I have a massive fear of anything that moves, but this past week, I flew on a plane (twice), went on multiple elevators, rode in cars with people I've never ridden with before, and went on shuttles. I did all this so I could have a fantastic vacation with my fiance, and he told me he's never been so proud of me. Of course, there were a couple panic attacks, and I'm sure the people on the planes will have some good stories to tell their friends, but I got through it! I know I'm not over my anxiety but these small accomplishments make me realize there is hope. It was really nice knowing what it would be like to go through life not being afraid of everything. I just wanted to share my small success :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I did it!",
            "url": "http://www.reddit.com/r/Anxiety/comments/u59t0/i_did_it/"
        },
        {
            "author": "SenatorStuartSmalley",
            "author_created_utc": 1273548312,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_41tzk",
            "created_utc": 1337708335,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tzjkw/came_up_with_this_analogy_for_my_panic_attacks_i/",
            "id": "tzjkw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tzjkw/came_up_with_this_analogy_for_my_panic_attacks_i/",
            "score": 40,
            "selftext": "A little background to why I thought this up.  When I was younger (maybe 10/11) My dad had a golden retriever.  We would bring her for walks to the park.  One time I wanted to hold the leash.  Since these walks were uneventful, he let me.  Well, she saw another dog and started running.  I didn't have the sense to let go and she dragged me over some dirt and gravel.  It stung a little, but it wasn't anything too serious.  \n\n-----\n\nMy analogy:\nHaving a panic attack is like being dragged by an out of control dog.  You are just along for the ride and get dragged through whatever it wants to run through.\n\nLately, I've been better at aborting attacks.  It's like I have control of the leash. \n\nMy conclusion:\nI will never have control of the dog.  It's not possible to have complete control of another sentient being.  However, I can make sure the dog doesn't go beyond the reach of my leash.  Hopefully I won't be dragged through the gravel, though.\n\n-----\n\nHope you guys find this useful.  I know I did.  It helps explain things.  If it needs to be clarified, let me know!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Came up with this analogy for my panic attacks.  I thought I would share.",
            "url": "http://www.reddit.com/r/Anxiety/comments/tzjkw/came_up_with_this_analogy_for_my_panic_attacks_i/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1338179683,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u89g2/anxiety_is_awesome_who_needs_sleep/",
            "id": "u89g2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u89g2/anxiety_is_awesome_who_needs_sleep/",
            "score": 38,
            "selftext": "currently cleaning out my parents' fridge and eating an entire box of tagalongs to deal with the irrational and obsessive thoughts about death that plague me and won't be shut up by xanax.\n\nwoohooo.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "anxiety is AWESOME. who needs sleep?",
            "url": "http://www.reddit.com/r/Anxiety/comments/u89g2/anxiety_is_awesome_who_needs_sleep/"
        },
        {
            "author": "ai_kane",
            "author_created_utc": 1327549257,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6r8qm",
            "created_utc": 1337894871,
            "domain": "25.media.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u3ejr/i_think_this_is_solid_advice_for_anyone_who_needs/",
            "id": "u3ejr",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u3ejr/i_think_this_is_solid_advice_for_anyone_who_needs/",
            "score": 37,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/KRyUc6OC39rZyW20.jpg",
            "title": "i think this is solid advice for anyone who needs advice. ",
            "url": "http://25.media.tumblr.com/tumblr_lzbgk9NzBM1r8j7sbo1_400.png"
        },
        {
            "author": "plzdntfedthmodl",
            "author_created_utc": 1333412371,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7c9xr",
            "created_utc": 1338225684,
            "domain": "self.Anxiety",
            "edited": 1338227298,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u8xpk/i_was_a_victim_of_anxiety_disorder_for_2_years_i/",
            "id": "u8xpk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u8xpk/i_was_a_victim_of_anxiety_disorder_for_2_years_i/",
            "score": 24,
            "selftext": "23f victim of anxiety disorder\n\nAnxiety is worse than any physical pain I could ever recall. It hurts you deeply and so misunderstood! We're called crazy... because no one understands. Mind is constantly racing and your life IS your phobia. Screw deep breathing! I just wanted to be fixed! \n\nIt started when i was 16, I took a medication that I happened to later find out I was allergic to. It was a Sunday so I had to go to a health clinic because all the doctors offices were closed. My heart was racing (144 resting heart rate) and I was on the verge of passing out. \n\nPASSING OUT... FAINTING... that was NOW my phobia. I live in the south east united states so it gets really hot here. Heat scared me... low blood sugar scared me... bridges scared me because I couldn't pull over if I were to faint. (Or so I thought) I checked out from school every single day... until finally they sent me to the school shrink and I realized I had an anxiety problem. I did crazy things like not getting in a car unless it was already turned on with air conditioning for a few minutes and I had to have an ice pack with me. Always carried bananas and crackers in my backpack at school just incase I happen to get low blood sugar.\nAfter about 3 months they started medicating me. Lexipro...Buspar (both anxiety medications) stomach medication (due to the anxiety I was producing too much stomach acid) I was in HELL... I wanted to die. This was no way to live... I surely couldn't live like this forever. I couldn't drive... leave my house... hang out with friends. I was too scared... worst part is no one understood. \n\nFast forward to 3 therepists and 4 medications later I met someone who saved my life. She was a Cognitive Behavioral therepist... after 2 years of my life wasted to my phobia she fixed me. She forced me to face my fears. That's all I had to do.. face my fears! Cognitive behavioral therepy saved my life... I am now 23 years old and on no medications for anxiety. Passing out is not even a thought that crosses my mind.  Here's a few tips she gave me: \n\n* carry your ice pack around to hot places... you'll use it until you realize you won't need it anymore. (Use your crutch to help you get out. Slowly pull yourself apart from it at your own pace.) \n\n*DEEP BREATHING..deep breathing always made me feel worse... like I couldn't breathe. So I started to count.. 1..2...3..4..5... in....5..4...3..2..1 out. I was in control. \n\n*crossing the bridge was the hardest thing for me. I had to do it because I live in a small town where you HAVE to cross a 3 mile bridge to get to anything worth while. I would call my mom everyday to and from work or school. Making her talk the whole way. Then... I only needed her half way... then a quarter... then not at all. (Again using a crutch to help you... I used it until I didn't need to anymore.) \n\n*always carrying a small snack... turned into just carrying a dollar or 2 to go the vending machine just incase I was feeling a little low and hungry. \n\n\nAnyway I know this isnt much but I wanted to give some people a little hope. Seeing other people go through something that controls their life...its anything but fair. Its a long road but it will get better... this isn't the end. :) ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I was a victim of anxiety disorder for 2 years, I just want to.give a little hope.",
            "url": "http://www.reddit.com/r/Anxiety/comments/u8xpk/i_was_a_victim_of_anxiety_disorder_for_2_years_i/"
        },
        {
            "author": "Mojoman1",
            "author_created_utc": 1301134841,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_50juc",
            "created_utc": 1338034846,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u5wai/that_feeling/",
            "id": "u5wai",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u5wai/that_feeling/",
            "score": 23,
            "selftext": "Sometimes, it creeps up on me slowly. It starts small with, almost like the pressure in the room has doubled, like the concussion of an explosion it washes over me, unexpectedly. It rolls me like a liquid waving, smothering me, filling up my nose, eyes, ears. I want to scream, throw things through the fucking window. I want to rend my clothes, shout obscenities to the sky, break every fragile thing. If you saw me, I would be sitting calmly in a chair, watching out the window. Inside, I am erupting, outside I am stone. I contain it, bury it, push far inside. I think its gone, but its just waiting. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "That feeling....",
            "url": "http://www.reddit.com/r/Anxiety/comments/u5wai/that_feeling/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1337655718,
            "domain": "self.Anxiety",
            "edited": 1337656115,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tyn51/i_need_urgent_help/",
            "id": "tyn51",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tyn51/i_need_urgent_help/",
            "score": 22,
            "selftext": "first of all, i would like to state that i am 16 years old and im in 10th grade. i have had anxiety for as long as i can remember, which for the record is around 6th grade i think. that anxiety has gotten worse and worse especially when it comes around other people including girlfriends, which gets so bad i got stomach aches. i went to the doctors for a checkup and she gave me some medicine, which helped with the stomach aches, but didnt really help with the anxiety as a whole, but i attempted to cope with it, as i did the last 3 years (the current time in the 'story' is me around 15 years old, maybe 14). as the year passed i started feeling uncomfortable in class and school and just public places in general, i would get a dry mouth, start sweating, and studder which was embarrassing, and extremely hard to cope and on top of that hide. in the beginning of 10 grade (current school year) is where things go from bad to extremely terrible. from day 1 in the school year my medicine hasnt been helping, so i got new medicine that helped for a bit, so i thought everything was alright. on a sidenote, i am extremely close to my dad, who i havent seen in a while due to his recent breakup with his girlfriend, and that really took a toll on him emotionally. for a couple months he calls me and tells me that he is really stressed and wants it all to go away, me being a caring person i want to help him but i cant because my mom isn't the best parent in the world and forbids me and my siblings from seeing him. my dad then got so stressed out that he got a heart attack. that is when i had the worst panic attack of my life, and sent me into a deep depression. i stopping going to school, talking to friends, and doing stuff productive in general. i have missed so much school this year and im really scared, but i cant force myself to get up everyday with so much pressure on my shoulders from my dad. and the heart attack isnt even all of it. my grandma who is 74, had open heart surgery and almost died, and that certainly didnt add to my feelings at all. months pass of me laying in bed most days and not doing anything and my dad slowly recovers but is still pretty torn up about everything. one night he called me and told me to meet him at a near by dunkin donuts, me being excited to see him ran over but was soon disappointed because he told me he is going. i was really confused at the time and wasnt sure what to think. he wouldnt tell me where and when he was leaving so i kept badgering him to tell me. he told me he was going to kill himself. if anyone reading this hasnt had their dad who they loved dearly tell them straight to their face that they are going to kill themselves, its a knife straight though your heart. i start bawling my eyes out on the spot and dont know what to think... so he gives me a note saying he loves me. his wallet, his phone, and a little toy i gave him when i was little that he has had since... i walked home crying so hard i couldnt breathe, and to this day i have no idea where he is and if he is ok... i called his sister and she said she got in touch with him but he wont tell her anything... i am literally depressed to the point where i dont feel like living anymore. my mother finally got off her lazy drunken ass (her drunk attitude also adds to my feelings... more stuff go figure) and gets me a therapist. ive only went 3 times but i feel nothing yet. i really need advice/help from someone. i dont know what to do about my dad, about school, about my future. im also scared about my relationship because im not one to open up physically to someone, and my girlfriend is getting mad about that... i feel sorry for her but i just cant do it. i don't know what im doing right now and im scared. please help. thank you.\n\nno tl'dr for this.. i am sorry\n\nEDIT: also sorry for the errors in spelling.. hard to type while fighting back tears",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need urgent help..",
            "url": "http://www.reddit.com/r/Anxiety/comments/tyn51/i_need_urgent_help/"
        },
        {
            "author": "anjayrose",
            "author_created_utc": 1332889033,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7a9ff",
            "created_utc": 1337959310,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u4kdr/material_items_that_calm_your_anxiety/",
            "id": "u4kdr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u4kdr/material_items_that_calm_your_anxiety/",
            "score": 21,
            "selftext": "I am not sure what it is about today, but my big hooded sweatshirt, from my hubby, seems to be keeping me calm.  It is almost like a big hug that doesnt talk and offer advice to me.  \n\nDo you have a material item like this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Material items that calm your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/u4kdr/material_items_that_calm_your_anxiety/"
        },
        {
            "author": "interwar",
            "author_created_utc": 1333598749,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7d0va",
            "created_utc": 1337741288,
            "domain": "self.Anxiety",
            "edited": 1337831853,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u0dvf/nearing_a_panic_attack_mostly_needed_to_write_out/",
            "id": "u0dvf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u0dvf/nearing_a_panic_attack_mostly_needed_to_write_out/",
            "score": 21,
            "selftext": "I am on the borderline of a panic attack.  My anxiety is very high right now, it almost feels like something as slight as a pin dropping could set me off into a full blown attack.  I have not felt this way in a while.  For starts, I'm 25 y/o, female, and have bipolar (I'm on medications..lithium, lamictal, and clonazepam for the anxiety mostly).\n\nI think my issue is that work is stressing me out.  I travel sometimes for work, but this month I have traveled every week, only being at home on the weekends.  And tonight I'm in a crappy motel.  It's loud, there's not much security, the room is SUPER tiny, so the environment mixed with \"I miss my home, and my dog, and my friends\" is just a lethal combination.  But I don't know what else I can do, fellow redditors.  I've already taken my medicine.  I don't want to take more than the regular dose.  I just can't control my own thoughts right now and it's making me feel nauseous and my head hurts and I just want an escape but there is none. I HAVE to stay for work.  And all other hotels in the area are booked.  I can't take a walk (normally helps) because the area is unsafe.  \n\nI'm trapped.  And so I am panicking.  I figured writing it out would help because I don't have anyone to call.  I mean, I DO, but I don't want to burden them, you know?  My dad is really sick so I don't want to wake my parents.\n\nI guess I just needed to vent.  And maybe hear ideas on other coping mechanisms.  \n\nArghh this is hard...internet hugs to anyone feeling the same way right now.\n\n\n\nEDIT: Thanks guys, so much. I'd thank you all individually but I'm actually sleepy and relaxed tonight! Yay! Funny how it (anxiety and panic) always seems like it's never going to go away...but it always does. Logically I should be able to remember that and get my thoughts under control. Oh well. I do greatly appreciate your support, I'm glad I found this subreddit...lol I just typed in the URL reddit.com/r/anxiety and assumed it was out there! Thanks again!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Nearing a panic attack.  Mostly needed to write out my thoughts, support is appreciated.",
            "url": "http://www.reddit.com/r/Anxiety/comments/u0dvf/nearing_a_panic_attack_mostly_needed_to_write_out/"
        },
        {
            "author": "SenatorStuartSmalley",
            "author_created_utc": 1273548312,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_41tzk",
            "created_utc": 1337708969,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tzk5v/i_have_a_crush_on_my_therapist/",
            "id": "tzk5v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tzk5v/i_have_a_crush_on_my_therapist/",
            "score": 20,
            "selftext": "*First a small note that there have never been any unprofessional advances in either direction.  She is and has been completely professional.*\n\nShe's also the most effective therapist that I've had.  I've been able to work with her to get reassurance and some skills to combat panic attacks.\n\nShe's around my age, maybe a couple years younger (mid to late twenties).  She's attractive to me.  She's really nice and is the first therapist that I've had that seems to really understand what's going on in my head (probably because of our common age group and that she's been in school recently and is familiar with the newest anxiety work).  We actually seem to have a lot in common - at least based on what little we talk about her experiences.  I also understand that part of the reason I may feel this way is that she is supposed to be a positive person in my life.\n\nI have a wife that I love dearly and two wonderful kids.  I wouldn't jeopardize this for anything, especially a little crush - even if the opportunity to make more of it arose.  \n\nIs it OK to keep up with the same therapist?  I really would like to because, despite my crush, I think her input and the goals that she helps me set are really helping me.  I personally think it is, but I am looking for either reassurance that I am thinking clearly or that I am just deluding myself.\n\nThanks everyone.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have a crush on my therapist.",
            "url": "http://www.reddit.com/r/Anxiety/comments/tzk5v/i_have_a_crush_on_my_therapist/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1338075644,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u6lo6/how_do_you_explain_anxiety_to_someone_who_just/",
            "id": "u6lo6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u6lo6/how_do_you_explain_anxiety_to_someone_who_just/",
            "score": 19,
            "selftext": "I suffer from generalized anxiety, social phobia, depression, and insomnia. My dad doesn't understand, he just keeps telling me to \"get out there\" and \"you can't do anything if you're in your room all day.\" \n\n\nI live in a tourist town. There are no permanent jobs here unless you get lucky. I apply for average retail jobs (CVS, Acme Markets, Kmart, Walmart, ShopRite, Wawa, Michaels, Bed Bath and Beyond, GameStop, Office Depot, JC Penny, Pets Mart, Dollar General, and more) every 60~90 days like clockwork, year-round. He insinuates that, because he sees me sleeping past noon, I'm a lazy piece of shit and I'm *clearly* not trying very hard to get a job. \n\n\nYou know what is popular in tourist towns? Restaurants. You know what positions have been open, for the past month, at these restaurants? Hosts and servers. You know what I can't do? EXACTLY THAT. I can *barely* interact with people via cashiering, and I'm going to take ORDERS for them!? I had panic attacks working in the CVS pharmacy when people would get mad at me over their prescriptions. The thought of getting somebody's dinner wrong scares the shit out of me.\n\n\nAnd it's not like I'm fucking squandering my time away in my bedroom. I spend all of my time studying (programming, history, misc research for my writing, art guides, music theory, cooking, and others) and pursuing my dream career (being a successful webcomic artist). In the past few months, I've taught myself how to draw. I couldn't draw stick figures before this year, and now I can *almost* draw people. Writing has always been a passion of mine, even when I was little, I would write and write, and everybody just fucking put me down for being creative. Teachers, parents, peers, nobody gave a shit that I could write except people on the internet. Nobody thinks I can be successful, nobody fucking believes in me, despite the fact that I have legitimate potential.\n\nEDIT: And he KNOWS I do these things, because I've *shown* him the progress I've made. He's an artist too, a painter, and I always thought he would understand, but guess what? OF COURSE HE DOESN'T.\n\n\nWhat the fuck am I supposed to do? Of course I want a job, I want income, I'd love to have fucking money. How am I supposed to get this shit across to somebody who is a primary source of my mental problems? How the hell do you fucking get a point across to somebody who *doesn't believe you*? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you explain anxiety to someone who just doesn't get it? [RANT]",
            "url": "http://www.reddit.com/r/Anxiety/comments/u6lo6/how_do_you_explain_anxiety_to_someone_who_just/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1337710389,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tzlff/does_anybody_else_feel_they_get_worse_when_people/",
            "id": "tzlff",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tzlff/does_anybody_else_feel_they_get_worse_when_people/",
            "score": 18,
            "selftext": "I tend to get really anxious at work sometimes it's fine other times it's not. I generally tend to get anxious around some of the girls at work and then start to worry about all kinds of crazy things which I feel then isolates me and exacerbates the initial anxiety. I feel like I really need someone to talk to :(",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else feel they get worse when people realise that they are anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/tzlff/does_anybody_else_feel_they_get_worse_when_people/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1338146971,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u7lz8/having_mixed_up_thoughts_about_suicide_and/",
            "id": "u7lz8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u7lz8/having_mixed_up_thoughts_about_suicide_and/",
            "score": 18,
            "selftext": "Sorry for the bold title. guess I know I need help but so far nothing is making me feel better.\n\nMy mother is a horrible woman to me, since I can remember she called me fat, even when my school got me to see a nurse because they were worried I was anorexic - when I told my mother this she laughed and told me to stop lying.\n\nI'm now 22 and this hasn't improved. I've gone to university but am now living back at home with my parents as I am just an intern and do not earn enough to not live there.\n\nSo since living at home since March (I went and lived in France for six months after university) she's become a monster. I feel hopeless and sick constantly because of her. She went to the beach today with my dad, I didn't go, and when she came back all she's said is how fat and hopeless I am (I am 5'9 and a UK size 10) she chucked scales at me, asked me whether I wanted pure lard for dinner and now is just going on and on about how pathetic and useless I am to her, and how my dad is on her side with this.\n\nMy dad has said nothing in this argument, except to ask me whether I went to the gym.\n\nI have attempted suicide in the past, clearly failed, didn't see anyone about it, just got through university without seeing anyone (various panic attacks throughout, particularly at the end of my final year where I drank and took sleeping pills, scared about going home again) I spoke to my doctor about not sleeping well due to exam stress and got given the pills, but I don't have them anymore.\n\nI want to speak to someone, I do, but I don't get home until late and by then the surgury is shut, and I can't really take a morning off or whatever to go to the doctor as I'm just an intern and really want this job :(\n\nSorry for the rant, thanks for reading if you got this far.. I don't really  know what I'm going to get out of this post, but hey, feel slightly calmer for just writing it down.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Having mixed up thoughts about suicide and worried I don't have enough paracetamol to do it...",
            "url": "http://www.reddit.com/r/Anxiety/comments/u7lz8/having_mixed_up_thoughts_about_suicide_and/"
        },
        {
            "author": "Brittnet",
            "author_created_utc": 1337670897,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7s2aj",
            "created_utc": 1337670924,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tyxkf/herbal_pills_for_anxiety/",
            "id": "tyxkf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tyxkf/herbal_pills_for_anxiety/",
            "score": 13,
            "selftext": "Im thinking about trying to find herbal pills for anxiety. I have generalized anxiety and its pretty bad. Do any of you take herbal pills? If so what and what side effects do you have?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Herbal pills for anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/tyxkf/herbal_pills_for_anxiety/"
        },
        {
            "author": "CosmicBard",
            "author_created_utc": 1222402877,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_394l1",
            "created_utc": 1337798493,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u1e1k/help_paralyzed/",
            "id": "u1e1k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u1e1k/help_paralyzed/",
            "score": 13,
            "selftext": "I'm one of these cases who is too anxious to get help with his anxiety.\n\nI have an intense fear, hatred and resentment for anybody in a position of authority such as receptionists, doctors, teachers, police, anybody.\n\nI'm recently unemployed and have no close friends.  I was recently cast out by my fiancee and given my ring back and was left with a week to find a place to live in a strange city.  \n\nI sit around in my apartment as my unemployment insurance dwindles.  I cry myself to sleep.  I harm myself in desperate moments of anguish and despair.  I smash my head into walls, I punch myself in the arms, I tear at my hair and I bite and chew at my hands until they are raw, all in order to try and make my brain shut up for a minute.\n\nI would have no social life if not for the internet and I couldn't leave the house if not for brief moments of clarity afforded by smoking marijuana, being drunk or when on my medication, clonazepam.\n\nThe clonazepam is supposed to be a quick-fix to panic attacks and isn't meant to work on a day to day basis.\n\nThe last time I saw a therapist, I lied to him.  Told him I wasn't experiencing any paranoia, that it wasn't interfering with my life.  He believed me and sent me on my way.  When put on the spot with somebody of authority, I clam up and say whatever the fuck it is I have to in order to get away from there.\n\nI want to die.  I dream of the sweet release of death, how it will finally be an end to pain, suffering, dread, anxiety, depression, loneliness, all of it.   The only time I'm able to focus is with the calming thought of finally dying, finally letting all the dread slip away.  It is bliss.\n\nI need help.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Paralyzed.",
            "url": "http://www.reddit.com/r/Anxiety/comments/u1e1k/help_paralyzed/"
        },
        {
            "author": "shortageofchairs",
            "author_created_utc": 1334035524,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7es2v",
            "created_utc": 1337912884,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u3tye/i_finally_decided_to_see_a_therapist_and_he/",
            "id": "u3tye",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u3tye/i_finally_decided_to_see_a_therapist_and_he/",
            "score": 13,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/pfKSAO0ics3osvXl.jpg",
            "title": "I finally decided to see a therapist and he recommended these; I'm feeling optimistic for the first time in years.",
            "url": "http://i.imgur.com/CIYN7.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1338169868,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u8290/i_feel_my_life_is_characterized_by_a_never_ending/",
            "id": "u8290",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u8290/i_feel_my_life_is_characterized_by_a_never_ending/",
            "score": 13,
            "selftext": "I've have social anxiety and GAD for about 14 years now. I don't know why I'm bothering to write this, but I feel helpless. I feel like I have no escape. Life for the last five years has been more about surviving than living. It's always a battle. Always having to fight just to keep my head above the water, so to speak. I've sought professional help. Medication turned me into a zombie. Meditation helped significantly until I stopped.. and I've only now started to get back into it. But fuck me! Why does getting everyday feel like I'm getting ready to go to war? I'm so tired of this, I can't keep it up forever. 14 years of my life lost and I see no light at the end of this long, dark tunnel. I have no friends and the only reason I'm still here is because I know how much my departure would hurt my parents.. \n\nI'm reminded of the metaphor of the person in the burning sky scraper.. and the only options seem to be to jump or stay, keep fighting, and eventually burn. I've been fighting the flames back for so long.. and they just keep coming. I can't fight forever.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I feel my life is characterized by a never ending cycle of progress coupled with regression. I take a step forward and then two steps back. I want out [rant]",
            "url": "http://www.reddit.com/r/Anxiety/comments/u8290/i_feel_my_life_is_characterized_by_a_never_ending/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1337790126,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u16nr/getting_married_with_anxiety/",
            "id": "u16nr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u16nr/getting_married_with_anxiety/",
            "score": 13,
            "selftext": "So I’ve dealt with anxiety for most of my life. It usually gets heightened in social situations. I’m getting married in about a month, and was wondering if I could get some best practices for the big day.\n\nA big fear I have is passing out or excessively sweating at the ceremony. The wedding is at the end of June and it could be extremely hot that day. The church we’re going with does not have air conditioning and I’ll be in a tuxedo with everyone’s eyes on me. That causes panic in me while even typing it. What can I do to calm myself down and to prevent excess sweating?\n\nI’ve started seeing a therapist, but the advice he’s giving me doesn’t seem to be enough. It’s cognitive behavior based and just involves “visualizing everything going right.” I think I need more than just visualization though.\n\nI’ve considered trying a benzo or getting on an anti-anxiety medication, but I also want to be able to have a few drinks on my wedding day. I know that once I do, I’ll be a lot more loose and able to deal with the anxiety. But if I’m on a meds I don’t want to mix drinks and turn into a lunatic!\n\nSome of my other issues are hand shaking while eating in public, which is a concern for putting the ring on her finger, feeding her cake, etc.\n\nAre there any mental/breathing techniques you would recommend for my issues? Any certain types of meds to try out or stay away from? Any advice would be greatly appreciated!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Getting Married With Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/u16nr/getting_married_with_anxiety/"
        },
        {
            "author": "anx8932",
            "author_created_utc": 1337784887,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7sgpd",
            "created_utc": 1337785420,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u12p4/ive_developed_agoraphobia_how_do_i_reverse_it/",
            "id": "u12p4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u12p4/ive_developed_agoraphobia_how_do_i_reverse_it/",
            "score": 12,
            "selftext": "Towards the end of last year I started to notice my panic attacks were far more frequent in crowded areas and open spaces, but for the past 5ish months it's got to the point where going a few meters from my home is a real struggle.\n\nI need to put an end to this as quickly as I can because my life's falling apart, I can't work and it's putting a strain on my relationship.\n\nI'm currently taking medication and forcing myself to go outside almost daily, just to see if I can extend how far I can go or how long I can stay out, however I don't feel like I'm currently making any progress.\n\nAny advice would be greatly appreciated. Thanks.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've developed agoraphobia, how do I reverse it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/u12p4/ive_developed_agoraphobia_how_do_i_reverse_it/"
        },
        {
            "author": "aliceFTW",
            "author_created_utc": 1310497643,
            "author_flair_css_class": "",
            "author_flair_text": "Deep breaths...",
            "author_fullname": "t2_5i7bf",
            "created_utc": 1337797190,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u1cvd/your_experience_with_zoloft_medication_help/",
            "id": "u1cvd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u1cvd/your_experience_with_zoloft_medication_help/",
            "score": 10,
            "selftext": "Hi, r/anxiety!\n\nAfter several months of living with my anxiety under control, it appears as though things are going south. :( My depression suddenly flared up quite severely about a month ago, and hasn't gone away since. For me, the depression and anxiety go hand-in-hand, so this is very frustrating.\n\nI currently take 100mg of Zoloft and 25mg (I think) of Ativan as needed. However, I'm beginning to think I need a change in meds. Zoloft never really worked the way I expected an antidepressent to work, if that makes sense. I didn't really expect it to instantly cure my troubles or anything, but the medication only really ever took the edge off.\n\nSince everything's coming back with such force, I realized I need to get this under control once and for all. I don't want to even have to think about anxiety in public anymore. I'm willing to try whichever meds my psychiatrist recommends and will stick with whichever one helps me! \n\nSo, what are your experiences with Zoloft? Is it working like it's supposed to or am I right in wanting to switch? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Your experience with Zoloft? Medication help!",
            "url": "http://www.reddit.com/r/Anxiety/comments/u1cvd/your_experience_with_zoloft_medication_help/"
        },
        {
            "author": "anxiousanxiousanxiou",
            "author_created_utc": 1338216701,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7tx3a",
            "created_utc": 1338217259,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u8rcz/hoping_to_get_a_good_book_recommendation/",
            "id": "u8rcz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u8rcz/hoping_to_get_a_good_book_recommendation/",
            "score": 10,
            "selftext": "Throwaway, just because.\n\n*I have a debilitating fear of a family member or loved one dying* and this gets worse with each passing day. I really want to focus on dealing with this, as I have a daughter and I don’t want her to grow up with her mother being this way. I have vivid visions of terrible things happening - my daughter drowning, my husband crashing our car into a tree, my parents randomly dying, choking on a piece of steak and dying, my daughter eating a battery without us noticing and her dying, etc. The other day, my daughter fell (she’s one year old, kids fall, I get that) and she fell on her face, and I completely lost it. I imagined her breaking her neck with the fall and dying, right there on the spot. She seriously cried for five seconds and picked herself up and ran off, but I was completely lost for the rest of the day, crying and unable to snap out of it.\n\nI have severe anxiety in the car and stopped driving six years ago. Even when I’m riding in the car, I’m so worried sick by the time we get anywhere that I can’t enjoy myself.\n\nIt seems that every day I’m just blinded by these thoughts, and the happier the day is, the worse they are. If I’m having a wonderful day, the invasive thoughts are that much more pervasive, and I have to remember to smile and force myself to not cry. I have always felt that I can’t allow myself to get too happy, because that’s when shit will hit the fan.\n\nI love reddit, but I’m constantly hitting the “hide” button to keep myself from reading terribly depressing stories. I can only watch tv comedies anymore because I can’t deal with watching anything sad happening in fear of these invasive thoughts.\n\nI could continue, but I think I’ve gotten my point across.\n\nI’m asking two things of you, reddit: 1) what is this? ocd? gad? It doesn’t matter too much, I’m just curious. 2) More importantly, what books can I read to help myself? I understand that I may need more than a self-help book, but this is where I want to begin. I can’t help but think about a therapist sitting there listening to me and thinking “SNOOOOOOORE” while I blather on, and medicine is last resort for me, so I really want to start with some good reading.\n\ntl;dr - debilitating fear of death, looking for a good self-help book.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hoping to get a good book recommendation.",
            "url": "http://www.reddit.com/r/Anxiety/comments/u8rcz/hoping_to_get_a_good_book_recommendation/"
        },
        {
            "author": "NotsureIcandothis",
            "author_created_utc": 1337872625,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7ssvm",
            "created_utc": 1337873304,
            "domain": "self.Anxiety",
            "edited": 1337876512,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/u2v4f/i_have_horrific_social_anxiety_and_got_a_job_get/",
            "id": "u2v4f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/u2v4f/i_have_horrific_social_anxiety_and_got_a_job_get/",
            "score": 10,
            "selftext": "Hey guys and girls. I've had crippling social/general anxiety for years now. I managed to graduate with a psych degree and recently had some interviews as a counselor at a psychiatric hospital. I'm generally a shut in and this job involves dealing with groups of people all day long, running groups (charades, talks, games, stuff like that), and running meetings. Quite frankly I'm terrified and unsure if I'll be able to do it. I'm looking at it as an extremely intense exposure therapy session for myself. I think because of my struggles I will be able to relate and help people and that excites me, I feel like I could be amazing at the job, but I'm scared shitless. This isn't just in my head either the first interviewer even asked if I was \"kind of awkward\" and I just told him that I get a little nervous in interviews. But truth be told because of my anxiety I am pretty awkward these days. \n\n\nI think that because of my anxiety background I'll be able to relate to residents and be of help to them, and being in this environment will be helpful to me as well. I'm not sure what the point of my posting here is other than getting it off my chest and bouncing it off you guys. I'd like to hear your thoughts. This is an AMAZING opportunity that anyone with psych interests would die for, but man am I scared.\n\n\nEdit: Has social anxiety; typos in headline. *Quite frankly\n\nDouble Edit: I did not share my own struggles in the interviews, am I being dishonest?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have horrific social anxiety and got a job, get this, counseling anxiety patients. Wuite frankly I could BE one of these patients. Looking for thoughts and advice.",
            "url": "http://www.reddit.com/r/Anxiety/comments/u2v4f/i_have_horrific_social_anxiety_and_got_a_job_get/"
        },
        {
            "author": "galtor2",
            "author_created_utc": 1323829612,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6foe6",
            "created_utc": 1337655324,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/tymsu/deer_in_head_lights_look_having_trouble_around/",
            "id": "tymsu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/tymsu/deer_in_head_lights_look_having_trouble_around/",
            "score": 9,
            "selftext": "Every 5-6 years since I was 10, I was always hoping things would get better.  In highschool, I thought I would get better in college.  College, I thought I would get better in the workforce.\n\nGuess what, it doesn't work that way.  I have only perpetually worse.  Now it is getting to the point where I can't leave the house.   Literally, I refuse to leave the house.  It isn't because I have places to go, it is because I feel like the world is watching me and I can't take the stress.  If I do go out, every encounter seems like I am a deer in headlights.  I just freeze in front of strangers and don't know what to do.\n\nAnd I can't ever put my hands on it.  When I am outside, It is like a intense moments where my brain shutdown and I go into flight mode.  My brain has only one thought, \"get out of here\".   It doesn't even matter where.  It could be the grocery store, work, mall.\n\nI have to go to places at off hours or that are small shops.  Anything to avoid the glances of other people or the site of other people.\n\nI never thought I would be that person, but I turning into, \"that guy\".  It sucks because I can't fix it.  It isn't like a, I am over-weight, I should lose weight.   It is trying to control my thoughts which I don't understand when I am ... outside.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Deer in head lights look, having trouble around any people especially strangers",
            "url": "http://www.reddit.com/r/Anxiety/comments/tymsu/deer_in_head_lights_look_having_trouble_around/"
        }
    ]
}