{
    "data": [
        {
            "author": "MichigandergoneIowan",
            "author_created_utc": 1335684325,
            "author_flair_css_class": "",
            "author_flair_text": "GAD, PD",
            "author_fullname": "t2_7l40d",
            "created_utc": 1352248152,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12rg0s/relaxing_my_therapy_cat_whiskey_named_after_what/",
            "gilded": 0,
            "id": "12rg0s",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12rg0s/relaxing_my_therapy_cat_whiskey_named_after_what/",
            "retrieved_on": 1413427712,
            "score": 390,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/qiFzpD4XyN9AYbdg.jpg",
            "title": "[Relaxing] My therapy cat, Whiskey, named after what I used to use to treat my GAD and PD. He's changed my life — it's hard to panic with this little guy giving me kisses. ",
            "url": "http://i.imgur.com/INxWV.jpg",
            "user_reports": []
        },
        {
            "author": "degenerateFTW",
            "author_created_utc": 1337640316,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7rxg9",
            "created_utc": 1351816916,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12hm02/a_letter_to_anyone_who_doesnt_understand_panic/",
            "gilded": 0,
            "id": "12hm02",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 67,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12hm02/a_letter_to_anyone_who_doesnt_understand_panic/",
            "retrieved_on": 1413442565,
            "score": 301,
            "secure_media_embed": {},
            "selftext": "There are some things I want you to know about me and my condition.\n\nI am not necessarily shy, that's not what having a panic disorder is. I am an outgoing person who often feels trapped inside a wall of fear. I get really angry sometimes because what I feel like is the real me is trapped behind my anxiety. I probably want to be affectionate and laid back and fun at any given time but you make me nervous. It's not your fault, it's just people- it's nothing you do or did. I can only become desensitized to people by spending a lot of time with them and even then sometimes it doesn't work. Sometimes, with some people, it works right away.\n\nI know that what I'm afraid of isn't real. I know that the threat is an illusion and that I'm not really going to get hurt, but my body is telling me otherwise. I try to talk myself out of it but \"fight or flight\" is one of the most basic and powerful instincts of the body, and it doesn't always listen.\n\nI am working really hard to combat my anxiety disorder. Some days I start to give up because I've been fighting for so long and it doesn't seem to change, or I make progress and then I backslide. It's inevitable that I get depressed and may not seem to be working to help myself. Having an anxiety disorder is really hard and I promise I'm doing what I can. Much of the fight that goes on with my condition happens inside the head, so while it might not seem like I am trying to help myself, I am.\n\nI am constantly exhausted. If your body went through intense terror each day (or sometimes, just from time-to-time) and then crashed, you'd be exhausted too. I have to make myself move when I am crashing and sometimes I just have to sleep. My body doesn't present that as an option; it's just an order- \"You. Sleep. Now\". Sometimes I don't get things done because I am tired. Please don't get mad at me if I don't always do everything I am supposed to do- it can be a real struggle to do little things that most people don't think twice about, like walking into a store, running errands, sometimes even leaving my house.\n\nSome of my behavior might seem pretty odd at times. I might make someone go with me to places I ought to be able to go to alone because I need a \"safe\" person there. I might come off as clingy and dependent on others, but my reasoning is not what you might assume- \"safe\" people are our anchors to sanity. Real or not, we assume we can count on them to help us if we become terrified, and that can make the difference between fleeing a place or being able to stick it out. We develop triggers in specific places and that place, as innocuous as it might seem to you, scares me to death. I don't want to feel that way; it's embarrassing, but I do. How would you feel if you were terrified out of your mind in a place or around a person you know is harmless in your heart?\n\nI try many things to combat my anxiety. If you've heard about a technique, I've probably heard about it. I've tried meditation, yoga, acupuncture, keeping active, positive self-talk, cognitive behavioral therapy, regular therapy, and medication, among things. I've probably tried lots of different medication. Anxiety disorder (and depression, since the two are linked- you'd be depressed if you had an anxiety disorder) often get treated with strong medication, and strong medication has side-effects. When I am trying new medications I might be \"off\" and irrational. Please forgive me, it's not me, it's the meds. Also, some meds make me extra tired or dizzy or any number of other things that aren't my normal or desired state. Most medication used to treat anxiety is something the body becomes immune to over time, so the dosage must be increased. So, occasionally I may relapse when I am not expecting it. I don't necessarily know the cause.\n\nPlease don't make fun of me when I am experiencing a panic attack- it's horrible enough without you ridiculing me. You wouldn't be laughing if you were the one whose body was revolting in fear. I'm not making anything up, I'm not trying to use panic attacks as an excuse not to do things, and I surely don't want to be a burden on you or effect your life negatively. Knowing I sometimes am and sometimes do adds to the misery of the condition. What I really need is for you to let me hold your hand or your arm tightly at times, and to humor me and just tell me it isn't real and I don't have to be scared, even if it's the millionth time you've said it. Tell me you'll protect me and I might just believe you, because I want to so badly. I want to be tough and independent and in control, but something (psychological and chemical) inside of me won't let me be free.\n\nPanic disorders are almost always genetic and are chemically related, though they're often triggered by a traumatic event. Before realizing what is happening to us, most panic disorder sufferers go through a terrible period of thinking that we're dying when we're having a panic attack, or that something terrible is about to happen to us, etc. It's impossible to understand when it first happens, unless someone is there to warn you. There usually isn't.\n\nMany of us live in terror of letting other people know we're freaking out, so while we might seem normal, in control, and calm, our insides are often a different story. It's ok to tell us we seem stabler or more confident- we'll appreciate you noticing. Just know that sometimes it might be an illusion, sometimes true one day but not the next. Acting like it's a result of something we didn't do is a double-blow, the first one being our own senses of failure for not being able to just \"tough it out\", \"grin and bear it\" etc.\n\nSometimes, just walking into a room by ourselves is the accomplishment of the day. Sometimes, we could lead a parade. Please, give us the credit for living with something so tough and managing to do anything. Please, just support us and help us, and listen to us. It's natural to get annoyed sometimes, but if you're annoyed, we're probably beating ourselves up because we're a self-critical lot. That's part of how we got this way, by being too self-aware.\n\nWe are trying to win the battle, but some days we just want to give up.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A letter to anyone who doesn't understand Panic &amp; Anxiety. It saves time, and the stress of re-writing it...",
            "url": "http://www.reddit.com/r/Anxiety/comments/12hm02/a_letter_to_anyone_who_doesnt_understand_panic/",
            "user_reports": []
        },
        {
            "author": "righteo",
            "author_created_utc": 1288032752,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4gltt",
            "created_utc": 1352149215,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12or7g/relaxing_my_biggest_anxiety_helper/",
            "gilded": 0,
            "id": "12or7g",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12or7g/relaxing_my_biggest_anxiety_helper/",
            "retrieved_on": 1413432620,
            "score": 89,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/vhal3SnFzBZbP1sb.jpg",
            "title": "(Relaxing) My biggest anxiety helper.",
            "url": "http://imgur.com/tWZms",
            "user_reports": []
        },
        {
            "author": "getmeaburrito",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351894831,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12jchr/probably_a_repost_now_im_nervous_it_is_and_the/",
            "gilded": 0,
            "id": "12jchr",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "UrbanaPoetrySlam",
                    "author_url": "http://www.youtube.com/user/UrbanaPoetrySlam",
                    "description": "Catalina Ferro performs \"Anxiety Group\" as part of NYC Urbana Poetry Slam. The Bowery Poetry Club, 5/12",
                    "height": 338,
                    "html": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/gVEf6jS8GdU?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i4.ytimg.com/vi/gVEf6jS8GdU/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Catalina Ferro performs \"Anxiety Group\"",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=gVEf6jS8GdU",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/gVEf6jS8GdU?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "mod_reports": [],
            "num_comments": 17,
            "over_18": true,
            "permalink": "/r/Anxiety/comments/12jchr/probably_a_repost_now_im_nervous_it_is_and_the/",
            "retrieved_on": 1413440220,
            "score": 83,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "nsfw",
            "title": "Probably a repost (now I'm nervous it is and the world is going to crumble) but this is an awesome poetry slam about anxiety.  NSFW - language",
            "url": "http://www.youtube.com/watch?feature=player_embedded&amp;v=gVEf6jS8GdU#!",
            "user_reports": []
        },
        {
            "author": "vvj3nvv",
            "author_created_utc": 1341344301,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_87s1v",
            "created_utc": 1351977272,
            "domain": "self.Anxiety",
            "edited": 1351987292,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12kxm0/i_begged_my_husband_to_kill_me_last_night/",
            "gilded": 0,
            "id": "12kxm0",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12kxm0/i_begged_my_husband_to_kill_me_last_night/",
            "retrieved_on": 1413437902,
            "score": 74,
            "secure_media_embed": {},
            "selftext": "The night started off fine. Me, my husband, and my kids went to a few art shows and then went to the circus. We had a great time. Then we came home, put the kids to bed, and watched a movie. That's the last thing I remember before \"waking up\" (I'm using quotes because apparently I never really went to sleep) in the hospital surrounded by my mom and my husband. I had had 4 half shots of Absolut while we were watching the movie and I started freaking out. I begged my husband to just kill me. Clearly I was having a panic attack but I also had started taking Lamictal that morning and I guess that mixed with the alcohol made me black out and panic. My husband called 911 and when they loaded me in to the ambulance I burst out and took off running. They were able to catch me and get me to the hospital. When my mom showed up I told her everything that I haven't been able to tell her. I told her about my anxiety, my OCD, my panic disorder and my anorexia. I don't remember any of this. All I remember is watching the movie. I feel like shit because although I have no memories of what happened my husband still does. He won't tell me everything I said because he thinks that its better that I don't know. He thinks its better that I don't remember. I'm not a regular drinker and I don't do any drugs or abuse my meds but they almost Marchman Acted me last night so I know I must've been pretty bad. I don't know if it was the meds mixed with the alcohol or if I just had a drunken panic attack. I know that you can't drink with xanax so I hadn't taken it. But I did take my celexa and I had taken the Lamictal earlier that day. Now I am embarrassed and my whole body hurts. Has anyone had anything similar to this happen? Should I continue taking the Lamictal (minus that Absolut of course)?\n\n*also just learned I started speaking Spanish and talking about the Day of the Dead.   ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I begged my husband to kill me last night...",
            "url": "http://www.reddit.com/r/Anxiety/comments/12kxm0/i_begged_my_husband_to_kill_me_last_night/",
            "user_reports": []
        },
        {
            "author": "CreamyRanch",
            "author_created_utc": 1351626341,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9ggho",
            "created_utc": 1351714838,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12f1fw/i_think_im_getting_a_mental_haze_because_of/",
            "gilded": 0,
            "id": "12f1fw",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12f1fw/i_think_im_getting_a_mental_haze_because_of/",
            "retrieved_on": 1413445976,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "I feel like I'm losing my mind.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think I'm getting a mental haze because of anxiety.  My brain seems to be functioning at 50% of its power.  Does anybody get something similar?",
            "url": "http://www.reddit.com/r/Anxiety/comments/12f1fw/i_think_im_getting_a_mental_haze_because_of/",
            "user_reports": []
        },
        {
            "author": "throwawaythesadness",
            "author_created_utc": 1342684520,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8dq4l",
            "created_utc": 1351779690,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12gi69/i_need_to_start_catching_the_bus_home_straight/",
            "gilded": 0,
            "id": "12gi69",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12gi69/i_need_to_start_catching_the_bus_home_straight/",
            "retrieved_on": 1413444044,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "So I went to therapy today, and instead of taking the bus straight home like I ought to've, I went inside the mall because I'm an idiot. Of course, it was after school, so the place was filled with other teenagers. \n\nI had a bit of a panic attack.\n\nI went inside the electronics store, and found an empty area, and just sat down in an office chair for about half an hour, until eventually somebody asked me if I needed help (in other words, \"Are you shoplifting?\"), and I said, \"I'm sort of panicking,\" so that guy disappeared, and another guy came and asked me the same thing, and when I said I was panicking, he asked if there was a number he could call, I said no, and I said that I was waiting for the teenagers to shuffle out. He asked if he needed to call security on somebody, and I said, \"No, I just have an irrational fear of people my age,\" so he took me around to a goods elevator, swiped his card, and let me bypass an entire floor so that I could get out onto the street faster.\n\nThat was so embarrassing.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need to start catching the bus home straight after therapy...",
            "url": "http://www.reddit.com/r/Anxiety/comments/12gi69/i_need_to_start_catching_the_bus_home_straight/",
            "user_reports": []
        },
        {
            "author": "littlefield20",
            "author_created_utc": 1281666374,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_490nb",
            "created_utc": 1351860741,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12ifaw/reading_dune_and_i_came_across_this_helpful_quote/",
            "gilded": 0,
            "id": "12ifaw",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12ifaw/reading_dune_and_i_came_across_this_helpful_quote/",
            "retrieved_on": 1413441471,
            "score": 47,
            "secure_media_embed": {},
            "selftext": "LITANY AGAINST FEAR\n\nI must not fear.\nFear is the mind-killer.\nFear is the little-death that brings total obliteration.\nI will face my fear.\nI will permit it to pass over me and through me.\nAnd when it has gone past I will turn the inner eye to see its path.\nWhere the fear has gone there will be nothing.\nOnly I will remain.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Reading Dune and I came across this helpful quote. It calms me down when I feel panicky. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/12ifaw/reading_dune_and_i_came_across_this_helpful_quote/",
            "user_reports": []
        },
        {
            "author": "JustGonnaThrowIt",
            "author_created_utc": 1352112160,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9ibux",
            "created_utc": 1352113083,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12nunk/why_do_i_always_make_plans_then_never_follow_up/",
            "gilded": 0,
            "id": "12nunk",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12nunk/why_do_i_always_make_plans_then_never_follow_up/",
            "retrieved_on": 1413433776,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "It is so painfully frustrating, I want to go out and have fun but I just can't.\n\nChatting to someone online before just normally... then boom make plans for a few days later and now I can't think about anything other than trying to get out of it.\n\nAnd it's a self-perpetuating cycle too, the more I avoid stuff the worse it's gonna get ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Why do I always make plans then never follow up on them :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/12nunk/why_do_i_always_make_plans_then_never_follow_up/",
            "user_reports": []
        },
        {
            "author": "thr0w111",
            "author_created_utc": 1351955334,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9hpz2",
            "created_utc": 1351956126,
            "domain": "self.Anxiety",
            "edited": 1353517540,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12keam/im_suffering_from_anxiety_and_depression_but_the/",
            "gilded": 0,
            "id": "12keam",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12keam/im_suffering_from_anxiety_and_depression_but_the/",
            "retrieved_on": 1413438639,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I saw a therapist in college, but because the school made it pretty easily available. I had a panic attack and went to the infirmary, they dialed the doctor on call who set me up with an appointment almost immediately. I'm out of school and beginning to suffer constantly. I want to get help. I'm insured, but whenever I try to sort out where to start I get anxious, down on myself, depressed, and give up. Feeling worse than before no less. \nI don't know if I need a psychologist or a psychiatrist. I don't know how to find one. I'm a generally competent person but this block is starting to ruin my life. \nAny tips from anyone who has successfully gotten help?\n\nEdit: Thanks everyone for the advice and kind words! This definitely helped me get the ball rolling, even if it took a couple weeks. In case anyone is curious: I didn't have a family doctor or PCP, and getting on the phone definitely made me anxious. I ended up, with a little courage from Reddit, talking to my roommate who used to see a therapist regularly. Rommate connected me with his therapist, therapist was very receptive and said he could gladly give me a consultation. I can't meet with him regularly since he sees my roommate, but we met for about an hour to talk about my history and what I wanted/needed and he told me he would find a recommendation for me. I was given the contact information yesterday and will hopefully set up a regular appointment soon. As an added benefit, if I don't like this recommendation, my roommates therapist encouraged me to notify him so we can try to find a better fit. Either way, I feel a HUGE amount of weight lifted just by starting the process. Thanks again Reddit!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm suffering from anxiety and depression, but the act of searching for professional help gives me anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/12keam/im_suffering_from_anxiety_and_depression_but_the/",
            "user_reports": []
        },
        {
            "author": "BirdManJr",
            "author_created_utc": 1316133569,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5v8wm",
            "created_utc": 1351751080,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12g30i/this_subreddit_leaves_me_in_awe_everyday_thank_you/",
            "gilded": 0,
            "id": "12g30i",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12g30i/this_subreddit_leaves_me_in_awe_everyday_thank_you/",
            "retrieved_on": 1413444592,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "This sub shows me that everything I go through you guys/gals are going through too. I feel awful that anyone has to deal with this but seeing others experiencing similar things to me makes me feel so much better. Since finding this page (only about a week ago) my anxiety has actually decreased since I know I'm not totally insane. Things like the fogginess in my brain and my occasional dissociation made me think I lost my mind but I now know these are just symptoms of anxiety (along with most other things wrong with me!) So again, thank you, thank you, thank you!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This subreddit leaves me in awe everyday. Thank you!",
            "url": "http://www.reddit.com/r/Anxiety/comments/12g30i/this_subreddit_leaves_me_in_awe_everyday_thank_you/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351914626,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12ju0t/i_dont_want_to_get_better/",
            "gilded": 0,
            "id": "12ju0t",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12ju0t/i_dont_want_to_get_better/",
            "retrieved_on": 1413439584,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I have defined my whole life by my anxiety. Now that I have been getting better I feel like I am loosing everything I belong to. I don't know what to do.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't want to get better.",
            "url": "http://www.reddit.com/r/Anxiety/comments/12ju0t/i_dont_want_to_get_better/",
            "user_reports": []
        },
        {
            "author": "jessikaye",
            "author_created_utc": 1316576133,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wbf8",
            "created_utc": 1352066033,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12mqr9/youre_abandoning_me/",
            "gilded": 0,
            "id": "12mqr9",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12mqr9/youre_abandoning_me/",
            "retrieved_on": 1413435365,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I had a horrible anxiety attack last night that was worse then any I've ever had. My fiance picked me up from where I was and brought me home leaving my car at a friends house because I couldn't drive. Today I feel very unstable and need to go to my mother's house to move some of my things I asked him to either take me to my car and spare a little gas money or to take me to her house. I very nicely asked, \"could you please come with me though? I'm very unstable right now and shouldn't drive. I would appreciate it dearly if you would take me.\" He looks at me and says, \"I don't want to take you, I'm not going out there.\" I need him with me... I can't be alone right now... I'm so hurt right now... I even nicely asked even pleaded for him to come with me but he won't... I feel so abandoned..",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "you're abandoning me..?",
            "url": "http://www.reddit.com/r/Anxiety/comments/12mqr9/youre_abandoning_me/",
            "user_reports": []
        },
        {
            "author": "TooHighPi",
            "author_created_utc": 1287024532,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ff61",
            "created_utc": 1352033336,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12lypn/ive_been_using_weed_to_selfmedicate_my_anxiety/",
            "gilded": 0,
            "id": "12lypn",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12lypn/ive_been_using_weed_to_selfmedicate_my_anxiety/",
            "retrieved_on": 1413436485,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I've been struggling with my anxiety since I was a kid and ever since I first smoked weed in highschool I knew that I was on to something.  For years I've used it to either forget or attempt to curtail my anxieties.  Now,  I just started a new job while also going to school and although it helps sometimes I fear it's beggining to hurt me more than help.  I'd really like to stop using marijuana to medicate my anxiety because I'm tired of feeling like I *need* to smoke everytime I get anxious.  Has anyone on this sub been through something similar?  I'd really appreciate any helpful tips.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've been using weed to self-medicate my anxiety for years.  How can I stop this behavior?",
            "url": "http://www.reddit.com/r/Anxiety/comments/12lypn/ive_been_using_weed_to_selfmedicate_my_anxiety/",
            "user_reports": []
        },
        {
            "author": "DrDiv",
            "author_created_utc": 1334384446,
            "author_flair_css_class": "",
            "author_flair_text": "GAD + Panic Disorder",
            "author_fullname": "t2_7g9ld",
            "created_utc": 1352062167,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12mmt1/does_anyone_else_experience_heightened_periods_of/",
            "gilded": 0,
            "id": "12mmt1",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12mmt1/does_anyone_else_experience_heightened_periods_of/",
            "retrieved_on": 1413435521,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I've noticed for me, it's late march/early april, and late october/early november. I get periods of anxiety that don't really go away, my appetite goes down the drain, and I just feel like I have a cold. \n\nI don't know if it IS because I have a cold (I've been coughing/sneezing/congested the last week), or if it's anxiety. Or a mixture of both. Yesterday I had a massive panic attack, and I've felt incredibly anxious today. It also doesn't help I have work today, too. \n\nAnyway, does anyone else feel something similar? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else experience heightened periods of anxiety during certain times of the year?",
            "url": "http://www.reddit.com/r/Anxiety/comments/12mmt1/does_anyone_else_experience_heightened_periods_of/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1352215197,
            "domain": "self.Anxiety",
            "edited": 1352215531,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12qcwo/help_anxiety_and_the_fear_of_pooping_my_pants/",
            "gilded": 0,
            "id": "12qcwo",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12qcwo/help_anxiety_and_the_fear_of_pooping_my_pants/",
            "retrieved_on": 1413429560,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Well here is everything boiled down to it. I want to know what I have and if its even SAS? Please don't laugh, there is one part which scarred me. Highschool was the worst thing in my life so far.\n\nIf you read my welcome story it was a story about how it all started and the main thing I experience. It will be below all of this info.\n\nSo basically here is my symptoms. In the usual order they happen.\n\nStart to think about being stuck\nGet nervous\nStart to think of bathroom\nHave to use bathroom\nIf I cant I get nervous, shaky, sweaty\nI start to pick at my back and arms\nthe worst part is the shaking\n\n\nMy mother has it, and I recently found out my real father suffers from panic attacks also.\n\n\nMy other problem..\n\nI listen to my heart, it makes me nervous and I start manually breathing. I used to drink and smoke pot. Now I cannot drink or smoke pot for the fear of being messed up and having a panic attack.\n\nI don't like to go to public places with other people, but I will if I have to, just don't like to.\n\nI can't wait in lines.\n\nI have devoloped depression from it, panic attacks, and I have no insurence and cannot see a doctor. I have no idea what it is, if its mental, but it controls my life.\n__________________________________________________ ______\n\nMy Story\n\n\n\nSophomore Year\n\nMy mother has always had sa, I remeber how she used to freak out on car rides thinking she was going to poop her pants, the thought of not having a bathroom near by. I used to think it was a load of bull. I didn't understand how someone could feel that way. I spent the last three years outside skateboarding all day and night, with my friends, smoking, drinking, just having fun. Then the end of sophmore year it happened.\n\nIf I remeber correctly, it was right before school, and I didn't want to go. And I remeber being in music class and felt like I had to use the bathroom, I kept moving back and forth because it almost felt as if a stool was at the edge of my ( yea know ). I kept having stomach cramps all that week, it was so bad the girl I liked i just ignored her. I was the class clown, now I didnt talk. Then it just stopped. I finished sophmore year fine.\n\n\nJunior Year\n\nThis year was easy, I didn't have the problem, everything was good.\n\n\nSenior year\n\nThis is when it really got bad. It was around October. It started back up. I was on the bus, I had to use the bathroom really badly, and it was when they sat in the parking lot waiting for us to go in. \n\nI had to go now, I was shaking and everything, I wanted off that bus, finally we got let off and I went straight to the bathroom. It was getting worse, the bus rides became unbearable, sitting against the windows trying to sleep so I could make it, moving back and forth. I remember sitting in the bathroom at home while the bus came so I didn't have to go. My dad would drive me too school. But it wouldn't help. \n\nIt was so embarrassing, horrible. Soon it started into class. I wouldn't talk to my friends, my grades where declining. I would sit and shake, sweat horribly and scratch my back in a nervous frenzy, horrible stomach cramps, I would hold my stomach and lay my head on the desk. I just keep staring at the clock counting the minutes. Always, always feeling like I had to poop. I started asking the teachers to go to the bathroom, twice a class, everyday. I didn't eat because I thought that would make me not have to poop. It didn't help. \n\nCramps got worse, so bad I was failing every class. I talked to my mom about it, I ran out of sick days for school. So I talked her into letting me do online classes, but it didn't work, I was too far behind, so I just dropped out. \n\n\nAfter Highschool\n\nNow there's some good to this, I met the most beautiful person ever, a confused girl that I love. When I met her I still had my anxiety, it wasn't as bad. But I remember worrying I was going to poop my pants going 5 blocks to Walmart. That was the first time I tired taking medication, I took a half a peach ( Xanax ) it helped. But I didn't start taking them, my friends got bad into them so I always avoided taking medicine my whole life. So I tried smoking cigs, it was like a cure. Instantly I was relaxed and fine. \n\nWell my anxiety started to go away. It was all good, I started having fun again. Then I remember one night I got a bit too drunk, and smoked way to much. I've never been that messed up. So then I quit smoking ( this is weed ). I haven't touched it since. So then I became afraid of getting that messed up again. I could drink but now smoke. \n\nEventually me and my girlfriend moved into an apartment together. I got a job at a factory making car parts. I still had my anxiety, sitting in the meeting was bad, waiting to get hired on, signing all the applications. But I made it through. I worked there for about 4 months, then my anxiety started again. I found myself in the bathroom before work feeling like crap. I once again, failed. I quit the job. Things got bad, no money, but I got another job at a factory making plumbing. I worked there for 9 months.\n\nIt started all back up\n\nThen one day me and my friend where going to the mall early in the morning, I had just conqured all my problems. Everything was good, the past months where great. Then Gas hit me.. Ok no problem. Then I had to use the bathroom. ( This was because I ate a huge bowl of cereal about 3 hours before I got up, right before I went to sleep. This is when I found out I was lactose intolerant ) I started getting nervous because we wernt close to one. So I had him pull by the doors, and this was on black Friday. So here I am about to poop my pants shaking walking weird down the mall and i'm on the wrong side! I freaked out so bad I went outside behind the generator and pulled my pants down to use the restroom. People walked by and starred weird then finally I just pulled them up and made my way to the other side of the mall.\n\nBack to work\n\n\nThen one day, we used to have random meetings. And it just dawned on me, what if I have to use the bathroom during this meeting? What if i have to go before the meeting and it starts? what if i poop my pants? What if? I'm stuck! I'm trapped here! I can go to the bathroom but not during a meeting. Well it built up and up. Till one day I had a nervous breakdown.\n\n__________________________________________________ ______________\n\n\n\nI don't to live like this anymore. \nI'm almost 20 years old. I've been suffering with this since I was 16.\n\nTL;DR - I have depression and Anxiety, and panic attacks. My anxiety comes out in the form of my bowels, so If I am in a place where I cannot go, or am trapped I have to get to a bathroom. Now it is to the point where I cant even go in public, no matter how much I want to I just break. I can't live like this anymore, I cant do it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] Anxiety and the Fear of Pooping my Pants",
            "url": "http://www.reddit.com/r/Anxiety/comments/12qcwo/help_anxiety_and_the_fear_of_pooping_my_pants/",
            "user_reports": []
        },
        {
            "author": "TA7891",
            "author_created_utc": 1352051466,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9i1wv",
            "created_utc": 1352053088,
            "domain": "self.Anxiety",
            "edited": 1352142626,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12mdaz/social_anxiety/",
            "gilded": 0,
            "id": "12mdaz",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12mdaz/social_anxiety/",
            "retrieved_on": 1413435911,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I'm 15 years old. Last year I was diagnosed with depression and anorexia, I overcame that reasenty with my friends and family support but I've had low self asteem since. I've always been nervous about talking to people since I was 10, I thought I would just grow out of it. I am fine talking a few close friends and family but with anyone else I feel like I'm constantly fighting with myself just to say one word, the last time i tryied i just had a break down, i just felt myself panicking. I only have 3 close friends I can really talk to. Is this social anxiety or just shyness? \n\nEdit; thank you for everyone who commented. I really appreciate the advise you's have given me. I've read all of you're comments and I'll follow the advise. People have always thought I was strange because of this, it's great knowing that I'm not alone, thank you guys :)\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Social anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/12mdaz/social_anxiety/",
            "user_reports": []
        },
        {
            "author": "Abrum",
            "author_created_utc": 1286660021,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4f06q",
            "created_utc": 1352041300,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12m2zr/rant_why_do_i_feel_anxious_there_is_literally_no/",
            "gilded": 0,
            "id": "12m2zr",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12m2zr/rant_why_do_i_feel_anxious_there_is_literally_no/",
            "retrieved_on": 1413436328,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I just spent a couple of hours laying in my bed watching anime. I'm enjoying it, I'm comfortable, and all the while I have nothing to worry about, nothing I need to do, nothing bad going on in my life, no nightmares recently, no recent crisis or trauma, nothing. Everything is pretty much fine and happy. I don't do alcohol, drugs, caffeine, medications, nothing at all.\n\nBut I was still anxious. And worried. I felt it in my chest. I still do. I don't know why. There's no reason for it, it's just there. Why? Why do I feel like this? There's nothing wrong. There's nothing to be worried about. Nothing. I have no reason to be anxious. So why do I still have this anxiety just dwelling in my mind and body? Why will it not go away?\n\nI don't know. I think my worrying about why I'm worried is actually self-reinforcing. I'm completely at a loss otherwise. Please tell me I'm not slowly losing my sanity or something, because I feel like I am, and it's scaring me. Maybe some help on how I can make this stop would be nice too.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] Why do I feel anxious? There is literally no reason for it. At all.",
            "url": "http://www.reddit.com/r/Anxiety/comments/12m2zr/rant_why_do_i_feel_anxious_there_is_literally_no/",
            "user_reports": []
        },
        {
            "author": "picnicsandcrunchie",
            "author_created_utc": 1348492157,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_93x5r",
            "created_utc": 1351870425,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12in9g/finally_becoming_the_boss_of_my_anxiety_slowly/",
            "gilded": 0,
            "id": "12in9g",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12in9g/finally_becoming_the_boss_of_my_anxiety_slowly/",
            "retrieved_on": 1413441187,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "Hey reddit,\n\nSo I've posted here many times before, and usually I'm whinging about how horrible my anxiety has been and how I just can't control it. But today, I excited. I'm excited because I'm beginning to understand my mind, what triggers my anxiety, to spot when anxiety is approaching and deal with it, and just get a better quality of life in general. \n\nSo it's all started with this TED talk. I'll post the link down the bottom for anyone interested in a very heartening talk. Basically in a nutshell, this woman had a head injury, was horribly depressed and on the brink of suicide, but created 'a game to heal her brain'. It works on the 4 types of resilience, scientifically proven to lengthen our lifespans. And she talks about this game she created, and I decided to give it a go. (it's called Superbetter. You can play online at superbetter.com, or download the app on iPhone) And within a week, I have been feeling better than I've felt in so long. I had seriously forgotten what it felt like to enjoy a day. I'd forgotten what it felt like to not give so much of my time and energy to those anxious thoughts. I now tell them, \"I know you're anxiety making these palptitations, or whatever else it may be at the time, and I'm in control here, it's my life, and I'm going to run it. BECAUSE I am awesome. I sweat and breathe awesome. And I tell that anxiety that it has no room next to my awesomeness. \n\nThis is just one lesson this app has taught me. It has taught me so much more but I think this would become an essay! However, this app is designed to help people with anxiety, depression, eating disorders, and even things that arent so serious...and its even for people who just want a better quality out of life, to notice the little things and feel good about them, rather than all the huge big bad things.\n\nSo, everyday, I do my 3 power-ups (small things like walking around the block, or calling my aunty to say hi), I do my 3 quests (similar to power-ups but a little more involved) and I battle one bad-guy (your big issue). Need I mention who my bad guy is? But seriously, I think give this a shot. If you ever need an ally, I'm more than willing to help get you started :)\n\nTL;DR. Found an app/website, superbetter.com, mentioned in this TED talk http://www.ted.com/talks/jane_mcgonigal_the_game_that_can_give_you_10_extra_years_of_life.html, and it's amazing. Good luck guys! :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Finally becoming the boss of my anxiety. Slowly but surely. No medication, just an app/website and lots of self talk.",
            "url": "http://www.reddit.com/r/Anxiety/comments/12in9g/finally_becoming_the_boss_of_my_anxiety_slowly/",
            "user_reports": []
        },
        {
            "author": "kef__",
            "author_created_utc": 1327602875,
            "author_flair_css_class": "",
            "author_flair_text": "Social Anxiety Disorder",
            "author_fullname": "t2_6reh1",
            "created_utc": 1352080178,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12n68n/relaxing_what_ive_learned_in_the_last_year/",
            "gilded": 0,
            "id": "12n68n",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12n68n/relaxing_what_ive_learned_in_the_last_year/",
            "retrieved_on": 1413434726,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I've been going through Social Anxiety officially for over a year now. I'd say that although I've improved a lot over the past year, I still have my moments. I still get anxiety from going to parties or out to bars or clubs, or other social situations where I have to be present and contributing. Dates are killer for me- I still flake on dates probably 2/3 of the time. I have a huge fear of embarassing myself in public, specifically shitting myself or (to a lesser degree) throwing up. Of course the anxiety gives me nervous diarrhea and nausea, which makes a vicious spiral of increasing anxiety. \n\nAfter a year of therapy and warring with my anxieties I've developed a few tricks. I don't know how common these are but I'd say that I've developed all of them independently in myself. I'm not trying to say I'm original or anything, but I do want to share these because I feel like if I had known about and tried them sooner I would've saved myself from a lot of pain and anxiety.\n\n\n* **Inch towards daylight.** I've noticed that my anxiety tends to come in waves of panic that ebb and flow and eventually peak before disappearing. So I tell myself \"Just last 15 more minutes. Then you can go home.\" If the anxiety still isn't gone by then I tell myself \"Well you lasted that 15 minutes, you can do another 15.\" Sometimes the anxiety gets worse and I do end up leaving, but I've found that by the time the 15 minutes have passed I'm calm and in the clear.\n\n* **Stay busy.** Some of my worst triggers are standing in line or waiting for a test to start. But when the test finally starts, I focus on the exam and I'm fine. So whenever I'm at work with nothing to do and the panic sets in, I find something to do, even if it's something completely useless or extra. I'll help someone with whatever they're working on or figure out a better way of doing something. At parties, I tend to move around a lot. If I stay in one conversation too long, unless I'm really engrossed with the topic or who I'm talking to, I'll get bored and my mind will default to anxious thoughts. So I move around to something else, talk to new people or go back to other people I was talking to before- anything to keep me moving. Keeping busy keeps me out of my head and away from anxious thoughts.\n\n* **Ignite curiosity.** This is something that I'm still developing. I recently had a huge battle with anxiety. I was supposed to meet up with this cute girl and her friends at a popular local brewery, and of course the whole morning and trip there I was having a panic attack. I was terrified of the whole situation, and no amount of telling myself that I'd be okay would help. I managed to park my car, and sat there for 20 minutes trying to convince myself to go inside. I almost left, but then a thought dawned on me. My anxious thoughts were always a foggy version of \"What if something horrible happens?\" but this time I thought, \"What if it all goes right? What if I go in there and everything is awesome and I have a great time with this girl?\" It wasn't enough to keep the anxious thoughts away, but for once something was pushing me *towards* what I wanted to do. And that was enough to get me to grit my teeth, get out of my car, and put one foot in front of the other.\n\nAnxiety has taught me what it means to be crazy, to not be able to control your thoughts or emotions despite trying as hard as you possibly can. I can begin to understand why crazy people do what they do; somehow it seems sane even though logically they know it's not. It's taught me humility and empathy; willpower is not something that grows on trees, and people's failures of will are not simply because they're lazy. You don't go from 300 pounds of fat to 160 pounds of muscle overnight, and you don't go from lazy pothead to world's hardest worker overnight either. Willpower is cultivated. You work out every day to get stronger. You study every day to get smarter. You grit your teeth through laziness and fear every day to get more willpower. \n\nI, like the rest of reddit, am into sci-fi. I've always seen this anxiety as an invading force into my mind, taking over parts of my life and forcing me to do things that I don't really want to do. It's insidious and very convincing. It's been slowly invading me for probably 7 years now, and only a year ago did it reach a point where I realized what was going on.\n\nThis is a war, a long slow grind of pain and fear towards something better. Every day is a battle, some won and some lost. I'm cultivating the belief that even if the war goes bad for a while and I lose ground, it's not over until I say it's over. I'm not giving up until I'm dead or have completely mastered my anxiety. \n\nThe most important thing that I've learned, is that you win this war in the day to day, the moment to moment. You never give ground easily- every second is a chance to think positively, every day has opportunities for you to break out of your shell. \n\nI may not be able to go on kickass dates with cute girls or crazy parties in grungy downtown warehouses-turned-apartments, but *some day I will be*. And sooner than I think.\n\nI believe in myself.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] What I've learned in the last year",
            "url": "http://www.reddit.com/r/Anxiety/comments/12n68n/relaxing_what_ive_learned_in_the_last_year/",
            "user_reports": []
        },
        {
            "author": "sue2713",
            "author_created_utc": 1351980726,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9htny",
            "created_utc": 1351982583,
            "domain": "self.Anxiety",
            "edited": 1352057867,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12l2p6/how_do_i_tell_my_parents_i_need_help_if_they_dont/",
            "gilded": 0,
            "id": "12l2p6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12l2p6/how_do_i_tell_my_parents_i_need_help_if_they_dont/",
            "retrieved_on": 1413437699,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "Hello there everyone,\n\nI am 17 and I have been struggling with anxiety for as long as I remember. I never feel happy anymore because I'm always so worried about every little detail about my life. I second guess myself all the time in fear that I'm making a bad decision or I'm going to make myself look bad or embarrassing in front of people. I also feel really uneasy around people. I hate being in groups of people and I would rather just sit at home then be out with anyone. It even drives me to feeling sick sometimes to where I won't want to eat or want to do anything.\nMy boyfriend has expressed how worried he is about me and how he wants me to get help. My problem is that my parents don't believe problems like anxiety are real. They don't believe in getting therapy or medication to fix anxiety. I can't communicate on a personal level with my parents either and it's hard for me to tell them when I am having a problem. My boyfriend has told me that he will talk to them for me, but again, I'm too worried it'll upset them and then end up going down the road of telling me I need to grow out of this problem and there's really no medication for me to take that will help me because it's not real. I really don't feel okay with myself anymore and it's starting to throw me into a dark place. \n\nI just really need some advice on explaining to my parents that this really is a problem and that I'm very unhappy with my life because of it. Should I let my boyfriend talk to them? How can I tell them that I really NEED help with my anxiety? I just need some advice and thought you guys could possibly help! Thank you for reading.\n\n\nEDIT: Wow! Thank you all so much! I didn't expect to get so much feedback. I definitely have a little better idea of what to do now. I'm still pretty scared about it myself that I'm figuring all this out and not really sure how the next few months are going to go. But thank you again to all of you. This means a lot! I'll definitely keep you guys updated once things start rolling after I talk to someone about it! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do I tell my parents I need help if they don't believe anxiety is a real problem? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/12l2p6/how_do_i_tell_my_parents_i_need_help_if_they_dont/",
            "user_reports": []
        },
        {
            "author": "Ochikobore",
            "author_created_utc": 1269149128,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_3y9m9",
            "created_utc": 1352303586,
            "domain": "self.Anxiety",
            "edited": 1369630615,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12sutp/help_advice_my_anxiety_keeps_preventing_me_from/",
            "gilded": 0,
            "id": "12sutp",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12sutp/help_advice_my_anxiety_keeps_preventing_me_from/",
            "retrieved_on": 1413425374,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "As a back story, I've dropped out of college on two separate occasions due to failing courses because of my anxiety and depression at the time. I am back for a third time, and I returned believing that I had the tools necessary to at least be able to get through school without too much anxiety.\n\nI don't get this with doing nonschool work. I enjoy reading programming books on my own. I worked hard and have won music competitions by practicing for 8 hours a day for two years. I have a burning desire to work hard and understand my motivation for doing so.\n\nMy problem is that when it gets down to it and I have to sit down to work on a school assignment I get a sort of \"school work paralysis.\" I stare at my computer screen, browse reddit/facebook/youtube/etc and just don't get anything done.\n\nThe things that hold me back stem from...\n\n1. **Fear** of failing. Fear of not doing my best for the professors I admire. Fear of finding out that I am not great at something as I think I am.\n2. **Struggle**: I am not used to having to study so much. It means I have to make lots of sacrifices and even if I do make those sacrifices I may not necessarily succeed. Was it worth it at all?\n3. **Contentment**: Maybe living a modest life as a cashier at CVS or an IT guy would be okay for me. Is being content in this way holding me back?\n\nIf anyone has had a similar problem and has some strategies to overcome this I'd be much appreciative. Thank you fellow /r/Anxiety folks :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help / Advice] My anxiety keeps preventing me from starting school assignments.",
            "url": "http://www.reddit.com/r/Anxiety/comments/12sutp/help_advice_my_anxiety_keeps_preventing_me_from/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1352170972,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12phdi/i_know_this_isnt_a_good_thing_to_use_to_cope_with/",
            "gilded": 0,
            "id": "12phdi",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12phdi/i_know_this_isnt_a_good_thing_to_use_to_cope_with/",
            "retrieved_on": 1413431072,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "So I ran out of my anxiety meds on Saturday.  Sunday was ok.  But today the anxiety decided to kick off sometime before the end of work.  And it's been non-stop.  I ignore it, but it was factoring into everything I do and think.  \n\nThank god I'm to the point where I can recognize it.  If this was me two years ago, I wouldn't stand a chance.  But me now, I know what's going on.  Bad thing is with no meds until I get a refill from my doc, I have no hammer to beat the anxiety back, and none of my other methods of dealing with it are working except...\n\nAlcohol.  \n\nI just drank the last 3rd of my bottle of sour apple pucker straight on an empty stomach and except for some minor heartburn(I assume from the sugar in it), I feel great.  The anxiety is there, but it's like stuck... trapped behind a wall of fog, lost in a maze of sorts and can't get out.  I feel great... minus the tipsy part and moving to fast makes me lightheaded now.  \n\nI tried calling a few people and no one picked up.  Decided it was time to go to bed and my father called me.  Got to talk to him and my grandmother.  I was so buzzed the entire time, but I think I was coherent.  Well now it's time to go to bed.  I hope everyone has a good night.  I know that alcohol is one of the worst ways to deal with anxiety let alone any problem, but I know for sure that for me it worked tonight to stop the anxiety from effecting any changes on me beyond the need to deal with the anxiety.  I feel great now.  Good night",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I know this isn't a good thing to use to cope with anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/12phdi/i_know_this_isnt_a_good_thing_to_use_to_cope_with/",
            "user_reports": []
        },
        {
            "author": "throwout3",
            "author_created_utc": 1352057766,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9i30e",
            "created_utc": 1352075208,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12n0sm/something_bad_might_have_happened_there_are/",
            "gilded": 0,
            "id": "12n0sm",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12n0sm/something_bad_might_have_happened_there_are/",
            "retrieved_on": 1413434952,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "I'm cross posting this story from twoxchromoses.... This past Friday night I went out with some coworkers after work for a few drinks and some bowling. I'd had a stressful week, including a break up with a fairly long term boyfriend, and a lot of work stress, and just wanted to relax. I had a few beers, which turned out to be too much. I got sick and started throwing up. One of my coworkers walked me to my car and put me in the backseat, where I passed out or fell asleep, not entirely sure which. I can't even remember if I locked the car. A woke up about 3 hours later and drove myself home. When I woke up, my clothes were on, I'm pretty sure even my belt was still on and buckled (it was off when I got home but I kind of remember taking it off myself, but I'm not completely sure.) I didn't think too much at the time, but as the day went on, I started wondering what happened and then noticed I had some vaginal discharge and irritation. I started to get really scared. The more upset I got, the more the pain increased. I finally called RAINN, and they directed me to the emergency room for an exam. I had to involve the police and have a full rape exam done. They found a few bruises on me, but I bruise easily so those may have been pre-existing or happened while I was drunk, and a very minor reddening around my vagina, but no tears or abrasions or anything conclusive. They swabbed for foreign DNA, but the police officer told me later that since there was no overt evidence and no suspects, it is likely the DNA tests will never be run. They have me antibiotics and the morning after pill and sent me home. I have only told one friend about this, and he keeps trying to convince me to let it go, and that it is likely nothing happened since I woke up with my clothes on, no obvious semen on me, and there were no tears or abrasions in my vagina. I just don't know what to do. I can't let it go. I'm so angry at myself for being careless, and angry at the people I was with for not looking out for me better, and just wishing I hadn't gone at all. My anxiety over the unknown is intense. I will just never know for certain. I had already been struggling with anxiety and depression issues before this and I'm feeling worse now. I'm considering checking into a mental health hospital as I've been having some suicidal thoughts. I just can't stop being angry at myself for being so stupid, and terrified of not knowing what happened. I keep trying to convince myself that nothing happened. I didn't take the morning after pill they gave me because I have this sick idea that if I end up pregnant, at least then I'll know, and I'll just have an abortion. I just need a little help right now, because I am having such strong anxiety attacks about this and I don't know what to do.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something bad MIGHT have happened; there are indicators that it didn't and few that it did. But the anxiety is so intense it may as well have...",
            "url": "http://www.reddit.com/r/Anxiety/comments/12n0sm/something_bad_might_have_happened_there_are/",
            "user_reports": []
        },
        {
            "author": "wheresmysmokes",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1352238629,
            "domain": "self.Anxiety",
            "edited": 1352269959,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12r4py/dae_have_anxiety_about_voting_today/",
            "gilded": 0,
            "id": "12r4py",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12r4py/dae_have_anxiety_about_voting_today/",
            "retrieved_on": 1413428245,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "I had nightmares all last night that I was being dragged to the polling place.  The lines in my area area around an hour to two hours, and people haven't gotten out of work yet.  My anxiety is mostly centered around leaving the house AND being trapped somewhere.  I'm freaking the FUCK out.  I don't want to go and honestly don't care that much, but I'm afraid I'll get judged if I don't.  \nThe judging especially would come from my boyfriend, who I live with, so I can't just lie or not say anything.  We're very political, and I'm worse than him when it comes to bitching about politics.  I'm really not concerned about making a difference or not.  I should have gotten an absentee ballot, but I was afraid it wouldn't count.    Definitely will next time. \n\nUpdate:  I ended up not going to vote.  My state voted for the candidate I would have with an overwhelming majority.   I've decided to not bring up my voting whatsoever.  Because I was going to vote for Jill Stein (once again, NOT in a swing state) I figure saying that I didn't vote for Romney or Obama would be enough if I get asked.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE have anxiety about voting today?",
            "url": "http://www.reddit.com/r/Anxiety/comments/12r4py/dae_have_anxiety_about_voting_today/",
            "user_reports": []
        }
    ]
}