{
    "data": [
        {
            "author": "squidyfala",
            "author_created_utc": 1349118243,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_96h8w",
            "created_utc": 1353102645,
            "domain": "25.media.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13bjwk/if_you_follow_the_paint_brush_with_your_eyes/",
            "gilded": 0,
            "id": "13bjwk",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13bjwk/if_you_follow_the_paint_brush_with_your_eyes/",
            "retrieved_on": 1413370391,
            "score": 249,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/-7swR4pGR2DOqX4f.jpg",
            "title": "If you follow the paint brush with your eyes without moving your head, it's classified as a therapeutic technique to calm anxiety/panic. ",
            "url": "http://25.media.tumblr.com/tumblr_mcyhfmktxG1qiz4tho1_r1_500.gif",
            "user_reports": []
        },
        {
            "author": "bennybebop",
            "author_created_utc": 1348340881,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_93bmd",
            "created_utc": 1353054667,
            "domain": "qkme.me",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13ah9k/maybe_you_can_relate/",
            "gilded": 0,
            "id": "13ah9k",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13ah9k/maybe_you_can_relate/",
            "retrieved_on": 1413371815,
            "score": 189,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/JfVHqkH1OwA7JVL1.jpg",
            "title": "Maybe you can relate...",
            "url": "http://qkme.me/3rt06w?id=228101432",
            "user_reports": []
        },
        {
            "author": "elvears",
            "author_created_utc": 1316492873,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5w3wp",
            "created_utc": 1353390695,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13hvdz/does_anyone_else_feel_like_people_automatically/",
            "gilded": 0,
            "id": "13hvdz",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 35,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13hvdz/does_anyone_else_feel_like_people_automatically/",
            "retrieved_on": 1413362023,
            "score": 101,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel like people automatically don't accept/like you?",
            "url": "http://www.reddit.com/r/Anxiety/comments/13hvdz/does_anyone_else_feel_like_people_automatically/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1352950522,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/137ylo/started_antianxiety_medication_yesterday_to_help/",
            "gilded": 0,
            "id": "137ylo",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/137ylo/started_antianxiety_medication_yesterday_to_help/",
            "retrieved_on": 1413375141,
            "score": 83,
            "secure_media_embed": {},
            "selftext": "Just met with the doctor for the first time yesterday about anxiety, depression. I've never sought out therapy before, always felt that I just needed to deal with thing, but this past year has been horrifying. Told my doctor that I can't focus at work and my new boss has been heavily scrutinizing me. He asked \"What if you were in a different job tomorrow? How do you think that would affect your situation?\" Wasn't quite sure what I felt. Next morning, my paranoia turned out to be confirmed.\n\nI have a supportive family, thank goodness, but this turn of events sure isn't helping my anxiety. Just needed to reach out; this is without question the worst day of my life.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Started anti-anxiety medication yesterday to help me with paranoid feelings that I might lose my job. Got fired this morning.",
            "url": "http://www.reddit.com/r/Anxiety/comments/137ylo/started_antianxiety_medication_yesterday_to_help/",
            "user_reports": []
        },
        {
            "author": "anachromatic",
            "author_created_utc": 1309891442,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5h0of",
            "created_utc": 1353355235,
            "domain": "self.Anxiety",
            "edited": 1353391105,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13gsgk/anxietydepression_combo_is_stopping_me_from/",
            "gilded": 0,
            "id": "13gsgk",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13gsgk/anxietydepression_combo_is_stopping_me_from/",
            "retrieved_on": 1413363519,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "I have a lot of things to do--regular, life things. Plucking my eyebrows, showering, doing the dishes, cleaning. Basic stuff. I have to get my college to send out my official transcripts to grad schools. I have to apply for jobs. I need to start writing again.\n\nWhenever I think about doing any of these things I just feel crippled, as if I shouldn't/can't do them. Or why bother with them. It is a difficult feeling to describe. It just halts me. I want to put everything off to stifle the stone in my chest.\n\nDoes anyone have any tips for just getting done the tasks you NEED to do? I'm finding it so hard and scary to even think about...\n\nEDIT: All the responses have been extremely helpful. I can't thank all of you enough. I actually managed to get way more done today because of the advice in this thread. Thank you so much!!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety/depression combo is stopping me from accomplishing anything",
            "url": "http://www.reddit.com/r/Anxiety/comments/13gsgk/anxietydepression_combo_is_stopping_me_from/",
            "user_reports": []
        },
        {
            "author": "poppybloomers",
            "author_created_utc": 1353007358,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9m4td",
            "created_utc": 1353008363,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1396zb/rantive_ruined_any_chance_at_an_education_or/",
            "gilded": 0,
            "id": "1396zb",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1396zb/rantive_ruined_any_chance_at_an_education_or/",
            "retrieved_on": 1413373502,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "Some background, I'm 24. I've been wanting to kill myself since I was 13 or so. I watched my mother die when I was 12. I type this out a lot in various places, but it helps. She died when I was 12, and my dad died when I was 20. Problems on top of problems.\n\nSince my dad died, money has been a constant struggle. I'm basically leaching off of family and relying on food stamps.\n\nI've had chances to go to college, and I've fucked up everyone my non attendance. I wrote letters to get financial aid back, but this time I think it's over. I think I'm suspended indefinitely. Without financial aid, there will be no college or career.\n\nI had a 3.5 in high school and did well enough to get a scholarship to college. The June before my freshmen year, my dad found out he had lung cancer. He started an aggressive chemotherapy routine that destroyed his body. I lived alone with him. I never gave a fuck about college from the minute I started. I was too far down the rabbit hole of depression about losing my one last parent.\n\nSince then, I've tried going. I'll go a couple weeks. Then one day I'll just wake up scared to go. I feel paralyzed. I feel like killing myself would be better than having to go in among people. Eventually I decided to stop putting myself through this torture and not go. Then the guilt sets in.\n\nIt's not just my education. I have horrible job experience dominated by \"no shows\" so I basically have no job experience or references at 24. The last job I had was at retail. I cried before work every morning because I hated it. I would cut myself and drink Jack Daniels before I went in. I'd park the car and open the bottle. \n\nOf course, suicidal feelings were rampant at this time. Also, homicidal feelings for the first time. I hated people, and I never had before.\n\nWhile all this is happening, I started having serious health issues. My doctor believes it's MS. I can't find out because I don't have insurance or money. In my head, I've convinced myself it's worse than MS and probably an inoperable tumor. \n\nAt this point, I can't do anything. I can't find a job that's not retail, and I can't do that. I applied for disability and was denied twice. I'm losing financial aid so no chance of helping myself. I don't know how to get help for my health.\n\nWhat's worse? I'm frozen. People tell me things to do, you know. Contact these people, see about this. I'm at the point where I'm scared to call or email people. I get panicked at the thought of it and begin hurting myself.\n\nSo I'm helpless. There's literally not a god damn fucking thing I can do at this point. I have a doctor who gives me Klonopin, but I can't even leave the house to go get it. I'm too scared.\n\nI'm pathetic and my life is meaningless.\n\nThanks for reading.\n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant]I've ruined any chance at an education or career because of this problem...",
            "url": "http://www.reddit.com/r/Anxiety/comments/1396zb/rantive_ruined_any_chance_at_an_education_or/",
            "user_reports": []
        },
        {
            "author": "ReceptorFatigue",
            "author_created_utc": 1327812489,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6s5bv",
            "created_utc": 1353262037,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13emc2/nba_prospect_royce_white_may_never_play_a_game/",
            "gilded": 0,
            "id": "13emc2",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13emc2/nba_prospect_royce_white_may_never_play_a_game/",
            "retrieved_on": 1413366407,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "[Royce White, who was drafted by the Houston Rockets in June, has yet to play an NBA game because of his severe fear of flying.](http://espn.go.com/nba/story/_/id/8640395/houston-rockets-royce-white-says-art-business-fault)\n\nI have a great amount of respect for him for being open and honest about his problem. I have gone through a similar situation (although clearly not on this scale) where I was honest with an employer about my panic attacks in certain situations. They still tried to force me to work in those situations even though it was irrelevant to my main job. I ended up losing my job over it, and I'm still unemployed.\n\n[Here is a great 8 minute documentary about Royce on draft day.](http://www.youtube.com/watch?v=BRUS6QBiViQ&amp;feature=colike) I appreciate that he is vocal about how much he is panicking, and he is not shy about letting the people around him know that he is in distress. I thought it was interesting that he has probably played college basketball in front of thousands of people, but he couldn't be in a room with about 30 supporters because it felt like \"a pack of wolves.\"\n\nI tried to explain to my employer about my panic attacks dealing with crowds of people, and they wanted me to give them an exact number of how many people there needed to be in order for me to feel an attack coming on. They could not appreciate that it was more complex than that, and I couldn't give them an exact number because of all the social factors involved.\n\nI hope that the publicity from this case will help people understand that severe anxiety is not a choice or a quirk, but a mental illness that needs to be dealt with properly in order for a person to function and concentrate on the things that they do well.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "NBA prospect Royce White may never play a game because of his anxiety disorder.",
            "url": "http://www.reddit.com/r/Anxiety/comments/13emc2/nba_prospect_royce_white_may_never_play_a_game/",
            "user_reports": []
        },
        {
            "author": "SuddenlyDepression",
            "author_created_utc": 1352760203,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9l2q9",
            "created_utc": 1353486241,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13k3ib/does_anyone_else_get_completely_messed_up_as_soon/",
            "gilded": 0,
            "id": "13k3ib",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13k3ib/does_anyone_else_get_completely_messed_up_as_soon/",
            "retrieved_on": 1413358990,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "I don't particularly know what anxiety is, all I know is that it runs in my mom's side of the family and that my psychologist has told me I have all the physical symptoms of it (I have a hard time expressing/describing emotions so we don't know about that).  So if this is a normal thing for someone with anxiety, please just let me know and I will feel better about it and if not I will bring it up in my next appointment.\n\nI realized soon after posting it in /r/depression that this probably has more to do with my anxiety than my depression (which is most likely caused by my anxiety, still figuring that part out). But it was 3 AM and I was too tired and stressed out to care without waiting to see if anyone responded. \n\nSo, back to the topic: For example, my Mondays are always the same. I wake up, go to my two morning lectures, and go with a couple friends to get lunch. Then I have a break to maybe take a nap or just surf the internet or do homework or prepare for a quiz or whatever for a couple hours before my next class, and then after that class it's dinner and back to my room.\n\nNow, if anyone tells me they're going to be coming over to do something (like study for an exam with me for example) and then they don't do it, it ruins my entire day. As soon as I realize that they're not showing up, I just can't go on. I lie down in my bed and either find a show to watch or sleep. I wont go to class and I can't do any work. I don't understand why this is. And unfortunately for me, it happens at least once a week. And it happened today *(Edit: now yesterday)*, which is what made me wonder if anyone else experiences this or if it's just me.\n\nAlso, I would like to add that I'm okay with things changing on a day to day or week to week basis. I don't need a routine to function (most of the time), but I do need my schedule. And if my schedule changes without warning, then that's when I get messed up and pretty much give up on the spot.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else get completely messed up as soon as a routine or schedule changes? (x-post from /r/depression) ",
            "url": "http://www.reddit.com/r/Anxiety/comments/13k3ib/does_anyone_else_get_completely_messed_up_as_soon/",
            "user_reports": []
        },
        {
            "author": "claptrapsminion",
            "author_created_utc": 1353021678,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9m7lf",
            "created_utc": 1353052919,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13age6/does_anyone_else_have_more_anxiety_around_people/",
            "gilded": 0,
            "id": "13age6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13age6/does_anyone_else_have_more_anxiety_around_people/",
            "retrieved_on": 1413371847,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I find that I am way more anxious around people I am slightly familiar with, than people I don't know at all. Unless I am very very close to someone, I have really bad anxiety talking to people.\n\nI work in a popular coffee shop and I have to talk to strangers pretty much all day every day. I find that over the years of working there I've become decent at small talk with random customers, \"hi how are you, hows your day\" etc, and this causes me very little anxiety. The problem I have is with regular customers. When someone becomes a regular at my store, when I see them over and over again, the more anxious I become. Dealing with these people who I see relatively often makes my heart race and causes me to become lightheaded and shaky. \n\nIt is the same with friends, unless they are someone I see all the time, then I get really anxious even seeing them, and that makes it hard for me to talk to them. Same with people who were close to me at some point, if I have become more distant, then the anxiety comes. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else have more anxiety around people they know than strangers?",
            "url": "http://www.reddit.com/r/Anxiety/comments/13age6/does_anyone_else_have_more_anxiety_around_people/",
            "user_reports": []
        },
        {
            "author": "Renownedx",
            "author_created_utc": 1332370394,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_78ch6",
            "created_utc": 1353207491,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13dr19/i_feel_so_disconnected_lately/",
            "gilded": 0,
            "id": "13dr19",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13dr19/i_feel_so_disconnected_lately/",
            "retrieved_on": 1413367555,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "So I've had anxiety and depression for nearly 4 years now, it got worse 2 years ago and I became confined to my house. I haven't left here alone for that entire time, everything I used to love doing, everything I even took an interest in is now becoming less of a thing for me. I have no aspirations in life anymore, I have nothing I want to achieve. I'm not even sure I want to try and get out of this place in my life anymore, there's nothing waiting for me at the end of all this. \n\nDoes anyone else feel like this? I honestly don't know how long I can continue like this, I have absolutely no IRL friends. I sit awake night after night alone. \nI'm sorry about the jumbled sentences, I'm not good at writing stuff like this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel so disconnected lately.",
            "url": "http://www.reddit.com/r/Anxiety/comments/13dr19/i_feel_so_disconnected_lately/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1353185683,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13d7oc/help_need_some_advice_from_other_waitresses_with/",
            "gilded": 0,
            "id": "13d7oc",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13d7oc/help_need_some_advice_from_other_waitresses_with/",
            "retrieved_on": 1413368240,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "So I've been really proud of myself being able to manage my anxiety fairly well lately.\nAbout 3 weeks ago, I got a job waitressing at a family-style Italian place.\nIts the kinda place you go to for a party, or an expensive meal. \nWellll, things went well for training, I passed all my tests, and got a 2 person section to start off with.\nThat was too easy, so they bumped me up to \"3\".\nWell there was a mix up, since my manager wasn't there that night, and I ended up with 6 tables all at once, and unfortunately, the one table I /thought/ I did really well with, and seemed extremely pleased, saying everything was perfect... left me no tip and a nasty note on my check that I had to turn into my manager at the end of the night. It said I was the worst waitress they had ever had in their life, and they usually tip 25%, but were leaving me 0. I didn't freak out. I wanted to, but I didn't, and things got better. My manager understood the circumstances.\n\nWell, last night, I had yet again, a 3 person section.\nAnd things started off very well.\nThen suddenly, we're slammed.\nI'm freaking out, STILL don't know how to do everything, no one will help me even for a second when I have a legitimate question that's stopping me from getting to other tables... but somehow, I pulled through. I had a panic attack and stopped it AS I was taking another order. I did almost, puke though.\nSo its the last table of the night, I think I'm in the clear, and then I mess up.\nThey pay with a giftcard and coupon, but I forget to swipe the coupon first. No biggie. I got back, delete the giftcard, add the coupon, aaaannndd... the card is declined. The funds cant be accessed again. \nI go to my manager, and he can't fix it.\nHe starts to get pissed.\nComputer is fucked up, \netc etc.\nWe got to apologize to our happy, full, smiling couple, offer them their meal on the house...\nAnd they sit my manager down, and seriously rip him a new one.\nSuddenly, their drinks were late, food was shitty, everything took forever, etc..\nSeriously.\nNever coming back.\n10x worse than my other bipolar table.\n\nHe was so furious... and for some reason, I wasn't anxious when he called me into his office to talk to me.\nI understand its not my managers job to deal with my anxiety and new-ness. I didn't even tell him I had this type of thing, because I didn't want him to think of me as a weak server. \nNot only that, but I've been through about 4 jobs in the last year or so, (due to moving, conflict of interest, random stuff) so I'm not new to getting let go, or leaving a job. \n\n/TLDR;/\nSo basically here's my problem:\nI've only recently developed anxiety. Its been about a year now.\nNone of this was a problem in the past for my serving jobs.\nNow it is. \nMy boss told me I have one last chance.. I'm at 3 weeks now, 3 tables should be nothing. I should be able to handle at least 5. :(\nIts not my first time serving, but I just know I can't. \nIts an overload of information, and I can't do it..\nThis thought of being fired has literally taken over my brain.\nLiterally consumed my thoughts.\nI woke up twice last night in a cold sweat, thinking I was at work, and not being able to fall back asleep,\nI went to a meeting at work at 9am, got no sleep really, and now have to work 5:30-close.. my first ever closing shift, on our busiest night.\nThe closer 5:30 comes, the more anxious I get.\nI want to throw up.\nI want to cry.\nI want this job SO bad, I don't want to fail.\nI make great money, I did awesome every single time I've worked the last few weeks, as far as tips, but obviously I need to work on my technique so I don't get any more complaints.\n\nI would love some advice from others who have anxiety, and deal with it on a daily basis at a serving job...\nTips? Tricks? Words of comfort?\n\nI don't know how to not get overloaded when I have 1 table waiting on me to take their order, 1 that still needs drinks when we have no clean cups, and 1 that need their check split and delivered asap.\nI just shut down and can't stop thinking about how mad my tables will be if I don't do this, or how they'll complain if their drink isn't out in 2 secs, or how I'll get no tip if I don't get them pepper RIGHT NOW...\n\nMy priorities get so messed up, I just don't know what to do, and then THIS happens... :(\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] Need some advice from other waitresses with anxiety! I don't' want to get fired tonight..",
            "url": "http://www.reddit.com/r/Anxiety/comments/13d7oc/help_need_some_advice_from_other_waitresses_with/",
            "user_reports": []
        },
        {
            "author": "isitallreal",
            "author_created_utc": 1353331601,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9ndf9",
            "created_utc": 1353332306,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13g6y5/is_it_anxiety_or_what/",
            "gilded": 0,
            "id": "13g6y5",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13g6y5/is_it_anxiety_or_what/",
            "retrieved_on": 1413364364,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "It all started around May, 2011.\n\nI was working at a movie theater, and I was standing there as a movie was letting out, standing in the hallway waiting for everyone to get out so our crew could go in and clean it. \n\nI was just standing there, and thinking to myself, nothing out the norm. But all of the sudden I just think this stupid random thought of, \"What if everything isn't real?\" \n\nThen boom. It hits me. Everything around me seemed foreign, and scary. My heart was racing, my mouth tasted metallic from the adrenaline that was pumping through me. It was really really scary. I went straight for the restroom to rinse my face, hoping that would help. After I walked out, I just felt like a ghost, and I was just going through the motions of just walking around a crowd of people. I don't know, it's really hard to explain. It just felt like I was living in a dream or something, if that makes sense?\n\nThat messed me up for awhile, I didn't want to do anything, because I'd have \"flashbacks' so to speak of that moment, where little spurts of \"nothing seems real\" happened hourly for about 6 months. \n\nPart of me knew that it was just chemicals in my head acting funny, or something. Or that maybe it was just all in my head. So I didn't really talk to anybody about it, cause I didn't want to seem crazy. \n\nAnyways, fastforward to now, and I still feel like those experiences stick with me. The only thing I can really point my finger to is anxiety. Because I have similar feelings of those experiences while I'm with new people, or in big crowds of people. \n\nSo is this anxiety? Or is this just something way different?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is it anxiety, or what?",
            "url": "http://www.reddit.com/r/Anxiety/comments/13g6y5/is_it_anxiety_or_what/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1353014053,
            "domain": "self.Anxiety",
            "edited": 1353022663,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/139dkn/today_i_went_and_saw_a_psychiatrist_for_the_first/",
            "gilded": 0,
            "id": "139dkn",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/139dkn/today_i_went_and_saw_a_psychiatrist_for_the_first/",
            "retrieved_on": 1413373261,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "I have started having panic attacks and pretty bad anxiety since may of this year. Before that I only knew what it was because of my family members who dealt with it. \n\nToday, after finally getting insurance again, I was able to go see a doctor. As soon as I walked in a started to panic. When I am at my worst I (for some reason) start to gag. Its embarrassing but I let it take its course and finally it subsided. \n\nWhen I finally got called to go to the back I was told I had to take a drug test. This made me panic a bit as well and my blood pressure was 200 over something. I don't even remember the other number. I smoke pot to relax at times. I guess I was worried about that but I smoke so little it didn't even show on the test. \n\nAfter talking with the doctor for about an hour it seemed she wanted to treat me for ADHD instead of anxiety. She gave me a few more klonopin for emergency situations. She also gave me something called propanol?  I haven't actually picked up the prescription yet so I'm not sure of the name. She did say it was a beta blocker. \n\nWhat do you guys think about beta blockers?\n\nLastly she wanted to find out more information about my families ADHD history. She said we would start focusing more on that in the future and possibly start medicating for ADHD instead of anxiety. Does that make any sense?  She told me anxiety was the most common disorder that is genetically passed from parents to kids. I have never heard that. She also said that ADHD can cause anxiety. \n\nWhat does the community think of this?\n\nedit:  I just picked up the drug.  It's called Propranolol.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Today i went and saw a psychiatrist for the first time.",
            "url": "http://www.reddit.com/r/Anxiety/comments/139dkn/today_i_went_and_saw_a_psychiatrist_for_the_first/",
            "user_reports": []
        },
        {
            "author": "Hobodancer",
            "author_created_utc": 1353203236,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9mwkl",
            "created_utc": 1353251186,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13eeia/can_you_worry_yourself_sick_need_help_being_normal/",
            "gilded": 0,
            "id": "13eeia",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13eeia/can_you_worry_yourself_sick_need_help_being_normal/",
            "retrieved_on": 1413366690,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I will try to keep this short but I have nobody to talk to. \nI got really sick last year with the flu. I was in bed for two weeks and I did not stop coughing for a month afterwards. It really messed up my body. \nLater on I noticed I could feel my heartbeat and it freaked me out. I think now it was all the coughing that made my ribs sore and made me feel my heartbeat. \nAnyway I was stressing on that when I found a lump and I started to think I had cancer. \nSo thinking I had cancer AND a heart problem I was super stressed. The lump was just a big pimple thing. It went away. \nThen I got this weird heat burning in the center of my chest. I was convinced it was the onset of a heart attack! Turns out it was just heartburn from all the stress I was under. I even went to the emergency room. They said it was nothing. \nNow months later I am having trouble breathing but I think it's because of all the acid in my stomach from stress.  I am on medication  for it but it takes a while to kick in. \n\nHow the hell to I break this cycle? \nI seem to go from on worry to the next!  Even when the doctor told me not to worry, stay off google and eat better. \n\nDoes anyone have any advice on how to stop making myself sick? I just can not seem to let go of me being sick in some way and constant worry about it. \nThanks\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Can you worry yourself sick? Need help being normal. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/13eeia/can_you_worry_yourself_sick_need_help_being_normal/",
            "user_reports": []
        },
        {
            "author": "KTcube",
            "author_created_utc": 1325556854,
            "author_flair_css_class": "",
            "author_flair_text": "nom nom",
            "author_fullname": "t2_6ki4a",
            "created_utc": 1353458112,
            "domain": "self.Anxiety",
            "edited": 1353465044,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13jfg6/some_thoughts_im_having_about_treating_anxiety/",
            "gilded": 0,
            "id": "13jfg6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13jfg6/some_thoughts_im_having_about_treating_anxiety/",
            "retrieved_on": 1413359863,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I think that people should treat mental illness like they treat other illnesses. If you started coughing up blood you would go to a doctor. If you had a brain tumor you would go to a doctor. If you have a condition that causes you to be unable to work normally, alters your heart rate, changes your eating habits, and makes you tired or insomniac then you should go to a doctor.\n\nFor a lot of people without anxiety or depression they think we can just \"snap out of it\". Do they also think that cancer patients should go into remission after 1 round of chemo? Do they think it's ok to stop taking your antibiotics as soon as the symptoms start going away, even though the box says to take all of them? (don't answer that...) Treatment for all diseases is time-consuming, and the disease symptoms and the disease itself take a while to go away.\n\n(edit: for people who would say that they are not technically \"diseases\" but \"disorders\", diabetes, hypothyroidism, and cerebral palsy are disorders too.)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Some thoughts I'm having about treating anxiety and depression, in relation to other diseases...",
            "url": "http://www.reddit.com/r/Anxiety/comments/13jfg6/some_thoughts_im_having_about_treating_anxiety/",
            "user_reports": []
        },
        {
            "author": "personalstuffz",
            "author_created_utc": 1326862203,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6oxpr",
            "created_utc": 1353339371,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13gc1r/how_do_people_not_have_anxiety_issues_fear_of/",
            "gilded": 0,
            "id": "13gc1r",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13gc1r/how_do_people_not_have_anxiety_issues_fear_of/",
            "retrieved_on": 1413364159,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Typical small talk at the office (which I'm already freaked out over) somehow led into a discussion about how one of my coworkers likes to go skydiving. I told him there's no way I'd do that and when asked why I jokingly (but not jokingly) said, \"I like to minimize my daily risk of dieing.\"\n\nHe then laughed and said, \"Well there's always that risk of a meteor hitting your house in your sleep.\" I think you could've seen the color wash from my face as I've only recently accepted the unexpected/impossible happening.\n\nHow do people NOT have to deal with this?! It makes me so mad, I just want to be normal.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do people NOT have anxiety issues? Fear of death? etc...",
            "url": "http://www.reddit.com/r/Anxiety/comments/13gc1r/how_do_people_not_have_anxiety_issues_fear_of/",
            "user_reports": []
        },
        {
            "author": "PaigeTurner216",
            "author_created_utc": 1321248629,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_68n0c",
            "created_utc": 1353133683,
            "domain": "new.livestream.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13cbo6/i_know_this_might_seem_a_little_dumb_but_when_im/",
            "gilded": 0,
            "id": "13cbo6",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13cbo6/i_know_this_might_seem_a_little_dumb_but_when_im/",
            "retrieved_on": 1413369394,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/zQAcxVSEfKipsv8V.jpg",
            "title": "I know this might seem a little dumb, but when I'm having a panic/anxiety attack kittens make me feel just a little better, even for a minute or two. [Relax]",
            "url": "http://new.livestream.com/accounts/398160/events/1594566/",
            "user_reports": []
        },
        {
            "author": "BasicBear",
            "author_created_utc": 1335015523,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7io4k",
            "created_utc": 1353096261,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13bcwq/facts_you_have_learnt_that_reduce_your_anxiety/",
            "gilded": 0,
            "id": "13bcwq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13bcwq/facts_you_have_learnt_that_reduce_your_anxiety/",
            "retrieved_on": 1413370640,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "Information about general life that actually explains away some of the anxiety you've been having in your day to day life. I thought by sharing stuff maybe we can help reduce each other's anxiety.\n\nI used to think there was something wrong with my eyes/brain because my vision in the dark appeared grainy or like tv static.\n\n* Turns out everyone's vision is like that, its due to the number and types of photo-receptors you have in your eyes. \n\nSudden stabbing pain in your chest when breathing in.\n\n* Costochondritis is a common condition that can affect young adults that is benign. Obviously all sudden chest pain should be taken seriously, however I found this helpful to know. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Facts you have learnt that reduce your anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/13bcwq/facts_you_have_learnt_that_reduce_your_anxiety/",
            "user_reports": []
        },
        {
            "author": "Chisel_me_timbers",
            "author_created_utc": 1348446245,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_93qsg",
            "created_utc": 1353109840,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13bre1/social_anxiety_agoraphobia/",
            "gilded": 0,
            "id": "13bre1",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13bre1/social_anxiety_agoraphobia/",
            "retrieved_on": 1413370116,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/KA1-CPUP5RseL0nH.jpg",
            "title": "Social Anxiety / Agoraphobia",
            "url": "http://i.imgur.com/rEI9c.jpg",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1353139706,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13cevp/anxiety_what_are_some_songs_or_song_lyrics_that/",
            "gilded": 0,
            "id": "13cevp",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13cevp/anxiety_what_are_some_songs_or_song_lyrics_that/",
            "retrieved_on": 1413369275,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "For me the lyric in This Is Your Life by The Killers 'The sky is full of dreams, but you don't know how to fly' really gets to me. I have so many dreams and aspirations with what I want to achieve in life but my anxiety is stopping me.\n\nAlso the song Change by Blind Melon.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety, what are some songs or song lyrics that really resonate with your experience in dealing with anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/13cevp/anxiety_what_are_some_songs_or_song_lyrics_that/",
            "user_reports": []
        },
        {
            "author": "smoky_berserk_rat",
            "author_created_utc": 1338176413,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7tt1g",
            "created_utc": 1353421387,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13icj6/got_what_i_wanted_now_i_feel_like_i_shouldnt_have/",
            "gilded": 0,
            "id": "13icj6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13icj6/got_what_i_wanted_now_i_feel_like_i_shouldnt_have/",
            "retrieved_on": 1413361359,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "I can't stop thinking about a minor incident at work with my supervisor.  Basically she is violating the manager's policy on splitting tips evenly- I haven't said anything before but the other night I tried to claim a share.  She stopped me, but then backtracked and said I could have a share \"if you want.\"  It wasn't much, so I threw the money back down and said, \"Whatever,\" in my \"dangerous\" voice.  As I was leaving, another co-worker ran out and handed me some money.  I feel like I was taking advantage of the situation- I'm older than the supervisor, male, much bigger, etc. I've been told that I'm extremely intimidating (and my hobbies and work in the past only add to this- I'm a military veteran and have studied martial arts).  I know that I was entitled to a fair share but I feel like I failed by intimidating my way into what I wanted, and now I can't stop thinking about it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Got what I wanted, now I feel like I shouldn't have tried... ",
            "url": "http://www.reddit.com/r/Anxiety/comments/13icj6/got_what_i_wanted_now_i_feel_like_i_shouldnt_have/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1353518658,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13koot/zoloft_to_wellbutrinim_nervous/",
            "gilded": 0,
            "id": "13koot",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13koot/zoloft_to_wellbutrinim_nervous/",
            "retrieved_on": 1413358185,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "I'm about to start tapering off of Zoloft and starting on Wellbutrin.  I'm a little nervous but excited.  My main reasons were that I'm feeling very apathetic on Zoloft.  Also, the weight gain and loss of libido is becoming taxing.  Wish me luck!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Zoloft to Wellbutrin...I'm nervous",
            "url": "http://www.reddit.com/r/Anxiety/comments/13koot/zoloft_to_wellbutrinim_nervous/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1353458005,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13jfbz/im_a_huge_introvert_and_im_currently_on_my_way_to/",
            "gilded": 0,
            "id": "13jfbz",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13jfbz/im_a_huge_introvert_and_im_currently_on_my_way_to/",
            "retrieved_on": 1413359866,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "The title the explains it all. I'm currently on way to a concert with a friend and i'm totally freaking out. I'm an introvert and my friend said there will be people pushing other people, screaming, etc. I'm a small girl, and I won't know anybody there, and I don't even listen to the band. I'm just going because, hey, free concert, right? Ugh. I'm so nervous! What do i do?!?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm a HUGE introvert and i'm currently on my way to a concert and i'm reallly nervous.",
            "url": "http://www.reddit.com/r/Anxiety/comments/13jfbz/im_a_huge_introvert_and_im_currently_on_my_way_to/",
            "user_reports": []
        },
        {
            "author": "angrylynchmob",
            "author_created_utc": 1349403906,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_97o55",
            "created_utc": 1353342229,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13geot/feeling_numb_got_into_huge_fight_with_boyfriend/",
            "gilded": 0,
            "id": "13geot",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13geot/feeling_numb_got_into_huge_fight_with_boyfriend/",
            "retrieved_on": 1413364055,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "This whole thing started because I told him I was upset that he didn't even acknowledge the day, I didn't expect any gifts because we're tight on money right now, but he didn't kiss me good morning, or tell me he loved me, nothing. He said he did acknowledge it when I asked if he was making dinner and he asked what I wanted, which in my mind isn't really acknowledging it at all. Yadda yadda we start to argue about theh same thing we are always arguing about, him not showing appreciation, acting like he cares about me, I take everything he says too seriously, I have asked him many, many, many times to even just take one minute out of his day to text me telling me he loves me, or to ask me how my day is going and I think he's done it twice in the last month. I asked him what was going on with him and why he doesn't do it. I asked him if it was because he really didn't care at all. I asked him outright if he loved me and he said he did and I asked him if he was still attracted to me and he paused and just looked at me and said \"Not really\". It's been almost two years since I had our child and I have lost a good chunk of the baby weight but my form isn't where it used to be. I understand I should be working out for my own benefit but like I told him, \"I lam attracted to you no matter what you look like.\" I don't care that he's going bald, I don't care that he's not as in shape as when we first started dating, I always find him sexy, and I always want to have sex, which he doesn't. Now before yesterday I was feeling pretty good about my body having just lost 15 lbs, but now I just feel embarrassed, and fat, and disgusting. I want to work out, I want to be in shape like I used to be, but the thought of working out is embarrassing. I don't want him to see me doing it, I don't want him to see me naked. I just feel so hurt. I feel numb, I don't want to do anything. The thought of him leaving because I'm not good enough makes me sick. The thought of him actually being that shallow makes me sick. The thought of him cheating on me makes me sick. So now I'm sitting here at work thinking of all of this over, and over, and over, and trying not to cry, trying to just push it all down somewhere where I can't feel it where I can just be numb and not have to worry anymore. I apologize for the wall of text. \n\nTL;DR Boyfriend doesn't find me as attractive as he used to; making me feel sick and crying a lot. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feeling numb. Got into huge fight with boyfriend on our anniversary. Don't know what to do. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/13geot/feeling_numb_got_into_huge_fight_with_boyfriend/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1353386951,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/13hs04/sorry_to_bother_yall/",
            "gilded": 0,
            "id": "13hs04",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/13hs04/sorry_to_bother_yall/",
            "retrieved_on": 1413362154,
            "score": 12,
            "secure_media_embed": {},
            "selftext": "I recently became a mod of /r/problems[1] and r/stigma and I want to help people going through the same things that I am. As me dealing with depression and anxiety my whole life I can offer assistants to others with the same problems and various different problems and maybe we can learn something from each other. Please just give me a chance to help, its all I ask. Thanks for your time. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Sorry to bother y'all.....",
            "url": "http://www.reddit.com/r/Anxiety/comments/13hs04/sorry_to_bother_yall/",
            "user_reports": []
        }
    ]
}