{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351093201,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/120d6k/i_pwned_a_panic_attack/",
            "gilded": 0,
            "id": "120d6k",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/120d6k/i_pwned_a_panic_attack/",
            "retrieved_on": 1413465851,
            "score": 237,
            "secure_media_embed": {},
            "selftext": "I started having a panic attack yesterday but I managed to breathe and meditate through it! I did end up crying because my eyes automatically started tearing but other than that I was completely fine with in the span of a few minutes.\n\nFTW!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I pwned a panic attack!",
            "url": "http://www.reddit.com/r/Anxiety/comments/120d6k/i_pwned_a_panic_attack/",
            "user_reports": []
        },
        {
            "author": "migrations_",
            "author_created_utc": 1334811896,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7hvwd",
            "created_utc": 1350984990,
            "domain": "quickmeme.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11xsq0/this_is_me_tonight_laughing_at_it_helps_me_calm/",
            "gilded": 0,
            "id": "11xsq0",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11xsq0/this_is_me_tonight_laughing_at_it_helps_me_calm/",
            "retrieved_on": 1413469403,
            "score": 154,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/hDw5L08vjXD-EMe0.jpg",
            "title": "This is me tonight. Laughing at it helps me calm down a bit.",
            "url": "http://www.quickmeme.com/meme/3rgtt0/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351013466,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11yfd5/i_just_got_back_from_seeing_the_worst/",
            "gilded": 0,
            "id": "11yfd5",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 67,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11yfd5/i_just_got_back_from_seeing_the_worst/",
            "retrieved_on": 1413468526,
            "score": 98,
            "secure_media_embed": {},
            "selftext": "I'm still in shock over this, Reddit. I've been to a lot of doctors, for both physical and mental health, but I've never met a doctor who was this deliberately cold and just... unfeeling. \n\nShe had no bedside manner. I started the session off with complaints about my anxiety and depression, chiefly. This made her sigh. I couldn't remember all of the medications I've tried, which frustrated her. It's difficult for me to make and maintain eye contact, and I know this, so I apologized up front about it. She responded with, \"if I'm going to work with you, I demand eye contact. I won't work with you otherwise.\" Painfully, I tried to make eye contact, to no avail. I could tell this made her angry, because right after this, she looked me up and down and very bluntly said, \"so is it a portion control problem, or what?\" I couldn't believe my ears. I've been trying to lose weight - it's something I've battled with my entire life - and I just couldn't believe that someone.. a PSYCHIATRIST.. would say something like that. She then said, \"if I am going to work with you (again with that line!), you're going to HAVE to lose weight.\" and then spent 5 minutes (out of the entire FIFTEEN MINUTE session) discussing how she planned to have me lose weight.\n\nShe asked me what I did all day. I told her that mostly I laid in bed because I was too depressed to do anything else, that I read, etc. She said, straight up, \"this is not acceptable. All of my patients have jobs. You need to get one.\"\n\nReddit, I am freaking out. I have never been treated this way by someone who declares themselves to be a \"professional\" before. I paid $175 for a first session that lasted for 15 minutes. I spent money to be belittled and made ashamed of myself, my mental state, and my body, for 15 minutes. I feel attacked. I feel like I'm in middle school, and the popular kids are picking on me again. I had a panic attack when I left the office. \n\nI'm going to give everyone a reminder to Google your healthcare providers before you go out and spend actual money on services that may or may not be rendered. The one time I don't research someone, it blows up in my face. Lesson learned.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I just got back from seeing the worst psychiatrist I've ever met in my life.. no.. scratch that.. one of the worst *people* I've ever met.",
            "url": "http://www.reddit.com/r/Anxiety/comments/11yfd5/i_just_got_back_from_seeing_the_worst/",
            "user_reports": []
        },
        {
            "author": "Octowolf",
            "author_created_utc": 1330208258,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_70nux",
            "created_utc": 1351439660,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1280c6/anyone_else_just_want_to_feel_normal/",
            "gilded": 0,
            "id": "1280c6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1280c6/anyone_else_just_want_to_feel_normal/",
            "retrieved_on": 1413455371,
            "score": 98,
            "secure_media_embed": {},
            "selftext": "I just want to enjoy life without fear holding me back. I want to be able to go out and do things. I just want to live. Some days are easier than others... ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else just want to feel normal?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1280c6/anyone_else_just_want_to_feel_normal/",
            "user_reports": []
        },
        {
            "author": "panicmonkey",
            "author_created_utc": 1317661190,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5z1rk",
            "created_utc": 1351272120,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/124scq/a_recent_agoraphobia_thread_has_shown_me_theres_a/",
            "gilded": 0,
            "id": "124scq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/124scq/a_recent_agoraphobia_thread_has_shown_me_theres_a/",
            "retrieved_on": 1413459778,
            "score": 73,
            "secure_media_embed": {},
            "selftext": "Before I start, please read http://www.reddit.com/r/Anxiety/comments/123uma/i_havent_left_the_house_in_four_years_im_19/ and give the person some support.  They really need it.  My post is all about information.  That person could use some support first.\n\n5.5 years housebound.  7.5 years with agoraphobia.  Wait, what?  That's one of the more puzzling things about agoraphobia.  You don't have to be housebound to have it.  Below are some other bits of information that might help people understand what it all means.\n\nFrom the DSM-IV:\nhttp://www.medicalcriteria.com/site/index.php?option=com_content&amp;view=article&amp;id=47%3Apsyagoraphobia&amp;catid=76%3Apsychiatry&amp;Itemid=80&amp;lang=en\n\n1.  Agoraphobia isn't \"fear of open places\", as is often believed.  Agoraphobia is about avoidance of places and situations.  And like potato chips, if you start avoiding one place or situation, you can't just have one, it usually spreads to other places or situations.\n\n2.  Agoraphobics aren't always housebound.  Much of the time they are.  Before I became housebound, I was agoraphobic.  I only had to take one street to get to work, and I was unable to leave that street.  My commute was a few miles.  I avoided going anywhere off of that street.  Thats agoraphobia without being housebound.\n\n3.  Many agoraphobics have a \"comfort radius\".  I can drive or walk about a half mile from home.  On good days, when the meds are working fine and I'm feeling adventurous, I'll go outside that zone.\n\n4.  Not all agoraphobics have panic disorder.  There is a distinct diagnosis in the DSM-IV for agoraphobics without panic disorder.\n\n5.  Sometimes other conditions are mistaken to be agoraphobia.  Social phobia is one - it has its own diagnostic criteria.  The results are the same, withdrawing from society and becoming more isolated, but using my story about my commute to work, I could have gotten off that one street if it was social phobia most likely.\n\n6.  Probably the most important thing about being agoraphobic is that agoraphobic patients wind up not fearing the thing that made them agoraphobic.  They fear the resulting panic attack.  For instance, I fear driving far from home.  Not because I'm afraid of driving.  In fact, I enjoy driving very much.  I fear the panic attacks that result from driving.  This is the case with most people with the disorder.\n\n7.  People with agoraphobia are liars.  This is extremely difficult, at least for me, because I don't want to be.  I'm an honest person by nature, but making excuses for not going and doing things has made me a liar.  In more recent years, I've decided to just tell people what I have.  It makes me feel better to maintain my integrity.  But the point still stands.  We make excuses better than most anyone you know.  And can generally manipulate any person or situation to gain equilibrium.\n\n8.  Agoraphobia is extremely isolating.  That isolation leads to rumination, which leads to exacerbation of the symptoms, and in many cases, severe depression.  It's hard to be alone for so much o the day.  And it's humiliating to ask someone to do something for you that you should be able to do yourself.  It may sound like a lot of fun to be able to stay home and work, mess around, watch TV or whatever.  But the truth is, most of us are spending a lot of time thinking about what our lives have become and how we can make it better.  And that takes the fun out of lots of stuff.\n\nIf there's anything I missed, please add it in the comments.  I hope I've shed some light on agoraphobia and someone may find it useful.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A recent agoraphobia thread has shown me there's a lot of mystery and misconceptions regarding agoraphobia.  Instead of hijacking that poster's thread, here's a description of what agoraphobia is, from someone housebound for 5.5 years.",
            "url": "http://www.reddit.com/r/Anxiety/comments/124scq/a_recent_agoraphobia_thread_has_shown_me_theres_a/",
            "user_reports": []
        },
        {
            "author": "pigs_have_flown",
            "author_created_utc": 1334888622,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7i7jt",
            "created_utc": 1351171063,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/122b5y/does_anyone_else_start_crying_for_seemingly_no/",
            "gilded": 0,
            "id": "122b5y",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/122b5y/does_anyone_else_start_crying_for_seemingly_no/",
            "retrieved_on": 1413463186,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "This is extremely frustrating for me as for the most part I can shorten my attacks to a couple minutes, but usually I end of crying for several minutes after that. Does this happen to anyone else?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else start crying for seemingly no reason during a panic attack?",
            "url": "http://www.reddit.com/r/Anxiety/comments/122b5y/does_anyone_else_start_crying_for_seemingly_no/",
            "user_reports": []
        },
        {
            "author": "throw-away9090",
            "author_created_utc": 1351222541,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9exxh",
            "created_utc": 1351223041,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/123uma/i_havent_left_the_house_in_four_years_im_19/",
            "gilded": 0,
            "id": "123uma",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 51,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/123uma/i_havent_left_the_house_in_four_years_im_19/",
            "retrieved_on": 1413461088,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "Title sums it up. I left school when I was 16, after finishing my exams, I came home and I haven't left the house since. I don't really know what to do, anything anyone has to say I would be appreciative.\n(First ever post on Reddit, throwaway)   \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I haven't left the house in four years, I'm 19. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/123uma/i_havent_left_the_house_in_four_years_im_19/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351361218,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/126jge/heres_some_of_my_thoughts_on_how_to_deal_with/",
            "gilded": 0,
            "id": "126jge",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/126jge/heres_some_of_my_thoughts_on_how_to_deal_with/",
            "retrieved_on": 1413457402,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "*Quick back story:* \n\nI'm a 28 year-old guy and I started feeling really bad anxiety symptoms about 2 years ago. I would describe myself as queitly confident and the anxiety just hit me out of the blue and was probably due to a particular period in my life about 4 years ago where 4 people I knew/were related to, died all within a 6 month span. I had also moved cities, went back to university, and was about to embark on a new career path.\n\n*One thing I've learned:*\n\n**Anxiety is horrible.** \n\nAbsolutely horrible. And until you've experienced it, it's very hard to relate to someone with it. It eats away at your confidence and drains the colour from your life. For me, at its worst, every day became an exhausting battle just to be able to do very seemingly normal things.\n\nI think the crux of it (for me, at least) is that I'm constantly worried that my body will do something and embarrass me. On the one hand I can see that this is a totally irrational fear but on the other, the fear is incredibly strong.\n\nIt's like anxiety likes to try and latch on to anything it can to induce the fear response and the ocd thoughts.\n\nI'm gonna write out some of what I've went through (and am still going through). It's crazy and sometimes very laughable (and embarassing!) but here it is:\n\n* fear of wetting myself\n* fear that I'll get an erection\n* fear that I'll ejaculate\n* fear that I'll faint\n* fear that my hands will noticibly shake\n\nThe fear of getting an erection is a very laughable one. But c'est la vie, it is what it is!\n\nPersonally this manifests in the desire to constantly check myself, especially when I'm wearing shorts in the gym.\n\n\"Am I getting an erection?\"\n\n\"Is my penis sticking out?\"\n\n\"Do I have a wet patch on the front of my shorts?\"\n\n\nPeople might be able to relate that these thoughts/feelings get worse when I'm in situations where I'm percieved to be trapped, i.e., driving with other people in the car, when I'm taking my coaching class, when I'm in class, when I'm sitting in lectures.\n\nHere are some of my thoughts:\n\n\"What if I wet myself right in front of these people?\"\n\n\"What if I get an erection? Does this mean that I'm a pervert? Is that a twinge a feel? Oh, god, am I getting hard? Jesus, what the fuck is wrong with me?\"\n\nAll of these situations that I fear have happened exactly ZERO times in my life. They have occured many, many times in my head, but ZERO times in real life.\n\nAnd that is why anxiety is a deeply irrational thing! But irrational or not, the fear response remains the same.\n\n**So, how do I deal with it?**\n\n* The very first thing is acceptance. Accept your body and accept your thoughts but - and this is extremely important - don't identify with them. Watch them almost like some sort of scientific experiment. Watch and accept.\n* Make peace with the worst-case scenario in your head (this is obviously a very individual thing). Be ok with that worst case scenario:\n\n\"Ok, so tomorrow I'm gonna be giving some people a lift and I'm going to wet myself. Embarrassing? Yes, definitely. But the world'll keep on spinning, the sun will set, and tomorrow'll be a new day.\"\n\nWhen I consider that I'm on a floating rock surrounded by other members of my species and none of us know what the hell is going on, the insignificance of such an incident is mind-bogglingly small.\n\nNow this is the difficult and scary step:\n\n* Do everything you can to expose yourself to the fear. Really, really try to NEVER aviod a situation purely on grounds of anxitey and irrational fears. Everytime you do, you validate the fear and it grows a little stronger.\n* YOU ARE A WARRIOR! When things are going crazy inside your body simply sit and breath. Do nothing else but feel the feelings, accept them, let them go, and breath. Do not try to aviod them and totally avoid any little safety-ticks that you have.\n* Anxiety is a tricky little devil. It'll throw in a new bodily sensations to try and make you think that this time it's real! This time you're really gonna wet yourself! But be steadfast; do not be the first to blink! Anxiety is ultimately the wizard behind the curtain. Expose it for what it is.\n\nFor me, I want to so much look down and see if I've wet myself or if my penis is sticking out. But everytime I do, I validate it, and everytime I don't I weaken its grip on me.\n\nAnd this is scary, believe me. Fear is fear, regardless of irrationality or not.\n\n**In conclusion:**\n\nAnxiety is perfectly normal. Trying to get rid of it is a goal that is rooted in failure because you won't. Ever. \n\nWhat we *can* do is reduce it back to a normal level because, for some reason or another, our anxiety dials have been stuck on high. For some, medication is a great way to get a handle on it, for others, it may be some sort of therapy. Our amygdala 'dial' may even revert back to a more normal level simply through time.\n\nOur problem - and the reason we're different from other seemingly 'normal' people - is that we've become hypersensitive to our bodily sensations. Someone without an anxiety disorder has similar feelings but mostly they don't consciously register with them in the same way that they register with us.\n\nRelax: the sensations are normal. Our body is a magnificent machine that takes care of an insane amount of tasks each and every second that we're alive. Try not to get too hung up or worried about a few twinges/tingles. Our body takes care of itself. You, by and large, are just a passenger.\n\n(I didn't mean to write so much but I thought it might help someone because even writing and reading it back has helped me!)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Here's some of my thoughts on how to deal with anxiety. They may or may not help you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/126jge/heres_some_of_my_thoughts_on_how_to_deal_with/",
            "user_reports": []
        },
        {
            "author": "Hanana_Hammock",
            "author_created_utc": 1333972844,
            "author_flair_css_class": "",
            "author_flair_text": "<3",
            "author_fullname": "t2_7eh4b",
            "created_utc": 1350921600,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11wf0u/sometimes_i_just_need_a_hug/",
            "gilded": 0,
            "id": "11wf0u",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11wf0u/sometimes_i_just_need_a_hug/",
            "retrieved_on": 1413471547,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "But it's never there, so I continue in my path of anxiety, alone-ness and push the tears back once again. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sometimes I just need a hug...",
            "url": "http://www.reddit.com/r/Anxiety/comments/11wf0u/sometimes_i_just_need_a_hug/",
            "user_reports": []
        },
        {
            "author": "thedeuz",
            "author_created_utc": 1348084059,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9282a",
            "created_utc": 1351001511,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11y2vi/sometimes_help_lies_in_science_fiction/",
            "gilded": 0,
            "id": "11y2vi",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11y2vi/sometimes_help_lies_in_science_fiction/",
            "retrieved_on": 1413469010,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/4OnjtMDZ3-83SijL.jpg",
            "title": "Sometimes help lies in Science Fiction ",
            "url": "http://i.imgur.com/djBym.jpg",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351044324,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11zen2/what_the_eff_is_going_to_take_to_get_people_to/",
            "gilded": 0,
            "id": "11zen2",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11zen2/what_the_eff_is_going_to_take_to_get_people_to/",
            "retrieved_on": 1413467192,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "Like, I don't know what to say to people. \n\n\"You are just being lazy.\"\n\nWell ok, when I go outside and look at the car and want to get in, but I can't and I'm afraid that I'm going to get into a crash, and the size of the car makes me panic because it's small and I suddenly get claustrophobic and the thought of it sends me into a panic. Ok, I'm faking it. \n\nAnd when I can't eat half the time because my anxiety is so high, my throat feels like it's gonna shut off and I just can't handle it so I don't eat or do anything concerning hygiene for a week and then I feel a little better and it just cycles.\n\nAnd god forbid not having a job, mom and dad and family. God forbid that I enjoy sitting here every day wishing my life wasn't wasting away and that I'm 31 now and can't even get out to go do something enjoyable without immediately coming home and being exhausted from even being near people. \n\nJesus I can't handle it, how do people not know how this feels? This really is a \"walk a mile\" type thing. And you can't make people understand, you really can't. How do you make someone understand that you are physically and mentally incapable of doing things? And where's the compassion? \n\nCurrently I'm living with a friend, because I was behind so far on bills, I finally just got a paying job and I had to sell my house and I'm basically living with roaches and fleas and nasty crap because my \"friend\" doesn't give 2 dits about the condition of his house and I'm left cleaning up all the messes (mention I'm a tad OCD too?) and I'm grateful that thank god I have a place to stay, and I'd do anything to help his mom, who's 70+ and can't do it herself but jesus.\n\nWhat the hell is it going to take? I can't stay with my parents, my grandmother refuses to acknowledge this is a condition or illness at all. \n\nAnyways I'm done ranting. I'm sorry.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What the eff is going to take to get people to understand this condition?",
            "url": "http://www.reddit.com/r/Anxiety/comments/11zen2/what_the_eff_is_going_to_take_to_get_people_to/",
            "user_reports": []
        },
        {
            "author": "righteo",
            "author_created_utc": 1288032752,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4gltt",
            "created_utc": 1351035010,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11z44k/relaxing_i_dont_really_care_if_anyone_reads_this/",
            "gilded": 0,
            "id": "11z44k",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11z44k/relaxing_i_dont_really_care_if_anyone_reads_this/",
            "retrieved_on": 1413467580,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "For the past 3 days I've been having horrible panic attacks. They've left me completely on edge and exhausted all day long every day.\n\nToday, I decided to educate myself and read a lot about anxiety and other people's experiences. Sometimes that's hard for me to do because thinking/reading about anxiety often GIVES me anxiety. I constantly find myself unable to convince myself that nothing is wrong with me, I'm constantly paranoid that something bad is happening/going to happen, that I'm going to die or something is wrong in one way or another. I did a lot of research on fight or flight response and how/when my triggers take effect. I get anxiety while driving, I get anxiety when I'm hungover, I get anxiety when I'm tired or didn't get enough sleep, I get anxiety when someone texts me a paragraph text while I'm driving and I can't read it or respond. I get anxiety when I can't type a text fast enough. I get anxiety when I write in my journal for a long period of time. I get anxiety that I'm going to get anxious around people and people will see me act crazy. I get anxiety when I think about my friends. I get anxiety when I think about my exbest friend and my exboyfriend. I get anxiety when I'm working and I'm scared that I'll get dizzy and crash into someone. I've done a lot of research and I thought I had social anxiety, driving anxiety, I thought I was a hypochondriac, I thought I had claustrophobia, I always think if I've drank the night before that I'm having alcohol withdrawals or I'm super unhealthy, that my ADHD medication is the reason for anxiousness (even though it's never ever been a problem in my 10 years of being on it)... but because I've thought ALL of those things and I relate to each and every single one of those and I know it's unlikely it's ALL of them, I've discovered that it might just be more specific than that. I've narrowed it down and think that I've discovered that what I have is [anticipatory anxiety](http://panicdisorder.about.com/od/symptoms/a/anticianxiety.htm). This means that all of those thoughts/symptoms that I have that fall under each of those categories are all just me anticipating/worrying the worst in each situation. I anticipate and worry in ALL of them.\n\nFor the first time I don't feel as crazy. I've read so many of your guy's posts and responses and can relate to ALL of you. For me, this whole anxiety/panic attack thing for the last year and 6 months has left me feeling so alone and different from anyone. I always thought no one understood me and therefore I felt completely lost. For once, I feel like I'm not lost. I feel more confident that I'm going to be okay. That if I have a panic attack, it's going to be okay.\n\nReading about the \"[Fight or Flight Response](http://www.thebodysoulconnection.com/EducationCenter/fight.html)\" really helped me put my anxiety and my constant \"worrying\" into perspective. I encourage you all read this from time to time, and THINK hard about it and let it be comforting to you that your body is doing this to try to protect you, not hurt you. Try to make yourself believe that worrying about your body doing this to you is what's making your body do that to you. You should accept that your body does this because it's an amazing, complex and beautiful thing. You're body knows how to save itself when you let your mind play a trick on it. You're not crazy. You just have a hard time sometimes. I'm not crazy. I just struggle with my thoughts. I feel for you all, you're not alone. \n\nI'm deciding right now that I'm going to pick myself up. I'm going to do things for myself that make me feel good and not worry when I'm doing them. I'm going to shower every morning and get ready/do my makeup, straighten or curl my hair EVEN if I'm not going anywhere and don't have anything to do. I'm going to make my bed after I get up, I'm going to give myself manicures and pedicures when I'm bored.. I'm going to floss more, I'm going to hang up my paintings in my room, I'm going to wear lipgloss and not feel like I'm \"wasting\" it because no one is seeing me with it on. I'm going to do all these things.. and it's going to feel nice.\n\nAnxiety sucks balls... but I feel good today. :D\nThank you for reading if you did. I just really wanted to put this out there.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] I don't really care if anyone reads this, but I feel really good right now and I want to share it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/11z44k/relaxing_i_dont_really_care_if_anyone_reads_this/",
            "user_reports": []
        },
        {
            "author": "Shmergen",
            "author_created_utc": 1346539007,
            "author_flair_css_class": "",
            "author_flair_text": "Panic Disorder/GAD",
            "author_fullname": "t2_8vcch",
            "created_utc": 1351255490,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/124cv3/what_are_good_jobs_for_high_anxiety_people/",
            "gilded": 0,
            "id": "124cv3",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/124cv3/what_are_good_jobs_for_high_anxiety_people/",
            "retrieved_on": 1413460357,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What are good jobs for high anxiety people?",
            "url": "http://www.reddit.com/r/Anxiety/comments/124cv3/what_are_good_jobs_for_high_anxiety_people/",
            "user_reports": []
        },
        {
            "author": "YourFaceHere",
            "author_created_utc": 1307149333,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5btii",
            "created_utc": 1351217508,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/123p4l/thinking_about_getting_a_pet_has_anyone_with/",
            "gilded": 0,
            "id": "123p4l",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 51,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/123p4l/thinking_about_getting_a_pet_has_anyone_with/",
            "retrieved_on": 1413461304,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "Basically I'm anxious at the thought of being personally responsible for the care and well-being of another life. Yeah, I guess I could take baby steps and start with a fish or something, but has anyone gotten like a puppy or anything to have a companion? I guess I just get really anxious and even a bit annoyed at the thought of having to take it out for walks all the time, feeding it, and the more I think about it, it would be more of a burden to my work life than a blessing. \n\nMaybe I'm overthinking it and the rewards really outweigh the maintenance, but some perspective would be nice. Thanks for listening.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thinking about getting a pet. Has anyone with anxiety done this? Did it help improve things for you, or increase anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/123p4l/thinking_about_getting_a_pet_has_anyone_with/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351363501,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/126lku/went_to_give_blood_for_the_red_cross_but_got_so/",
            "gilded": 0,
            "id": "126lku",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/126lku/went_to_give_blood_for_the_red_cross_but_got_so/",
            "retrieved_on": 1413457325,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I was really embarrassed, as I was the only one there that was deferred from giving blood that day. Anybody have a similar experience or advice on how to calm the hell down so I can help people in need? \n\nI'm not really scared of needles, I just get fairly intense anxiety whenever I'm in a hospital setting (getting blood pressure/pulse taken and stuff life that) I don't really know why, but it's starting to really get in the way of what I want to do.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Went to give blood for the Red Cross, but got so anxious that my pulse was too high to donate.",
            "url": "http://www.reddit.com/r/Anxiety/comments/126lku/went_to_give_blood_for_the_red_cross_but_got_so/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1351385088,
            "domain": "self.Anxiety",
            "edited": 1351441743,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1274up/had_alcohol_for_the_first_time_last_night/",
            "gilded": 0,
            "id": "1274up",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1274up/had_alcohol_for_the_first_time_last_night/",
            "retrieved_on": 1413456582,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "It was awesome, I didn't want to but then I realized I might as well try it once. I had a beer and 5-6 shots of rum and vodka. I loosened up and talked, usually I'm crazy unsocial but it made me feel great. I went to a frat party and asked girls to dance. It was awesome and tonight will be even better. \n\nJust had to share the awesomeness I experienced last night and how my anxiety was GONE and was also gone for at least 12-15 hours after I sobered up.\n\nUPDATE: Well, I liked all the comments, for reference I'm 17 and this won't be a regular thing. I was visting my brother at college and went to some parties so I drank. This isn't a weekly thing. The only thing that worried me was when I woke up this morning (Headache like crazy and still slightly drunk) I wanted more. I wanted to keep partying and having fun because It was the best time of my life. I wouldn't mind talking to someone about my experience, I'm still tipsy writing this btw. Honestly I just want to go talk to girls, my confidence is through the roof and I plan on talking to some girls tomorrow at school.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Had alcohol for the first time last night...",
            "url": "http://www.reddit.com/r/Anxiety/comments/1274up/had_alcohol_for_the_first_time_last_night/",
            "user_reports": []
        },
        {
            "author": "heyitsunshine",
            "author_created_utc": 1327346314,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6qhqy",
            "created_utc": 1350923913,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11whmx/i_hate_my_anxiety_and_i_feel_ridiculous_taking/",
            "gilded": 0,
            "id": "11whmx",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11whmx/i_hate_my_anxiety_and_i_feel_ridiculous_taking/",
            "retrieved_on": 1413471446,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I hate that I can't leave the house, make phone calls etc. without having my stomach in constant pain, my breathing accelerated, my head going crazy, all the other symptoms of anxiety. \n\nI just wanted to go to the grocery store and the bank today, but today is one of the harder days to leave the house. It doesn't even matter how important it is for whatever I have to do - even if it's work, I still get scared to leave. I know once I leave, then I'm *usually* ok, it's just forcing myself to leave, which means if I get dressed and get ready then I'm even closer to leaving my house (eek!).\n\nIf I take anymore of my meds, I'm pretty sure I will fall asleep from them. (I take 2mg Klonopin and 30mg Lexapro - so far this has been the best treatments.)  I want to know I'm not alone, and I'm not the only one that has a hard time leaving the house, even with the treatment for anxiety. How do you cope with severe anxiety? What gets you to leave the house everyday? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate my anxiety and I feel ridiculous taking all the meds I do just to leave the house. I want to know I'm not alone, since no one I know has severe anxiety. How do you guys cope?",
            "url": "http://www.reddit.com/r/Anxiety/comments/11whmx/i_hate_my_anxiety_and_i_feel_ridiculous_taking/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1350900873,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11w16c/got_told_i_was_was_much_less_shy_after_a_year_at/",
            "gilded": 0,
            "id": "11w16c",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11w16c/got_told_i_was_was_much_less_shy_after_a_year_at/",
            "retrieved_on": 1413472128,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "Still happily an introvert, but I can make eye contact properly now and hold a good conversation without breaking out in sweat. Took a while, but work has been really good exposure to the anxiety - think I might finally be getting on top of this. Feelsgoodman.jpg. Just thought I'd share with any of you who think it may not get better! It can, although it comes in fits and starts.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Got told I was was much less shy after a year at my job today! Social anxiety victory.",
            "url": "http://www.reddit.com/r/Anxiety/comments/11w16c/got_told_i_was_was_much_less_shy_after_a_year_at/",
            "user_reports": []
        },
        {
            "author": "meannoharm",
            "author_created_utc": 1349725545,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_98tgj",
            "created_utc": 1351078981,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1201lt/i_am_overcoming_my_anxiety_and_want_to_help_others/",
            "gilded": 0,
            "id": "1201lt",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1201lt/i_am_overcoming_my_anxiety_and_want_to_help_others/",
            "retrieved_on": 1413466296,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Hi everyone,\n\nI am just getting over about a year of severe panic and anxiety. It got so bad at one point that I wouldn't eat anything but peanut butter and jelly or mac and cheese (my panic attacks started after having what I thought was an allergic reaction to a food). I wouldn't attend parties or travel unless I had my own transportation.  I almost lost my relationship with my SO of 5 years.\n\nThe good news is that I've overcome the worst of my panic and anxiety, although I am still working on expanding my comfort zone. I want to offer encouragement to anyone out there who is struggling because for months I honestly thought there was NO WAY I would ever recover. This isn't true!! You can do it. The solution is different for everyone, and there is no magic \"cure', but you CAN recover.\n\nNow, I want to help others with anxiety in some way. Giving back to others really gives me a sense of peace and I think it would help my progress. I'm not sure how. Any ideas? I can't donate any money. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I am overcoming my anxiety and want to help others.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1201lt/i_am_overcoming_my_anxiety_and_want_to_help_others/",
            "user_reports": []
        },
        {
            "author": "Odwan",
            "author_created_utc": 1345311218,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8pm7r",
            "created_utc": 1350877026,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11vmyq/help_self_defeating_school_anxiety/",
            "gilded": 0,
            "id": "11vmyq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11vmyq/help_self_defeating_school_anxiety/",
            "retrieved_on": 1413472690,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I am currently in my senior year of college and I hate the way school makes me feel. I get myself in this loop of putting off work so I can put off that feeling of anxiety. As you may of guessed this only magnifies my anxiety I have to deal with later and I get worse and worse and the work becomes too much.\n\nI get especially anxious about interactions with professors and going to class. Which gets much worse when my brain comes up with a thousand possible (all negative) outcomes.\n\nThis anxiety has cost me many grades and I fear my current grades. I have many interests but without drive and the ability to cope I fear I am limiting myself.\n\nIf anyone has some advice on how to end this self defeating attitude and to manage my work and anxiety I would be forever grateful.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Self Defeating School Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/11vmyq/help_self_defeating_school_anxiety/",
            "user_reports": []
        },
        {
            "author": "donotmicrowave",
            "author_created_utc": 1333494200,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_7cky5",
            "created_utc": 1350955094,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11x1fq/relaxing_embrace_your_body_and_what_it_does/",
            "gilded": 0,
            "id": "11x1fq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11x1fq/relaxing_embrace_your_body_and_what_it_does/",
            "retrieved_on": 1413470659,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I am 20f. I have had diagnosed GAD, SAD, and Hypochondria since I was very young. I have been on medicine. I have gone (and still go) to a therapist. I have done hypnosis. I have tried all sorts of diet and exercise plans. And you know what? I AM STILL ANXIOUS.\n\nAnd so I have been thinking about that a lot. Why am I still anxious when I have utilized every resource available to feel better? I still have daily panic attacks. I still have nervous tics. I have been wondering if I am just more sick than others or if I have some sort of other disease that inhibits the treatment of my anxiety. It is a worry that is always on my mind (and probably hinders the very treatments that I am so worried aren't working). \n\nI came to a realization  that I want to share with all of you fine people. My body (and yours too) is totally amazing. It does all of these cool things all the time. It has patterns and processes that work in incredibly intricate ways. It fucking rocks! \n\nI spend so much time worrying that something is wrong with my body. I don't acknowledge all the wonderful things that it does. I fill it full of pills and punish it. My body and I have been enemies for so long. But not anymore. Today, I resolve to embrace my body and what it does and you should consider doing the same. \n\nTake a moment to think about how awesome it is. Next time you have a panic attack or think you are sick you will remember how it always does its best to look out for you. Your body is not a bad guy. Utilize it to overcome your anxiety. Next time you feel panicked trying feeling the air go in and out of your lungs or feel your muscles move under your skin. Remind yourself that you and your body work together. \n\nTwo weeks ago I started dreadlocks. I was initially really nervous that I would mess them up, but now I watch my crazy frizzy hair change everyday and it reminds me of these things. Even my hair has processes that are wonderfully natural and normal. Maybe there is something radical you can do that will always serve as a reminder to embrace your body and accept what it does even when it feels wrong. \n\n**tl;dr Your body is great and you should try to remember that when things get you down**",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] Embrace your body and what it does.",
            "url": "http://www.reddit.com/r/Anxiety/comments/11x1fq/relaxing_embrace_your_body_and_what_it_does/",
            "user_reports": []
        },
        {
            "author": "swaggalikethat",
            "author_created_utc": 1350866952,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9dgkk",
            "created_utc": 1350867549,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11vddw/forgiving_myself_for_a_driving_mistake/",
            "gilded": 0,
            "id": "11vddw",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11vddw/forgiving_myself_for_a_driving_mistake/",
            "retrieved_on": 1413473080,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "i made a really dangerous mistake while driving yesterday; i was tired and distracted and turned left at a red light, nearly getting hit by a car. i had a family member in the car. the other car stopped and didn't even honk and it was all fine but i keep replaying the moment in my head as well as other mistakes i have made while driving. driving used to make me really anxious and i was having car problems earlier this week that resurfaced some of those feelings.\n\nhow do i stop beating myself up over this? my family member just told me to stop worrying because nothing happened, but i keep thinking about all the what-ifs.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "forgiving myself for a driving mistake?",
            "url": "http://www.reddit.com/r/Anxiety/comments/11vddw/forgiving_myself_for_a_driving_mistake/",
            "user_reports": []
        },
        {
            "author": "righteo",
            "author_created_utc": 1288032752,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4gltt",
            "created_utc": 1351029959,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11yyhu/every_time_my_body_has_one_of_those_normal_but/",
            "gilded": 0,
            "id": "11yyhu",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11yyhu/every_time_my_body_has_one_of_those_normal_but/",
            "retrieved_on": 1413467788,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "How do you convince yourself that these are just normal bodily effects that everyone experiences? Why am I constantly on edge thinking my body is broken, malfunctioning, that something is happening to me and I'm going to die?!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Every time my body has one of those normal but weird feeling (muscle twitch, heart palpitation, stomach churn, ect.) I start to freak out that somethings wrong with me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/11yyhu/every_time_my_body_has_one_of_those_normal_but/",
            "user_reports": []
        },
        {
            "author": "vaguenotions",
            "author_created_utc": 1344567426,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8md26",
            "created_utc": 1351231178,
            "domain": "yourfaceismelting.blogspot.ca",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/12414g/quieting_anxiety_comic/",
            "gilded": 0,
            "id": "12414g",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/12414g/quieting_anxiety_comic/",
            "retrieved_on": 1413460827,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/Wvkr5pGJ0fkdOS-v.jpg",
            "title": "Quieting Anxiety [Comic]",
            "url": "http://yourfaceismelting.blogspot.ca/2012/10/what-if-its-adorable.html",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1350955388,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/11x1v4/i_really_dont_want_to_wake_up_tomorrow/",
            "gilded": 0,
            "id": "11x1v4",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/11x1v4/i_really_dont_want_to_wake_up_tomorrow/",
            "retrieved_on": 1413470641,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "This is seriously the saddest I can remember being in a long time, maybe ever. I just want to go to sleep tonight and not wake up. I've been depressed for about 5 years and little by little its killing me inside. I'm a 20 year old male in his Junior year of college and I found out I had social anxiety a few months ago. I constantly get angry because I have to deal with these things. \n\nIn high school, I slowly lost all my friends because of the anxiety induced depression. At first people tried to deal with it, but I became too much to handle. I couldn't and still can't have relationships with girls because I'm terrified I'm gonna fuck it up. I would like girls, work up the courage to ask them out, and it would go downhill from there because I would avoid them. I decided to go to college out of state, thinking that would help my problems.\n\nOnce I got to college, the same issues arose. The depression continued to get worse from repeating the same mistakes over and over again. I befriended some people early on but after a year and a half, I became too much of a hassle. People wanted to help, but they just couldn't understand. I guess I can't really blame them. I eventually worked up the courage to tell my parents. I went in to the doctor and after awhile (and plenty of therapists) I found out I have social anxiety.\n\nFor a long time my parents were super supportive but the depression has been been getting worse lately. They moved within an hour of my school a couple of years ago and I've been going home on the weekends because I don't have any friends. This weekend, I had a really bad panic attack and broke down in front of my mom. She may have just been having a bad day, but she said very condescendingly \"Do you ever have a good day.\" \n\nNow it feels like I have no one to turn to. I hate my life. I hate waking up. The only reason I haven't killed myself is because it would be inconvenient. Fuck it all.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I really don't want to wake up tomorrow.",
            "url": "http://www.reddit.com/r/Anxiety/comments/11x1v4/i_really_dont_want_to_wake_up_tomorrow/",
            "user_reports": []
        }
    ]
}