{
    "data": [
        {
            "author": "theflamecrow",
            "author_created_utc": 1300967430,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_506om",
            "created_utc": 1348725920,
            "domain": "self.Anxiety",
            "edited": 1348726212,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10jveg/found_elsewhere_how_to_decode_a_person_with_an/",
            "gilded": 0,
            "id": "10jveg",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 108,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10jveg/found_elsewhere_how_to_decode_a_person_with_an/",
            "retrieved_on": 1413542120,
            "score": 558,
            "secure_media_embed": {},
            "selftext": "(Their title, not mine. :P) \n\n\nthings we are trying to do all the time:\n\n* be safe\n\nthings we can’t help but do all the time:\n\n* second-guess ourselves\n* behave impulsively and reactively\n* take everything personally\n* worry\n* have difficulty accepting compliments\n* have difficulty reciprocating friendly gestures\n* worry\n* have difficulty finding the courage to respond\n* have difficulty not being suspicious of others’ intentions\n* worry\n* make a huge deal out of the smallest thing\n* think we're bothering you\n\nthings you should keep in mind:\n\n* we’re scared of everything\n* pretty much all of the time\n* it’s an actual disorder\n* it manifests as impulsive behavior\n* you can’t fix us with words\n* telling us “worrying is silly” won’t make us stop worrying\n* it’ll only make us feel silly\n* and then we’ll worry even more\n* “oh god, am i worrying too much? what if they call me silly again?”\n* like that\n* also, we wear a lot of armor\n* cold, heavy, affection-proof armor with spikes\n* we constructed this armor as children\n* we’re fairly certain you will never be able to pry it apart\n* but there is a nice person under there, we promise\n\nthings you can do for a friend with an anxiety disorder:\n\n* stick around\n* ask them if they’re comfortable in a place or situation\n* be willing to change the place or situation if not\n* activities that help them take their mind off of things are good!\n* talk to them even when they might not talk back\n(they’re probably too afraid to say the wrong thing)\n* try not to take their reactions (or lack thereof) personally\n(the way they expresses themself is distorted and bent because of their constant fear)\n(and they know this)\n* give them time to respond to you\n* they will obsess over how they are being interpreted\n* they will anticipate being judged\n* it took me four hours just to type this much\n* even though i sound casual\n* that’s because i have an anxiety disorder\n\nthings you shouldn’t do:\n\n* tell us not to worry\n* tell us we’ll be fine\n* mistake praise for comfort\n* ask us if we are “getting help”\n* force us to be social\n* force us to do things that trigger us\n* “face your fears” doesn’t always work\n* because—remember—scared of everything\n* in fact, it would be more accurate to say we are scared of the fear itself\n\nemergency action procedure for panic attacks:\n\n* be calm\n* be patient\n* don’t be condescending\n* remind us that we’re not “crazy”\n* sit with us\n* ask us to tighten and relax our muscles one by one\n* remind us that we are breathing\n* engage us in a discussion (if we can talk, then we can breathe)\n* if we are having trouble breathing, try getting us to exhale slowly\n* (it will be harder for us to exhale than inhale)\n* (sometimes all it takes is our body to realize it can push the air back out)\n* or breathe through our nose\n* or have us put our hands on our stomach to feel each breath\n* or have us put a hand on your chest and breath with you\n* ask us what needs to change in our environment in order for us to feel safe\n* help us change it\n* usually, just knowing that we have someone on our side willing to fight our scary monsters with us is enough to calm us down\n\nif you have an anxiety disorder:\n\n* it’s okay.\n* even if you worry that it’s not okay.\n* it’s still okay. it’s okay to be scared. it’s okay to be scared of being scared.\n* you are not crazy. you are not a freak.\n* I know there’s a person under all that armor.\n* and i know you feel isolated because of it.\n* I won’t make you take it off.\n* but know that you are not alone.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Found Elsewhere - \"How to Decode a Person With an Anxiety Disorder\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/10jveg/found_elsewhere_how_to_decode_a_person_with_an/",
            "user_reports": []
        },
        {
            "author": "nerdasaurous",
            "author_created_utc": 1338172032,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7tsek",
            "created_utc": 1348532392,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10f74h/anxiety_girl/",
            "gilded": 0,
            "id": "10f74h",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10f74h/anxiety_girl/",
            "retrieved_on": 1413548327,
            "score": 553,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/0CMOA8WQ-U47v0E0.jpg",
            "title": "Anxiety Girl",
            "url": "http://imgur.com/MNfVz",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1348342524,
            "domain": "self.Anxiety",
            "edited": 1348343121,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10b5q1/so_i_have_been_going_out_to_social_events_alone/",
            "gilded": 0,
            "id": "10b5q1",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10b5q1/so_i_have_been_going_out_to_social_events_alone/",
            "retrieved_on": 1413553847,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "I have been doing an experiment lately where I have been going out alone to social events to ease my anxiety and to be less dependent on people. Sometimes, I would bring a audiobook with me and walk back and forth near the bar scene listening to this audiobook and observing people. I think it's a lot more stimulating and beneficial to be anywhere but home - especially when there's nightlife around you. \n\nIt's interesting because, one time I was walking back and forth, I heard something a bar security guard said and added in my own comment (matter-of-factly as I was walking) and ended up talking for like 3 hours about various life topics. I enjoyed it.\n\nSo, last night I went to a live music/bar/club by myself and spent about 4 hours there. (9p-1a) I went there for these three reasons:\n\n* To people watch\n* To listen to music\n* Be comfortable in my own skin and reduce my anxiety\n\n\nOnce I got there, I started chatting up the bartender about music. He seemed like a real cool dude. I don't really like to drink when I am observing people as it hinders my judgement - so I used a fairly effective technique I learned from a much older friend of mine George and that is to simply order/get a cup of tonic water with lemon (it's called a bitter lemon/bitter lime). \n\nSidenote: George is a very high energy black dude with his own fucked up issues, but the man had the gift of gab and was quite street smart - I haven't seen him in years though.\n\nThe purpose behind this (getting a tonic water + lemon) is four fold:\n\n* It's free or fairly cheap\n* It tastes great, is non-alcoholic and refreshing\n* It looks just like a vodka tonic, therefore you will blend in well with the crowd without getting inebriated and won't be questioned by drinkers. (ie: Why are you not drinking blah blah)\n* The cash you save from this drink can be put toward a tip towards the bartender, which he/she appreciates - because you just tipped them the cost of a regular drink and didn't even buy a legitimate drink.\n\n\nAnyway, I got some music recommendations from the bartender (he was in his mid thirties) and wrote them down on a napkin. He seemed to really appreciate my interest in music and the fact that I pulled out a pen and napkin to write it down threw him off a bit. (in a good way). \n\n\nI spent the next 1.5-2 hours literally sitting by myself at the bar and listening to music and sipping on my non-alcoholic bitter lemon. There was the occasional casual chat up with people coming to buy drinks, but that was it. The interesting thing about this is that, I had a bit of anxiety about going out by myself for a long time and I could actually feel my anxiety deteriorate over the course of the night because it becomes fairly clear that no one really gives a shit about you and that's perfectly OK. It forces you to be comfortable with yourself and be self reliant instead of always going out with a group of friends/people and hiding behind the collective cowardice. One of my biggest assumptions was that \"If I go out by myself, what would people think? am I a loser? etc..\" and based on my experience in the past 3 days - that's hardly the case. In fact, I think it takes more balls to go out by yourself.\n\n\nSo, eventually, I noticed this blonde girl (around a 6 in looks and in her mid thirties) stroll about the bar/club talking with one of the band members. What was interesting is that, she was ALWAYS smiling, almost in a strange insecure kind of way. A bit later, I noticed that she was hovering around where I sat, looking like she almost wanted to get another drink from the bartender - but she was hesitant. (at this point, I noticed that she had two drinks and had closed her tab).\n\n\nI was a bit slow to react, but then I realized that she was actually alluding her interest in talking to me because she would hover around me randomly throughout the night. I am fairly sure that she came to the bar alone as well. Eventually, I chatted her up and we joked/talked for a good 30ish minutes when several (somewhat drunk) 23-25 year old's started hitting on her right next to me. She hugged them and sent them on their way and told me that \"...Can you believe that? They are like 24! I don't know why young people always hit on me..\". \n\n\nKeep in mind, I am 24 as well, but for some reason, she think's I am older because I managed to insert some old school jazz artists into the mix (ie: John Coltrane) when we were talking about music earlier. She apparently worked in finance, bought a condo recently and moved to California from Texas.\n\n\nAlso, she was blatantly touching me in interest. I did not touch back, but kept up a friendly conversation. Then, she eventually said \"..That's OK, your not interested.., We can still be buddies..\". Was I interested? Meh. I was neutral and on the fence - She was the type of girl you would move forward with just for the \"story\". She eventually sat next to me and said \"there's a booth open in the front, do you want to go there?\". To which, I replied: \"Yea, let's go\". Also, keep in mind that all this shit is new to me, so internally, I am panicking but on the surface I look fairly calm and doing my best to navigate the interaction effectively.\n\n\nI didn't understand why she was constantly smiling though. Also, she would go to the restroom hell of a lot more than usual. It's certainly possible that she had some emotional/substance abuse issues.\n\n\nWe eventually sat in the booth next to each other, but with plenty of empty space between us. After a song or two, I moved closer to her and whispered \"Listen, empty space makes me uncomfortable, I'd like you to move closer\" and put my hand around her and helped her move closer. (By the way, I had major butterflies while thinking about doing this - I spent a good 5 minutes scared and questioning myself before I managed to force myself to utter those words) It's weird because you sort of \"feel\" the energy and logically know what to do, but actually doing it is fairly difficult/strange.\n\n\nShe obviously liked it. The next several songs consisted of me playing with her hair and squeezing her ass a little bit. Was I attached to closing the deal with her? Not really, but I was curious about what I could get away with. Being attached to any outcome only increases my anxiety, so I don't expect anything.\n\n\nAnyway, I wish I had a stupendous ending to this night, but shortly afterward, we hugged and departed.\n\nTry going out alone. It forces you to confront yourself in the absence of modern distractions (television, internet, etc.) and you can learn a lot about yourself.\n\nI have only gone out by myself 3 times thus far and I am 24, but fuck it's enlightening to see the world from the solo vantage point. I plan on doing this again whenever I have a free night. \n\nThe world is such a fascinating place.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "So, I have been going out to social events alone on Friday nights.",
            "url": "http://www.reddit.com/r/Anxiety/comments/10b5q1/so_i_have_been_going_out_to_social_events_alone/",
            "user_reports": []
        },
        {
            "author": "britachu",
            "author_created_utc": 1290810629,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4k5nb",
            "created_utc": 1348785619,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10l6fz/i_just_made_a_doctors_appointment/",
            "gilded": 0,
            "id": "10l6fz",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10l6fz/i_just_made_a_doctors_appointment/",
            "retrieved_on": 1413540216,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "After being out of therapy and off meds for over a year, I made an appointment and am going back in. I'm sick of the way anxiety and depression are ruining my relationships and impacting my life/work/etc....\n\nJust wanted to share.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just made a doctor's appointment",
            "url": "http://www.reddit.com/r/Anxiety/comments/10l6fz/i_just_made_a_doctors_appointment/",
            "user_reports": []
        },
        {
            "author": "notemaker",
            "author_created_utc": 1271127919,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3zwk5",
            "created_utc": 1348454761,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10dghg/what_is_helping_me_xpost_rdepression/",
            "gilded": 0,
            "id": "10dghg",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10dghg/what_is_helping_me_xpost_rdepression/",
            "retrieved_on": 1413550686,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I don't know if this will help anyone, but I hope it can (TL;DR below).\n\nI've always been a bottler - anything bad that happens, I push it away, try not to think about it, run away from the negative feelings. When I was 12 I dealt with the death of my brother, that's when it started, I think. Since then, that's how I've learned to deal with pain - push it away.\n\nAlso, I've always been afraid to assert myself. My first instinct when someone does something that hurts me is that I've done something wrong. I've never let myself have a voice.\n\nAbout a year ago, though, I had a very painful breakup with someone I cared deeply about, and suddenly I was in panic mode - shaking, heart racing, like I was afraid or panicking or something. I didn't realize it at the time, but this was basically the beginnings of an anxiety disorder. I had no idea what to do about it, but alcohol would numb it so I could sleep.\n\nThen about 2 months ago, after having been off Zoloft for a few months, I went back to my Dr. and asked for something different. I tried Effexor, starting on a Saturday. By Sunday night, I was totally lethargic and apathetic - I knew this was not working. I called my Dr. on Monday and said I needed to stop taking it. Due to my having been a \"bad patient\" in the past, rather than help me, she released me from her practice. I was stunned - what was an anxiety disorder before became sheer psychic misery. It hurt to be awake - my whole upper body was in agony. I can't really even explain it, but my brain was on fire. I spent the next week in an alcoholic stupor trying to numb it away.\n\nI found another Dr., and rather judge me and treat me like a child, he actually offered me care. Just walking out of there I felt my heart rate and blood pressure (which had been severely hypertensive) drop.\n\nEventually, through the use of Paxil and temporary use of Klonipin, I've become stable. But I still have bouts of anxiety and depression. Just today, I went bowling with my son, and on the way back, just thinking about the day and the week ahead, nothing seemed worthwhile or encouraging, anything I thought about made me miserable.\n\nSo I did the only thing besides medication that's been helping: I went into the bathroom and cried. Not just a little sniffle, but a full on temper tantrum (as quiet as I could), shaking my fists, getting as physically angry as I could while the kids are here. Thinking about the ways in which life has made me feel fucked over, unimportant, abandoned, and worthless, and telling all of them \"FUCK YOU!\"\n\n\"FUCKYOUFUCKYOUFUCKYOUFUCKYOU!!!!\"\n\nAfter about a half an hour, relief started kicking in, and now I'm fairly calm again. Before, I was craving alcohol for the numb, but now I don't need it (trying to stay away from it as much as possible).\n\nSo for anyone feeling miserable, anxious, depressed, despondent, please: find a way to let it out. Don't worry about whether you feel you deserve to be angry, it doesn't matter - let yourself be, let it out, get physically angry, shake your fists, scream into a pillow and pound your fists on the bed, take a baseball bat and break up branches in your yard (just try not to do anything permanently destructive to yourself or property, and I really recommend doing this as privately as possible).\n\nThe first time I did this, I was just on my hands and knees throwing my head back and forth and crying as hard as I could. The next day I was sore as crap, but it helped, and it's continuing to help.\n\nIt's really working wonders for me, this is something I've never let myself do, never thought I deserved to be angry, never thought I was worthy.\n\nFUCK THAT SHIT, I'M LETTING IT OUT!\n\nSo the next time you feel depressed, despondent, anxious - maybe it's just tantrum time. Let it out.\n\nI hope this helps someone out there.\n\nTLDR: Expressing physical anger is a great release and is helping me through my depression and anxiety, just do it as safely and privately as possible.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What Is Helping Me [xpost r/depression]",
            "url": "http://www.reddit.com/r/Anxiety/comments/10dghg/what_is_helping_me_xpost_rdepression/",
            "user_reports": []
        },
        {
            "author": "SwordsToPlowshares",
            "author_created_utc": 1338274991,
            "author_flair_css_class": "",
            "author_flair_text": "Mild depression/Social anxiety/AvPD",
            "author_fullname": "t2_7u5a2",
            "created_utc": 1348309019,
            "domain": "news.stanford.edu",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10ajpz/more_than_just_relaxing_meditation_helps_improve/",
            "gilded": 0,
            "id": "10ajpz",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10ajpz/more_than_just_relaxing_meditation_helps_improve/",
            "retrieved_on": 1413554690,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/KNgwGD8-60VGOJX9.jpg",
            "title": "More than just relaxing, meditation helps improve self-image of anxiety sufferers",
            "url": "http://news.stanford.edu/news/2009/june3/meditate-060309.html",
            "user_reports": []
        },
        {
            "author": "Drew13",
            "author_created_utc": 1334936870,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7idtb",
            "created_utc": 1348818959,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10lyyi/the_moment_ive_been_dreading/",
            "gilded": 0,
            "id": "10lyyi",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10lyyi/the_moment_ive_been_dreading/",
            "retrieved_on": 1413539120,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "Hey guys, it's been a while since I've been here, but something is happening to me currently and I don't know who else to turn to. I am emetophobic (afraid of vomiting) and I just started college. It's only been a week and today my stomach has been feeling a little off. Currently I felt like I almost threw up and my heart started to race. All my anxiety rushed back into me and I am freaking out. I don't know what to do. I don't want to throw up. I'm scared. Please some advise :/",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The moment I've been dreading :'(((",
            "url": "http://www.reddit.com/r/Anxiety/comments/10lyyi/the_moment_ive_been_dreading/",
            "user_reports": []
        },
        {
            "author": "screentest",
            "author_created_utc": 1298526265,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4vusv",
            "created_utc": 1348685845,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10iqyx/i_feel_like_everyone_i_love_and_am_close_to/",
            "gilded": 0,
            "id": "10iqyx",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10iqyx/i_feel_like_everyone_i_love_and_am_close_to/",
            "retrieved_on": 1413543588,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "Does anyone else feel this way? I'm away from home in college and couldn't be lonelier. I know I'm the one who left but its always felt this way to me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like everyone I love and am close to leaves or drifts away. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/10iqyx/i_feel_like_everyone_i_love_and_am_close_to/",
            "user_reports": []
        },
        {
            "author": "duyjo",
            "author_created_utc": 1310075315,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5helw",
            "created_utc": 1348448414,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10da4l/anyone_has_never_been_scared_of_being_alive/",
            "gilded": 0,
            "id": "10da4l",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10da4l/anyone_has_never_been_scared_of_being_alive/",
            "retrieved_on": 1413550943,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Title sounds dumb, but I sometimes get this anxiety-like problem where I realize I am alive, this is real life and more, this makes me start feeling scared just of thinking about it, if it gets too big, I start screaming until it just goes for a while. Anyone has ever experienced this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone has never been scared of being alive?",
            "url": "http://www.reddit.com/r/Anxiety/comments/10da4l/anyone_has_never_been_scared_of_being_alive/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1348626976,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10hizx/i_wrote_this_to_calm_myself_down/",
            "gilded": 0,
            "id": "10hizx",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10hizx/i_wrote_this_to_calm_myself_down/",
            "retrieved_on": 1413545225,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "So its been almost a month since I've moved away for university. A few nights ago my mother came down to visit me. We got a hotel room and after spending a bit of time with her I had to hide myself in the bathroom so I could breakdown. I came out after the tears were dried and felt the need to put my thoughts on paper.\n\nYou never feel more at home than listening to your mothers heartbeat. Absorbed back inside the womb, back to your primitive form, all the world seems to subside into the perceptional nothing it once was so many years prior. The begining of an era, my first movement took place here, my first rush of blood pumped through my forming body, my first untainted, pure thought.So I wondered, if I had a chance to start over what would I change? As I pondered this I couldn't seem to find a place I would begin to change what I have already created. What reporcussions would come from these changes? Would I still end up with as happy as a life I intended? I don't know if I would be able to deal with the consequences. My life couldn't be enjoyed as much if I had different people in my life or if I had different characteristics. Now I'm not conceded but I love my life and I need to learn how to appreciate it more. I need to stop worrying about what happens next and be happy that at least theres something that can happen next. I need to swallow my fear and discard the thought of how my life could be if I had made different choices that I have already. Because in truth, deep down I know I wouldn't change a single thing about my choices in life. Those choices have given me the people I love and my body and mind which in itself I have accomplished so much. So stop worrying about what will happen next because no matter what it will be the right thing. Swallow your fear of living life the wrong way because not living your life is much worse.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I wrote this to calm myself down.",
            "url": "http://www.reddit.com/r/Anxiety/comments/10hizx/i_wrote_this_to_calm_myself_down/",
            "user_reports": []
        },
        {
            "author": "Legit_GFX",
            "author_created_utc": 1317608172,
            "author_flair_css_class": "",
            "author_flair_text": "Here to help.",
            "author_fullname": "t2_5yxcn",
            "created_utc": 1348583841,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10g8w4/hey_guys_tell_me_something_that_is_going_really/",
            "gilded": 0,
            "id": "10g8w4",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 79,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10g8w4/hey_guys_tell_me_something_that_is_going_really/",
            "retrieved_on": 1413546901,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey guys. Tell me something that is going really well in your life that you are very happy about. Don't focus on the anxiety for a second.",
            "url": "http://www.reddit.com/r/Anxiety/comments/10g8w4/hey_guys_tell_me_something_that_is_going_really/",
            "user_reports": []
        },
        {
            "author": "vaguenotions",
            "author_created_utc": 1344567426,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8md26",
            "created_utc": 1348523404,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10excr/rantwhy_are_people_downvoting/",
            "gilded": 0,
            "id": "10excr",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10excr/rantwhy_are_people_downvoting/",
            "retrieved_on": 1413548686,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "Hey, i'm not sure if I expect an answer from anyone here about this, but i've noticed on peoples self.posts that they sometimes get a downvote or two. This is something I don't understand. I noticed it on /r/depression as well.\nI've only posted comics on here, and that I understand downvoting. But people just saying how they feel, reaching out to others, especially when we're all obviously not feeling that confident, to recieve a downvote makes me ... angry i guess.\n\nfrick i've already run out of steam.. i was going to be all \"shame on you\" but that is also entirely the wrong approach, as nobody in these subreddits need any more shame directed at them either. just.. think before you downvote. why are you doing it? delve deep. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant]why are people downvoting? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/10excr/rantwhy_are_people_downvoting/",
            "user_reports": []
        },
        {
            "author": "soveryanxious",
            "author_created_utc": 1348435332,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_93oto",
            "created_utc": 1348436418,
            "domain": "self.Anxiety",
            "edited": 1348445687,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10cyfv/help_anxiety_about_driving_is_ruining_my_life/",
            "gilded": 0,
            "id": "10cyfv",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10cyfv/help_anxiety_about_driving_is_ruining_my_life/",
            "retrieved_on": 1413551391,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I am a male in his mid 20s. Financially everything is ok. I am going to school where I am making the grades I want. Family life is ok. Not on any meds.\n\nI have sought counseling in the past for anxiety issues. I am not sure if I was ever diagnosed with anything, they never told me. My anxiety has never lead to situations where I feel my life is in danger until now.\n\nAlmost a year ago I was driving on an interstate on my way to school when I nearly fainted (pre-syncope?). I tried to rationalize that I hadn't eaten very well that day and I had stayed up late the previous night working on an assignment. I was worried about a root canal surgery I needed and how I was going to pay for it (I have health insurance but my portion was very expensive. I think just random stresses from life can trigger this.\n\nEver since then, every couple of months, I'll have an episode where I am driving and I encounter a stressful driving situation and suddenly it feels like I will lose control of my body and car.\n\nI have never fainted and never consciousness and each time I have had this happen I maintain enough control to pull over to the nearest exit and take the backroads home. I have never had an accident.\n\nHere comes the anxiety part. I sometimes feel (like now) this dreadful feeling about interstate driving. Right now I am safe at home and all I can think about is if I will have another episode on my way home from work or to school. It feels like my heart is sunk in my body and and my fine motor movements like typing and writing are a bit off and shaky.\n\nThe situations where this happens have been expanding. First it would only happen when I drove from work to school. Through a very urban driving environment. Then it started happening when I drove from work to home (urban to suburban driving). It has never happened on my way to work.\n\nI have had enough and I am calling my primary care physician tomorrow to make an appointment to see if there is a physiological basis for what I am experiencing but I am worried that he will shrug it off and tell me my problem is that I just need to eat better and exercise. Until I can find the help I need I feel like I am on my own.\n\nI don't know what to do! I have done breathing exercises, played video games to distract myself, had a drink or two to hopefully calm down.\n\nI can't get my mind off of it. If I continue feeling like this I am sure I'll have another episode tomorrow.\n\nr/Anxiety I need your help\n\nedit:forgot a few words\n\n*Edit 2:* I learned about valerian root and how it helps some people's anxiety. I took some and I am feeling better. Hopefully I can use this tomorrow when it's time to drive to school so feeling like I have a strategy really feels empowering. Thank you all for your help. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[HELP] Anxiety about driving is ruining my life",
            "url": "http://www.reddit.com/r/Anxiety/comments/10cyfv/help_anxiety_about_driving_is_ruining_my_life/",
            "user_reports": []
        },
        {
            "author": "blaaahrgh",
            "author_created_utc": 1348243677,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_92xo4",
            "created_utc": 1348503102,
            "domain": "self.Anxiety",
            "edited": 1348504386,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10ebsd/the_one_thing_holding_my_life_back_is_my/",
            "gilded": 0,
            "id": "10ebsd",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10ebsd/the_one_thing_holding_my_life_back_is_my/",
            "retrieved_on": 1413549503,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I worry this should go into /r/relationships, but in truth, I feel this topic is a little too... deep(?) to be regarded as a normal \"relationship\" problem. I worry it may be rooted further in my childhood/background (and his) than simply be a clash. But I am so new to this physical sense of anxiety that I'm not very wise at all.\n\nI am *so* tired of being sad, feeling helpless, doubting myself and hiding from my friends. For what soon has been the better part of a year, I've felt this way. With the help of my mother, I've decided that it ends here. I *can* be beautiful, my interests *do* matter, I'm *not* stupid and I *can* achieve what I want in life. Just not at this moment.\n\nAs I assess these issues, I realise something extremely disconcerting. Most of this anxiety stems from my relationship. While I can't, won't, don't blame the guy himself - and I love him more than anything, I wouldn't ask for anyone else - I worry that he is the source. He is so angry, all the time, and very aggressive in his opinions. Unfortunately, he himself struggles with dissatisfaction in life, and he often goes on minute-long rants about how shit everything is. Even the things I enjoy. His anger makes me want to turn around, run away, and plug my ears while closing my eyes.\n\nWhile he doesn't necessarily target me with the intention of making me feel shit and insignificant (I hope), he really does. I can't get a word in edgeways without being shot down as a dramatic and/or being unreasonable, illogical or stupid. My feelings are inferior to his rational mind. I experience him to be extremely cold and unsympathetic. I long for someone to hold me, protect me, support me and just be nice and positive - but I don't want *anyone else* to do that. I want him to. When I then naturally wander to other social circles to fulfill these wishes (not cheating at all), he takes offense to the friendly banter. He thinks I'm flirting with people, that they view me as a single girl. I struggle with confrontation and while I understand some comments are inappropriate, I couldn't stand shooting someone down with dismissal. I re-direct, but in truth, it's nice to feel appreciated and desired.\n\nWe had another blow-out that's put me in a mindset I worry is destructive. I've told him that he needs to make his mind up and consider whether he truly loves me (as he claims, he doesn't want it to end and seems very disheartened by this thought) because he doesn't seem like he respects or cares for me. I fear I come across the same way to him.\n\nSo I brace myself for the worst, and I just feel so anxious all the time, constantly. What is he doing? What is he thinking? I prod him to communicate more with me, he just apologises (for not doing so) and then there's nothing more of it. I can't help but wonder if I am unable to recover from my anxiety as long as I'm with him, but I can't even begin to explain the physical pain I feel at the thought of it.\n\nI've asked (but not requested) medicine solution, but they say that \"talking\" should be the first hand choice. I feel that I can't solve this by talking to any outsiders, and my boyfriend won't talk to me enough that it matters.\n\nI just can't seem to figure out whether the anxiety is the \"chicken or the egg\" in this case. \n\n**tl;dr - relationship making me very anxious. How can I make the right decision while my mind is so clouded by doubt and worry? Am I ruining this relationship, or is it ruining me? How can I tell?**\n\nThrowaway account to stay anon, sorry about that.\n\n**Edit**: As a side question, I find that I've become almost sickeningly empathic along with this anxiety/emotional duress. I feel myself sometimes tearing up when I read some of the posts around here, it can be simple things like methods of calming yourself etc. Is this a side effect of anxiety or am I just an exaggeratedly sensitive person?\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The one thing holding my life back is my relationship. It makes me so anxious, but I feel almost consumed by anxiety when I think it might end.",
            "url": "http://www.reddit.com/r/Anxiety/comments/10ebsd/the_one_thing_holding_my_life_back_is_my/",
            "user_reports": []
        },
        {
            "author": "einssein",
            "author_flair_css_class": "",
            "author_flair_text": "GAD and OCD",
            "created_utc": 1348391800,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10c4by/helpmy_pet_died_and_im_having_a_panic_attack/",
            "gilded": 0,
            "id": "10c4by",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10c4by/helpmy_pet_died_and_im_having_a_panic_attack/",
            "retrieved_on": 1413552533,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I have a pet hermit crab who I suspect has died while molting. I'm having *major* anxiety. It's not even about me being heartbroken (although I am) as much as it is his actual death. I'm creeped out and grossed out about having to dig him up and then dispose of his body. I don't handle this kind of thing well since I've got a lot of anxiety about germs and stuff.\n\nIt's a weird situation, I know. I feel like the only thing I can do is get drunk so I don't freak out too much. Anyone else have any advice?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help]My pet died and I'm having a panic attack",
            "url": "http://www.reddit.com/r/Anxiety/comments/10c4by/helpmy_pet_died_and_im_having_a_panic_attack/",
            "user_reports": []
        },
        {
            "author": "Khrisper",
            "author_created_utc": 1311898514,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5l0q4",
            "created_utc": 1348571370,
            "domain": "self.Anxiety",
            "edited": 1348910565,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10g0fy/help_suffered_with_anxiety_for_8_years_without/",
            "gilded": 0,
            "id": "10g0fy",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10g0fy/help_suffered_with_anxiety_for_8_years_without/",
            "retrieved_on": 1413547220,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "**EDIT: As of Sunday 30th, I will not be around for a few days. I'm making my way back up to university and won't have the internet sorted up to a few days. I'll read and respond to new posts as soon as I am able to.**\n\n---\n\n*Hello /r/Anxiety, first time posting here. I need some advice/suggestions and would like to know if anyone else suffers in a similar way to me and how you managed to deal with it. This post whilst being used to reach out to others in a similar situation as well as gaining advice and thoughts will be used to help me collect and compile my thoughts into one location that I can copy down and use as some sort of transcript when speaking with a doctor. I know it's big but I wanted to cover all grounds and try and answer any questions and provide information to you that you may want. I've broken it all down into categories so you can read the bits that interest you. It would be great to get some feedback, even if you don't read it all.*\n\n**TL;DR: Anxiety causes me bad gut cramps and makes me shit badly, it is caused by just thinking about and actually leaving the house, even if it's to take a 1 minute walk to a postbox. Longer durations cause more stress.**\n\nI haven't been told by a doctor that I suffer with anxiety but I think my symptoms (I will get to these shortly) are a clear indication of this. My anxiety is directly linked to my bowels which I've dealt with for nearly 8 years in silence. I only came out to my parents on the seriousness of the issue a few years back and need to get medical help. Anyway, I'm not sure how to structure this post, everything is all inter-connected and all over the place. I'll start with a bit about me.\n\n---\n\n**About Me**\n\nCurrently, I am a 21 year old Male in the UK. I am about to go into my 3rd year at Uni. I have dealt with my anxiety as it is listed below for nearly 8 years. I place the event that started it towards the back end of October 2004. Some stupid school/childhood trauma that I place at the foot of all of this, I could be wrong. I'll write the details up at the end if anyone is curious. I'm about 5'10\" and weigh in at ~(8st|50.80kg|112lbs). Very underweight, not sure if this is related to my symptoms at all (I eat lots).\n\n---\n\n**My Triggers**\n\nTo begin the horrible anxiety crash course, all I need to do is merely think about either going outside. This ranges from going places in the car - to sitting in a university lecture - to walking to the postbox and back. Leaving the house causes anxiety, thinking about leaving the house causes anxiety. This is somewhat related to the worry of getting caught-short and needing the toilet where there isn't one. (The symptoms complicate this, see below).\n\n---\n\n**My Symptoms**\n\nSymptoms I can deal with:\n\n- Faster, shallow breathing.*^1\n- Nausea.\n- Feeling like I could be sick.\n\nSymptoms I cannot deal with:\n\n- Horrible gut cramps that force me to clutch my stomach in pain, these come and go in a way that can only be described as contractions lasting from 20s - 60s and coming as often after one another as the time they last.\n- A sudden and alarming urge to take a poop. (The urge is very real) *^2\n\n*^1 I'm not sure if this is a symptom or my response as a coping mechanism.\n\n*^2 My stool is firm and fine when I am not anxious. As soon as the anxiety kicks in it will liquefy there and then. Never had a hard stool while anxious. My anxiety involves holding back diarrhea. You can now see my problem.\n\nIt takes a great deal of mental (keep doing what I'm doing and remaining around my trigger) and physical strength (keeping that sphincter shut (see *^2 above)) to push past this. It should be noted that once the trigger has gone, ie: I get back into the safety of my house: my cramps stop, the urgent need to poop goes and the other symptoms just vanish. It's at this point I become fine.\n\n---\n\n**About My Attacks**\n\nOnce we get to about 30 minutes before I need to leave the house to attend university classes, my symptoms start. I will go to the toilet for a poop (as stated earlier, these are real urges with something behind them) and will poop about 3 times before finally leaving the house. (15 mins before leaving, 10 mins before leaving, 5 mins before leaving, etc... (not concrete times)). This is the point where I'll decide if I can continue, if I feel too bad, I will stay at home and skip the day, which makes me feel bad since once I decide to stay at home, the symptoms just stop. Should I venture onwards, it is at this point I'm usually just feeling sick, nauseous and be breathing quickly (going to the toilet has calmed the guts down for now). At this point, the bowel troubles could start up again. The worst feeling is sitting in class/lecture stuck in by other people while waiting for it to start, knowing that it could come back with a vengeance. Not nice when you're going to be stuck there for 1 hour. Whilst I can go to the toilet and this offers some relief, it doesn't always stop the problem. I can go to the toilet and feel great afterwards, until it comes back again. Other times I can go to the toilet and still be in pain. Truly horrible. The only cure for this problem is to remain at home - Not something that is going to be possible for me.\n\nThankfully my family and friends fully understand what I go through and never rush me. They encourage me and convince me everything's going to be all right. The sad thing is that it doesn't help, my problems don't go away and I continue to experience them on a daily basis.\n\n---\n\n**My Current Stance**\n\nSo right now once I get back up to university, I'm going to go back to the doctors. I've been before but I was going there with the intent to sort out a bowel problem*^3 and didn't place the focus on anxiety which after much reading leads me to believe that is the cause. I hope with this stance and changed approach to my problem that I can get the help I need to overcome my problem.\n\nI find it hard to force myself to attend university classes or group meetings when walking there, sitting there and going back lead to the symptoms I described above. This is wrecking my life and I need it sorting quickly. How can I attend my graduation with this problem? If it's not under control, I will skip it. Travelling to and from university (nearly 3 hours drive) is the bane of my nightmare and I'll be doing this on the upcoming Sunday.\n\n*^3 Was given Mebeverine 135mg as a stomach relaxant. Worked for a while but my worry eventually rendered them useless and the problems persisted. Continued to take it as a way of convincing myself it would help, though I'm not convinced with those efforts.\n\n---\n\n**Where do I place the cause for this?**\n\nBack towards the end of October 2004, I was in school and we were doing a small test in class that was used to assess how we were doing with learning German. Our normal teacher wasn't there and we had another covering for it. I sat there in pain, really needing the toilet - Yet I didn't ask until I really had to go and that I couldn't hold out until the end of class. My request to go to the toilet was rejected and I sat there suffering in pain for about 15 minutes before she looked up, saw me looking as white as a sheet and then had the cheek to ask me if I wanted to go to the toilet. She sent someone with me thinking I would faint when I went downstairs. Anyway, I unloaded and completely destroyed the toilet (it was very messy) and then I felt relief. Since then I've had my problems. I blame that woman. She doesn't even know how much she's screwed me up. It makes me so angry.\n\n---\n\n**I ask you:**\n\n- Do you deal with bad bowels as a symptom to your anxiety?\n- If yes or no, doesn't matter, how do you deal with you anxiety, what do you do to push past and through the rough parts of it?\n- Does my symptoms meet the requirements to be considered an anxiety \"attack\"?\n- What kind of anxiety disorder would you put this down to? (8 years of suffering when the same triggers fire makes this hard to believe it can't be a disorder).\n- To those who have gotten help from a doctor, how would you advise me to convey my problems in a way that will stress my urgency? The shitting problems need to go and they need to go very soon.\n\n---\n\nThank you if you took the time to read any of this giga-post. It feels good to get it off my chest.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Suffered with Anxiety for 8 years without help, anxiety causes bowel problems, bowel problems cause anxiety - looking for advice.",
            "url": "http://www.reddit.com/r/Anxiety/comments/10g0fy/help_suffered_with_anxiety_for_8_years_without/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1348660610,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10i3c1/if_anxiety_is_fear_and_fear_is_not_understanding/",
            "gilded": 0,
            "id": "10i3c1",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10i3c1/if_anxiety_is_fear_and_fear_is_not_understanding/",
            "retrieved_on": 1413544486,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "I've almost certainly got some sort of anxiety disorder, though I can't know for sure since I've been unable to communicate my problems with my doctor. I'm 25 and I've been dealing with these problems since I was about 10 or 11. Every time I go to the doctor I feel hopeful and leave disappointed and hopeless. \n\nI have some paranoia about it, I think that the doctor is not treating me because he works for the state (I'm in Canada) and they want me to die because I'm not productive. My parents deny that there's anything wrong with me and have always dissuaded me from seeking help. \"You just need a job\" is their answer for everything. I've had jobs, they don't last very long. I can work, I would work but it's pointless if I'm just going to be a fearbag and lose the job anyways.\n\nI'm about an hour away from calling for my first doctor's appointment in over a year. I don't want it to be like all the other times. If I leave there again unsatisfied I don't think I'll ever make it back. I'm 6'2, 130 pounds and dropping. I try to shop at the market but often walk by because I don't want to interact with the vendors. \n\nOther things too. I don't want to be institutionalized. My thoughts are chaotic. \n\nI don't really believe that my doctor is conspiring against me, I'm aware that this is probably/definitely not the case. They're just paranoid thoughts that I can come close to believing but I never really lose sight of what the truth probably is. \n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If anxiety is fear and fear is not understanding, is knowledge/education the cure for anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/10i3c1/if_anxiety_is_fear_and_fear_is_not_understanding/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1348782094,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10l2kv/dae_get_really_watery_red_eyes_for_no_reason_23f/",
            "gilded": 0,
            "id": "10l2kv",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10l2kv/dae_get_really_watery_red_eyes_for_no_reason_23f/",
            "retrieved_on": 1413540369,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "My eyes have been watering a lot lately. Today I was at the store with a friend and they started watering horribly and once I got home started turning really red. I would say allergies, but they dont itch at all. My eyes have been feeling strained and weird lately with headaches behind them ever since I had a bad reaction to Paxil which included my pupils being fully dilated for almost 24 hrs. I dont know if its anxiety or what but its starting to GIVE me anxiety. I need to wait for my insurance card to get to an eye doctor.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get really watery red eyes for no reason? 23/f",
            "url": "http://www.reddit.com/r/Anxiety/comments/10l2kv/dae_get_really_watery_red_eyes_for_no_reason_23f/",
            "user_reports": []
        },
        {
            "author": "hiiiheather",
            "author_created_utc": 1343262420,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8gb5k",
            "created_utc": 1348639867,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10hu11/how_can_you_cope_with_anxiety_and_change_negative/",
            "gilded": 0,
            "id": "10hu11",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10hu11/how_can_you_cope_with_anxiety_and_change_negative/",
            "retrieved_on": 1413544821,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "The biggest lesson I need to fully learn, and actually keep in mind, is that worrying serves no purpose. I have let senseless worrying affect my mental health and behaviors. This stress is taking its toll on me and I have to get this under control before I collapse. It's so hard to know where to start and hard to change the negative way I've been thinking. I don't mean to think negatively, it's just that I let things get to me that shouldn't. Like getting aggravated with customers at work and angry at a car that I think is driving too close. I want to get a grip on this, be healthy, stop smoking, exercise, do well in school and work without letting myself get overwhelmed. \n\nWhere can I even start? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How can you cope with anxiety and change negative thinking?",
            "url": "http://www.reddit.com/r/Anxiety/comments/10hu11/how_can_you_cope_with_anxiety_and_change_negative/",
            "user_reports": []
        },
        {
            "author": "newtopic",
            "author_created_utc": 1313701231,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ovkd",
            "created_utc": 1348342358,
            "domain": "youtu.be",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10b5kp/made_this_video_in_the_hopes_those_with/",
            "gilded": 0,
            "id": "10b5kp",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "TopicSimple",
                    "author_url": "http://www.youtube.com/user/TopicSimple",
                    "description": "A brief introduction to Generalized Anxiety Disorder, or GAD. Video by Topic Simple (http://www.topicsimple.com)",
                    "height": 338,
                    "html": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/IaPN9KQoYbs?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i2.ytimg.com/vi/IaPN9KQoYbs/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "What is Generalized Anxiety Disorder?",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=IaPN9KQoYbs",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtu.be"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"600\" height=\"338\" src=\"http://www.youtube.com/embed/IaPN9KQoYbs?fs=1&amp;feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10b5kp/made_this_video_in_the_hopes_those_with/",
            "retrieved_on": 1413553852,
            "score": 12,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/HLsVIH1_aiuZmtRc.jpg",
            "title": "Made this video in the hopes those with Generalized Anxiety Disorder could get help sooner than I did...",
            "url": "http://youtu.be/IaPN9KQoYbs",
            "user_reports": []
        },
        {
            "author": "scount15",
            "author_created_utc": 1343626196,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8hy5p",
            "created_utc": 1348371064,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10bt51/smoking_marijuana_and_anxiety/",
            "gilded": 0,
            "id": "10bt51",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10bt51/smoking_marijuana_and_anxiety/",
            "retrieved_on": 1413552950,
            "score": 12,
            "secure_media_embed": {},
            "selftext": "I can't be the only one that has some experiences/stories with this combination.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Smoking Marijuana and Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/10bt51/smoking_marijuana_and_anxiety/",
            "user_reports": []
        },
        {
            "author": "meglet",
            "author_created_utc": 1146075643,
            "author_flair_css_class": "",
            "author_flair_text": "GAD, MDD, it runs in the fam",
            "author_fullname": "t2_50dp",
            "created_utc": 1348431448,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10ctja/im_going_to_visit_some_dear_old_friends_i_havent/",
            "gilded": 0,
            "id": "10ctja",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10ctja/im_going_to_visit_some_dear_old_friends_i_havent/",
            "retrieved_on": 1413551590,
            "score": 11,
            "secure_media_embed": {},
            "selftext": "We were all best friends in high school (Class of '99) but have grown apart. One girl lives across the country, one lives *in my same part of town* but has a toddler and we've just never reconnected after college.\nBut we're the type to be comfortable falling back into friendship and we'll be friends forever no matter how long we go without communicating. \n\nAll we're doing is spending a few hours catching up at the mother's house of the out-of-town girl and seeing her baby! Yeah her Dad just *just* died but I was one the family called when they needed babysitting help during the final days of their father's illness. I was fine then. I can handle death; I've witnessed it, held my grandmother's hand and talked her through it. So that's not my problem.\n\nOne friend is coming at 5 to pick me up, so I'm now in Cowntdown Obsession Mode, where I watch time run out as I panic. Even though I KNOW I WILL HAVE FUN the thought of leaving my bed is crippling me. I'm making myself sick and wasting an entire day because there's something unusual on the schedule at 5. Any advice? Please?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm going to visit some dear old friends I haven't seen in years. I am panicked because I am now in Countdown Mode. I'm being picked up at 5. I'm curled in a ball in tears with my dog pawing at me whining and I just snapped at her. How do I get through the anxiety of the Countdown?",
            "url": "http://www.reddit.com/r/Anxiety/comments/10ctja/im_going_to_visit_some_dear_old_friends_i_havent/",
            "user_reports": []
        },
        {
            "author": "throwawaysev",
            "author_created_utc": 1348603684,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_94fce",
            "created_utc": 1348604393,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10gv8l/im_afraid_of_therapy_but_i_know_that_i_need_it/",
            "gilded": 0,
            "id": "10gv8l",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10gv8l/im_afraid_of_therapy_but_i_know_that_i_need_it/",
            "retrieved_on": 1413546086,
            "score": 11,
            "secure_media_embed": {},
            "selftext": "I decided to read the FAQ and found the self-rating scales, they both said I probably have severe anxiety (big fucking surprise). I know that they aren't a psychiatrists and can't diagnose me, but I guess I just wanted to be told that my level of anxiety was normal for someone or I'm not a hypochondriac or something, I don't know.\n\n\nI'm pretty convinced that I have a few mental health issues, but I don't really know how to get confirmation or help. I literally freeze up when I try to talk to people, or I have a break down and then cry more because I hate crying in front of people. My parents tried to get me help when I was a kid, but I froze up and they never took me back, they probably saw it as a waste of money knowing them. I also don't want to be get diagnose and prescribed meds and have frequent appointments, because my parents are guaranteed to find out since I'm on their insurance. I don't want them to know, but I also don't want to wait until I'm completely on my own, I'm in my early 20s and this has been an issue for as long as I can remember and I just want to be happy.\n\n\nI keep forcing myself into situations to try to force fix my anxiety (leadership positions, open mic nights, etc.) but all it does it make me feel worse when I don't do as well as I wanted to. I don't really know what else to say, I don't know what to do.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm afraid of therapy, but I know that I need it. [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/10gv8l/im_afraid_of_therapy_but_i_know_that_i_need_it/",
            "user_reports": []
        },
        {
            "author": "anxi-throwaway",
            "author_created_utc": 1348258778,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_930g6",
            "created_utc": 1348259114,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/109l1r/help_me_im_supposed_to_be_at_a_party_but_i_feel/",
            "gilded": 0,
            "id": "109l1r",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/109l1r/help_me_im_supposed_to_be_at_a_party_but_i_feel/",
            "retrieved_on": 1413556039,
            "score": 10,
            "secure_media_embed": {},
            "selftext": "I've been dreading this for weeks since I heard about this. Kept telling myself I would go but now I really dont want to. But I know people will be let down if I dont.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Help me. I'm supposed to be at a party but I feel weak and like i'm gonna be sick.",
            "url": "http://www.reddit.com/r/Anxiety/comments/109l1r/help_me_im_supposed_to_be_at_a_party_but_i_feel/",
            "user_reports": []
        },
        {
            "author": "themetz",
            "author_created_utc": 1321165409,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_68fsg",
            "created_utc": 1348420226,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/10cixv/help_how_do_you_stop_obsessing_about_anxiety/",
            "gilded": 0,
            "id": "10cixv",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/10cixv/help_how_do_you_stop_obsessing_about_anxiety/",
            "retrieved_on": 1413551979,
            "score": 10,
            "secure_media_embed": {},
            "selftext": "I feel like I spend almost all of my time \"checking\" to see if I am anxious, if anxiety is increasing, if anything is going to cause it to increase, etc. It's like the continuous monitoring of my anxiety disorder has taken over my life, even when I am experiencing none or mild anxiety. My mind is almost never off of it. It is my first thought when I wake up, and my last thought when I go to bed. What do other people do to just get your minds off of it? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[HELP] How do you stop obsessing about anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/10cixv/help_how_do_you_stop_obsessing_about_anxiety/",
            "user_reports": []
        }
    ]
}