{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347422921,
            "domain": "self.Anxiety",
            "edited": 1347474739,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zr09m/brought_myself_down_from_panic_today_internet/",
            "gilded": 0,
            "id": "zr09m",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zr09m/brought_myself_down_from_panic_today_internet/",
            "retrieved_on": 1413583735,
            "score": 117,
            "secure_media_embed": {},
            "selftext": "I've been on the job market after getting fired in August and it's been awful. I had a severe panic attack before a job interview last week but today I had another interview and I stayed totally on point! \n\nMy anxiety had been really high all day but I didn't have a panic attack, vomit, or act like an idiot. I managed to breathe my way through it and actually do quite well in the interview. Yay! I'm so happy with myself",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Brought myself down from panic today! Internet high five!",
            "url": "http://www.reddit.com/r/Anxiety/comments/zr09m/brought_myself_down_from_panic_today_internet/",
            "user_reports": []
        },
        {
            "author": "kezzie87",
            "author_created_utc": 1327968648,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6sozz",
            "created_utc": 1347393486,
            "domain": "wilwheaton.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zq4sc/wil_wheaton_on_depression_and_anxiety_xpost_from/",
            "gilded": 0,
            "id": "zq4sc",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zq4sc/wil_wheaton_on_depression_and_anxiety_xpost_from/",
            "retrieved_on": 1413585061,
            "score": 107,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/My6yFUxJ1l05ooni.jpg",
            "title": "Wil Wheaton on depression and anxiety [x-post from r/geek]",
            "url": "http://wilwheaton.net/2012/09/depression-lies/",
            "user_reports": []
        },
        {
            "author": "crf10",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347240211,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zmoos/xpost_from_rimages_pooh_bears_wisest_words_of/",
            "gilded": 0,
            "id": "zmoos",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zmoos/xpost_from_rimages_pooh_bears_wisest_words_of/",
            "retrieved_on": 1413590042,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/2oVbIOh88lE6Gvb_.jpg",
            "title": "x-post from /r/images: Pooh Bear's wisest words of encouragement, of friendship and of love. ",
            "url": "http://imgur.com/ZFwVo",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347329754,
            "domain": "self.Anxiety",
            "edited": 1347417617,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zoqtj/randall_munroe_hits_the_nail_on_the_head_with/",
            "gilded": 0,
            "id": "zoqtj",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zoqtj/randall_munroe_hits_the_nail_on_the_head_with/",
            "retrieved_on": 1413587069,
            "score": 66,
            "secure_media_embed": {},
            "selftext": "For a lot of us, ADHD and anxiety are intertwined.\n\n\nImgur hotlink: http://i.imgur.com/EDHUM.png\n\nAlt text:\n&gt;20 balloons float away while I'm busy permanently tying one to a tree to deal with it for good. Unfortunately, that one balloon was 'land a rocket on the moon in Kerbal Space Program'.\n\nPermalink to the comic: http://xkcd.com/1106/\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Randall Munroe hits the nail on the head with today's comic.",
            "url": "http://www.reddit.com/r/Anxiety/comments/zoqtj/randall_munroe_hits_the_nail_on_the_head_with/",
            "user_reports": []
        },
        {
            "author": "Mind101",
            "author_created_utc": 1308769745,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ev00",
            "created_utc": 1347137196,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zkkgb/why_the_hell_am_i_almost_paralyzed_with_fear/",
            "gilded": 0,
            "id": "zkkgb",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zkkgb/why_the_hell_am_i_almost_paralyzed_with_fear/",
            "retrieved_on": 1413592999,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "This is a trait of mine I am really pissed at. I see every single obstacle thrown before me as insurmountable, stress out over it, and have the terrible feeling of my gut wrenching whenever i think about stuff needing to get done. Then i start working on it, or external circumstances force me to, and lowly but steadily shit gets done, almost always in a manner that is (more than) satisfactory. \n\nWhy can't i use the overwhelming amount of proof and first hand experience at doing something to alleviate the stress and anxiety brought on by new challenges? I really wish i could turn the \"oh crap i am doomed\" attitude into \"well, you've done it before, you'll just have to do it again.\"\n\nDAE know what I'm talking about / have any advice on this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Why the hell am i almost paralyzed with fear every time some new thing has to be done, even though the majority of past similar experiences turned out well?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zkkgb/why_the_hell_am_i_almost_paralyzed_with_fear/",
            "user_reports": []
        },
        {
            "author": "buttcircus",
            "author_created_utc": 1208837012,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_34rfs",
            "created_utc": 1347285182,
            "domain": "self.Anxiety",
            "edited": 1347320308,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/znhxv/how_i_completely_rid_myself_of_crippling_anxiety/",
            "gilded": 0,
            "id": "znhxv",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/znhxv/how_i_completely_rid_myself_of_crippling_anxiety/",
            "retrieved_on": 1413588882,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "Hi!\n \nHere is my backstory:\n \nAt around 15, I began to experience anxiety, mainly in social situations. Also, I got in a series of car wrecks that left me very anxious. Around this time I began seeing a therapist and a couple years later I began meds. But nothing helped that much.\n \nThe problem grew and by college I was avoiding people as much as possible. Eye contact was a nightmare. I wasn’t even comfortable looking at my family. Speaking in class was out of the question. And I would get anxious in cars and sometimes I'd just freak myself out while alone.\n \nWell, from ages 15-30 I struggled terribly. I'm sure you're familiar with this story. It ruined my social life and my academic career. I couldn't hold a job. The few I had, I would sometimes have to hide in the bathroom, I’d perform tasks poorly, and ultimately I would just quit showing up. I would usually make up some convoluted excuse that I would leave on their answering machines, then never speak to them again.\n \nOver these 15 years, I was on a total of 19 drugs. From Klonopin to Zoloft to Seroquel and Geodon. And saw nearly as many psychologists and psychiatrists. On more than one occasion I showed up at the ER, just wanting the anxiety and confusion to end. I’d get an MRI, which of course showed nothing, and other times I was given referrals to more Psychiatrists. Nothing worked. So, you get the idea.\n \nThen, 16 months ago, I went through \"enlightenment\". It is silly useless word, but that's what people call it.\n \nHere's how:\nI downloaded the audio version of Eckhart Tolle's *The Power Of Now*.\nI listened to it over and over again. Despite the occasional unappealing New Agey phrase (i.e., \"I have lived with several Zen masters, all of them cats. Or \"You are sitting on your own box of gold.\" Oh, and he mentions Jesus (as a Zen master).  Jesus doesn’t freaking matter here, so hopefully that’s not too big of a distraction. Anyways, I knew that Tolle was pointing to a deep truth.\n \n**So, here's basically the change required:**\n \n**Learn to observe your mind**. For instance, think of your mother or job (or what/whoever). \"See\" with your mind the emotions and/or thoughts that are evoked by bringing you mother up. This “seeing” part of your brain is what we’re concerned with. \n \nNow stop thinking. And wait and see what the next thought will be to pop up in your brain.  It is *this* neurobehavior that you want to execute. Always be watching your thinking brain with your consciousness.  Try not to make any judgments or analyses, as those are themselves, thoughts.\n\nAfter a while, it took about 6 weeks for me, you will come to the point where you can \"see\" every thought you make, and **you will be able to stop thinking whenever you want and for as long as you want**.\n \nAnd here are two things that can help this process:\n \n1. Realize deeply that it is literally always Now. This isn't meant to evoke a hippy attitude or make a philosophical statement; it's just an objective truth.\n \n2. Feel your body as a whole from within. That may sound hippyish, but it has a grounding effect that keeps all of your attention from flying right up and into your head.\n \n \n \nTolle makes many metaphysical extrapolations from this shift in consciousness, but please don’t let that be a distraction for you. Your only responsibility in this is to adopt this neurobehavior I have described.\n \n \nAnd so here’s what happened to me: I came out of my disorder 100%. Of course I can get apprehensive here and there, but that’s just human. And I’ve had some challenges to figure out along the way. But haven’t felt whole like this since I was a child. And socializing and working are no problem. I don’t take meds nor do I see a therapist. I won’t go on and on about my transformation, but hopefully this will help some of you, as I know very well the horrors of a mind out of control.\n\ntl;dr - Had a lot of anxiety, now I have none. Observing your thinking brain is the way out.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How I completely rid myself of crippling anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/znhxv/how_i_completely_rid_myself_of_crippling_anxiety/",
            "user_reports": []
        },
        {
            "author": "kwDL428",
            "author_created_utc": 1345398171,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8pxpv",
            "created_utc": 1347494980,
            "domain": "self.Anxiety",
            "edited": 1347940168,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zsmhq/help_does_anyone_else_have_really_bad_anxiety/",
            "gilded": 0,
            "id": "zsmhq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zsmhq/help_does_anyone_else_have_really_bad_anxiety/",
            "retrieved_on": 1413581240,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "I've been having some anxiety for about the last month and it all started after I moved to a different state to go to school. I really just felt that I was having trouble adjusting and that it would go away, but it hasn't yet. My boyfriend goes to school in the area too, but I started before him so we were apart for about a month. I thought that as soon as he got here everything would be a lot better, but I'm still having anxiety, especially in the morning. \n\nAt first i was anxious about the move, whether i made the right decision, etc., and missing my boyfriend. Recently it changed to me being anxious about my college classes, but now I seem to be anxious for no reason. \nThe last 3 days I've woken up feeling sick to my stomach and actually did get mildly sick. I thought it was because of a test I had Tuesday, but this morning I still felt sick. Even this afternoon when I woke up from a nap, I felt incredibly anxious for honestly no reason. \n\nI don't understand what's going on and why I can't seem to get rid of this. \nAnyone have any of the same experiences or advice? \nThanks.\n\nUPDATE: I just wanted to tell you guys that the past 5 days have been way better. The drinking more water idea has really been helping me, and so has just trying to stay as positive as I can all day. \nThank you guys so much for your support! I never expected to get so many replies for this. \nI hope the others suffering from this get some relief soon as well!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Does anyone else have really bad anxiety after waking up in the morning or from a nap?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zsmhq/help_does_anyone_else_have_really_bad_anxiety/",
            "user_reports": []
        },
        {
            "author": "Mo3",
            "author_created_utc": 1281251919,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_48mg3",
            "created_utc": 1347540426,
            "domain": "self.Anxiety",
            "edited": 1347541002,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zti8b/fish_oil_is_fucking_amazing/",
            "gilded": 0,
            "id": "zti8b",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 51,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zti8b/fish_oil_is_fucking_amazing/",
            "retrieved_on": 1413579855,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "Supplements work differently for everyone else, but maybe it helps someone!\n\n\nI bought fish oil capsules this morning (they're $6 for 100 capsules here) and took two. And over the course of only 3-4 hours, the constant anxious and nervous feeling went away. COMPLETELY. I can't fucking believe it - I've been living with this shit for 2 months now and it's just gone, like that. My old, familiar, slightly happy and relaxed permanent feeling has returned and it just feels sooo good. I took the car to get lunch for a few coworkers and myself a few minutes ago. I wasn't anxious even for a second. And I'm incredibly motivated. SO MUCH TO DO, SO LITTLE TIME.\n\n\nTry it, guys, maybe it will help someone to live again :)) Any Omega-3 oils will do, I have salmon oil capsules.\n\n\nHere's an article about it\n\nhttp://www.livestrong.com/article/449250-fish-oil-for-treating-depression-and-anxiety-disorder/",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "FISH OIL IS FUCKING AMAZING.",
            "url": "http://www.reddit.com/r/Anxiety/comments/zti8b/fish_oil_is_fucking_amazing/",
            "user_reports": []
        },
        {
            "author": "norrisiv",
            "author_created_utc": 1325474920,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6k8fd",
            "created_utc": 1347588540,
            "domain": "self.Anxiety",
            "edited": 1347635060,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zutf5/i_see_your_fish_oil_and_raise_you_running/",
            "gilded": 0,
            "id": "zutf5",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zutf5/i_see_your_fish_oil_and_raise_you_running/",
            "retrieved_on": 1413577803,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "I've had a really bad bout of anxiety these past few weeks. I can only guess why, but I have recently put in my two weeks at work for a new job, and I felt terrible about leaving all of my co-workers behind. The two weeks flew by in a terrible anxiety induced haze, but this week after my last day I bought a pair of running shoes and started running for the first time in probably 10 years and I've felt amazing since. Things were ~~a little better~~ really tough after the first run, but the best part has always come near the end of my sessions when the adrenaline has been flowing for a while. The anxiety crept back after a quick shower after the first run BUT was the best it had ever been. Slowly but surely it has dissipated after about a week. \n\nI'm not saying that exercise is the complete solution, I know that anxiety happens for different reasons, but it sure as hell doesn't hurt to try if you are physically able. I was inspired by [r/running](http://www.reddit.com/r/running), and I'd recommend checking out their beginner FAQ if you're interested. I'm doing the \"from your couch to 5K in nine weeks\" program, and while it was tough to start, it was well worth it, and I look forward to exercising on my running days now!\n\nAgain, I know that there isn't a cure all solution for anxiety, but I know how much it sucks and I wanted others to know what has helped me lately. \n\nEDIT: Thanks for sharing your experiences, everyone!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I see your fish oil and raise you... RUNNING!",
            "url": "http://www.reddit.com/r/Anxiety/comments/zutf5/i_see_your_fish_oil_and_raise_you_running/",
            "user_reports": []
        },
        {
            "author": "shallah",
            "author_created_utc": 1220919695,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_38lau",
            "created_utc": 1347216135,
            "domain": "cci.health.wa.gov.au",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zm1rr/generalised_anxiety_mindfulness_information/",
            "gilded": 0,
            "id": "zm1rr",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zm1rr/generalised_anxiety_mindfulness_information/",
            "retrieved_on": 1413590946,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Generalised Anxiety &amp; Mindfulness: Information &amp; Worksheets -Centre for Clinical Interventions (CCI)",
            "url": "http://www.cci.health.wa.gov.au/resources/minipax.cfm?mini_ID=21",
            "user_reports": []
        },
        {
            "author": "vaguenotions",
            "author_created_utc": 1344567426,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8md26",
            "created_utc": 1347382407,
            "domain": "yourfaceismelting.blogspot.ca",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zpslh/comic_about_depression_and_anxiety/",
            "gilded": 0,
            "id": "zpslh",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zpslh/comic_about_depression_and_anxiety/",
            "retrieved_on": 1413585558,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/x1N6tO938RGtdJfU.jpg",
            "title": "Comic about Depression and Anxiety",
            "url": "http://yourfaceismelting.blogspot.ca/2012/08/blog-post_8752.html",
            "user_reports": []
        },
        {
            "author": "hamcheesetomato",
            "author_created_utc": 1345369267,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8pujv",
            "created_utc": 1347377774,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zpnmh/how_do_you_stop_worrying_and_over_thinking_before/",
            "gilded": 0,
            "id": "zpnmh",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 64,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zpnmh/how_do_you_stop_worrying_and_over_thinking_before/",
            "retrieved_on": 1413585770,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "Heres my typical scenario: It's dark and quiet everywhere, alone in bed, have to get up in 6-7 hours and get ready to work. I didn't drink coffee, I took a nice shower, I'm very tired, I will surely fall asleep soon. \n\nNo, I won't. During the night I will keep trying to relax, play white noise, think about fluffy cute pets, think about how good my next day will be, how I love my work, how good the life is..\n\nNo use. Some idiotic memories will come back. I feel embarrassed. Them I remember about my current relationship problems, my partner is not with me now, I miss him so fucking much, I start crying. Then I think about the future, I can only afford to save 5-10% of my salary, and I need to save 20% each month, what if I lose my job. What my partner will break up with me, what am I going to live for without him. What if he had an accident? What if he's dead???? It's 3am, I cant text or call him and wake him up. I have to wait until morning. What if he's dead. Crying again.\n\nI'm the most pathetic person ever. I can't control my sleep. I have nightmares quite often, it doesn't help. \n\nI'm not on any medication, I'm willing to fight these thoughts on my own-please, if you can advise any method of how to fight with them, help me. I work in the coastguard, very often I would have to stay awake whole night - my sleep pattern is fucked up and I'm meant to learn how to fall asleep whenever possible, to regenerate. But I fail to do so, usually I don't get sleep for 1 whole night, and then next few - just 3-4 hours each night. And then on days off I sleep 7-8 max. It's not enough. I'm exhausted.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you stop worrying and over thinking before falling asleep? (without medication)",
            "url": "http://www.reddit.com/r/Anxiety/comments/zpnmh/how_do_you_stop_worrying_and_over_thinking_before/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347132677,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zkg8z/how_the_hell_am_i_going_to_get_a_job_i_can_barely/",
            "gilded": 0,
            "id": "zkg8z",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zkg8z/how_the_hell_am_i_going_to_get_a_job_i_can_barely/",
            "retrieved_on": 1413593150,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I hate talking to people, I never known what to say. \n\nI don't know how I'll ever get a job, let alone go for a job interview. This thought causes even more anxiety. \n\nDo any of you guys work from home? How is that working out?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How the hell am I going to get a job? I can barely survive school...",
            "url": "http://www.reddit.com/r/Anxiety/comments/zkg8z/how_the_hell_am_i_going_to_get_a_job_i_can_barely/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347578672,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zujpo/has_anyone_selfmedicated_using_alcohol/",
            "gilded": 0,
            "id": "zujpo",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zujpo/has_anyone_selfmedicated_using_alcohol/",
            "retrieved_on": 1413578210,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "What are your experiences? Would a shot or two before bed be that bad for me...?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Has anyone self-medicated using alcohol?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zujpo/has_anyone_selfmedicated_using_alcohol/",
            "user_reports": []
        },
        {
            "author": "gmailfacebooknetflix",
            "author_created_utc": 1347061062,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8xurt",
            "created_utc": 1347061257,
            "domain": "marc.ucla.edu",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zj5pr/awesome_and_free_guided_meditations/",
            "gilded": 0,
            "id": "zj5pr",
            "is_self": false,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zj5pr/awesome_and_free_guided_meditations/",
            "retrieved_on": 1413595256,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/x1J_YyWJEmeCC_u2.jpg",
            "title": "Awesome and free guided meditations",
            "url": "http://marc.ucla.edu/body.cfm?id=22",
            "user_reports": []
        },
        {
            "author": "EnglishT",
            "author_created_utc": 1314561458,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qtmc",
            "created_utc": 1347201475,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zlpcq/hunger_anxiety_anyone_else/",
            "gilded": 0,
            "id": "zlpcq",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zlpcq/hunger_anxiety_anyone_else/",
            "retrieved_on": 1413591420,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "To give a brief background, I'm a 21 year old male and I've had anxiety/panic since around the age of 14. I mainly have health anxiety but that branched into others like social anxiety and agoraphobia. \n\nThankfully, my anxiety is stable much more these days thanks to counselling and self help. \n\nHowever, I've always had a high amount of anxiety in terms of being hungry. It stems from having a fear of passing out. \n\nWhen I eat, 2-3 hours later I'll feel starving hungry and I'll start to shake, feel anxious, have palpitations... Pretty much all the usual symptoms of low blood sugar. I've had a fasting blood test and my results were in the normal range so I always put down my hunger symptoms to anxiety.\n\nI have to plan my days purely on when I'm going to eat next, making sure I eat every 2-3 hours in order to be sure my blood sugar won't crash low enough to make me pass out.\n\nI'm more worried about this lately because I start a new job tomorrow and I'll have to go 5 hours without eating after lunch, I know this may sound really petty to most of you but it scares me because right now all my anxiety is based around me thinking I'll pass out because of how hungry I get and how I get all the horrible hunger symptoms.\n\nCan anyone with anxiety relate to this? :(\n\nCheers",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hunger anxiety. Anyone else?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zlpcq/hunger_anxiety_anyone_else/",
            "user_reports": []
        },
        {
            "author": "justliketheother",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347057234,
            "domain": "self.Anxiety",
            "edited": 1347077523,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zj1xy/should_i_turn_in_a_doctors_note/",
            "gilded": 0,
            "id": "zj1xy",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zj1xy/should_i_turn_in_a_doctors_note/",
            "retrieved_on": 1413595399,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "Last night I had a panic attack, ending up in the ER until about 3AM. I got home and slept until about 2 today. Missing my college classes, two of them smaller and take attendance. I'll still have some days I can miss without excuses, but I also have a note from the ER.\n\nShould I give the ER note to my professors to have it excused?\n\nI kinda don't want them to know about it, but I also don't want to have a problem with the absence limit later.\n\nEDIT: I sent out an email letting them know, and that I can bring in a note Monday. Hopefully it all works out?\nThanks everyone",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Should I turn in a doctors note?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zj1xy/should_i_turn_in_a_doctors_note/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347053739,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ziyi6/i_cried_while_asking_for_help_today_because_i_was/",
            "gilded": 0,
            "id": "ziyi6",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ziyi6/i_cried_while_asking_for_help_today_because_i_was/",
            "retrieved_on": 1413595524,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "So I have been struggling to learn recent lessons in math lately. When I finally got the courage to ask my teacher for help, I started crying. I didn't mean to, it just came. To be more specific, how can I stop myself from crying and how can I calm down in stressful situations - especially in public?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I cried while asking for help today because I was so afraid of feeling stupid. How can I become less sensitive?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ziyi6/i_cried_while_asking_for_help_today_because_i_was/",
            "user_reports": []
        },
        {
            "author": "8nate",
            "author_created_utc": 1330461645,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_71jmw",
            "created_utc": 1347158998,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zl36o/does_anyone_else_feel_in_college_hate_partying/",
            "gilded": 0,
            "id": "zl36o",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zl36o/does_anyone_else_feel_in_college_hate_partying/",
            "retrieved_on": 1413592274,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "I'm a freshman at a small state school. Obviously, I also suffer from anxiety and depression. It feels like the only thing to do around here for fun is to go to house parties. The only problem is that I absolutely hate them. I went to two, and felt absurdly uncomfortable, and left minutes after I arrived. I just want to hang out with a few cool people and play video games and stuff, but it just seems like no one does that here. I feel like I'm going to become withdrawn and antisocial again just like in high school. DAE feel this way in college?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel in college hate partying?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zl36o/does_anyone_else_feel_in_college_hate_partying/",
            "user_reports": []
        },
        {
            "author": "steph1cleveland",
            "author_created_utc": 1333509296,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7cnih",
            "created_utc": 1347493961,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zslfo/starting_therapy_again_but_im_scared_of_going/",
            "gilded": 0,
            "id": "zslfo",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zslfo/starting_therapy_again_but_im_scared_of_going/",
            "retrieved_on": 1413581281,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "So it's been about a year since I've had any form of therapy for my anxiety/depression this Friday I'm going back, and quite frankly this terrifies me. I will be seeing the same doctor that I saw a year ago, but the thing is I kind of just quit going because I was \"fine now\". This is playing into my fear of going back for some reason I'm scared he is going to hate me and be rude to me (it's an irrational fear I know). I'm fully committed to the processes this time, but my anxiety is in full blown \"RED FLAG\" mode about getting the ball rolling.  Do you guys have any advice or techniques that you use to ease your anxiety in this type of situation?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Starting therapy again but I'm scared of going back. Does anyone have any advice that would help calm my nerves?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zslfo/starting_therapy_again_but_im_scared_of_going/",
            "user_reports": []
        },
        {
            "author": "MsNym",
            "author_created_utc": 1347417358,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8zdy9",
            "created_utc": 1347453516,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zrgv5/can_i_get_some_success_stories/",
            "gilded": 0,
            "id": "zrgv5",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zrgv5/can_i_get_some_success_stories/",
            "retrieved_on": 1413583045,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "Really needing to hear some stories about people who are successfully managing their anxiety, either with or without meds. Just need to feel like there is a light at the end of this tunnel.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Can I get some \"success\" stories?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zrgv5/can_i_get_some_success_stories/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347333352,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zouo8/ranxiety_looking_back_what_is_the_funniest_or/",
            "gilded": 0,
            "id": "zouo8",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zouo8/ranxiety_looking_back_what_is_the_funniest_or/",
            "retrieved_on": 1413586915,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "For me, it was one morning three years ago, I was taking a shower.  I couldn't get out of the shower.   I'm not sure what if anything triggered the anxiety panic attack but my brain just refused to process for me how to get out of the shower.  Perhaps I was afraid I was going to be late for work if I couldn't get out of the shower, and well, for a few minutes, I couldn't get out of the shower.\n\nI mean it's usually really easy to get out of a shower.  I normally turn off the water, and in some order, I grab a towel, open the curtain/door, dry off and step out.  My brain would not process this.  I was in the shower turning in circles with the water still on for several minutes.  I was looking for a way out.  A way to escape the shower so I wouldn't be late, and I freaked out.  After several minutes, I started yelling at myself -- Focus, Focus, Focus, and then my brain was like, duh, this is what you do.  Turn off the water...  And I was free of the shower.    \n\nI had another panic attack a few minutes later trying to get dressed because the anxiety was in full swing.  I picked a shirt out of my closet, set it on my bed, turned back to get pants, and then couldn't find my shirt.  It was on my bed where I had set it down, but my brain was worried about being late and getting dressed, and it wouldn't process that it was right where I left it.  I started to freak.  Other options looking back could have been to pull another shirt out of the closet and put it on immediately, use a dirty shirt in the laundry hamper, or go to the car and get a spare shirt I kept there... but no, I had to find this shirt I had picked out, I couldn't find it right there in front of me, and I freaked out.  Again, I started to yell focus focus focus at myself, calmed down and then I found the shirt, right where I left it on the bed in plain sight.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "r/Anxiety, Looking back, what is the funniest or silliest panic attack you have had from anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/zouo8/ranxiety_looking_back_what_is_the_funniest_or/",
            "user_reports": []
        },
        {
            "author": "aerynjbson",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347607559,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zv88i/dae_have_trouble_doing_breathing_exercises/",
            "gilded": 0,
            "id": "zv88i",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zv88i/dae_have_trouble_doing_breathing_exercises/",
            "retrieved_on": 1413577157,
            "score": 12,
            "secure_media_embed": {},
            "selftext": "Every time I have done/tried a breathing/relaxation exercise that involves even semi focusing on my body. I end up focusing on my heart rate which inevitably going faster and faster till I focus on something external.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE have trouble doing breathing exercises \nbecause they end up focusing on their heartbeat \n( which then starts going faster)",
            "url": "http://www.reddit.com/r/Anxiety/comments/zv88i/dae_have_trouble_doing_breathing_exercises/",
            "user_reports": []
        },
        {
            "author": "rmm45177",
            "author_created_utc": 1273115428,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_41i1k",
            "created_utc": 1347295912,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/znrp1/forgot_my_meds_one_day_and_im_shaking_like_crazy/",
            "gilded": 0,
            "id": "znrp1",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/znrp1/forgot_my_meds_one_day_and_im_shaking_like_crazy/",
            "retrieved_on": 1413588474,
            "score": 11,
            "secure_media_embed": {},
            "selftext": "I'm in school at the moment and I can't stop shaking. I probably look like a drug addict to everyone. I'm on my break right now and I just want to go home.\n\n\nI felt really cold this morning, like I had a hole in my chest. Stupid and tired me decided the best case of action for this was drinking coffee. That warmed me up but now I'm sweating (quite visibly). My pits are drenched and I had to give a presentation in front of my class, which made it worse.\n\n\nNow I'm shaking, sweating, and I don't really feel safe here anymore.\n\n\nI just forgot the medicine one day and its already a disaster.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Forgot my meds one day and I'm shaking like crazy.",
            "url": "http://www.reddit.com/r/Anxiety/comments/znrp1/forgot_my_meds_one_day_and_im_shaking_like_crazy/",
            "user_reports": []
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1347238351,
            "distinguished": "moderator",
            "domain": "self.Anxiety",
            "edited": 1375911434,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/zmmvi/meta_congrats_we_have_10k_users_now_lets_chat/",
            "gilded": 0,
            "id": "zmmvi",
            "is_self": true,
            "media_embed": {},
            "mod_reports": [],
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/zmmvi/meta_congrats_we_have_10k_users_now_lets_chat/",
            "retrieved_on": 1413590113,
            "score": 11,
            "secure_media_embed": {},
            "selftext": "a",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Meta] Congrats! We have 10k users! Now let's chat about downvotes...",
            "url": "http://www.reddit.com/r/Anxiety/comments/zmmvi/meta_congrats_we_have_10k_users_now_lets_chat/",
            "user_reports": []
        }
    ]
}