{
    "data": [
        {
            "author": "abcdefg4",
            "author_created_utc": 1419657621,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kc8nq",
            "created_utc": 1452100245,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zqph5/you_know_you_have_social_anxiety_when_you_say_i/",
            "gilded": 0,
            "id": "3zqph5",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 64,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zqph5/you_know_you_have_social_anxiety_when_you_say_i/",
            "retrieved_on": 1454980995,
            "score": 355,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "You know you have social anxiety when you say 'I hope I did ok' after you've had a conversation with someone.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zqph5/you_know_you_have_social_anxiety_when_you_say_i/"
        },
        {
            "author": "athingnamed",
            "author_created_utc": 1448221945,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_saxoy",
            "created_utc": 1451604128,
            "domain": "athingnamed.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3yyqid/15_ted_talks_on_anxiety_fear_and_mental_wellness/",
            "gilded": 1,
            "id": "3yyqid",
            "is_self": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3yyqid/15_ted_talks_on_anxiety_fear_and_mental_wellness/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "TsPtwt-o25lcIHChQatBrnz4ma1Tnzv45zgAMea_dF0",
                        "resolutions": [
                            {
                                "height": 108,
                                "url": "https://i.redditmedia.com/lfhkCaQjDhnY6YrWdjbK_IOQ-6KaPRRGSxJLsgd-W1Y.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=26d0d031d7adffaaba71f7a5474f475c",
                                "width": 108
                            },
                            {
                                "height": 216,
                                "url": "https://i.redditmedia.com/lfhkCaQjDhnY6YrWdjbK_IOQ-6KaPRRGSxJLsgd-W1Y.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=e5378bb2ee1464fd2aa3950fe1bc4638",
                                "width": 216
                            },
                            {
                                "height": 320,
                                "url": "https://i.redditmedia.com/lfhkCaQjDhnY6YrWdjbK_IOQ-6KaPRRGSxJLsgd-W1Y.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=75f62c3c9be08df0422107209850e352",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 627,
                            "url": "https://i.redditmedia.com/lfhkCaQjDhnY6YrWdjbK_IOQ-6KaPRRGSxJLsgd-W1Y.jpg?s=67d4339845e96eae0cddd694a97d154b",
                            "width": 627
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1454965128,
            "score": 326,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/A1hBLaCdKFMO5t8l5-m7MOfYx7lLKxQLAEw9brr0QeU.jpg",
            "title": "15 TED talks on anxiety, fear, and mental wellness that I’ve found inspiring",
            "url": "http://athingnamed.com/best-ted-talks-on-anxiety-stress-and-fear/"
        },
        {
            "author": "sciencelabrador",
            "author_created_utc": 1432662837,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nq7pw",
            "created_utc": 1451690689,
            "domain": "self.Anxiety",
            "edited": 1451749942,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3z2ltz/anyone_else_strangely_calm_in_actual_emergencies/",
            "gilded": 0,
            "id": "3z2ltz",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 96,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3z2ltz/anyone_else_strangely_calm_in_actual_emergencies/",
            "retrieved_on": 1454967004,
            "score": 302,
            "secure_media_embed": {},
            "selftext": "I have social and generalized anxiety, and I usually jump to the absolute worst conclusions. (ex. if my mom is ten minutes late picking me up, she was in a wreck and died.) But lately \ni've noticed that when actually bad things happen, I'm suddenly calm and rational, generally that would be good, but it makes me feel emotionless. Like when my mom was in the hospital, I cried once. When her blood sugar drops, I kind of flatline and make her a sandwich, help her check it, etc. does anyone else experience this? I am taking buspirone, if that helps.\n\nEDIT: obligatory \"wow this blew up!\" I'm glad a ton of other people experience this too, and I like hearing your stories! While I'm not sure I'd do as well as some of you in the crazy emergencies you've been in, I can only hope I would.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else strangely calm in actual emergencies?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3z2ltz/anyone_else_strangely_calm_in_actual_emergencies/"
        },
        {
            "author": "bentley00",
            "author_created_utc": 1344972098,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8o34g",
            "created_utc": 1451797132,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3z8j8c/fuck_social_anxiety_this_is_going_to_be_the_year/",
            "gilded": 0,
            "id": "3z8j8c",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3z8j8c/fuck_social_anxiety_this_is_going_to_be_the_year/",
            "retrieved_on": 1454969770,
            "score": 219,
            "secure_media_embed": {},
            "selftext": "TLDR; anxiety has caused my loneliness, body dismorphia disorder, depression and now suicidal thoughts\n\nOver the last 3ish years social anxiety has been creeping up on me, and before I realized it, it was too late.  \n\nFrom the outside, you'd think I'd be pretty content, I'm above average in looks (I think), my boss loves me and I do very well in school. I have a great family life, I live in the upper middle class and I'm in good health.\n\nUnfortunately, my social life is absolute shit. I've never had a girlfriend, or even kissed a girl. I don't have any real friends anymore ,just classmates I hang around at school so people don't think I'm a loner. And the worst part is, I used to be pretty popular, I played some sports, hung out with the \"cool\" jocks, and was pretty socially respected. But over the last few years I've been distancing myself, not talking to my friends because I thought I would annoy them, and getting feelings that they didn't like me anymore. I stopped playing sports because I felt I wasn't good enough to be on a team and I didn't like being watched or put on the spot.\n\nSince I practically lost all of my friends, couldn't talk to girls and just general thought everyone hated me, I developed serious self esteem and confidence issues, and I've pretty much stopped talking all together unless someone asks me a question.\n\nI've always been super skinny, and lanky (the body shape of someone who's over 6'5, but only 5'11), so naturally, I started working out once I lost all my self esteem. I made 0 progress for at least a year which made me feel even more worthless, and it was at this point I started to get seriously depressed, I decided I couldn't do or achieve anything so why even bother? Somehow I managed to persist, and continued to lift weights frequently as an escape from the world. I would put on my headphones, focus on the weights, and forget how horrible I felt. \n\nAfter a little while I started to seriously commit to what had become a 6 days a week regime, and I was dedicated (and still am) to the only thing I still enjoy(ed), bodybuilding. \n\nJump to now, in the last year I've gained close to 20 pounds of mostly muscle, but I also managed to pick up body dismorphia disorder along the way. I can no longer quite tell what I see when I look in the mirror, but I still see myself as that same scrawny kid, only slightly fatter. I still have no friends and avoid social contact at all costs, I hate school, it feels pointless and half of my time there I'm struggling to not break down and cry. Right now the only time a don't hate myself is when I'm high,  but  if I smoke any more than a bowl (really low tolerance) I have a major panic attack usually resulting in throwing up. \n\nI feel so small, insignificant and lonely, I think about suicide usually a couple of times a week, I never really consider it, but I like think about how people would finally notice me if I did, you know what I mean? Anyways, this is the year I will finally seek help for the root cause of all my problems, anxiety, and I hopefully ill be able to feel happiness again.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fuck social anxiety, this is going to be the year I take my life back",
            "url": "https://www.reddit.com/r/Anxiety/comments/3z8j8c/fuck_social_anxiety_this_is_going_to_be_the_year/"
        },
        {
            "author": "BucketBrain",
            "author_created_utc": 1419523214,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kb9cw",
            "created_utc": 1451752732,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3z5nio/dae_feel_like_they_are_constantly_feeling/",
            "gilded": 0,
            "id": "3z5nio",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3z5nio/dae_feel_like_they_are_constantly_feeling/",
            "retrieved_on": 1454968427,
            "score": 179,
            "secure_media_embed": {},
            "selftext": "For example if I go to the store, take the bus or even just walking outside. I can't shake the feeling of people watching or judging me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel like they are constantly feeling watched/judged?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3z5nio/dae_feel_like_they_are_constantly_feeling/"
        },
        {
            "author": "Gut_Bucket",
            "author_created_utc": 1446086937,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_rjut1",
            "created_utc": 1452059622,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zogza/suicide_prevention_hotline_saved_my_life_this/",
            "gilded": 0,
            "id": "3zogza",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 44,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zogza/suicide_prevention_hotline_saved_my_life_this/",
            "retrieved_on": 1454979883,
            "score": 147,
            "secure_media_embed": {},
            "selftext": "I am a \"normal\" 30 year old woman. I have 2 great kids at home and a wonderful step daughter in college. My husband of 10 years and I live in a nice home with comfortable furnishings. We have a large mastiff, rats, lizards and other fun things to entertain us. We have normal struggles making ends meet sometimes, but nothing drastic. Except, I'm suicidal. \n\nI can't explain why. Woke up and stubbed your toe? Better kill yourself. \n\nBecause (in my opinion) I have things so good feeling this way makes me unbearably guilty. I watch my kids doing awesome things and am proud of them; still want to die. Shame on me. Guilt. My husband comes home and plays a board game with the family. I play too but, I want to die. Guilt. \n\nFinally, one night after I really scared myself and I thought I really would do it-- I decided to have one more chance. I called the National Suicide Prevention Lifeline (1-800-273-TALK (8255)). The phone rang and immediately a kind-sounding woman answered. All I could do was sputter. No words were coming out. \n\nShe calmly talked to me through my tears and constant nose-blowing. I'll never know the woman on the other end of that line. I wish I did. I would tell her that she set me on a path that saved my life. If it wasn't for her, or Lifeline, I may not be here to talk about it. \n\nI never wanted my husband to know. I knew how much it would hurt him to know how I felt. He would take it personally. \n\nLucky for me-- he was awake while I was making that late night, sobbing phone call. He was laying in bed listening from the other room. \n\nI felt better after speaking to Lifeline. I was glad my husband heard, although ashamed. He took me to an emergency room. \n\nFrom the E.R., he was asked to leave. I was alone. I was scared. The staff went through my bag, pulling drawstrings out of my sweat pants and cutting the underwire out of my bras. They made me don a gown, mesh underpants and slipper socks. It basically felt horrible. \n\nFeeling vulnerable and like a big dumb alien, I was herded out with the rest of the people in the psychiatric ward for suicidal people. I won't lie. It was horrifying. There were people in there with thick bandages around their necks and wrists. People yelling and violent. People like me, scared and trying to blend in with the wall.\n\nFirst thing I did was go to the room they assigned me. I of course had a room mate. She was a woman about my age. She was loud and jittery. It put me on edge. I climbed into the bed and tried to go to sleep. Slept I did. For almost 2 whole days. I just shut down, shut everyone out and slept. \n\nI awoke to a nurse gathering my things. \"You're moving up, sister.\" she said. It scared me. Everything else in there was scary-- this probably would be too. \n\nLucky for me, being \"moved up\" (upstairs) was the best thing that could happen to me. \n\nIt was a ward just for people with disabilities or needed medical attention more so than just routine psychiatrics. I have severe asthma, mass on my lung, and COPD (I don't even smoke-- never did). \n\nThe third floor was quiet. Fewer people. The people in there had things like me, or were pregnant, mentally delayed, wheelchair bound etc. Much less intimidating. For someone with fierce panic/anxiety disorder this was much better. \n\nI started going to group. I started talking to people around me. I started even befriending a mentally handicapped man in a wheelchair. He needed a lot of help. I ate my lunch next to him to discreetly help him cut up his food. It was as good for him as it was for me that we were friends. \n\nI learned that people who talk to Jesus don't care a thing about logic. The best thing you can do is ask them how that makes them feel and enjoy the ride of their conversation.\n\nDay to day, I felt better. I got incredibly homesick. I got better. A doctor was there every day. Therapists and counselors were too. All of the staff was wonderful. They listened. They didn't judge. The people around me didn't either. \n\nI'm home now. VERY happy to be home. VERY happy to be alive. I still feel anxious. I still have thoughts of harming myself. I still don't go to family/friend functions but, I am significantly better. \n\nIf you feel like you could take your own life, try the hotline. Go to the E.R. There is help for you. \n\nIf you know someone who is unstable, encourage them. In any way you can. (You can pull a chain but you can't push it.)\n\nCalling 1-800-273-TALK (8255) saved my life. \n\nGoing to the E.R. let the cat out of the bag to the family. Now that everyone knows my darkest secret-- I have a new found support system. It's okay to let people in on how you feel. \n\nSometimes, it might be the person you least suspect. Share Lifeline's website on a social media page. Give the phone number to someone. You never know who's life it will save. It could be someone you'd never suspect.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Suicide prevention hotline saved my life. This story isn't heroic, but one that should be told.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zogza/suicide_prevention_hotline_saved_my_life_this/"
        },
        {
            "author": "primetrace",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1452185039,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zw9eo/i_always_anxiously_recite_my_order_in_my_head/",
            "gilded": 0,
            "id": "3zw9eo",
            "is_self": false,
            "locked": false,
            "media": {
                "oembed": {
                    "author_name": "Showmarries",
                    "author_url": "https://www.youtube.com/channel/UCIi8zMOUWsZYzhvA3zvALBw",
                    "description": "From S10E06 \"The Gang Misses the Boat\"",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FWg6NsSAvQGc%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWg6NsSAvQGc&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FWg6NsSAvQGc%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.ytimg.com/vi/Wg6NsSAvQGc/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "BEAK!",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=Wg6NsSAvQGc",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FWg6NsSAvQGc%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWg6NsSAvQGc&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FWg6NsSAvQGc%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zw9eo/i_always_anxiously_recite_my_order_in_my_head/",
            "post_hint": "rich:video",
            "preview": {
                "images": [
                    {
                        "id": "chL-ly0lGEJGO7Ok_HfZwSicol8bQ7iO1q6uJfE1N5k",
                        "resolutions": [
                            {
                                "height": 81,
                                "url": "https://i.redditmedia.com/HAndTawNIEJMJ8if7A-rT0YUHcbonXl8p8y1PqRlJTc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=3b00dff6e60d468db423df74efebcca7",
                                "width": 108
                            },
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/HAndTawNIEJMJ8if7A-rT0YUHcbonXl8p8y1PqRlJTc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=d13cd8cc49d3dbff4b812e8eb6d1fbc1",
                                "width": 216
                            },
                            {
                                "height": 240,
                                "url": "https://i.redditmedia.com/HAndTawNIEJMJ8if7A-rT0YUHcbonXl8p8y1PqRlJTc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=afd4888f8d8956b70d6572cedcc8d884",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 360,
                            "url": "https://i.redditmedia.com/HAndTawNIEJMJ8if7A-rT0YUHcbonXl8p8y1PqRlJTc.jpg?s=70daec5c0b9b35fd4f4f4f08457adb10",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1454983586,
            "score": 143,
            "secure_media": {
                "oembed": {
                    "author_name": "Showmarries",
                    "author_url": "https://www.youtube.com/channel/UCIi8zMOUWsZYzhvA3zvALBw",
                    "description": "From S10E06 \"The Gang Misses the Boat\"",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FWg6NsSAvQGc%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWg6NsSAvQGc&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FWg6NsSAvQGc%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FWg6NsSAvQGc%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "BEAK!",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=Wg6NsSAvQGc",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FWg6NsSAvQGc%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWg6NsSAvQGc&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FWg6NsSAvQGc%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/58LwHc6WN6aa54lUX-bQqyM14nQ8YB1Ceb2_f0AjxQk.jpg",
            "title": "I always anxiously recite my order in my head when going to restaurants and something like this ends up happening. I feel so bad for my severs.",
            "url": "https://www.youtube.com/watch?v=Wg6NsSAvQGc"
        },
        {
            "author": "CherreBell",
            "author_created_utc": 1390971061,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f10ft",
            "created_utc": 1451945086,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zgxb4/anxiety_is_just_its_exhausting/",
            "gilded": 0,
            "id": "3zgxb4",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zgxb4/anxiety_is_just_its_exhausting/",
            "retrieved_on": 1454976293,
            "score": 138,
            "secure_media_embed": {},
            "selftext": "Hi. I'm sure this is nothing new to the people here. I just wanted to vent. My baseline mood is like.. 5ish on a scale of 1 being totally relaxed and 10 being full blown panic attack. (although I find it hard to even rank on a 1-10 scale.. we need more in between numbers!) I feel like I'm ALWAYS tense, nervous, over analyzing and coiled up. \n\nAt the end of the day, my brain and body are just exhausted. I feel like I carried a bag of 50 lb rocks around for 8 hours and my brain feels like I did complex math equations for 8 hours. I over analyze off hand remarks my boss says for fear it's some indicator of my work performance.. I beat myself up over making a typo on something.. I feel totally incompetent compared to the person that used to be here that I've partially replaced. \n\nI just can't get either to shut off when I'm finally at home either. It's horrible. I hate to say it, but I've started slipping into taking my prescription xanax to just take some kind of edge off this horrible stressed out/coiled up constant natural state of worry I have. \n\nIt's just.. it's nice knowing I'm not alone in this feeling. Sorry, I know this post didn't really accomplish or say anything.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety is just.. It's exhausting",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zgxb4/anxiety_is_just_its_exhausting/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1451997713,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zjzeq/dae_wake_up_and_go_to_sleep_anxious/",
            "gilded": 0,
            "id": "3zjzeq",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zjzeq/dae_wake_up_and_go_to_sleep_anxious/",
            "retrieved_on": 1454977789,
            "score": 121,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "DAE wake up and go to sleep anxious?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zjzeq/dae_wake_up_and_go_to_sleep_anxious/"
        },
        {
            "author": "mooseknuckle543",
            "author_created_utc": 1368488437,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bo0l7",
            "created_utc": 1451920794,
            "domain": "self.Anxiety",
            "edited": 1451946198,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zf5v5/i_just_spoke_in_front_of_200_people/",
            "gilded": 0,
            "id": "3zf5v5",
            "is_self": true,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "locked": false,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zf5v5/i_just_spoke_in_front_of_200_people/",
            "retrieved_on": 1454975471,
            "score": 112,
            "secure_media_embed": {},
            "selftext": "Before the Xmas break I was informed that I'd be speaking in front of 200 coworkers on our first day back from break. At that moment, I've been terrified of this day. \n\nI just got back from the event, the speech went ok.  I had a bunch of things written down but I pretty much just memorized it and don't need to look at my notes. \n\nI take Ativan for extreme anxiety when I know it will happen (flights, public speaking) but I still somehow become very nervous to where you can hear it in my voice. \n\nAnyone have any tips that have been in similar situations. I'm really proud of myself for doing this but I know I can do better. Any help is greatly appreciated. Thanks. \n\nEdit: by the way, thank you to everyone. Since 12/17 (the day I found out I was giving a speech), I've been dreading this day. I even thought about calling in sick but I know that that would've made me feel terrible and like a coward. I'm really proud of myself for going through with even though the build up to it can be painful. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just spoke in front of 200 people",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zf5v5/i_just_spoke_in_front_of_200_people/"
        },
        {
            "author": "toogster",
            "author_created_utc": 1301255867,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_50rfx",
            "created_utc": 1451880139,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zd59x/do_you_guys_ever_feel_like_you_forget_to_breathe/",
            "gilded": 0,
            "id": "3zd59x",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zd59x/do_you_guys_ever_feel_like_you_forget_to_breathe/",
            "retrieved_on": 1454974529,
            "score": 94,
            "secure_media_embed": {},
            "selftext": "I've been having some anxiety lately and I feel like its caused my breathing to stop being automatic. I need to think about it and my body doesn't just naturally do it. Like as I'm typing this I'll realize \"oh shit, I need to breathe\" and take a huge breath because I didn't take any before.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you guys ever feel like you forget to breathe?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zd59x/do_you_guys_ever_feel_like_you_forget_to_breathe/"
        },
        {
            "author": "LeeroyM",
            "author_created_utc": 1373205706,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_caj6x",
            "created_utc": 1452028075,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zm6wh/zoloft_sertraline_has_completely_changed_my_life/",
            "gilded": 0,
            "id": "3zm6wh",
            "is_self": true,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "locked": false,
            "media_embed": {},
            "num_comments": 55,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zm6wh/zoloft_sertraline_has_completely_changed_my_life/",
            "retrieved_on": 1454978819,
            "score": 88,
            "secure_media_embed": {},
            "selftext": "I've had crippling anxiety (social and general) since I was 17 and I'm 23 now. I also suffer from depression. I became agoraphobic. I couldn't hold down a job. I struggled to keep friends or run simple errands. It was very bad.\nI was very opposed to medication. I didn't want to have to rely on a pill to be happy, plus I doubted that it would have any effect. Out of desperation I asked my GP for something and he gave me Zoloft.\nI started on 50mg and the first week was a nightmare. Insomnia, anxiety skyrocketed, severe depression, dilated pupils, 0 appetite for days among other symptoms. After 1-2 weeks these subsided.\nI stayed on 50 mg for a month. After not much effect I went back to my GP and he upped me to 100mg. I definitely began to feel a positive effect, but still not great. So after 2 weeks he upped me to 150mg. \nHoly shit. I feel almost....normal? The difference is night and day. I feel like I can do anything now and after 7 years of my youth wasted I'm actually hopeful for the future again. A cloud has been lifted. I really wish I tried Zoloft sooner. Couldn't recommend enough.\n\nTL;DR: Zoloft is amazing and changed my life for the better, highly recommend",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Zoloft (Sertraline) has completely changed my life",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zm6wh/zoloft_sertraline_has_completely_changed_my_life/"
        },
        {
            "author": "awakejsl85",
            "author_created_utc": 1449278747,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_somcd",
            "created_utc": 1451593168,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3yy5nd/anyone_ever_experience_intense_fear_of/",
            "gilded": 0,
            "id": "3yy5nd",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3yy5nd/anyone_ever_experience_intense_fear_of/",
            "retrieved_on": 1454964857,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone ever experience intense fear of applying/getting a job?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3yy5nd/anyone_ever_experience_intense_fear_of/"
        },
        {
            "author": "meganac",
            "author_created_utc": 1390424061,
            "author_flair_css_class": "",
            "author_flair_text": "(GAD)",
            "author_fullname": "t2_exifq",
            "created_utc": 1451870867,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zckbq/im_so_scared_about_going_back_to_university_after/",
            "gilded": 0,
            "id": "3zckbq",
            "is_self": true,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "locked": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zckbq/im_so_scared_about_going_back_to_university_after/",
            "retrieved_on": 1454974258,
            "score": 76,
            "secure_media_embed": {},
            "selftext": "Please help me feel less anxious and more able to face the world :(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm so scared about going back to university after 3 weeks at home :(",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zckbq/im_so_scared_about_going_back_to_university_after/"
        },
        {
            "author": "e_0",
            "author_created_utc": 1386097602,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_e6mwt",
            "created_utc": 1451844420,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zaq1t/making_progress_hey_everyone_id_like_to_share_my/",
            "gilded": 0,
            "id": "3zaq1t",
            "is_self": true,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zaq1t/making_progress_hey_everyone_id_like_to_share_my/",
            "post_hint": "self",
            "preview": {
                "images": [
                    {
                        "id": "CAxPCF872zewd-acGw-fLJwjJ4Qb6Fo0wErs2Jr428Y",
                        "resolutions": [
                            {
                                "height": 60,
                                "url": "https://i.redditmedia.com/x-JTWq8ootlYsm96_RvmmmKTwTpxSw9Wov4dog6jMw8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=814ec4cfc71cec808b3dc28781c4b65b",
                                "width": 108
                            },
                            {
                                "height": 121,
                                "url": "https://i.redditmedia.com/x-JTWq8ootlYsm96_RvmmmKTwTpxSw9Wov4dog6jMw8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=dfc6d915944257b66a961f05c75e4e8a",
                                "width": 216
                            },
                            {
                                "height": 180,
                                "url": "https://i.redditmedia.com/x-JTWq8ootlYsm96_RvmmmKTwTpxSw9Wov4dog6jMw8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=f4d6c29f9f91cf56743d8e7ce2caf99f",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 270,
                            "url": "https://i.redditmedia.com/x-JTWq8ootlYsm96_RvmmmKTwTpxSw9Wov4dog6jMw8.jpg?s=c3e45160bc9dd56b5a32ab80479bbd82",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1454973400,
            "score": 74,
            "secure_media_embed": {},
            "selftext": "Hey guys! I've been in an exceptionally good mood this morning after work. While browsing an Askreddit thread asking how everyone \"unwinds,\" a few gears began turning in my head and I thought of a new way to help calm myself down / remind myself to be happy during trying times. \n\nWhat I did was open the notepad on my phone (iPhone). It has a feature that allows you to post photos directly from your gallery to the note. I filled this particular note with a bunch of memories that make me happy, things that remind me of life's peculiar nature of bringing in happiness when I least expect it, and the people I have that make love worth living. You can do yours in any fashion, as this is all based on personal experiences. \n\nHere's a few screenshots of mine, with minor edits for privacy reasons. \n\nhttp://imgur.com/a/TFxWD\n\nThese screenshots may be meaningless, strange, or just downright unintelligible to you; but to me? To me they mean happiness. They show me that life can be wonderfully spontaneous and filled with joy when you least expect it. \n\nMake your own note. Fill it with love, with peace. Fill it with those little moments that help keep your feet on the ground when all you want to do is become detached; caged in the confines of your own mind in the worst possible light. \n\nI hope this can help you too, even slightly. \n\nStay happy, stay calm, and enjoy yourselves everyone. Have an amazing day and stay true to yourself. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Making Progress!] Hey everyone! I'd like to share my new coping method with you, and would love for you to try it with me!",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zaq1t/making_progress_hey_everyone_id_like_to_share_my/"
        },
        {
            "author": "Redrocketz",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1451941230,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zgn2j/does_anyone_else_jumble_their_words_up_a_bit_is/",
            "gilded": 0,
            "id": "3zgn2j",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zgn2j/does_anyone_else_jumble_their_words_up_a_bit_is/",
            "retrieved_on": 1454976159,
            "score": 68,
            "secure_media_embed": {},
            "selftext": "I have battled anxiety my whole life it seems. It's recently gotten better, where as I still get nervous sometimes I can hold a conversation and am no longer that awkward quiet guy at work that can hang but rarely speaks. \n\nBut in certain situations I find that I jumble my words up. Not so much speak them out of order, but I replace words mid-word or use the wrong tense or something. For example:\n\n\"The bin was full up this morning when I got here\" \n\nI meshed \"The bin was full\" and \"the bin was filled up\" into one awkward sentance.\n\nIt feels like it stems from being tired, needing to slow down before I speak yet at the same time not speaking my mind and letting words flow off the tounge. \n\nI also have experiences where I may want to speak or participate, but physically feel like I cannot as my voice feels weak and I can't put any life into what I'm saying. There's no anxiety, just a complete physically aversion to wanting to speak. \n\nIn fact that is what concerns me a bit. Even in times where I feel comfortable I feel like I can't fucking speak.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else jumble their words up a bit? Is this anxiety related?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zgn2j/does_anyone_else_jumble_their_words_up_a_bit_is/"
        },
        {
            "author": "WhenWhereWho",
            "author_created_utc": 1330365900,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_716a6",
            "created_utc": 1451675794,
            "domain": "self.Anxiety",
            "edited": 1451799452,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3z1nzq/took_m_last_night_my_anxiety_is_out_of_control/",
            "gilded": 0,
            "id": "3z1nzq",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 47,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3z1nzq/took_m_last_night_my_anxiety_is_out_of_control/",
            "retrieved_on": 1454966566,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "Has this happened with anyone else?  Last night was amazing,  I swear it's what it must feel like to not live with anxiety! \n\n\nBut this morning. .. I can't catch my breath and my chest is so tight it hurts. Everything seems scary right now,  none of my normal coping mechanisms are working and I don't even know how to answer my boyfriend when he asks about what would help.\n\n\nEDIT: I know I haven't responded to everyone, but I just wanted to say thank you to everyone to took the time to respond. It means a lot that complete strangers took the time to talk me through a really rough day.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Took M last night. My anxiety is out of control today.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3z1nzq/took_m_last_night_my_anxiety_is_out_of_control/"
        },
        {
            "author": "chicken_waggy",
            "author_created_utc": 1451399742,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_tbcj1",
            "created_utc": 1451922171,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zf986/51_yo_with_addiction_problems_somehow_never_got/",
            "gilded": 0,
            "id": "3zf986",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zf986/51_yo_with_addiction_problems_somehow_never_got/",
            "retrieved_on": 1454975513,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "Felony possession ( charged ). Aggravated Assault ( arrested but not charged ).\n\nI have bad anxiety on any given day but when I really have a reason to be anxious,   EDIT: then anxiety goes through the roof. \n\nLost my job, job is disputing my pay, eviction, car repo; I have all this coming up now. \n\nCan't contact my lawyer.  I have no idea what is going on legally except for a court date. \n\nI never got charged for the aggravated assault so I am probably ok but I don't know.\n\nBut the arrest will always be there. \n\nTerrified of the police now. Went to pre trial services a couple weeks ago. I was shaking so hard I could barely fill out the paperwork.  \n\nI needed to do some things today but was so shaky.  Extreme paranoia. Bad dreams, can't sleep but when I do, dream about the police coming to get me. \n\nI need to get back on meds. \n\nThe other person involved, I am afraid she is going to have me murdered. I am starting to think this is in my head though. \n\nI am afraid to walk down the street. \n\nJust venting I guess. I have to pull it together or I will have no chance. \n\nJust wish I could sleep. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "51 yo. with addiction problems. somehow never got into trouble with police but finally did.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zf986/51_yo_with_addiction_problems_somehow_never_got/"
        },
        {
            "author": "littlewarrior7410",
            "author_created_utc": 1422803396,
            "author_flair_css_class": "",
            "author_flair_text": "GAD/BPD",
            "author_fullname": "t2_l34ec",
            "created_utc": 1451794596,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3z8duy/boyfriend_confirmed_worst_fears_tonight_and_i/",
            "gilded": 0,
            "id": "3z8duy",
            "is_self": true,
            "link_flair_css_class": "relationshipflair",
            "link_flair_text": "Relationships",
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3z8duy/boyfriend_confirmed_worst_fears_tonight_and_i/",
            "retrieved_on": 1454969700,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "Hey r/Anxiety. Thanks in advance for any input.\n\nI have been taking notes on \"Loving Someone With Anxiety\" by Kate N. Thieda and going over them with my boyfriend. My boyfriend has had anxiety in the past, but not as severely as mine.\n\nThere's a section of the book that discusses how my anxiety can give him anxiety, and it offered up some sample questions that he has about my anxiety. We point out things in the notes by highlighting on a Google doc, and he highlighted that he was worried he would develop an anxiety disorder because of me, and the other question was \"What if I get sick of dealing with this and want to leave?\"\n\nI'm feeling a lot of conflicting feelings. I'm very sad and hurt to know that he has these thoughts because of me, but then I'm scared to bring up how I feel because it's related to my anxiety. I'm also angry that he feels this way, because he knew I had anxiety before getting together with me. And then I want to break up with him for feeling this way. I just overall feel very terrible right now, and my borderline isn't helping. \n\nI don't know what to do, but I'm very hurt and just looking for support.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Boyfriend confirmed worst fears tonight, and I don't know how to handle it.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3z8duy/boyfriend_confirmed_worst_fears_tonight_and_i/"
        },
        {
            "author": "Zephandrypus",
            "author_created_utc": 1414690809,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j4fyl",
            "created_utc": 1451996970,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zjy0o/is_anyone_else_very_adamant_about_not_using/",
            "gilded": 0,
            "id": "3zjy0o",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zjy0o/is_anyone_else_very_adamant_about_not_using/",
            "retrieved_on": 1454977771,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I can't stand using speakers and broadcasting my electronic's contents out to the world. I absolutely must mute or use headphones. Whenever someone asks me to play some of my music out loud to them, to display my tastes in the middle of class, my heart practically stops. I'd rather smash my phone and swallow the pieces. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is anyone else very adamant about not using speakers, only headphones?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zjy0o/is_anyone_else_very_adamant_about_not_using/"
        },
        {
            "author": "Shqueak",
            "author_created_utc": 1442128211,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_qf6uq",
            "created_utc": 1451849150,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zb1yx/worst_new_year_ever/",
            "gilded": 0,
            "id": "3zb1yx",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zb1yx/worst_new_year_ever/",
            "retrieved_on": 1454973553,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "So 2nd day into the new year, and I had the worst day I've had in years. \n\nFirst on my way to work I saw a man get hit by a car. He was screaming in pain, and the entire bus was stopped to phone an ambulance. No one was willing to get out and check on him except me - the incredibly blood-phobic girl. Sobbed the entire way through putting pressure on his wounds, apologising and trying to calm him down until the ambulance got there then immediately fainted and was covered in blood. \n\n3 hours into my work day, when I dragged myself in I discovered the best friend I've ever had died. In Hawaii. Where I can't get to her. This woman was my life, we were very nearly engaged on many occasions. \n\nAll of this has led to a perfect anxiety storm. I'm scared of the bus, I'm scared of cars, I can't focus and that increases my anxiety. \n\nAnd I don't know what to do, who to turn to. It's only been a day and I'm terrified. \n\nAnd of course every time I've tried to talk about it I've been ignored or just plain shot down. So I'm sorry for the wall of text, I just... Need to say it to someone I guess. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Worst new year ever",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zb1yx/worst_new_year_ever/"
        },
        {
            "author": "MakiraGirgir",
            "author_created_utc": 1410991980,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ig6mo",
            "created_utc": 1451876893,
            "domain": "self.Anxiety",
            "edited": 1451877114,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zcy95/the_fear_of_death_gives_me_panic_attacks/",
            "gilded": 0,
            "id": "3zcy95",
            "is_self": true,
            "link_flair_css_class": "healthflair",
            "link_flair_text": "Health Related",
            "locked": false,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zcy95/the_fear_of_death_gives_me_panic_attacks/",
            "retrieved_on": 1454974438,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "Hi. \n\nI am aware that this might sound odd, but since I was about seven years old I have been intensely scared of death. I lost my grandmother at that age, and was in a catholic school. I realized at that time when I started to wonder about where my grandmother would go, that I had no belief, and did certainly not belief in any afterlife. That's when the thought arose that the end is permanent, infinite, forever, meaning that it is the opposite of life, and going on endlessly. Life will never be again. Never! \n\n\n(EXISTENTIAL CRISIS!) \n\n\nI (25/F) still have this fear and it only seems to get worse. Right now I'm obsessed with my fathers health. He has and incurable cancer. \n\n\nThe thought about the fear of death goes on and on in a loop in my head until I have trouble breathing. I feel terrible and sick to my stomach. I get a panic attack. I used to think this was common, but none of my friends of family have had this experience.\n\n\nPeople who say that death is nothingness and just like being unconscious, or just like it was before you were born are not quite getting what I fear the most. I fear the permanence of death that goes on for all eternity, which means I will never experience life again, ever, and never see my loved ones again. That wouldn't matter if I had never experienced life. But it might be simular to a person becoming blind after having had a perfect vision, and knowing that you will never get the vision back. It's pretty scary.\n\n\nFear is after all irrational. Right now I'm reading a book called *The Denial of Death* by Dr. Ernest Becker. I'm going to read some works of Heidegger and Kierkegaard and try to live my life with the knowledge that death is impending, and we never know when. So at least that gives me a tiny bit of satisfaction - knowing I will use this as a power to be as good a person as I possibly can while I'm here.\n\n\nI think it would be good to talk to somebody who has experienced this, or has some good advice since I have difficulty sleeping and feel like nobody understands this.\n\n\nLive long and prosper.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The fear of death gives me panic attacks",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zcy95/the_fear_of_death_gives_me_panic_attacks/"
        },
        {
            "author": "bertrumsbitch",
            "author_created_utc": 1384033009,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dudb6",
            "created_utc": 1452117307,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zs2ox/dae_feel_like_they_would_benefit_from_a_couple/",
            "gilded": 0,
            "id": "3zs2ox",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zs2ox/dae_feel_like_they_would_benefit_from_a_couple/",
            "retrieved_on": 1454981633,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I'm so consumed with my anxiety that I just want to go somewhere where I can get help and stop being a burden to everyone I love. I just want to give up and walk away but I have nowhere to go.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel like they would benefit from a couple months in an institution?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zs2ox/dae_feel_like_they_would_benefit_from_a_couple/"
        },
        {
            "author": "SmartassComment",
            "author_created_utc": 1284897120,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4cuzm",
            "created_utc": 1452029134,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3zma29/job_recruiters_for_people_with_anxiety_or_other/",
            "gilded": 0,
            "id": "3zma29",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3zma29/job_recruiters_for_people_with_anxiety_or_other/",
            "retrieved_on": 1454978861,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "Is there such a thing as Job Recruiters / Head Hunters that specialize in dealing with employees with depression, anxiety, bipolar disorder etc. and matching them up with appropriate jobs that maximize their chance of being successful?  Or are Job Recruiters always presumed to be working for the employer, not the employee?  I'm not talking about 'job coaches' or advocates in government agencies, I'm talking about honest-to-goodness for-profit head hunters.\n\nIf such things exist, do they exist for high-level 'professional' salaried jobs, and not just for entry level or hourly work?\n\nI suspect this does not exist, but I wouldn't mind being pleasantly surprised.  I would fear that disclosing any psychological issues to a head hunter would be a good way to never get work again (possibly even blacklisted).  On the other hand I think it would make sense for head hunters to try to match employees with jobs they have the best chance of success in if (and this is a *very big if*), the head hunters see that this is the best way to get repeat business from employers.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Job recruiters for people with anxiety or other mental illness.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3zma29/job_recruiters_for_people_with_anxiety_or_other/"
        },
        {
            "author": "limpingzombi",
            "author_created_utc": 1350143251,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9ahp6",
            "created_utc": 1451713119,
            "domain": "youtu.be",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3z3wef/a_lot_of_us_know_it_and_love_it_heres_30_minutes/",
            "gilded": 0,
            "id": "3z3wef",
            "is_self": false,
            "locked": false,
            "media": {
                "oembed": {
                    "author_name": "BrawlBRSTMs3",
                    "author_url": "https://www.youtube.com/user/BrawlBRSTMs3",
                    "description": "Super Mario 64 music that has been extended to play for at least 15.5 minutes. Composer(s): Koji Kondo Arranger(s): Koji Kondo Developer(s): Nintendo EAD Publisher(s): Nintendo Purchase and/or download this game here: http://tinyurl.com/1c2 Purchase and/or download the album for this game here: http://tinyurl.com/nb33n5k This video was uploaded from http://www.brawlcustommusic.com/2599 This BRSTM was created by TheUltimateKoopa.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FcTl0ky4DcHA%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcTl0ky4DcHA%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcTl0ky4DcHA%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.ytimg.com/vi/cTl0ky4DcHA/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Dire, Dire Docks (OST Version) - Super Mario 64 Music Extended",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=cTl0ky4DcHA",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtu.be"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FcTl0ky4DcHA%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcTl0ky4DcHA%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcTl0ky4DcHA%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3z3wef/a_lot_of_us_know_it_and_love_it_heres_30_minutes/",
            "post_hint": "rich:video",
            "preview": {
                "images": [
                    {
                        "id": "UzqHTjtFeBNH1Z9nQBCEEsotdAfwRKeCr84XJemEwHE",
                        "resolutions": [
                            {
                                "height": 81,
                                "url": "https://i.redditmedia.com/H0yOisA7g3ach0R3faCqfigNu1y1YULCUhzRi3iIcts.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=78b04254d4cfa0c62eb5712641cdc4db",
                                "width": 108
                            },
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/H0yOisA7g3ach0R3faCqfigNu1y1YULCUhzRi3iIcts.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=fd3bbe41eadbf099a8b5cd5c550c67eb",
                                "width": 216
                            },
                            {
                                "height": 240,
                                "url": "https://i.redditmedia.com/H0yOisA7g3ach0R3faCqfigNu1y1YULCUhzRi3iIcts.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=04ed37cb57768cfff0479bfe51c08b4d",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 360,
                            "url": "https://i.redditmedia.com/H0yOisA7g3ach0R3faCqfigNu1y1YULCUhzRi3iIcts.jpg?s=d037ea91c658dc0990002a9dea717556",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1454967607,
            "score": 24,
            "secure_media": {
                "oembed": {
                    "author_name": "BrawlBRSTMs3",
                    "author_url": "https://www.youtube.com/user/BrawlBRSTMs3",
                    "description": "Super Mario 64 music that has been extended to play for at least 15.5 minutes. Composer(s): Koji Kondo Arranger(s): Koji Kondo Developer(s): Nintendo EAD Publisher(s): Nintendo Purchase and/or download this game here: http://tinyurl.com/1c2 Purchase and/or download the album for this game here: http://tinyurl.com/nb33n5k This video was uploaded from http://www.brawlcustommusic.com/2599 This BRSTM was created by TheUltimateKoopa.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FcTl0ky4DcHA%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcTl0ky4DcHA%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcTl0ky4DcHA%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcTl0ky4DcHA%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "Dire, Dire Docks (OST Version) - Super Mario 64 Music Extended",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=cTl0ky4DcHA",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtu.be"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FcTl0ky4DcHA%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcTl0ky4DcHA%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcTl0ky4DcHA%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/BOA4N7aEKd4CQVmYdEGS-weF_YgyVzA4mv_o8H6krRE.jpg",
            "title": "A lot of us know it and love it. Here's 30 minutes of the \"Dire Dire Docks\" music from Mario 64. This always chills me out, be it swimming around, or just the music.",
            "url": "https://youtu.be/cTl0ky4DcHA"
        }
    ]
}