{
    "data": [
        {
            "author": "thelopoco",
            "author_created_utc": 1433403984,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nwerp",
            "created_utc": 1465150322,
            "domain": "self.Anxiety",
            "edited": 1467379754,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4molsy/panic_attacks_some_pathetic_shit_that_little/",
            "gilded": 1,
            "id": "4molsy",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 100,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4molsy/panic_attacks_some_pathetic_shit_that_little/",
            "retrieved_on": 1472748506,
            "score": 470,
            "secure_media_embed": {},
            "selftext": "Growing up I'd heard occasionally about these things called \"panic attacks\" that apparently some overly-sensitive people claim to get. Seriously? An attack... of panic? What a HILARIOUS concept!\n \n\nIt's probably like some precious little princess in third grade losing her shit because *Johnny flicked a booger in my hair* as her arms flail around and she screams like the little whiny girl she is. Or maybe it's like *oh my god, oh my god, oh my god, I'm running late for Yoga and I can't find my car keys and the dog just threw up* - cue more effeminate limp-wristed flailing and prancing. Or perhaps when you lose your phone and *oh shit I can't find it anywhere, where did I leave it? Was it stolen? Oh my god!* You know, just like... panicking. Everyone knows metaphorically what panic is. Some pathetic shit that little sissies get in a flap about when things aren't going their way or the food blender spills everywhere or your girlfriend sees a wasp. \n\n\n**NO.**\n\n\n**NO NO NO.**\n\n\n**NOT EVEN CLOSE.**\n\n\nI had no idea what panic was until panic came to me a decade ago. \n\n\nTwenty-four years old of strapping athletic just-graduated pilot; cocky and overconfident to the extreme, bitch to nobody and obnoxious master of the known universe. I'm sitting in a pleasant country restaurant with my family and six friends, chowing down my rib-eye steak with a fine red wine and guffawing loudly as I regale the table with stories and bask in my own assured invincibility in the pantheon of men. \n\n\nThen a strange little sensation, imperceptible at first. \n\n\nMaybe I caught some steak in my throat? No, that's not it. Hmmm, my chest feels kinda strange like a... woah why am I so sweaty? I've stopped talking because my throat has clamped shut like a vice. The oxygen flow has turned to treacle and my throat insists its never known how to swallow. Why is everyone looking at me? Fuck this room is TINY. SO CROWDED. Something is wrong. Something is very wrong. My heart is pounding. My lungs can't function. Vision narrows and greys. The walls spin as the lump in your throat becomes a tumor that envelopes your entire existence. \n\n\nThen there is this overpowering feeling; a welling-up of all-encompassing fear. It's like an ocean surge. A rumbling from the depths of your soul that comes from the pit of your stomach at the edge of consciousness, rushing up your throat and into your brain like an unstoppable juggernaut on a collision course with your own demise. It's that crescendo of violins from the most terrifying horror movies just before the monster erupts from the dark, and it's coming for me. My whole temporal experience of the world has turned inwards and I'm pinned helpless to the moment. Inside my head a deafening megaphone overpowers every other thought - *Something dark, evil and truly awful is about to happen to you and you're powerless to stop it.*\n\n\nAm I dying? Yes, that must be it. I'm dying. Fuck. I'M ACTUALLY ABOUT TO DIE. RIGHT NOW IN THIS ROOM. This is what a heart attack feels like. Your mind swims in a freezing, clammy, boiling torrent of fractured thoughts and confusing sensations as your body assumes the twitching convulsive outline of a fish caught on a hook. Vision loses focus, eyes dart in all directions. \n\n\nMY HEART! BOOMBOOMBOOMBOOMBOOMBOOMBOOM it goes, with the ruthless life-extinguishing violence of a machine-gun. Nothing seems real, seconds stretch to years. Familiar things distort into terrifying non-shapes as you try to grasp on to the slush that has suddenly replaced reality. Everything is wrong. So wrong. My universe is about to collapse. The only sensation: IMPENDING DOOM. I must escape! If only I can get out of this room in the next three nanoseconds maybe I can survive. \n\n\nI stumble to something resembling an upright position and announce garbled words in incoherent gibberish to the table before racing for the door in a shambling, hyperventilating mess. I'm dying. This is it. Any moment now. Will there be pain? I'll never see my family or loved ones again. I never even got to say goodbye. This is the end. Everything lurches and races as the world implodes around you. I sit down and hyperventilate, furiously trying to catch a breath that is never satisfied, obsessively clutching the maniac pulse in my wrist. That's no good. Stand up again. Even worse. Go outside. No, I'll just die out there. Back inside to curl up in a corner. Logic has been obliterated. I am no longer rational. All that I'm aware of is the guaranteed knowledge that I am about to pass irrevocably past the line of my sudden cardiac death. Nothing exists except my crumbling body in a thick swamp of immobilising terror. \n\n\nI'm face-down on the floor in the corner of the restaurant, panting for breath, hoping that every gasp of air I can squeeze into my lungs isn't my last and that my heart won't instantly rupture and explode in agony. This lasts an eternity. What is happening to me?\n \n\nThere is noise. A commotion. People. Hands on my shoulders. \"ARE YOU OKAY?\" \"HEY, LOOK AT ME!\" Am I okay? No I'm fucking dying you fucking idiot. Do something! Help me! *HELP ME!*\n\n\n\nFifteen minutes of absolute raw-faced terror pass, adrenaline and fear pouring from every sweaty inch of your soaked body. The interminable minutes seem like years. \n\n\nSlowly something comes together. The floor is the floor again. It's wooden. Brown. Shiny. I can touch it. That's okay. Hold on to it. The walls are here. I'm wearing blue jeans. My parents are hunched down next to me talking soothing words. \n\n\nIT'S GOING TO BE OKAY. JUST BREATHE. YOU'RE HAVING A PANIC ATTACK. DON'T WORRY. \n\n\nLike a murky runway appearing from the fog, lights of reality slowly begin to emerge. Breathing shallows. My heart starts to slow as the aura of doom subsides into a dull roar like a distant waterfall. \n\n\nDinner is abruptly abandoned and I'm driven home slackjawed, a prisoner to my own reeling mind of neural traffic jams. What the fuck just happened to me? \n\n\nBefore I know it, I'm on the couch at home with my shirt unbuttoned. An on-call doctor arrives and I try to articulate the symptoms of my almost-death. He attaches bulbous rubber suckers to my chest to perform an ECG, EEG and other tests. Everything is normal. Ask some questions, check the history. Nothing out of the ordinary, all systems nominal. \n\n\n\"He'll be fine\" the doctor laughs, putting away the machines and tape prints.  \"Classic panic attack. Rest up and drink some tea.\"\n\n\nAnd that was the day I realized that anxiety and panic attacks aren't the pitiful little hand-flailing bad hair days that I'd condescendingly imagined. \n\n\n\nIt's not the momentary nervousness of losing your phone or being late for an appointment. It's not just some trivial moment of stressful overreacting, and it certainly doesn't just happen to weak-willed schoolgirls and pussies. That's not true panic.  \n\n\nTrue panic is the instantaneous, all-encompassing explosive jolt of terrifying **certainty** that without a doubt, **you are about to die** - right here and right now as your heart explodes - and submerge suffocatingly into a crushing blackness you never knew existed. \n\n\nAnxiety burst into my life without warning during a peaceful family dinner while I was at the prime of my life, so confident in my mastery over the world that I never imagined a crippling betrayal would come from inside my own body.  It can come to anyone at any time. \n\n\nI don't laugh about that any more. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Panic Attacks = Some pathetic shit that little sissies get in a flap about when things aren't going their way.",
            "url": "https://www.reddit.com/r/Anxiety/comments/4molsy/panic_attacks_some_pathetic_shit_that_little/"
        },
        {
            "author": "shakingunder",
            "author_created_utc": 1442425500,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_qieew",
            "created_utc": 1465234708,
            "domain": "self.Anxiety",
            "edited": 1465255651,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mu6sh/i_asked_out_the_dude_i_like/",
            "gilded": 0,
            "id": "4mu6sh",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 56,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mu6sh/i_asked_out_the_dude_i_like/",
            "retrieved_on": 1472751680,
            "score": 282,
            "secure_media_embed": {},
            "selftext": "For background I'm a 19 years old girl.\n\nI have suffered with anxiety since I was 13-14, and I have always had trouble dealing with new people. I either shut down completely, or scare them away because I open up to quickly. And past experiences have made me stop myself and be afraid to have a relationship. \n\nI basically have no filter when I talk (still working on that). It's one of my mayor flaws because I say shit I shoudn'y be saying, and end up in trouble or just in awkward situations. That being said, if I find something off about a situation, or something that I like about someone, I will voice it. This also is a problem, because I don't order my ideas before I voice them, and almost noone understands me. BUT, this dude tries to be patient with me, and he also has walked me through a panick attack.\n\nI also already asked him out last year, but I panicked when he said yes and immediately told him that a friend was also comming to see the movie with us.\n\nWell, yesterday I asked him again, he said yes. I almost had a panick attack on my own when he left, and almost text him again telling him that a friend was coming with us.\n\nBut I didn't.\n\nI calmed myself down. \n\nAnd I have a date with this dude.\n\nI can't believe I did this.\n\nEDIT: Wow, first I wanna thank everyone who has given me good wishes. I never thought this thread would get this big. I will update as soon as something about the date changes, when the date happens and after 'happenings'. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I asked out the dude I like",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mu6sh/i_asked_out_the_dude_i_like/"
        },
        {
            "author": "Related_TIL",
            "author_created_utc": 1326432176,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6njxt",
            "created_utc": 1464900407,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m9b3k/who_else_finds_themselves_staying_up_as_long_as/",
            "gilded": 0,
            "id": "4m9b3k",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 39,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m9b3k/who_else_finds_themselves_staying_up_as_long_as/",
            "retrieved_on": 1472739803,
            "score": 210,
            "secure_media_embed": {},
            "selftext": "Also so that you wake up around noon or 1 so half the day is already over\n\nI would rather not have lived at all than to live this life. Nobody deserves this bullshit. But, this bullshit will be over in a minute.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Who else finds themselves staying up as long as possible to prolong tomorrow as long as possible?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m9b3k/who_else_finds_themselves_staying_up_as_long_as/"
        },
        {
            "author": "SPER",
            "author_created_utc": 1339910625,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_80t9p",
            "created_utc": 1464881683,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m7qdj/do_you_ever_get_nervous_doing_things_youve_done/",
            "gilded": 0,
            "id": "4m7qdj",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m7qdj/do_you_ever_get_nervous_doing_things_youve_done/",
            "retrieved_on": 1472738926,
            "score": 199,
            "secure_media_embed": {},
            "selftext": "So, I get anxiety as well as social anxiety and I bartend. I feel like it's a good job for someone with anxiety because it kind of forces you to get out of your comfort zone. There is nothing for you to hide behind.\n\nNow on to my main point, I've been doing this for a few years now and have a lot of service experience as well. But still when I come in to work and start making drinks for someone I sometimes get really anxious and my hands start shaking a bit and heart beats. \n\nIt's weird because it's something I've done probably thousands of times, yet still I sometimes get really anxious and feel like I don't know what I'm doing. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you ever get nervous doing things you've done hundreds, even thousands of times and feel like you don't know what you're doing?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m7qdj/do_you_ever_get_nervous_doing_things_youve_done/"
        },
        {
            "author": "therealprincesszelda",
            "author_created_utc": 1464921118,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_yex7b",
            "created_utc": 1464983509,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4meov9/anyone_ever_feel_like_being_on_social_media/",
            "gilded": 0,
            "id": "4meov9",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4meov9/anyone_ever_feel_like_being_on_social_media/",
            "retrieved_on": 1472742863,
            "score": 176,
            "secure_media_embed": {},
            "selftext": "Any thoughts on this correlation?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "anyone ever feel like being on social media triggers your anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4meov9/anyone_ever_feel_like_being_on_social_media/"
        },
        {
            "author": "coffeeonsunday",
            "author_created_utc": 1406398280,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hl0w5",
            "created_utc": 1464754327,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4lzfnd/anxiousness_is_transient_while_anxiety_is_a_state/",
            "gilded": 0,
            "id": "4lzfnd",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4lzfnd/anxiousness_is_transient_while_anxiety_is_a_state/",
            "retrieved_on": 1472734421,
            "score": 174,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiousness is transient while anxiety is a state. Next time you're feel it, tell yourself 'Im feeling anxious' as oppose to 'I have anxiety' to train your mind to reinforce the thought as short term rather than long",
            "url": "https://www.reddit.com/r/Anxiety/comments/4lzfnd/anxiousness_is_transient_while_anxiety_is_a_state/"
        },
        {
            "author": "1398_Days",
            "author_created_utc": 1459109056,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_woxp6",
            "created_utc": 1465110857,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mmdy2/anyone_get_stomach_problems_from_anxiety/",
            "gilded": 0,
            "id": "4mmdy2",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 68,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mmdy2/anyone_get_stomach_problems_from_anxiety/",
            "retrieved_on": 1472747264,
            "score": 166,
            "secure_media_embed": {},
            "selftext": "For as long as I can remember, my anxiety has always messed with my stomach. And over the past several months my anxiety has gotten worse and so have the stomach issues. I've been having a really hard time eating lately so I've pretty much been living off of cereal haha. Anyone else experience this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "anyone get stomach problems from anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mmdy2/anyone_get_stomach_problems_from_anxiety/"
        },
        {
            "author": "RedInTheMorning",
            "author_created_utc": 1464133873,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_y6sji",
            "created_utc": 1464808876,
            "domain": "self.Anxiety",
            "edited": 1464867968,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m30dp/selfie_thread_anyone/",
            "gilded": 0,
            "id": "4m30dp",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 524,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m30dp/selfie_thread_anyone/",
            "post_hint": "self",
            "preview": {
                "images": [
                    {
                        "id": "GHzu_g6_RBHsAZaq5ZE7a8FwJXKMml3_oZjq_NyHO7Q",
                        "resolutions": [
                            {
                                "height": 192,
                                "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=e8e078220e4534d58952be6a77d115bd",
                                "width": 108
                            },
                            {
                                "height": 384,
                                "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=e0a34efce669c3b3b7efd1fc5d6c8e18",
                                "width": 216
                            },
                            {
                                "height": 568,
                                "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1eed350ee5ed6651bf4c95b41eb063fa",
                                "width": 320
                            },
                            {
                                "height": 1137,
                                "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=67831dc1c7303444a2eaf5b2c4591487",
                                "width": 640
                            },
                            {
                                "height": 1706,
                                "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=ddd9518092c81a0be148a6c2822e88c0",
                                "width": 960
                            },
                            {
                                "height": 1920,
                                "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=da1f3c8274d593b6fc525619af94de76",
                                "width": 1080
                            }
                        ],
                        "source": {
                            "height": 3264,
                            "url": "https://i.redditmedia.com/grR3-QmNzHJv-cInaykNwKcI-xpyJ-TzCne5DzEu1RY.jpg?s=e3cecdc15d8139e9256e9a4227f0eb09",
                            "width": 1836
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1472736346,
            "score": 165,
            "secure_media_embed": {},
            "selftext": "Haven't seen one of these in a while but have found them personally helpful in the past! Hopefully it'll let others see they're not alone. I think it helps to see the faces of others who are fighting the same battle. \n\n\nI'll start: http://m.imgur.com/j0rGC7S\n\nEdit: I can't respond to any more but I tried to as many as possible. Not a single one of you hasn't been attractive though. Hope this helped some of you. Thank you so much to everyone that posted. \n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Selfie thread anyone?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m30dp/selfie_thread_anyone/"
        },
        {
            "author": "looks_familiar",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1465069405,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mjvov/brain_never_stops/",
            "gilded": 0,
            "id": "4mjvov",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mjvov/brain_never_stops/",
            "retrieved_on": 1472745830,
            "score": 81,
            "secure_media_embed": {},
            "selftext": "For the second time this year, I finished a major project for work, but instead of feeling relieved, I feel totally wound up.\n\nThis is the side of anxiety that's so hard to explain to people who've never felt it:\n\nThere is nothing wrong. Nothing that needs to be done immediately. No deadlines. No projects at home. \n\nYet here I sit, my heart pounding and my mind haunted by a specter of dread.\n\nI try to take my mind off it by playing a computer game. But then I feel like I am putting of work. So I sit down to do work, but then I realize I am between projects. So I go outside to sit and relax. And my mind says, \"What are you just sitting around for?? There's so much to be done!\"\n\nMy brain never turns off. It just keeps pecking at my sense of calm. Don't stop working...you'll fall behind. Don't take a break...there's more to do. Don't eat out of boredom...you'll get fat. Don't start that building project...you won't have time to finish it.\n\nPeople worry about something and say, \"Oh, I have such anxiety!\"\n\nMaybe you are anxious. But you do not have anxiety.\n\nAnxiety is this unwelcome guest that stays in your bed with you, and follows you to work, and to the movies, and to the gym. And you beg it to go away. And when you think it has, you feel like something is missing...a part of you. And your chest tightens again, and the dread creeps back, and anxiety says, \"JK! I never left. I just wanted you to know how much you need me.\"\n\nI don't need it. But I have it. And goddamn but how I want to get rid of it...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Brain Never Stops",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mjvov/brain_never_stops/"
        },
        {
            "author": "h-hux",
            "author_created_utc": 1461948510,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_xk71x",
            "created_utc": 1465285574,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mxyf2/wanting_to_die_while_also_being_terrified_of_dying/",
            "gilded": 0,
            "id": "4mxyf2",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mxyf2/wanting_to_die_while_also_being_terrified_of_dying/",
            "retrieved_on": 1472753839,
            "score": 77,
            "secure_media_embed": {},
            "selftext": "I've got both depression and anxiety. Normally, I only notice one at the time, but the problems happen when both decide to act at the same time. The depression wants me want to kill myself - the anxiety makes me terrified of ultimately ending it. Anyone else feel the same?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Wanting to die - while also being terrified of dying.",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mxyf2/wanting_to_die_while_also_being_terrified_of_dying/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1464956465,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mclpr/fighting_what_if_thoughts_and_worst_case_scenarios/",
            "gilded": 0,
            "id": "4mclpr",
            "is_self": true,
            "link_flair_css_class": "adviceneeded",
            "link_flair_text": "Advice Needed",
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mclpr/fighting_what_if_thoughts_and_worst_case_scenarios/",
            "retrieved_on": 1472741650,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "I only realise this now but I suffer from catastrophizing, which is believing the worst will happen. I've always had this affliction, for example if Mum was 10 mins later than she said she would be, I would be certain that she died or something horrible happened. \n\nI hadn't suffered from this in a while, until 2 weeks ago, where I'm now constantly fighting these thoughts. I know these thoughts are irrational, several other people have told me so. When I analyse the thoughts I always in the end find ways to console myself that I'm being ridiculous. However the thoughts don't stop and constantly having to analyse them and fight them is wearing me down. \n\nI've googled this issue and whilst a lot of what I read is helpful, I'm having a hard time letting these thoughts go. I feel like if I ignore them I'm not caring enough that this horrible thing will happen and then I am drawn back into fighting them. \n\nIf anyone could help me resist the urge to fight these 'what if' and worse case scenario thoughts, I'd really appreciate it! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fighting 'what if' thoughts and worst case scenarios",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mclpr/fighting_what_if_thoughts_and_worst_case_scenarios/"
        },
        {
            "author": "Detroitvibe",
            "author_created_utc": 1285335412,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ddjj",
            "created_utc": 1465089019,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4ml8yy/my_girlfriend_is_taking_a_flight_this_week_i_want/",
            "gilded": 0,
            "id": "4ml8yy",
            "is_self": true,
            "link_flair_css_class": "relationshipflair",
            "link_flair_text": "Relationships",
            "locked": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4ml8yy/my_girlfriend_is_taking_a_flight_this_week_i_want/",
            "retrieved_on": 1472746600,
            "score": 57,
            "secure_media_embed": {},
            "selftext": "My girlfriend has some pretty bad anxiety,  she's taking a flight without me this week,  and I want to pack her a bag of items to help her since I won't be able to be there for her.   \n\nWhat items would help calm her nerves? \n\nI want to also put positive notes in there for her to find and read,  what does a person with anxiety need to hear?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My girlfriend is taking a flight this week, I want to pack her a small bag to help her with her anxiety. What do I put in there?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4ml8yy/my_girlfriend_is_taking_a_flight_this_week_i_want/"
        },
        {
            "author": "sailsouth_",
            "author_created_utc": 1422846381,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_l3ic7",
            "created_utc": 1465048337,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4midu4/i_keep_feeling_things_crawl_on_my_skin_hear/",
            "gilded": 0,
            "id": "4midu4",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4midu4/i_keep_feeling_things_crawl_on_my_skin_hear/",
            "retrieved_on": 1472744984,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "Sometimes I'll have sleepless night because I feel things crawling on my skin or pinch me, but I swear I don't see any bugs or anything. I've checked my sheets and blankets, several times. Even right now I keep fidgeting becuase I have to rub my face or scratch my arm or something.\n\nI'lll hear things, too. Like bumps through my headphones. I take them out real quick to listen, but then it's gone. It can't be coming from my headphones. A few months ago, I had a nigheborg always complain of noise. I know for a fact that it was coming from my sister's room, becuase she stomps, jumps around and slams he door. The police was called on us, a few times. I tried telling my sister to quiet down, but I'm younger than her, so I feel that she believes she doesn't have to listen to me. This has made me very scared and paranoid because I'm terrified of getting evicted. I don't have my own car, nor do I have the money to even deal with that. \n\nLastly, I keep seeing things at the corners of my eyes. Like black flashes of whatever. It can't be bugs because then I won't see the flashes, anymore. It's too big to be a fly, too.I hardly ever open my window, do it definitely can't be that. But sometimes tiny flies get into my room, but they always gather near the light of my computer scree, and they don't move as fast as these flashes.\n\nI don't understand what's happening and I'm scared :(\n\nThis has been going on for a while. Maybe I'm always scratching or feeling things becuase I've been taking terrible care of myself. I suffer from depression. I'll go days without showering, but I'm trying to be better about that. I brush my teeth everyday and night, too. Well, occasionally I'll forget to brush at night. But last summer I was so bad that I went weeks at a time without showering or brushing. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I keep feeling things crawl on my skin ,hear noises or voices and sometimes see things. What does this mean?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4midu4/i_keep_feeling_things_crawl_on_my_skin_hear/"
        },
        {
            "author": "largerthanlifesize",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1464778996,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m0oz6/fighting_anxiety_is_hard_like_really_hard/",
            "gilded": 0,
            "id": "4m0oz6",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m0oz6/fighting_anxiety_is_hard_like_really_hard/",
            "retrieved_on": 1472735096,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I do so much to try and fight it. I exercise most days, I fixed and try to stay on top of my diet, I've removed caffeine and limit alcohol, I'm on my third SSRI, fingers crossed I don't get unbearable side effects on this one. I constantly try to carry out what I learned through CBT and use on-line CBT resources to keep me going until I can get more therapy sessions. I try to put myself in a controlled way in situations I know will make me anxious to try and overcome them. I talk to people who relax and calm me and know about my situation, I know sometimes I just need to stop and go and have a time out, I have a relax corner with emergency supplies of chamomile and peppermint tea and my favourite books and music.\n\nAnxiety itself already costs a lot of energy. The constant fear takes its toll. But still I pick myself up and try to fight it day after day come hell or high water, I wont let it win, I can't let it win. I might have inherited anxiety and panic from my Mother but fortunately I got my Dad's unrelenting positivity to try and fight this. I worry what will happen if this breaks me and I lose this positivity, I'm 90% sure that would destroy my life. \n\nSome days are worse than others. The energy I have to spend every day just to turn up and be like 'Yes I have attempted this day' makes me envy 'normal' people. Trying to complete a 4-year degree on top of this is a near impossible task only someone who was mentally ill would even dare attempt. \n\nBut here I am. Three years down, one more to go. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fighting anxiety is hard, like really hard",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m0oz6/fighting_anxiety_is_hard_like_really_hard/"
        },
        {
            "author": "yadamnrite",
            "author_created_utc": 1412664789,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iqqup",
            "created_utc": 1464892655,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m8n9b/anxiety_convinces_me_everyone_hates_me/",
            "gilded": 0,
            "id": "4m8n9b",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m8n9b/anxiety_convinces_me_everyone_hates_me/",
            "retrieved_on": 1472739435,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "I have had fairly mild general anxiety for the past 4 years. It's always been manageable without the use of medicine. But recently, with a lot of stress and depression, my anxiety is spilling over into my social life. I'm convinced that, either as a result of my anxiety or because of the anxiety itself, every one of my friends is mad at me or can't stand me or even hates me. \n\nI typically don't care. I keep my circle small and typically I know the people I chose to have in my life love and care about me. But even that is crushing me. I have no reason to believe that my friends are talking about me behind my back, but I am convinced they are. \n\nI honestly don't know how to handle it. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety convinces me everyone hates me",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m8n9b/anxiety_convinces_me_everyone_hates_me/"
        },
        {
            "author": "Diedalonglongtimeago",
            "author_created_utc": 1458924116,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_wn9hc",
            "created_utc": 1464972710,
            "domain": "thebookoflife.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mdt3z/on_anxiety_a_friend_shared_this_article_to_me/",
            "gilded": 0,
            "id": "4mdt3z",
            "is_self": false,
            "link_flair_css_class": "articleflair",
            "link_flair_text": "Article",
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mdt3z/on_anxiety_a_friend_shared_this_article_to_me/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "GQ-4wiRYMurG8kIa-80nzhPJ9NM-4G3Juj2hdWEAJlo",
                        "resolutions": [
                            {
                                "height": 98,
                                "url": "https://i.redditmedia.com/hf2BGAVT40e_yaJuexVLTWVCgTgQ_9ZuHKT9iypqWz4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=8b9a36d8085a0d3b05e282be4522a8da",
                                "width": 108
                            },
                            {
                                "height": 197,
                                "url": "https://i.redditmedia.com/hf2BGAVT40e_yaJuexVLTWVCgTgQ_9ZuHKT9iypqWz4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=971cc64aca2328498927b82230fa1919",
                                "width": 216
                            },
                            {
                                "height": 292,
                                "url": "https://i.redditmedia.com/hf2BGAVT40e_yaJuexVLTWVCgTgQ_9ZuHKT9iypqWz4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=c8dc65e4130b1cd3e8a45d5899ace479",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 580,
                            "url": "https://i.redditmedia.com/hf2BGAVT40e_yaJuexVLTWVCgTgQ_9ZuHKT9iypqWz4.jpg?s=481b6226f0806f99d8547087114a97ab",
                            "width": 635
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1472742342,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/kcedUKjEjBd3QTCGe6JTFoY0e7Vi54IeVjFxLeV5xCw.jpg",
            "title": "On Anxiety - A friend shared this article to me this morning. It really helped me get through my shitty week",
            "url": "http://www.thebookoflife.org/why-you-are-anxious-all-the-time/"
        },
        {
            "author": "emiliehelena",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1465291624,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4my7ph/being_broke_is_one_of_the_things_i_stress_most/",
            "gilded": 0,
            "id": "4my7ph",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4my7ph/being_broke_is_one_of_the_things_i_stress_most/",
            "retrieved_on": 1472753981,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Being broke is one of the things I stress most about. However working is also causing me a lot of anxiety, especially the fear of making mistakes. Later today I have a job interview for telemarketing, it can either be the worst job I could ever choose or the best. Any experiences?",
            "url": "https://www.reddit.com/r/Anxiety/comments/4my7ph/being_broke_is_one_of_the_things_i_stress_most/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1465028361,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mhgad/does_anxiety_affect_your_face/",
            "gilded": 0,
            "id": "4mhgad",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mhgad/does_anxiety_affect_your_face/",
            "retrieved_on": 1472744455,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anxiety affect your face",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mhgad/does_anxiety_affect_your_face/"
        },
        {
            "author": "OneFinal",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1464962646,
            "domain": "self.Anxiety",
            "edited": 1464962841,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4md05n/withdrawal_is_very_real_and_its_something_that/",
            "gilded": 0,
            "id": "4md05n",
            "is_self": true,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "locked": false,
            "media_embed": {},
            "num_comments": 39,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4md05n/withdrawal_is_very_real_and_its_something_that/",
            "retrieved_on": 1472741881,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I have been dealing with bad anxiety for months now. I have been on and off Xanax and Celexa throughout this period. Being on medication is not something that I wanted, especially the Xanax due to its highly addictive nature. I wanted to deal with my anxiety through therapy and other methods that did not involve medications.\n\nWith the help of my doctor, I established a plan for weaning myself off these drugs. The plan was to spend an entire month gradually stepping down the dosages. I spent the first week at .5mg of Xanax and 10mg of Celexa per day. The second week was .375mg of Xanax and 10mg of Celexa per day. The third week was .25mg of Xanax and 5mg of Celexa per day. The final week was .125mg of Xanax and 5mg of Celexa per day.\n\nThe biggest thing that I learned during this month is that **withdrawal is going to occur**. Unfortunately, it is inevitable and there were certain side effects that were out of my control. The worst of it, for me, was the insomnia. As I approached the smaller dosages, I could not sleep at all. No matter how calm and restful I felt, sleep would not come. Over the course of about two weeks, I got very little sleep: maybe an hour or two per night. It was awful. I was incredibly sleep-deprived and my eyes were so bloodshot.\nEventually, though, I had one night of about four hours of sleep, followed by one of five hours, followed by one of six hours, and so on, until my sleeping pattern started to return to normal.\n\nI just wanted to share my experience for those of you who are looking to stop taking medications like these. **Expect withdrawal and do anything in your power to help yourself work through it.** There is a light at the end of the tunnel and the withdrawal will end at some point. It varies for each person, but you just have to fight through it and you will eventually feel better!\n\nEDIT: Spelling and grammar.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Withdrawal is very real and it's something that you'll need to work through (My experience getting off of Prescription Drugs).",
            "url": "https://www.reddit.com/r/Anxiety/comments/4md05n/withdrawal_is_very_real_and_its_something_that/"
        },
        {
            "author": "Surnaik",
            "author_created_utc": 1368050273,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_blwx9",
            "created_utc": 1464829999,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m4nw4/i_feel_like_my_friends_arent_actually_my_friends/",
            "gilded": 0,
            "id": "4m4nw4",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m4nw4/i_feel_like_my_friends_arent_actually_my_friends/",
            "retrieved_on": 1472737246,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Ninja Edit: For reference, I am an 18-year-old male who is graduating high school next week.\n\nEvery person I like to talk to seems to want to talk to me less and less. Whenever I try to have a one-on-one conversation, in person or over text, with a person, it seems to me that they are just trying to get away from me as fast as possible. Over text, they take longer and longer to reply, with replies getting shorter and shorter. Eventually, they just stop replying altogether or never reply in the first place, despite our seemingly good relationship. On the other hand, I see these same people texting each other non-stop when I am around them in real life, so the problem is not that they don't check their phones often.\n\nI keep telling myself that everyone I try to text is just busy or they don't check their phones often- though I think I know the truth. People don't like texting me or talking to me one-on-one no matter how we're doing it and I have no idea why this is happening. It feels like I am not close to any of my friends, despite having plenty of people who would call me a \"friend.\" I don't have any single person I can just talk to and expect them to appreciate me as much as if not more than their other friends. I have no \"best friend\" and can't remember a time I ever have had a best friend in my entire life. The closest I have had to a best friend are two girls: the first girl (17/f) helped me with my problems and I helped her with her problems, we shared a deep connection over text but in real life she never treated me as much more than an acquaintance; the second girl (16/f) was my girlfriend for 10 months but we broke up a month ago and by the end it seemed like she was fighting to get away (though there were legitimate reasons for her wanting that).\n\nIs this feeling normal? Am I just unreasonably panicking? For the past month, I have felt totally and utterly alone and I have had no one to turn to, despite hanging out with my friends multiple times. Oh, and that reminds me, whenever I hang out with my friends I don't usually feel very included unless I initiate situations in which I have to be included- such as games or activities.\n\nThis entire afternoon, I have felt as though I want to just talk to someone and enjoy their company and have them enjoy mine just as much- however, I cannot think of a single person I know who would actually enjoy doing this, even though I can think of plenty of people with whom I would enjoy doing this. This sort of scenario has panned out multiple times over the past month because before then I would always text my ex-girlfriend when having any of these sorts of feelings; however, I can't text her or the other girl any more due to our rough break up.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like my friends aren't actually my friends.",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m4nw4/i_feel_like_my_friends_arent_actually_my_friends/"
        },
        {
            "author": "Saddiesmomma",
            "author_created_utc": 1464556315,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_yaxl6",
            "created_utc": 1465224958,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mtbri/waking_up_with_terrible_anxiety/",
            "gilded": 0,
            "id": "4mtbri",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mtbri/waking_up_with_terrible_anxiety/",
            "retrieved_on": 1472751178,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Hi. Thought maybe I could get some advice from anyone else dealing with similar issues. For as long as I can remember, the morning has been a difficult time for me. Most days I wake up in a panic with the worst feeling of doom and dread. Sometimes it's about nothing and sometimes it's specific to the day ahead. I usually end up feeling better after a run with my dog and once I get going with my day but I feel like my ability to be happy is greatly impaired by this horrible feeling when I wake up. I still feel myself buzzing with anxiety now even though I have been up for 4 hours now. Any tips on waking up more relaxed? Thanks! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Waking up with terrible anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mtbri/waking_up_with_terrible_anxiety/"
        },
        {
            "author": "lemaxx",
            "author_created_utc": 1365744284,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_baf1m",
            "created_utc": 1464893163,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m8out/if_one_more_person_tells_me_to_just_calm_down_i/",
            "gilded": 0,
            "id": "4m8out",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m8out/if_one_more_person_tells_me_to_just_calm_down_i/",
            "retrieved_on": 1472739460,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If one more person tells me to \"just calm down\", I will lose my shit.",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m8out/if_one_more_person_tells_me_to_just_calm_down_i/"
        },
        {
            "author": "SQUIDYYY",
            "author_created_utc": 1361413106,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_aoc67",
            "created_utc": 1464748556,
            "domain": "self.Anxiety",
            "edited": 1464751716,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4lz1he/im_irrationally_scared_of_dying/",
            "gilded": 0,
            "id": "4lz1he",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4lz1he/im_irrationally_scared_of_dying/",
            "retrieved_on": 1472734206,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "So this is a relatively new sensation that I've been experiencing and it's been extremely detrimental. Once I'm trapped into that that state of mind, I can feel the area around my heart feel really heavy followed by shaky sweaty hands. Kinda like drinking way too much coffee. I probably experience this at least 2 times a week and it's difficult to get out of that state of mind.\n\nAs a kid, I don't think I ever thought about it. I just lived life and worried about when cartoons were gonna air but now everytime I get into my car, I think it could be my last. I can be laying in bed with my mind racing about all the different ways I could die horrific deaths with excruciating details. I have a flight coming up and I keep imagining it crashing or disappearing like the ones on the news.\n\n You know, whenever you watch the news and see a car crash with fatalities, usually people just mention how unfortunate it is and move on completely forgetting about it. For some reason I just completely place myself in their shoes and practically simulate the crash in my head down to the last moments of breath. I start to freak out once I think that perhaps there's absolutely nothing after death, just darkness. It absolutely terrifies me to the point where I just want to start crying in the middle of the night. \n\nThere's no reason for me to think this because I have no control over these types of situations. I live a great life that I'm extremely grateful for with a loving family but thinking about no longer being in this world and joining the dead freaks me out. \n\nI don't know if this is normal but usually taking deep breaths and distracting myself helps. I don't even know if this is the correct sub to post this in but I don't know what else to call this feeling other than anxiety. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "i'm irrationally scared of dying",
            "url": "https://www.reddit.com/r/Anxiety/comments/4lz1he/im_irrationally_scared_of_dying/"
        },
        {
            "author": "mycrookedheart",
            "author_created_utc": 1405568463,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hftwo",
            "created_utc": 1464789814,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4m1drw/anxiety_is_like_a_leaky_faucet_that_requires/",
            "gilded": 0,
            "id": "4m1drw",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4m1drw/anxiety_is_like_a_leaky_faucet_that_requires/",
            "retrieved_on": 1472735462,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I was catching up on the show Elementary and there was a very powerful scene which put into perspective my struggle with anxiety. The character was talking about sobriety rather than anxiety but I still related:\n\n&gt; It's the process of maintaining my sobriety. It's repetitive. And it's relentless. And above all, it's tedious. When I left rehab, I... I accepted your influence, I committed to my recovery. And now, two years in, I find myself asking, 'is this it?' My sobriety is simply a grind. It's just this leaky faucet that requires constant maintenance, and in return offers only not to drip. \n\nThis is exactly how I feel about battling my anxiety. I feel like it takes constant effort and thought to keep my self centered and calm. But now that I've spent years figuring out how to fight anxiety I feel dissatisfied, all of this constant work and just to get me feeling \"less bad\" rather than good. I thought that overcoming anxiety would be a joyous experience, but right now I'm struggling with the realization that it's really a tedious grind with no end in sight. \n\nDoes any one feel the same way? Or have any thoughts?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety is like a leaky faucet that requires constant maintenance",
            "url": "https://www.reddit.com/r/Anxiety/comments/4m1drw/anxiety_is_like_a_leaky_faucet_that_requires/"
        },
        {
            "author": "ucncdcecrcwcecacr",
            "author_created_utc": 1341406054,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_881n1",
            "created_utc": 1465075039,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/4mkacp/xanax_sweet_xanax/",
            "gilded": 0,
            "id": "4mkacp",
            "is_self": true,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "locked": false,
            "media_embed": {},
            "num_comments": 59,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/4mkacp/xanax_sweet_xanax/",
            "retrieved_on": 1472746060,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I started Zoloft a week ago for anxiety that has been building for a while and is beginning to impact noticeably on my performance at work. I will gradually taper up to 100mg and I start counselling next week. Overall my experience so far is positive; my managers, even though they appear impatient, have been very supportive and as understanding as they can be. They know I am good at what I do, but also they understand that Life is clearly piling it on and I'm not coping very well. \n\nWhen my doctor asked if my anxiety, when in full swing, is in need of medicating like with Xanax. I immediately said no, it's not at that level at all, but also mentioned I was taking a 14hr flight in two weeks and that I'm a bit nervous about it, so she said here's some xanax for that, and a bit extra if you get caught up in any panicky moments while you're away.\n\nSo I took 500mcg last night as a sort of test run (I don't want the first time I try a fast acting benzo to be when I'm stuck in a tin can thousands of feet in the air -- what if I have an adverse reaction??) and I do get the irony about being anxious over taking a xanax ha. But sweet Jesus did I sleep well!!!!! That was the BEST night's sleep I've had in weeks! WEEKS! and I went to work this morning still feeling the affects, and floated on through the doors with such a spring in my step, I had forgotten what it was like to actually enjoy getting up for work in the morning! What a refreshing, if a little artificial, feeling. \n\nIt's a drug. I know. It's fake happiness and fake relaxation and fake sleep. But the enjoyment and the courage to face the day was real. I can't wait to feel this way without medication. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Xanax; sweet xanax",
            "url": "https://www.reddit.com/r/Anxiety/comments/4mkacp/xanax_sweet_xanax/"
        }
    ]
}