{
    "data": [
        {
            "author": "ilikeeatingmeals",
            "author_created_utc": 1453982856,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_u6rdr",
            "contest_mode": false,
            "created_utc": 1473461431,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/5206vc/when_your_antidepressants_start_working_and_you/",
            "gilded": 0,
            "id": "5206vc",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/5206vc/when_your_antidepressants_start_working_and_you/",
            "retrieved_on": 1476403861,
            "score": 459,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "When your antidepressants start working and you no longer have full blown panic attacks when you're in a crowd!!!!! woo!",
            "url": "https://www.reddit.com/r/Anxiety/comments/5206vc/when_your_antidepressants_start_working_and_you/"
        },
        {
            "author": "smokey_zzz",
            "author_created_utc": 1471826768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_10rwrf",
            "contest_mode": false,
            "created_utc": 1473872850,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52rite/does_anyone_else_have_such_bad_anxiety_it_makes/",
            "gilded": 0,
            "id": "52rite",
            "is_self": true,
            "link_flair_css_class": "discussion",
            "link_flair_text": "Discussion",
            "locked": false,
            "media_embed": {},
            "num_comments": 151,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52rite/does_anyone_else_have_such_bad_anxiety_it_makes/",
            "retrieved_on": 1476419133,
            "score": 281,
            "secure_media_embed": {},
            "selftext": "Every morning I wake up way earlier than I should, around six or seven. And every morning I feel on the urge of throwing up because of how bad my anxiety gets. The shitty thing is that there's really nothing to cause this. It's just a normal day and I am not obligated to go out in public or do anything, really. Unless I have to work, but my job doesn't give me anxiety. I love my job. This has been happening since March, when my boyfriend of three years and I were in the process of breaking up and moving out. I've accepted that I just can't be with him, and I've moved on. I have a wonderful partner now that treats me very well, and comforts me and kisses me to no end every single morning, but it doesn't help. The only thing I can do that helps is go outside and smoke a bowl. It makes me super tired, so it's easier to fall back asleep. By the time I wake up the second time around, I usually feel fine. \n\nI don't know what to do, but it's getting really old. Halp. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else have such bad anxiety it makes you feel physically sick?",
            "url": "https://www.reddit.com/r/Anxiety/comments/52rite/does_anyone_else_have_such_bad_anxiety_it_makes/"
        },
        {
            "author": "Cacahahadoodoo",
            "author_created_utc": 1429909373,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_n3uxx",
            "contest_mode": false,
            "created_utc": 1473817096,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52o6da/my_whole_life_just_got_flipped_upside_down/",
            "gilded": 0,
            "id": "52o6da",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52o6da/my_whole_life_just_got_flipped_upside_down/",
            "retrieved_on": 1476417281,
            "score": 233,
            "secure_media_embed": {},
            "selftext": "It all started on a Monday; of course... I had just drove to university and I got a call from my mom, I think \"she knows I have class this must be important\" when I answered she was balling. She told me about a text she had just received, a screen shot actually. A sum oh hundreds of messages and dirty pictures from my dads mistress. This was so unexpected- my parents had always been known to be the perfect married couple, envied by my friends and family members. My mom is heart broken, my dad has lost his mind. I spent yesterday changing the locks on the house for my mom and packing my dads shit, consoling my mother and trying not to think of myself but WAIT-THERES MORE. I wake up at 6 this morning not being able to sleep and look for my dog, not being able to find him I go out back and there he is; dead. He choked on something he found outside and died- covered in ants and just a gruesome sight I had to take him and clean him up and take his body to the nearest vet. After that I proceeded to go check on my dad and had to cradle him after multiple breakdowns- this is an old military man- a man I've rarely seen cry in my life. Idk man, idk. I don't if I'm losing my mind, idk what's going on. I feel so betrayed, I'm not a religious man but if there's a God i beg him to just make this calm down. I'm already a pretty anxious person and I also have IBS so I've been pretty miserable but no one knows. I have to be strong- what happens if I fall apart, what will happen to my parents. I'm literally in between a rock and a hard place. I just had to post this somewhere, I had to just write it down.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My whole life just got flipped upside down",
            "url": "https://www.reddit.com/r/Anxiety/comments/52o6da/my_whole_life_just_got_flipped_upside_down/"
        },
        {
            "author": "Um_is_this_taken_yet",
            "author_created_utc": 1364740378,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b4yi2",
            "contest_mode": false,
            "created_utc": 1473650389,
            "domain": "self.Anxiety",
            "edited": 1473729011,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52cdf9/fuck_this/",
            "gilded": 0,
            "id": "52cdf9",
            "is_self": true,
            "link_flair_css_class": "venting",
            "link_flair_text": "Venting",
            "locked": false,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52cdf9/fuck_this/",
            "retrieved_on": 1476410568,
            "score": 207,
            "secure_media_embed": {},
            "selftext": "Had an attack. First one in a few weeks, can't sleep. Seriously fuck this feeling, fuck anxiety, why the fuck do I have to be my own worst enemy all the goddamn time? Why can't I just fucking love myself? Fuck. \n\n(Edit-one day after) \nThanks everyone for the love and support most of the time an attack will leave me fucked up for a few days but this one I did mange to sleep off (which is a great thing) No depressive episodes at work today, No suicidal thoughts today, I'll call it a win. \nLove you all. If you guys ever need to talk, Shoot me a PM and don't even think for a second that it would bother me. \nThanks again. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "FUCK. THIS.",
            "url": "https://www.reddit.com/r/Anxiety/comments/52cdf9/fuck_this/"
        },
        {
            "author": "RnGRamen85",
            "author_created_utc": 1416525968,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jhj60",
            "contest_mode": false,
            "created_utc": 1473700333,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52ffh6/dont_keep_with_a_therapist_that_you_dont_actively/",
            "gilded": 0,
            "id": "52ffh6",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 41,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52ffh6/dont_keep_with_a_therapist_that_you_dont_actively/",
            "retrieved_on": 1476412419,
            "score": 207,
            "secure_media_embed": {},
            "selftext": "They won't care if you leave and it's your money, don't waste your time with someone that doesn't fit your personality and isn't helping. And there's a difference between someone who enables and someone that's helping, but if someone is being rude or otherwise just not helping cause maybe you're smarter than them, get a new one.\n\nThe good ones are out there I promise, just gotta look.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Don't keep with a therapist that you don't actively feel is helping you",
            "url": "https://www.reddit.com/r/Anxiety/comments/52ffh6/dont_keep_with_a_therapist_that_you_dont_actively/"
        },
        {
            "author": "junin16",
            "author_created_utc": 1377974189,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cynyh",
            "contest_mode": false,
            "created_utc": 1473518550,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/523dqg/i_hate_those_days_where_you_dont_accomplish/",
            "gilded": 0,
            "id": "523dqg",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/523dqg/i_hate_those_days_where_you_dont_accomplish/",
            "retrieved_on": 1476405578,
            "score": 199,
            "secure_media_embed": {},
            "selftext": "Yesterday i had my first web development class in my University, i am currently studying computer science, the class is basically an introduction and the teacher asks us to do a few things in the code he sent to our email. It's really basic stuff but i am able to fuck up the ctrl c ctrl v he asked us to do and now nothing works. I get home and asked for a friend of my to sent me the source code file so i can look up what i got wrong, but every minute after i send the message it was like torture, i coudn't stop thinking about wtf was wrong.See here that i knew nothing about web development so it was very fucking normal to not know what was wrong, but my brain decided that was a huge problem and i couldn't rest until i solved it.\n\nAfter 5h of walking around the house thinking, reading and trying to fix what i knew nothing about, my friend sends me the code and i spent half an hour reading and learning what was going on there, after that i could finally rest.\n\nTl;dr: I fuck up a ctrl c ctrl v in a Web Development class, spent an entire day thinking about my fuck up and at the end i learned very few when i could have worked out, studied other subjects and rested a little. I fucking hate those loop thoughts.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate those days where you don't accomplish anything because you can't stop thinking about something silly",
            "url": "https://www.reddit.com/r/Anxiety/comments/523dqg/i_hate_those_days_where_you_dont_accomplish/"
        },
        {
            "author": "KadexGaming",
            "author_created_utc": 1439083222,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_pesi5",
            "contest_mode": false,
            "created_utc": 1473389368,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/51v7ss/so_i_did_it/",
            "gilded": 0,
            "id": "51v7ss",
            "is_self": true,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/51v7ss/so_i_did_it/",
            "retrieved_on": 1476401163,
            "score": 177,
            "secure_media_embed": {},
            "selftext": "I finally confessed my constant feelings for my crush and was told she just didn't feel the same but was too scared to tell me. Its a lot to swallow at the moment but I know I can get through this. Everyone remember to breath. I love you all!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "so i did it.",
            "url": "https://www.reddit.com/r/Anxiety/comments/51v7ss/so_i_did_it/"
        },
        {
            "author": "Williusthegreat",
            "author_created_utc": 1348285775,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_934wr",
            "contest_mode": false,
            "created_utc": 1473296533,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/51op6c/i_started_a_round_of_ssris_and_therapy_7_months/",
            "gilded": 0,
            "id": "51op6c",
            "is_self": true,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/51op6c/i_started_a_round_of_ssris_and_therapy_7_months/",
            "retrieved_on": 1476397474,
            "score": 141,
            "secure_media_embed": {},
            "selftext": "I don't quiet know why I'm writing this. I hope this isn't seen as a self-serving post. I only hope that my experience with mental health and how I've overcome anxiety can help others.\n\nContext - I live in Christchurch, New Zealand. We had two major earthquakes, one in September 2010 and a more devastating one in February 2011. I could write a book about my experiences post-earthquake but in short, these events triggered what would eventually turn into a meltdown in June 2012. I was one of many people in my city who'd been silently trying to cope with PTSD without even knowing, until finally everything all fell a part. This was when I first sought help for Depression, Panic Attacks and Anxiety. My doctor referred me to a counselor, and around the same time I made some big life changes (I was really unhappy with where I was with my life, which contributed to my depression). I learned coping mechanisms to manage my anxiety and afterwards, everything was fine for a long time.\n\nFast forward to about February this year, and I could feel my anxiety coming back, and it was becoming harder to control. There was no depression this time, no major panic attacks (although I had to fight to control one or two of them from starting), I just had high levels of anxiety. I went back to the doctor and admitted I could no longer help myself and I needed help again. \n\nI was put on 20mg of Citalopram a day, and referred to a therapist. The meds helped a lot with the immediate symptoms of anxiety, but things really made a turn for the better after the therapy. I had 5 sessions with this therapist which ended in July this year. I learned so much from her which has helped tremendously, but I honestly don't believe it would have been possible without the SSRI's as a safety net. 6 weeks ago I started tapering off my meds, and today is my second day with no medication.\n\nIt's such a relief to have reached this point. If there's anything I can offer anyone else it's the following:\n\n*  Anxiety may never fully go away. It's ok to go back and seek additional help if you're finding things tough again. This is the second time I've had to seek professional help for mental health, and I hope it's a last - but I've promised myself not to hesitate if I need to seek help again. I think everyone can do themselves a favour by not hesitating when things are getting tough.\n* Find the doctor that's right for you. It's ok to shop around to find one that's experienced with mental health issues and can prescribe you with the right meds and refer you to the right therapists. \n* I was terrified to go on SSRI's because like many, I'd read the horror stories on the internet about their side-effects. Just remember, the internet is full of confirmation bias. People are only ever going to post on forums about the bad experiences, and rarely the good ones. There's also a lot of taboo and misinformation around the subject of anti-depressant/anxiety meds - I experienced this with my immediate family, so I just don't talk to them about it. A lot of people won't always understand, but they don't have to. Do what's right for you and your health. This actually applies to most things in life I guess!\n* The first two weeks on Citalopram sucked. Big time. I don't want to scare anyone, but I feel I have to be honest on this point. The saying is so true though, SSRI's make things worse before they make things better. I'm lucky to have an incredibly supportive partner who helped me through this stage. All I can say is keep reminding yourself that this is only temporary. It may be tough, and you may be tempted to stop, but if you stay on the meds, push through the first few weeks and remind yourself \"it's going to be ok\", you'll feel so much better when the meds start doing what they're meant to do. After the first few weeks were over, I had a few side effects but they were no more than an occasional nuisance. \n* Citalopram wasn't a magic pill that made everything lovely. It did however make my anxiety so much easier to handle. I was no longer constantly on edge and feeling like I was about to throw up. \n* I think I'd probably still be on the meds if it wasn't for my therapist. All I can say is CBT (Cognitive Behavioral Therapy) is the bomb! The meds helped bring my anxiety down to a manageable level in the short term, so I could start to function as a normal human being and take advantage of the therapy. CBT gave me the tools to manage my anxiety in the long term, and taught me how to recognise anxious thoughts and manage them before they turned into obsessive thought patterns. If you're refereed to a therapist, I highly recommend you find one who's trained in CBT. It's made the world of difference. \n* When/if you decide to come of your meds, make sure you taper off, and over a decent period of time. Coming straight off them \"cold turkey\" is a huge shock to the system, and had I done that I assume It would probably have resulted in my anxiety returning. Each morning when I'd reduce my dose, the day that would follow would normally be a little more tough. It feels like the return of anxiety, but it's just the effects of the drugs coming out of your system. SSRI's take time to build up in your body before they take effect, hence why the first few weeks suck. Tapering off them is basically the reverse of that, so as the level of the SSRI reduces in your system, those effects will present themselves. When I would reduce my meds these effects would only last a day or less however, and then I'd be back to normal. Again, just remind yourself \"it's going to be ok\". \n\nIf anyone has any questions feel free to ask. I don't know if this can be of any help to anyone, but I would be thrilled if something good did come out of this for someone. New Zealand has a pretty poor track record when it comes to Mental Health services, so I feel pretty motivated to share information if I can. \n\nTo end, I guess all I can say is, it's going to be ok. If there's anything I've learned, it's that there's been so many times where I thought a situation was only going to end in disaster, and I would obsess over the worst possible outcome. Disaster hasn't struck yet, and it's likely it never will, so that helps me breathe easy. I hope you can breathe easy as well :) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I started a round of SSRI's and therapy 7 months ago. my therapy has ended and i've finished my meds, and life is finally great again.",
            "url": "https://www.reddit.com/r/Anxiety/comments/51op6c/i_started_a_round_of_ssris_and_therapy_7_months/"
        },
        {
            "author": "ClerUnderwood",
            "author_created_utc": 1456426472,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_vjgy0",
            "contest_mode": false,
            "created_utc": 1473600535,
            "domain": "self.Anxiety",
            "edited": 1473660505,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/528hx5/lpt_when_having_health_anxiety_and_googling/",
            "gilded": 0,
            "id": "528hx5",
            "is_self": true,
            "link_flair_css_class": "healthflair",
            "link_flair_text": "Health Related",
            "locked": false,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/528hx5/lpt_when_having_health_anxiety_and_googling/",
            "retrieved_on": 1476408424,
            "score": 123,
            "secure_media_embed": {},
            "selftext": "Used to google every weird feeling,  trembling,  pain,  shake and got worried about all the possible shit i might have,  reducing the search to see if they can be anxiety related really helps me not worry\n\nEdit: Its of course better to not google symptoms,  all of you guys are right,  but if you do,  this for me made a big difference in my worries. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[LPT] When having health anxiety and googling symptoms always include anxiety in the search",
            "url": "https://www.reddit.com/r/Anxiety/comments/528hx5/lpt_when_having_health_anxiety_and_googling/"
        },
        {
            "author": "RnGRamen85",
            "author_created_utc": 1416525968,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jhj60",
            "contest_mode": false,
            "created_utc": 1473747326,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52j1rx/fuck_anxiety/",
            "gilded": 0,
            "id": "52j1rx",
            "is_self": true,
            "link_flair_css_class": "venting",
            "link_flair_text": "Venting",
            "locked": false,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52j1rx/fuck_anxiety/",
            "retrieved_on": 1476414440,
            "score": 120,
            "secure_media_embed": {},
            "selftext": "Nearly 3am here, fuck anxiety.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fuck anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/52j1rx/fuck_anxiety/"
        },
        {
            "author": "Awe101",
            "author_created_utc": 1396198668,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fx0aw",
            "contest_mode": false,
            "created_utc": 1473341231,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/51rab2/does_intimacy_set_off_your_anxiety/",
            "gilded": 0,
            "id": "51rab2",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 55,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/51rab2/does_intimacy_set_off_your_anxiety/",
            "retrieved_on": 1476398919,
            "score": 119,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does intimacy set off your anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/51rab2/does_intimacy_set_off_your_anxiety/"
        },
        {
            "author": "laughingOrangutan",
            "author_created_utc": 1471070779,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_10fh4i",
            "contest_mode": false,
            "created_utc": 1473784432,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52lesv/this_is_a_page_i_wrote_when_i_was_feeling_good_to/",
            "gilded": 0,
            "id": "52lesv",
            "is_self": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52lesv/this_is_a_page_i_wrote_when_i_was_feeling_good_to/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "u3nZMDXJ-7ZJbL5KddXSRyGndQ3ruwzRRmHNcTYNG8s",
                        "resolutions": [
                            {
                                "height": 168,
                                "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=acc403b17d5e51de39de89d47d09c7f9",
                                "width": 108
                            },
                            {
                                "height": 336,
                                "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=a807e103fbbfafe09f2d2c7199ea7880",
                                "width": 216
                            },
                            {
                                "height": 498,
                                "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=bc8f535e10181498b148112eab791ef8",
                                "width": 320
                            },
                            {
                                "height": 997,
                                "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=8c00abaea219fb5b7d2220fb7ed9b7c3",
                                "width": 640
                            },
                            {
                                "height": 1496,
                                "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=4955835f771606097d5befe1666b2028",
                                "width": 960
                            },
                            {
                                "height": 1684,
                                "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=7ce55c4c5422bc3e586f722d49423aa5",
                                "width": 1080
                            }
                        ],
                        "source": {
                            "height": 3864,
                            "url": "https://i.redditmedia.com/qg4OUL9SaNtGtyO6U57UYYbzYemMlcjWAmAwaIsLBgA.jpg?s=2dea17a95fdc3ca245ecfa3f8171ce15",
                            "width": 2478
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1476415760,
            "score": 104,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/0GGtzkzPYNsFAs8ZCg7HdTr6R9AA8M7DS5ExCEcsLyg.jpg",
            "title": "This is a page i wrote when i was feeling good to remind myself that I'm not the guy when i'm struck by anxiety/depression/other shitty things.( some lines are contextual)",
            "url": "http://imgur.com/gallery/wQe94"
        },
        {
            "author": "GrimeMachine",
            "author_created_utc": 1328721362,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6vesj",
            "contest_mode": false,
            "created_utc": 1473526210,
            "domain": "socialanxietyco.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/523yb7/dont_let_shyness_stop_you_from_looking_great_an/",
            "gilded": 0,
            "id": "523yb7",
            "is_self": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/523yb7/dont_let_shyness_stop_you_from_looking_great_an/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "zWbI9RlrT89Q_OOnWxfO2U5M5zLL6Ml3-tRbstoWseM",
                        "resolutions": [
                            {
                                "height": 72,
                                "url": "https://i.redditmedia.com/QQ963hFEqLpMRlqhaeh6eFrMehRpHA3AOG8MLMRkJtc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=5e20d5d39a552d1babc06092124de534",
                                "width": 108
                            },
                            {
                                "height": 144,
                                "url": "https://i.redditmedia.com/QQ963hFEqLpMRlqhaeh6eFrMehRpHA3AOG8MLMRkJtc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=7c438f9dac6aa49184a4b409bc7a6e5b",
                                "width": 216
                            },
                            {
                                "height": 213,
                                "url": "https://i.redditmedia.com/QQ963hFEqLpMRlqhaeh6eFrMehRpHA3AOG8MLMRkJtc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1acb60eb5eca8d83ce1d8007b78336b2",
                                "width": 320
                            },
                            {
                                "height": 426,
                                "url": "https://i.redditmedia.com/QQ963hFEqLpMRlqhaeh6eFrMehRpHA3AOG8MLMRkJtc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=3d2f5583a14e34743af6ec529a5d0126",
                                "width": 640
                            },
                            {
                                "height": 640,
                                "url": "https://i.redditmedia.com/QQ963hFEqLpMRlqhaeh6eFrMehRpHA3AOG8MLMRkJtc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=ba0dfa39f070cf55eaa11c58d52c5d45",
                                "width": 960
                            }
                        ],
                        "source": {
                            "height": 683,
                            "url": "https://i.redditmedia.com/QQ963hFEqLpMRlqhaeh6eFrMehRpHA3AOG8MLMRkJtc.jpg?s=38a7b8a8cc10364876f19b7e6eb18e99",
                            "width": 1024
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1476405894,
            "score": 96,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/HAuZDgLvG1DEIzl5Ks_Wmd7Ir8rWMg87LW_F8yJTUec.jpg",
            "title": "Don't let shyness stop you from looking great - an article I recently wrote regarding public self-consciousness, the spotlight effect, and dealing with how you feel when you dress a certain way (or try to) [x-post from /r/social_anxiety]",
            "url": "https://socialanxietyco.com/blogs/personal-time/don-t-let-shyness-stop-you-from-looking-great-why-it-happens-what-you-can-do-about-it-and-how-to-u-not-u-get-overwhelmed"
        },
        {
            "author": "jnv8231013",
            "author_created_utc": 1472692969,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_112qho",
            "contest_mode": false,
            "created_utc": 1473792605,
            "domain": "realsimple.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52m679/7_things_you_should_never_say_to_someone_with/",
            "gilded": 0,
            "id": "52m679",
            "is_self": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52m679/7_things_you_should_never_say_to_someone_with/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "HNDVJc820DzdSYyicZ5yprRKs6eINCKOQIj2cePqwYM",
                        "resolutions": [
                            {
                                "height": 72,
                                "url": "https://i.redditmedia.com/QAroGler5eAju3uCdszHVXT28tfQwl2ziD9GnJ7bb3E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=34394be0e2ab42baeeae6c1acd561ec5",
                                "width": 108
                            },
                            {
                                "height": 145,
                                "url": "https://i.redditmedia.com/QAroGler5eAju3uCdszHVXT28tfQwl2ziD9GnJ7bb3E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=6ebcd29f9f2ad861730549fb90accd63",
                                "width": 216
                            },
                            {
                                "height": 214,
                                "url": "https://i.redditmedia.com/QAroGler5eAju3uCdszHVXT28tfQwl2ziD9GnJ7bb3E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=c7ee13d69fcf71a249c457ce2cd09cc7",
                                "width": 320
                            },
                            {
                                "height": 429,
                                "url": "https://i.redditmedia.com/QAroGler5eAju3uCdszHVXT28tfQwl2ziD9GnJ7bb3E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=e2e49a120e8ba55461ed5a7f34319624",
                                "width": 640
                            }
                        ],
                        "source": {
                            "height": 552,
                            "url": "https://i.redditmedia.com/QAroGler5eAju3uCdszHVXT28tfQwl2ziD9GnJ7bb3E.jpg?s=11fc9611c9a2e8b1578c7620a6aa9a47",
                            "width": 822
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1476416190,
            "score": 93,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/BIpHIqzAdjjFRC8Pe7VBUc2JankEGTz91-yckYQYk4w.jpg",
            "title": "7 Things You Should Never Say to Someone With Anxiety",
            "url": "http://www.realsimple.com/health/anxiety-what-not-to-say"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "contest_mode": false,
            "created_utc": 1473616560,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/529qac/being_26_and_far_behind_other_my_age_is_making_me/",
            "gilded": 0,
            "id": "529qac",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/529qac/being_26_and_far_behind_other_my_age_is_making_me/",
            "retrieved_on": 1476409096,
            "score": 90,
            "secure_media_embed": {},
            "selftext": "i'm ridiculously far behind in terms of life accomplishments compared to others my age: i've never had a job, have never travelled as an adult, i've never been in relationship, i've never dated, i'm a virgin, i haven't driven a car since getting my licence as a teenager, i haven't had a close friend in over a decade now, i still live with my a parents and i'm only just now finishing a degree\na lot of this stems from anxiety issues and keeping to myself indoor only leaving for uni, but lately i find myself more and more depressed about getting older, in my mind i have fantasies about eventually achieving all these things ( though i'm worried about never achieving them also) , but i'm constantly worried that maybe i have missed out on living my youth completely, i won't be able to tell anyone my younger years were good, i'm going to have to explain to people i meet why i'm so unaccomplished and inexperienced for my age, i already look at younger people having a better time than me and feel so envious that i never gave myself the chance to or that they are far more comfortable when interacting with people than i ever was, can't imagine how much worse this feeling might be 10-20 years from now. I find myself constantly wishing i was 5 or 10 yrs younger, noone really associates 26 with youth as much as they do 21 of 16, i'm depressed i'll never get to feel undeniably young ever again, the thought of getting to 26 this quickly never crossed my mind 5 years ago, yet here i am already and unprepared, with less life experiences than some people a decade younger than me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "being 26 and far behind other my age is making me anxious daily",
            "url": "https://www.reddit.com/r/Anxiety/comments/529qac/being_26_and_far_behind_other_my_age_is_making_me/"
        },
        {
            "author": "EthelineTenenbaum",
            "author_created_utc": 1447607160,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_s28lo",
            "contest_mode": false,
            "created_utc": 1473806930,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52nfd7/did_someone_ever_told_you_you_were_overreacting/",
            "gilded": 0,
            "id": "52nfd7",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52nfd7/did_someone_ever_told_you_you_were_overreacting/",
            "retrieved_on": 1476416877,
            "score": 81,
            "secure_media_embed": {},
            "selftext": "Sometimes I feel like my family thinks I'm just a dramatic crazy person",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Did someone ever told you you were overreacting while you were extremely anxious about something?",
            "url": "https://www.reddit.com/r/Anxiety/comments/52nfd7/did_someone_ever_told_you_you_were_overreacting/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "contest_mode": false,
            "created_utc": 1473278286,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/51n7ff/today_anxiety_won_the_battle_but_lost_the_war/",
            "gilded": 0,
            "id": "51n7ff",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/51n7ff/today_anxiety_won_the_battle_but_lost_the_war/",
            "retrieved_on": 1476396611,
            "score": 77,
            "secure_media_embed": {},
            "selftext": "Had an opportunity to get a job I really *really* wanted. Have outright bailed on about 4 jobs in the past year due to anxiety. Good jobs too. No idea how I keep getting these.\n\nThere was an \"group training instruction\" tonight. It was unclear from the e-mail whether or not this was mandatory for the core aspects of the job. Was it for people who were instructing groups, or was it us being instructed in a group!? Anxiety began yesterday afternoon. Stayed up almost all night. Paralyzed in the morning. There was no way this was going to happen.\n\nI'm fortunate enough to have *some* skills in my black toolbox - it's black so the red cross stands out. So I can find it more easily when I need it. Enter damage control mode.\n\nI choose honesty, as I usually do when anxiety is trying to dictate my life. I send a short very straight forward e-mail. I say \"I have a personal emergency and I'm not going to be able to make it\". I say that \"I understand it's a training session, so please let me know where that leaves me.\"\n\nTen minutes later an e-mail blips on my phone. I debate not reading it. I think most times I wouldn't dare until hours later. Turns out it's in fact, for people who were going to be instructing in groups. This wasn't really going to be a part of my job anyways as I understood it. I'm not fired. I may not have the best start, but I have a chance.\n\nThanks for reading! Have a serene day, friends.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Today anxiety won the battle but lost the war",
            "url": "https://www.reddit.com/r/Anxiety/comments/51n7ff/today_anxiety_won_the_battle_but_lost_the_war/"
        },
        {
            "author": "ageekyninja",
            "author_created_utc": 1395778712,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_funly",
            "contest_mode": false,
            "created_utc": 1473504048,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/522l1q/final_update_i_am_a_21_year_old_with_a_driving/",
            "gilded": 0,
            "id": "522l1q",
            "is_self": true,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/522l1q/final_update_i_am_a_21_year_old_with_a_driving/",
            "retrieved_on": 1476405151,
            "score": 70,
            "secure_media_embed": {},
            "selftext": "**a little note here to the mods. I am posting this in anxiety because my doctor thinks GAD is highly related to my phobia :) just so you know Im staying relevant to the sub.\n\nOk....Im done posting here about this for now. Sorry Ive been posting a lot about me driving (should I say sorry?) its just that this has been super super stressful to me and I wanted to vent to people who would understand.\n\n**BACKGROUND**\n\nSo, here are my 2 major previous posts about my journey leading up to this point...or just go to my submission history and youll see everything, I posted a lot around reddit a few more times about this whole issue (reddit is basically my venting space lol). But here are the posts that really matter. \n\n[original post- short, just asking people to wish me luck](https://www.reddit.com/r/Anxiety/comments/4y96lt/im_21_years_old_and_tomorrow_i_am_going_to_face/)\n\n[update post. failed the test. long post, mostly because I saturated it with tips to help the many people I saw on this sub who were struggling with taking the driving test too. Good read for anyone who needs help.](https://www.reddit.com/r/Anxiety/comments/4yh3v4/update_i_am_21_years_old_and_i_have_a_driving/)\n\n**Ok, now to the actual update and tips**\n\nSo many of you guys shared my struggle that I just wanted yall to know its possible to get through this. Im serious. Seldom did I EVER think I would get my licence in my entire life because I was so fucking scared of driving. I really cant stress that enough.\n\nBut I still did it. I really, really did it. And when that examiner told me I passed I cried tears of joy right in front of him and shook his hand.\n\nSo I just wanted to give yall a few final tips on how to get your licence when it feels like driving is so scary that its basically life or death every time you get on the road in your mind- or if youre horrified of messing up or getting lost, or embarrassing yourself.\n\nThis is an extension of my second major post, so read that if you want more tips :)\n\n**When you get to your test its ok to tell your examiner that you have anxiety or a driving phobia that you are trying to overcome**. It really is. It can benefit you a lot to open up to people, even if they are strangers. The first time I took my test my examiner didnt know what was going on with me. She just knew I was incredibly nervous. But on this second test **when I actually told my examiner what was going on with me, he actively worked to help me ease my nerves during the entire test**. He encouraged me and talked to me the entire time, just trying to distract me from my fears. Im not sure which eased me more, his helpful actions, or just knowing that he was really rooting for me and cared about me.\n\nIm not saying there is any guarantee that you will get an examiner as kind and helpful as mine was, but if you just take a chance and tell them that important detail about yourself, I think its worth it. \n\n**If you show signs of nervousness during the test like shaking or sweating, its ok**. Its distracting to try and *hide* your anxiety. Shaking, sweating, etc, are just expressions of how you feel. You need to be focused on the road. So let your body and voice shake during the test if you have to. Get it out of your system. As long as you can push through then its ok to express yourself. Accept that you are going to be scared and then push on! Sometimes the most debilitating thing about anxiety is that we waste so much energy fighting how we feel that we end up hurting ourselves and putting life to a halt.\n\n**Its only going to feel bad for a little bit**. Just like that feeling before getting on a rollercoaster. Its always so terrifying before you get on the ride, but once you are on it you may not be scared anymore. Truly, the worst part for me was waiting for the test to happen and the beginning of the test. But once I was on the road for a while my fears gradually subsided and I was focused.\n\n**If you fail its ok to be upset. Just remember that failing doesnt really matter**. Seriously, so many people fail their drivers tests. Youre not any kind of special snowflake if you happened to do it too ;) congratulations, it just makes you normal :)\n\n**If you are like me, you might feel SO MUCH BETTER after you have your licence**. I thought my drivers test would just be the beginning of conquering my driving phobia...and who knows, maybe it is. But the strangest thing is happening. I....dont feel scared anymore. At least, right now I dont. Not THAT much. I think that before I took the test I just had a lot of familial pressure on me to progress in life and start driving and it just overwhelmed me. Now that Ive gotten over that hump and can actually adult and not worry about getting ticketed for not having a licence I am about 85% more comfortable about being on the road. So...I really didnt think I would react this way. Maybe you will end up like this too.\n\nSo, there you have it! Good luck to all you guys out there. I am really, really rooting for you and I mean that. You can do this. You can.\n\nOnce you pass dont be suprised if you need a day to take it all in. Honestly I was in complete shock the rest of the day after I passed my test. It was the weirdest thing. I was so overwhelmed with the *possibilities* granted to me by having a licence. \n\nSo many possibilities....\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "FINAL UPDATE: I am a 21 year old with a driving phobia. 2 days ago I got my licence. Tips on how to overcome driving test fears",
            "url": "https://www.reddit.com/r/Anxiety/comments/522l1q/final_update_i_am_a_21_year_old_with_a_driving/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "contest_mode": false,
            "created_utc": 1473561736,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/526kwb/i_cant_eat_i_cant_go_to_school_i_feel_so_worthless/",
            "gilded": 0,
            "id": "526kwb",
            "is_self": true,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "locked": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/526kwb/i_cant_eat_i_cant_go_to_school_i_feel_so_worthless/",
            "retrieved_on": 1476407363,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I can't eat, I can't go to school, I feel so worthless...",
            "url": "https://www.reddit.com/r/Anxiety/comments/526kwb/i_cant_eat_i_cant_go_to_school_i_feel_so_worthless/"
        },
        {
            "author": "chbay",
            "author_created_utc": 1313901818,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pc7u",
            "contest_mode": false,
            "created_utc": 1473795459,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52mfj1/i_just_walked_out_of_class_with_my_bookbag_still/",
            "gilded": 0,
            "id": "52mfj1",
            "is_self": true,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "locked": false,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52mfj1/i_just_walked_out_of_class_with_my_bookbag_still/",
            "retrieved_on": 1476416332,
            "score": 61,
            "secure_media_embed": {},
            "selftext": "The instructor was making each student talk about their ideas for a project proposal, and I immediately knew I wasn't going to be able to stay. I partly brought this upon myself because I haven't done enough research, but I froze up and decided to walk out when I thought he was going to call on me next.\n\nI'm sitting in the bathroom typing this out as I think about 1)How out of control I am with my life, and 2) How I can find a way to retrieve my backpack without running into him and having to come up with a BS reason of why I left.\n\nI'm 26 and didn't start getting panic attacks until my first day of school. My cropping anxiety is the worst it's ever been yo the point where I actually get sick. \n\nFirst post here, I'm sorry for the rant. I just needed to vent to somebody.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just Walked out of class with my bookbag still in it so i didn't have to describe my project to the class",
            "url": "https://www.reddit.com/r/Anxiety/comments/52mfj1/i_just_walked_out_of_class_with_my_bookbag_still/"
        },
        {
            "author": "Gordramus",
            "author_created_utc": 1332691802,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_79hcj",
            "contest_mode": false,
            "created_utc": 1473304060,
            "domain": "self.Anxiety",
            "edited": 1473469961,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/51p935/he_made_me_feel_ashamed_tonight/",
            "gilded": 0,
            "id": "51p935",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 29,
            "over_18": true,
            "permalink": "/r/Anxiety/comments/51p935/he_made_me_feel_ashamed_tonight/",
            "retrieved_on": 1476397786,
            "score": 60,
            "secure_media_embed": {},
            "selftext": "I've struggled for awhile with anxiety and a lot of my anxiety is wrapped around my sexuality and sex life. I'm a bisexual 21 year old male. Tonight I was with this guy I've been seeing for a few weeks and we tried to have sex but I was getting anxious so I told him I would rather we didn't and suggested maybe we do something a little lighter. He got in this mood and told me that he was offended I didn't want to have sex with him. We had tried earlier in the week with some mild amount of success but I just wasn't feeling up to it this time. He told me I offended him and we sat in awkward silence. I tried to explain that it was something that stressed me out and apologized but he said \"That isn't something I will ever be able to understand.\" Then he did some homework and then asked to leave. I just feel so ashamed. I can't function like everyone else and normally it doesn't get to me like this but right now... I really feel like an outsider. Like I'm not normal. It feels bad. I guess I just wanted to see if anyone else has felt like this and I also just wanted to tell someone. I don't feel comfortable telling my friends about this cause I'm fairly ashamed about it. \n\nEDIT: I really really appreciate all these kind comments. I woke up this morning and read through them all and it made me feel better. It made me feel kinda normal knowing so many other people are right by my side with this so thank you all!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "nsfw",
            "title": "He made me feel ashamed tonight",
            "url": "https://www.reddit.com/r/Anxiety/comments/51p935/he_made_me_feel_ashamed_tonight/"
        },
        {
            "author": "Blurrypuss",
            "author_created_utc": 1459652722,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_wub5y",
            "contest_mode": false,
            "created_utc": 1473714996,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52gqul/left_therapy_feeling_better_for_the_first_time/",
            "gilded": 0,
            "id": "52gqul",
            "is_self": true,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52gqul/left_therapy_feeling_better_for_the_first_time/",
            "retrieved_on": 1476413161,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "Today was my 5th therapy session, after the other 4 I left feeling miserable. Talking about all of my triggers and my past, and actually experiencing all the pain and guilt I had locked away was excruciating. But today we started working on moving past it all and picking apart all of my negative thoughts. Much to my surprise I got in my car after and instead of bursting into tears like usual i felt relieved. My triggers have still been triggering, there's still a lot of work to be done, but for the first time in years I feel like I might actually be better someday. I know this wasn't well written, but I thought I'd share some of this newfound positivity with you guys. Keep fighting you guys!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Left therapy feeling better for the first time today. Starting to feel like there is a light at the end of the tunnel.",
            "url": "https://www.reddit.com/r/Anxiety/comments/52gqul/left_therapy_feeling_better_for_the_first_time/"
        },
        {
            "author": "Ils808",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "contest_mode": false,
            "created_utc": 1473709715,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52g9uk/cbd_oil_i_wish_i_found_it_earlier/",
            "gilded": 0,
            "id": "52g9uk",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 63,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52g9uk/cbd_oil_i_wish_i_found_it_earlier/",
            "retrieved_on": 1476412897,
            "score": 57,
            "secure_media_embed": {},
            "selftext": "This stuff really works. I'm calm and I feel like myself. I wish I knew about CBD when my anxiety was at its peak.\n\nIt's worth trying if nothing else is working. Just be sure to buy from a reputable company",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "CBD oil, I wish I found it earlier",
            "url": "https://www.reddit.com/r/Anxiety/comments/52g9uk/cbd_oil_i_wish_i_found_it_earlier/"
        },
        {
            "author": "TheBlawndeLotus",
            "author_created_utc": 1470962149,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_10da6f",
            "contest_mode": false,
            "created_utc": 1473435795,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/51y1nj/crippling_social_anxiety_makes_me_such_an_awkward/",
            "gilded": 0,
            "id": "51y1nj",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/51y1nj/crippling_social_anxiety_makes_me_such_an_awkward/",
            "retrieved_on": 1476402703,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "Long story short, I've battled with horrible self esteem issues from a very young age (had horrible acne from age 9-18). I've always been hyper-aware of how I look in other people's eyes. This has lead to multiple eating disorders and a huge anxiety problem stemming from social contact. The only time when I feel like I am my true self is when I'm at home alone. Other than that, I feel like I must put on a show for other people, and I'm kinda paranoid that everyone is watching me and passing judgements (too fat, big nose, lame clothes), so I am constantly monitoring my body posture and keeping myself very tense. I don't know what I think will happen if I simply relax and just be myself fully. I'm actually a really weird and cool person when I get past my shy barrier. Over time this feeling has gotten a lot better, but I'm starting school at a new college and desperately want to make new friends and connect with others on a deeper level. Because of all these anxious and paranoid thoughts, I've spent the last six months with minimal human contact. I don't feel like I could handle going out and meeting new people who may think I'm not good enough. I'm so fed up with being socially awkward because of these unfounded beliefs and I'm tired of always trying to be something that I'm simply not. Getting pretty sick of holding back my awesomeness. I want to have a life filled with meaningful relationships. So my questions for everyone: Do you suffer from social anxiety? If so, what has your experience with it been like and in what ways does it hold you back? Any stories of success with overcoming social anxiety? I guess right now I just want to feel like I'm not alone. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Crippling social anxiety makes me such an awkward person",
            "url": "https://www.reddit.com/r/Anxiety/comments/51y1nj/crippling_social_anxiety_makes_me_such_an_awkward/"
        },
        {
            "author": "RootsEntwined",
            "author_created_utc": 1455713460,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_v6raf",
            "contest_mode": false,
            "created_utc": 1473787084,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/52lnmd/going_back_to_work_after_being_off_for_4_weeks/",
            "gilded": 0,
            "id": "52lnmd",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/52lnmd/going_back_to_work_after_being_off_for_4_weeks/",
            "retrieved_on": 1476415901,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "So I'm finally going back to work tomorrow after having a breakdown and going off sick. I've only got 6 weeks left there as I'm moving to Canada (also quite scary) and I want it to go smoothly and leave a good impression. \nI'm up at quarter to six and I'm really scared I won't sleep well and have terrible anxiety from lack of sleep and end up running out if the office in panic.\nThanks in advance for any advice.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going back to work after being off for 4 weeks with depression and anxiety. I'm terrified. Any tips?",
            "url": "https://www.reddit.com/r/Anxiety/comments/52lnmd/going_back_to_work_after_being_off_for_4_weeks/"
        }
    ]
}