{
    "data": [
        {
            "author": "Reeonimus",
            "author_created_utc": 1285624023,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4drv7",
            "created_utc": 1304110436,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/h0ez9/i_really_dont_know_if_it_is_anxiety_or_not_shed/",
            "id": "h0ez9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/h0ez9/i_really_dont_know_if_it_is_anxiety_or_not_shed/",
            "score": 10,
            "selftext": "Hello folks. I'm here to pour my problems upon you if you don't mind. I really don't know if this is the right place but maybe someone could point me in another direction if not. I can never voice the words to describe my woes but typing gives you the time to check... to think. Maybe someone here can help me make sense of it. I've had some issues with myself in my life I can't quite make sense of. I guess I've just always dealt with it but always had a constant nagging in the back of my skull silently screaming at me to acknowledge it.\n\nI'm a 24 year old guy who lives a normal semi-uneventful life with a decent job and a wonderful girl. \n\nThe thing is, I constantly avoid confrontation. I HATE it. My job involves a lot of talking to people, either face to face or on the phone. When I know I need to talk to someone, I tense up, I get nervous, I can't articulate thought into voice and end up mumbling, stuttering, or saying words incorrectly. Everything inside my head moves a mile a minute while in a situation I haven't been in before. I'm comfortable around my girl, my family etc. I'm the comical one of the family, the charming one, the funny one, the smart one, the intellectual one. This is what my family/friends say, not me.\n\nI constantly wish I could be like this to outsiders but I can't. Sometimes I think ahead about a scenario happening, myself having a certain conversation with someone and I plan how that conversation would go, what I would say, what they would say. Recently I entered a scenario which I played out in my head several times. A conversation with someone at my workplace. It was even a topic which I enjoy. The conversation started exactly how I played out in my head but when it was time to reply to them I froze. I wanted to talk to them about this topic which I really have so much to talk about but it came out broken, confusing. It's like I was over thinking what I should say and after I finally spit out what it is I was trying to say I feel disgusted. I feared whay they would think, what they **are** thinking.\n\nWhen playing out these scenarios in my head often my thought patterns wander to creating the worst case scenario in my head. I think about an upcoming event and play it out in my head with the result being my humiliation, embarrassment or even death! If I am walking down the street I am constantly prepared to jump out of the way **JUST IN CASE** a car veers off the road towards me. Such things aren't right to think about.\n\nI spoke to a doctor once but really didn't explain my problems, basically just told them I think I have anxiety problems and they passively subscribed me some Xanax which didn't really seem to do anything. Made me feel like a drug addict cause I know people can abuse anxiety meds. I took it daily until the prescription ran out and never went back to the doc out of fear. Fear of what exactly I really don't know. I wish I had a therapist but who the hell can afford that. You have to be rich to get professional help yet its the rich who typically go insane. Convenient.\n\nI hide all of this spectacularly well. People might think I just stutter sometimes but really I'm fracking dying inside. I swear my heart is going to stop by he time I'm 30. I remember in high school 7 or so years ago we were all measuring our pulse for some reason. All the healthy kids were you know 70 - 80 bpm, all the smokers were 90's, meanwhile my heart skyrockets to 100+ bpm almost like I'm afraid to even measure it! Can't even confront my own heart; Poetic, or pathetic?\n\nI may be rambling now and I apologize. If you made it through my wall of text thanks for reading. Venting helps to some extent.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I really don't know if it is anxiety or not. Shed some light?",
            "url": "http://www.reddit.com/r/Anxiety/comments/h0ez9/i_really_dont_know_if_it_is_anxiety_or_not_shed/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1301635449,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/gg4vw/im_exhausted_ive_been_worrying_about_something_i/",
            "id": "gg4vw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/gg4vw/im_exhausted_ive_been_worrying_about_something_i/",
            "score": 1,
            "selftext": "This is very hard for me to post, but I can't think of anything else left that I can do. I went to see a counselor, but they provided no specific help.\n\nAnyway, when I was a senior, this person I have not spoke to in ever sent me text messages, I was extremely stupid, and the person was \"sexting\" and in the end, it ended with us exchanging a few compromising pictures.\n\nThe next week I was an anxious wreck, I was crying and would pace around my house thinking.\n\nI read articles on the internet about teenagers being charged as an adult for these kinds of crimes, etc. and it made me a mess and extremely worried. For weeks after I searched every night for hundreds of articles, court cases, etc. all to try and \"see\" what would happen to me.\n\nI also thought back to when me and a friend where Google Image searching for pictures of people our age. And thought about how that was illegal (even though there was no images that were not adult anyway).\n\nI have been worrying everyday since then that my life is ruined, I will one day be exposed and be arrested.\n\nRight now in college I cannot focus, because I think I am just wasting my energy as I won't be able to get a job anyway.\n\nI know this may sound very stupid, but it truly does consume my life, and a day does not go by that I don't think about this.\n\nCan anyone please help? This is slowly ruining my life, and anytime I hear anyone say anything on the news about sexting or sex charges, it gives me anxiety. I don't know what else to do.\n\nEdit: I live in Canada, there have been no recorded charges in relation to sexting, and in a Supreme Court case (which has been since disputed if it would hold up in court), the judge said that the only way child porn laws violated someones rights is if an image is exchanged between two minors the same age.\n\nDespite all this, I still think something is going to happen to me (maybe for image searching).",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm exhausted, I've been worrying about something I did in high school for over a year, and I don't know what else to do.",
            "url": "http://www.reddit.com/r/Anxiety/comments/gg4vw/im_exhausted_ive_been_worrying_about_something_i/"
        },
        {
            "author": "NobleSounds",
            "author_created_utc": 1301024107,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_50bp1",
            "created_utc": 1303365730,
            "domain": "hubpages.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/gv420/what_anxiety_and_panic_attacks_feel_like/",
            "id": "gv420",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/gv420/what_anxiety_and_panic_attacks_feel_like/",
            "score": 1,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_gv420.png",
            "title": "What Anxiety And Panic Attacks Feel Like",
            "url": "http://hubpages.com/hub/anxietyexplained"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1303607060,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/gw1h7/halp_reddit_dealing_with_anxiety_in_college/",
            "id": "gw1h7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/gw1h7/halp_reddit_dealing_with_anxiety_in_college/",
            "score": 1,
            "selftext": "I am very stressed out, reddit. I basically lost all of my confidence over the past two years since going into college, plus my depression and OCD/neurotic-like habits have gotten a little out of hand. My grades are not horrible, a GPA of 3.0, but they’re not good enough to get into graduate school (physical sciences), which is depressing and I am extremely disappointed in myself.\n\nI had a hard time adjusting in freshman year, moved 2 times in the middle of the semester, bed bug infestation in one of the places, bad roommates, psychosis (exaggerating) induced from bad acid trip, not making any friends, which are all just excuses I’ve made for myself, but the bad grades I got were in my lower division requirement courses (C-, C, C+, B- range).\n\nNow, almost 4 semesters in, I have realized that the only thing I REALLY want to do is go into academia, but I feel like I’ve already lost my chance due to my earlier mess-ups.\n\nI know that applications are cumulative - GRE, letters of recommendation, work experience, etc. also count - but my anxiety problems have deterred me from even speaking to people sitting around me, let alone a professor or graduate school instructor (it’s stupid, I know). I’m afraid with continued failure I’m going to lose it, especially as I start getting into upper division courses where more is expected of me (althought I’m really excited to learn more!). I am a sophomore at a large, top 10 public university, and I really need to start getting into research (this is about the time most people start), but my credentials fall short and I don’t have any confidence whatsoever. Basically, adjusting to college life will probably result in brain hemorraging 20 years from now, or heart disease, not sure which yet.\n\nTLDR; not sure how most of you deal with being human\n\nSo, I’m not willing to withdraw for a semester because I like being here - believe it or not it's more of a sane inducing environment than my parents' house - and I was wondering if any of you guys are in a similar situation/have any experience on how to improve self image and sell yourself to get internships.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Halp reddit - dealing with anxiety in college?",
            "url": "http://www.reddit.com/r/Anxiety/comments/gw1h7/halp_reddit_dealing_with_anxiety_in_college/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1301988572,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/giyvw/im_weighing_the_pros_and_cons_of_medication/",
            "id": "giyvw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/giyvw/im_weighing_the_pros_and_cons_of_medication/",
            "score": 1,
            "selftext": "I have an appt with doc tomorrow to discuss options, medication being one of them. Anyone had any experiences that might help with my decision? Can employers ask? Did it help you? Any unexpected side effects? How soon did they (if at all) take effect?\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm weighing the pros and cons of medication. Thoughts? Advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/giyvw/im_weighing_the_pros_and_cons_of_medication/"
        }
    ]
}