{
    "data": [
        {
            "author": "webcrawler89",
            "author_created_utc": 1323809741,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6flo9",
            "created_utc": 1325181293,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nv4i2/saw_this_in_rgetmotivated_thought_we_could_use_it/",
            "id": "nv4i2",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nv4i2/saw_this_in_rgetmotivated_thought_we_could_use_it/",
            "score": 94,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/4onryU-m__uO0qeu.jpg",
            "title": "Saw this in r/getmotivated, thought we could use it here :)",
            "url": "http://imgur.com/kRAjQ"
        },
        {
            "author": "aglet",
            "author_created_utc": 1263100208,
            "author_flair_css_class": "",
            "author_flair_text": "kicking anxiety's ass",
            "author_fullname": "t2_3tfy6",
            "created_utc": 1324316221,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/niofm/i_laughed_then_i_cried_used_anxiety_book_xpost/",
            "id": "niofm",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/niofm/i_laughed_then_i_cried_used_anxiety_book_xpost/",
            "score": 42,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/CiSf5fDqFPOyRqRm.jpg",
            "title": "I laughed, then I cried: Used Anxiety Book (xpost from r/books)",
            "url": "http://i.imgur.com/uSMly.jpg"
        },
        {
            "author": "dweckl",
            "author_created_utc": 1253638522,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3n51i",
            "created_utc": 1325094480,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ntsbe/conqueror_of_anxiety_disorder_here_and_thought_id/",
            "id": "ntsbe",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ntsbe/conqueror_of_anxiety_disorder_here_and_thought_id/",
            "score": 40,
            "selftext": "\"Thoughts.\"  I quoted that purposefully, because \"thoughts\" are the key to many (if not the vast majority of) people's anxiety.  Over the past 50 years or so, researchers have discovered connections between feelings/emotions, healthy and unhealthy, and thoughts.   People with feelings of anxiety, depression, anger, etc. had similar types of thoughts.  \n\nSo researchers tried something pretty novel - they said \"fuck asking a person about mom and dad, let's see if we can directly challenge a person's thoughts and see if that affects feelings/emotions.\"  \n\nHere's what they found: \n\nPeople with feelings of anxiety, fear, and panic, nearly always have thoughts that they are in danger, and it can be any kind at all; danger of losing social status, being rejected, being physically harmed, having an illness, losing a job, dying, or even danger of becoming anxious (fear of fear).  Your mind creates the danger, whether it actually exists or not, and it is unable to distinguish between real danger and imagined or perceived danger.  The physical reaction you have is identical when you have mere 'thoughts' of danger as it is to the reaction if an actual lion were standing before you ready to chomp. \n\nInterestingly, people with feelings of sadness, helplessness, and depression nearly always have thoughts that they have lost something irretrievably, while feelings of anger are connected with thoughts that things are not as they \"should\" be, according to your idea, and that things \"should\" be different. \n\nResearchers then discovered that people with unhealthy levels of sadness, anxiety, guilt, shame, anger, etc. all seemed to have **irrational, unsupported, untrue, and otherwise illogical** thoughts of the types I just mentioned.  For example, an anxious person had thoughts of something dangers, and those thoughts were irrational, illogical, and sometimes really off-the-wall with no basis in reality.  \n\nSo the researchers set out to help people **identify their thoughts, challenge them, and modify them.**\n\nHere's a neat example of how thoughts, whether empirically true or not, can have monumental impacts on your emotions: \n\n*Your coworker calls to tell you that the lottery ticket you bought is the winner - $200 million, divided among 5 people.  You're ecstatic, your mind racing with thoughts of paying off debt, helping others, taking relaxing vacations, and buying that coveted Reddit-monogrammed leather miniskirt you always admired.  But your coworker got it wrong.  She looked at last week's winning numbers, and this week, you didn't win.*\n\nObjectively, you were never a millionaire.  You won nothing.  But the \"thought\" of it, without having a single dollar in your hands, without paying off any debt or taking any vacations, made you happy.  There was no connection between truth and reality and your thoughts and connected emotions. \n\nHere's an example of how anxiety tends to work: \n\n*You are going to a party, and you just **know** you're going to say something stupid to someone, and everyone will laugh at you and talk about you for years.  You may even become so embarrassed that your name is forever linked with social-failure, the old \"Munson\" syndrome.*\n\nThis thought is completely illogical and irrational, yet your body physiologically reacts as if you actually, truly are in danger of losing respect, being vilified, and having people look down upon you for eternity.\n\nCognitive Behavioral Therapy teaches people to identify their feelings and emotions, search for the \"thoughts,\" and then challenge those thoughts using various methods.  These methods include: \n\n* directly analyzing the truth/falsity of your thoughts by writing them and reviewing them\n* challenging the truth/falsity by doing something, like actually going to the party and seeing if you end up universally vilified forever\n* digging into the foundation for the thoughts, by searching for underlying fears and concerns and then challenging those. \n\n\nI thought I'd share this with all, because I spent years working on anxiety before researching CBT and reading books about it, and it can change your life. \n\n**EDIT**:  Thought I'd share another few postings on this subject with another Redditor.  http://www.reddit.com/r/Anxiety/comments/ntbu0/anxiety_attack/c3byymn?context=3\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Conqueror of Anxiety Disorder Here, and Thought I'd Share Some 'Thoughts'",
            "url": "http://www.reddit.com/r/Anxiety/comments/ntsbe/conqueror_of_anxiety_disorder_here_and_thought_id/"
        },
        {
            "author": "ravedaddy",
            "author_created_utc": 1322388026,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6bl45",
            "created_utc": 1322808083,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/mx9b8/ive_become_so_agoraphobic_ive_stopped_going_to/",
            "id": "mx9b8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/mx9b8/ive_become_so_agoraphobic_ive_stopped_going_to/",
            "score": 30,
            "selftext": "I've had a rough semester so most people understand my apprehension but nobody really knows how long I've gone without going to class. My Sociology/History classmates ask me when they see me if I've dropped out of the course but I just say I've been too sick to go. History I have an A+ in because it's all lecture and I've completed both essay assignments and the first exam and the lectures are online, so it's a zero-effort class. Sociology is similar. What I'm truly worried about is Precalculus, which I'm failing and have only attended twice in two months. Every time I wake up on time to go to class I have this overwhelming anxiety that forces me to hide in my room for most of the day. Sometimes I don't come out for days, and I don't eat. I worry that my effort to recover from my surgery, strep, and bronchitis is futile and that there is nothing I can do to bring my grade back up. My teacher won't admit that she is partially at fault for not answering my emails when I was ill. The syllabus does say that there are no makeup quizzes (the majority of our grade) unless there is prior notification, which she had plenty from me. All she said when I met with her was that I had to pass the final with at least a B to get a D in the class. She claimed that her computer was broken for 3 days and that is why she didn't get my emails and that she will not honor them. It upset me so much because I was prepared for them, and now I've gone into a deep depression and become agoraphobic because I think that there is nothing I can do. My biggest concern is having to show my parents my final grades. I had to drop one course already after my surgery, and now this. Oh and another fun thing I deal with: I have so much anxiety  over speaking about my anxiety that I won't go to counseling. Every time I have to go in that building I get nauseated. I need some serious help. Right now talking to people on the internet is my only solace.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've become so agoraphobic I've stopped going to classes almost entirely. Help me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/mx9b8/ive_become_so_agoraphobic_ive_stopped_going_to/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1324780593,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/npqyv/does_anyone_else_just_sit_there_and_quietly_think/",
            "id": "npqyv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/npqyv/does_anyone_else_just_sit_there_and_quietly_think/",
            "score": 29,
            "selftext": "Because I do. Life is fucking horrifying to me. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else just sit there and quietly think about life and all of a sudden just want to puke? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/npqyv/does_anyone_else_just_sit_there_and_quietly_think/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1323471703,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n6t7q/its_almost_impossible_for_me_to_have_a/",
            "id": "n6t7q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n6t7q/its_almost_impossible_for_me_to_have_a/",
            "score": 28,
            "selftext": "I don't know what it is but I just can't talk to people I don't know. It's too difficult to approach people and just start a conversation and I can't for the fucking life of me carry one with someone I've never met.\n\n\nYou can probably guess that I have an extremely small circle of friends already and I'm slowly but surely losing touch with them also. \n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "It's almost impossible for me to have a conversation/small talk with anyone that I haven't personally known for awhile.",
            "url": "http://www.reddit.com/r/Anxiety/comments/n6t7q/its_almost_impossible_for_me_to_have_a/"
        },
        {
            "author": "mileshigh_23",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1323828456,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nbtiz/one_of_the_most_effective_ways_to_reduce_anxiety/",
            "id": "nbtiz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nbtiz/one_of_the_most_effective_ways_to_reduce_anxiety/",
            "score": 27,
            "selftext": "Yes, I'm sure you've heard of it. It's called *exercise,* and I think a lot of people forget how HUGELY effective it is in lowering anxiety and stress. I've been forcing myself to run every morning before work, and I've noticed my anxiety and stress levels will drop down significantly when I'm doing this exercise. I also find that it builds up a momentum; that when I've done it multiple days in a row, it seems to \"set in\" a more relaxed physical feeling in my body. So I guess this is just a reminder. If you're tired of feeling tense all the time, go grab those running shoes!\n\nedit: definitely getting some mixed vibes on the exercise here. It definitely helps relieve stress for me, but looks like not everyone is in that boat. Regardless, I hope everyone *does* find what works for them.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "One of the most effective ways to reduce anxiety and stress...",
            "url": "http://www.reddit.com/r/Anxiety/comments/nbtiz/one_of_the_most_effective_ways_to_reduce_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1323394543,
            "domain": "alcoman.railfan.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n5n9z/ive_posted_this_before_but_i_think_it_bears/",
            "id": "n5n9z",
            "is_self": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n5n9z/ive_posted_this_before_but_i_think_it_bears/",
            "score": 25,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I've posted this before but I think it bears repeating. ",
            "url": "http://alcoman.railfan.net/fear.html"
        },
        {
            "author": "SylvrFalkon",
            "author_created_utc": 1320727125,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_67b2g",
            "created_utc": 1323966606,
            "domain": "socialanxietysupport.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ndwzb/interesting_social_anxiety_quiz/",
            "id": "ndwzb",
            "is_self": false,
            "media_embed": {},
            "num_comments": 35,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ndwzb/interesting_social_anxiety_quiz/",
            "score": 23,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Interesting Social Anxiety Quiz",
            "url": "http://www.socialanxietysupport.com/disorder/liebowitz"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1322846677,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/mxpfb/does_anyone_practice_mindfulness/",
            "id": "mxpfb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/mxpfb/does_anyone_practice_mindfulness/",
            "score": 23,
            "selftext": "My university has a group for people with anxiety and depression  where we learn mindfulness techniques to cope. We've practiced meditation, breathing techniques, walking meditations, among others. I'm still new at it and developing my skills, but so far I've had a lot of success with my anxiety symptoms. Anyone else practice, or have anything to add?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone practice mindfulness?",
            "url": "http://www.reddit.com/r/Anxiety/comments/mxpfb/does_anyone_practice_mindfulness/"
        },
        {
            "author": "krampus666",
            "author_created_utc": 1321334729,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_68v8w",
            "created_utc": 1324446475,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nkxjh/dae_check_their_pulse_constantly/",
            "id": "nkxjh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nkxjh/dae_check_their_pulse_constantly/",
            "score": 19,
            "selftext": "My anxiety has caused me to check my pulse every few hours... I'm pretty sure I am checking to see if my heart is racing at all when I am feeling anxious, although it usually doesn't (I seem to have a very low heart rate). \n\nWhen people notice me with my fingers on my neck they usually say something like, \"Checking to see if you're still alive? Hahaha\" \n\nAnyone?\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE check their pulse constantly?",
            "url": "http://www.reddit.com/r/Anxiety/comments/nkxjh/dae_check_their_pulse_constantly/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1324110763,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ng6v3/anxiety_about_not_being_able_to_access_a_bathroom/",
            "id": "ng6v3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ng6v3/anxiety_about_not_being_able_to_access_a_bathroom/",
            "score": 19,
            "selftext": "I am a 24 year old female and I have lived with anxiety since at least first grade. This was my earliest recollection regarding my symptoms manifesting. I have a fear about being somewhere where I wouldn't be able to access a bathroom quickly. \n\nSome examples include road trips and being stuck in a car,  that period of ten minutes on an airplane where you can't get up, being on any crowded places (bars on the weekends, concerts, popular restaurants) where there are a lot of people... Because where there are a lot of people, there will probably be a long line for the restroom.\n\nMy brain over thinks everything and I end up spiraling down into my dark hole of anxiety. I think that I have to use the bathroom immediately, and that if I don't find one, I WILL soil myself. Throughout my life, it had changed from nausea (gagging and dry heaving) to ther feeling of needing to urinate to the feeling of defecation. I also experience gas and stomach pains when anxious. It has gotten so bad in college that I've had panic attacks and couldn't go to class because I was scared I'd have to go to the bathroom while walking there. \n\nI've seen a couple of therapists who have basically said I will have to just learn to live with it. My new insurance sucks and doesn't cover psych, so my therapist had offered to keep going by just paying her my copay. Although that is nice, I feel like a burden because she could be helping someone else and getting money for it.\n\nHere is some background: i grew up in an Asian household with somewhat strict parents (not as bad as usually portrayed) and I am from a large metropolitan city. I went to UC Berkeley and majored in molecular biology. My mother has the exact same fear as I do, though hers is probably one tenth as bad as mine. I am/was working with a therapist that my parents are tied to my anxiety, and it has helped.\n\nThe biggest anxiety test of my life is coming up in two weeks. I am going to Japan (with my soon to be in laws-which puts even more anxiety on me) to visit my fiance's family who doesn't speak any English. There will be a lot of traveling where a bathroom is inaccessible and I need to hide my anxiety because I don't want them to see how bad it is.  I'll literally be in every situation that I find scary as hell - plane ride, train rides, large gatherings, etc. all while trying to impress his family.\n\nMy tools:\n-I've bought adult incontinence pads, kind of as a backup.\n-Ativan-this makes me sleepy and often times I can't remember what happened while I was on it. So I would prefer not to use it if I can help it.\n\nThe questions I pose to you, Reddit, are:\n-how do you get yourself out from the spiraling effect of anxiety? I've tried breathing, talking to myself, affirming myself that I'm ok. Although it works sometimes, it isn't a go-to technique for me.\n\n-does anybody else feel \"trapped\" when there isn't access to a bathroom?\n\n-please teach me any techniques you have when you feel a panic attack coming.\n\n-are there any suggestions about what my SO can do to help me? He has absolutely no idea what it feels like and I can tell he is lost and has no idea how to support me. \n\nThank you for reading my wall of text. I wish I knew someone in real life who knows exactly what it feels like to go through my poisonous train of thoughts.\n\nTl;dr: I have anxiety when I don't have immediate access to a bathroom, I feel the urge to barf/poo/pee in addition to panic attack symptoms. Going on a trip to Japan where there will be lots of sightseeing and transportation (= no bathroom) all while trying to not embarrass myself. What the hell do I do?!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety about not being able to access a bathroom immediately when I go on my trip to Japan in two weeks with the soon to be in-laws. Help! :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/ng6v3/anxiety_about_not_being_able_to_access_a_bathroom/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1322956374,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/mz6xp/dae_ever_just_have_one_of_those_days/",
            "id": "mz6xp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/mz6xp/dae_ever_just_have_one_of_those_days/",
            "score": 19,
            "selftext": "I know my issues with anxiety and depression are minuscule compared to most of the other posts on here, but I still wanted to post.\n\nDoes anyone else live a pretty good life for the most part, yet have days where you feel unsettled and discontent for no apparent reason? I seem to get those days after nights of debauchery or on days where I have little to nothing going on. They seem to occur more often in the wintertime, I think because of the lack of light, less time spent outside, and because of school-related obligations.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE ever just have one of those days?",
            "url": "http://www.reddit.com/r/Anxiety/comments/mz6xp/dae_ever_just_have_one_of_those_days/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1323105086,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n19v3/i_cant_talk_to_people_especially_on_the_phone/",
            "id": "n19v3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n19v3/i_cant_talk_to_people_especially_on_the_phone/",
            "score": 19,
            "selftext": "I'm seeing a school therapist about my anxiety. And I've got xanax. But none of it seems to help. And I need to find a place to live in a new city by next month, but I'm so terrified by the thought of calling people that I cry, get angry with myself, have panic attacks every time I try to motivate myself to do it.\n\nIf I don't do this soon though I won't be able to go to college because I won't have a place to live. Even the fear of that isn't helping me get over my anxiety. And to top it all off the people in my life are getting frustrated with it and yelling at me about it. I understand their frustration but I'm paralyzed. \n\nI've never rented a place in my life, I don't even know what to ask for when calling a person about this. I guess I know that the only way to get over my anxiety is to do it, but *knowing* that doesn't really... make a difference on how I feel about it I guess. I'm sorry, I just needed to rant in a place where people might understand. If you have any experience with getting over these kinds of fears please tell me about it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't talk to people, especially on the phone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/n19v3/i_cant_talk_to_people_especially_on_the_phone/"
        },
        {
            "author": "Guuuhhh",
            "author_created_utc": 1323233866,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6e2jh",
            "created_utc": 1323234726,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n3jql/can_anyone_identify_with_me/",
            "id": "n3jql",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n3jql/can_anyone_identify_with_me/",
            "score": 19,
            "selftext": "I'm really frustrated and just want to see if anybody else is experiencing the same symptoms as I am.\n\nI used to feel awesome, but after a few traumatic events I've gone completely down hill.\n\nI used to be comfortable with myself, love having a good time, love to party, hang around with friends, joke around, make chit chat with classmates, etc. I liked to be funny, draw, play music, and all the good stuff. I'm an intelligent person and used to do very well in school but no more.\n\nAfter a few traumatic events (est 3-4 years ago) my personality completely changed. Here's what I feel like every day.\n\n- I feel physically tired all day\n- I haven't had a genuine laugh in years\n- I can't connect with anybody, I have a few friends on the surface but no friends that I can just relax and enjoy myself with\n- Extremely low self esteem\n- Tons of anxiety\n- Can't concentrate on my studies\n- Have no passion for any subject or hobby\n- Push people away when they get too close\n- Constant knot in my gut\n- At any time in the day I would rather be taking a nap\n- Talking to anybody about anything is exhausting for me\n- Constant verbal thoughts about killing myself. Stuff like \"fucking shoot me in the face\" \"if I could push a button so that I would never exist I would\" \"kill me now\" **note that I'm not suicidal or anything, these are just thoughts that kind of precipitate out of my frustration**\n- Drinking does not affect me at all in the way that it used to, so while all of my friends love to party and have a few drinks I can join but I don't enjoy myself.\n- When my old friends from high school who knew me as a fun guy come back to town it just stresses me out because now I act awkward and apathetic around them\n- Can't even feel comfortable around family anymore.\n\nThings I have tried (believe me I am proactive at trying to conquer this fucking shit)\n\n- Zoloft (Currently taking)\n- Celexa\n- Effexor\n- Therapy\n- Putting myself outside of my comfort zone/\"out there\"\n- Never making excuses to not do something social\n\nNone of these medications have seemed to do anything and I have a strong suspicion they're probably more or less placebos.\n\nFML\n\nI don't think I can be fixed",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Can anyone identify with me?",
            "url": "http://www.reddit.com/r/Anxiety/comments/n3jql/can_anyone_identify_with_me/"
        },
        {
            "author": "anxiouswife",
            "author_created_utc": 1315177138,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5si70",
            "created_utc": 1323458905,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n6kgp/new_subreddit_for_people_who_support_people_with/",
            "id": "n6kgp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n6kgp/new_subreddit_for_people_who_support_people_with/",
            "score": 18,
            "selftext": "First off, thanks for all this subreddit has helped me with, as I learn more about my wife's anxiety.\n\nOut of those posts, I've realized that a separate subreddit may help for people who are supporting their loved ones as they deal with anxiety. So, I created [/r/anxietysupporters](http://www.reddit.com/r/anxietysupporters/). \n\nIf you have anxiety, and have a loved one who is a redditor, pass along this new subreddit. \n\nI welcome any comments, suggestions, or offers to help moderate :-).",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "New subreddit for people who support people with anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/n6kgp/new_subreddit_for_people_who_support_people_with/"
        },
        {
            "author": "Dr_America",
            "author_created_utc": 1316651451,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wi9g",
            "created_utc": 1323941614,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ndm3z/19yo_college_freshman_and_i_have_anxiety/",
            "id": "ndm3z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ndm3z/19yo_college_freshman_and_i_have_anxiety/",
            "score": 18,
            "selftext": "I was diagnosed last fall. Since then I've taken Effexor and then Venlafaxine (generic Effexor). When i was first diagnosed i was put Lorazapam because the anxiety was that big a deal. With my Anxiety come Social Anxiety, I had and have friends but i don't really talk too much. For me it's hard making friends. Spent the greater part of my senior year switching friend groups. I've never had a girlfriend. Hell i just got my first kiss at a party a couple weeks ago when i was drunk and this chick just started man handling me. When i think about it, it makes me sad that i haven't had a girlfriend. One of my better friends has a girlfriend and they've been dating for 9 months and when i see them i get even sadder that i don't have, or never have had, what they have. I've tried to do stuff like get in shape and workout, but every time i do, i end up working out for 20 minutes then saying to myself that i suck and then i stop and get even more sad that i stopped working out but i have no motivation to go back. I guess I'm saying all this because outside my family only 2 people know i have Anxiety and one of them guessed it from the way I behave and I guess i just want to tell someone. So if you read this, thanks for listening. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "19y/o college freshman and i have anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ndm3z/19yo_college_freshman_and_i_have_anxiety/"
        },
        {
            "author": "czerniana",
            "author_created_utc": 1302787222,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_53q54",
            "created_utc": 1324548190,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nmh29/wakes_from_dead_sleep_hi_mr_panic_attack_its_been/",
            "id": "nmh29",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nmh29/wakes_from_dead_sleep_hi_mr_panic_attack_its_been/",
            "score": 18,
            "selftext": "So, there is nothing quite like waking up from a dead sleep with a panic attack.  Many of you know what i'm talking about.  It's jarring, unsettling, and for me it is my nemesis.  \n\nI have absolutely no idea how to calm down from these because i don't know what got me there in the first place.  What do you guys do?  I need help calming down =(\n\n(no one will probably see this at 5am, but one can hope) ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "*wakes from dead sleep* Hi mr. panic attack, it's been a long time....",
            "url": "http://www.reddit.com/r/Anxiety/comments/nmh29/wakes_from_dead_sleep_hi_mr_panic_attack_its_been/"
        },
        {
            "author": "acmercer",
            "author_created_utc": 1223663641,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_39kix",
            "created_utc": 1324535669,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nmbyk/so_how_is_everyone_faring_this_holiday_season/",
            "id": "nmbyk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nmbyk/so_how_is_everyone_faring_this_holiday_season/",
            "score": 18,
            "selftext": "I'm having another sleepless night, lying in bed typing this on my phone. I can get into details later on but I'm wondering if you guys feel like a wreck around the holidays like I do, and how you deal with it.\n\nEdit: Sorry I kind of ditched this thread for a bit. Not good etiquette, especially here. But holidays, etc, also I didn't really know what to say but realized that I really like this subreddit. Never actually posted here before. Thanks for everyone's kind wishes and Merry Christmas/Happy Holidays/Happy Days. Stay positive everyone, and take care :)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So, how is everyone faring this holiday season?",
            "url": "http://www.reddit.com/r/Anxiety/comments/nmbyk/so_how_is_everyone_faring_this_holiday_season/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1323095248,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n141e/could_not_get_on_the_train_to_work_this_morning/",
            "id": "n141e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n141e/could_not_get_on_the_train_to_work_this_morning/",
            "score": 18,
            "selftext": "I could feel my anxiety growing and growing and by the time I got to the train platform I was having a panic attack. I managed to get on the train eventually but I had to get off at the next stop because I felt trapped. After I calmed myself down a bit I got back on the train again. Same thing happened and I got off again. I kept think \"what if I make a fool of myself and pass out in public?\" Finally I gave in and took a xanax and here I am at work now... With the xanax I can feel the adrenaline still in my body but my brain says \"who cares?\" instead of \"oh my god I'm gonna pass out\". I'm not sure why I'm posting this but it seems to make me feel better...\n\nEdit: Thanks for the kind words and tips everyone. I normally don't have a fear of being on the train but yesterday the panic just hit me. Today I was able to ride all the way with only mild anxiety. I used several tips you guys left for me yesterday such as playing a game on my iPod and breathing through my nose. I have a headache today though which I think is from the xanax I took yesterday morning... \nI'm pretty confident I'm through the worst of it. Now I just need to look into the root cause of my anxiety and address that. \nThanks!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Could not get on the train to work this morning.",
            "url": "http://www.reddit.com/r/Anxiety/comments/n141e/could_not_get_on_the_train_to_work_this_morning/"
        },
        {
            "author": "TwoKingsAndABroom",
            "author_created_utc": 1251437001,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3ludz",
            "created_utc": 1323549033,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/n7ph3/anxiety_seems_to_be_controlling_my_life_i_really/",
            "id": "n7ph3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/n7ph3/anxiety_seems_to_be_controlling_my_life_i_really/",
            "score": 17,
            "selftext": "I have been diagnosed with an anxiety disorder, and it affects my life a great deal. I've been on five different medications for it, and I'm not sure if any really work. \n\nI don't get out and socialize a lot, although I work in an area where i deal with customer on a minute to minute basis. I'm very polite and cheerful, but when alone or stressed, worries stack up and emotion tends to scale very high. \n\nI've tried dating a lot, but most people either stop talking to me, or feel I have too much anxiety. When out on a date, I worry about a lot, especially if I've upset my date. I've been sent to a psych ward for this happening actually. \n\nThoughts really get to me a lot. It's hard to break a negative chain, though I know how to put on a mask and help people at work. People usually notice something is up, but not enough to be critical. My friend says I know how to fool doctors, as she thinks their diagnosis of who I am seems very off base. \n\nAnxiety's really affecting my life, and I can't keep living like this. I really need your advice, Reddit.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety seems to be controlling my life. I really need advice. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/n7ph3/anxiety_seems_to_be_controlling_my_life_i_really/"
        },
        {
            "author": "marshmollie",
            "author_created_utc": 1293526829,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4nupf",
            "created_utc": 1323834421,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nbxnv/finals_insanity_or_scumbag_brain_finals_edition/",
            "id": "nbxnv",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nbxnv/finals_insanity_or_scumbag_brain_finals_edition/",
            "score": 17,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/ERB9w7dXbSeBBXWx.jpg",
            "title": "Finals Insanity (or, Scumbag Brain: Finals Edition)",
            "url": "http://i.imgur.com/oBICR.png"
        },
        {
            "author": "000ghosting",
            "author_created_utc": 1323970141,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6g3bw",
            "created_utc": 1324007764,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/neqi6/im_either_anxious_about_things_or_apathetic_about/",
            "id": "neqi6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/neqi6/im_either_anxious_about_things_or_apathetic_about/",
            "score": 16,
            "selftext": "So much so that I can't even get help. I'm too anxious about having to go to a doctor. I'm worried about money problems, my parents' divorce, employment issues, church obligations, social situations, being out of shape and overweight, being depressed, being lonely. And yet there's another side, too. Sometimes I just won't care about any of these things. I just try to slide by everything. Nothing is important, nothing matters because I'm so utterly worthless. Sometimes these feelings happen within hours of each other.\n\nI'm in a new town, don't know even how to go about getting a doctor, scared to death of actually going to see one, have no money to pay for anything, plus I don't know if I actually want to get help. I'm afraid I'll do it wrong somehow. I'm afraid I won't say the right things. I never say the right things. And I've never really thought myself worth helping. I'll probably just waste any help I'm given. \n\nI don't know if I actually want anyone to respond to this. It makes me feel, well, anxious.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm either anxious about things or apathetic about them.",
            "url": "http://www.reddit.com/r/Anxiety/comments/neqi6/im_either_anxious_about_things_or_apathetic_about/"
        },
        {
            "author": "happy_may",
            "author_created_utc": 1322423295,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6bnp4",
            "created_utc": 1322764647,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/mweie/anxiety_noneating/",
            "id": "mweie",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/mweie/anxiety_noneating/",
            "score": 16,
            "selftext": "I have been dealing with some major anxiety as of late and one of the MAJOR ways my anxiety manifests itself is by me losing my appetite.  This has nothing to do with wanting to be thin or food restircting, it is as if I am so stressed I feel like I can not hold food down, or even swallow it!  Even the smell of food makes me woozy.  I dont want to not eat.  I want to eat and stay healthy, I want to be healthy.  If you have delt with this and have any tips please share.\n\nEDIT:thanks all.  I have an appt with my therapist in the near future so hopefully that will help.  I was able to hold doen some fruit and lots of water, BIG THANKS!\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety Non-Eating",
            "url": "http://www.reddit.com/r/Anxiety/comments/mweie/anxiety_noneating/"
        },
        {
            "author": "craigtheotter",
            "author_created_utc": 1318809755,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_620vq",
            "created_utc": 1325151652,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/nurxl/anxiety_was_a_creepin_today/",
            "id": "nurxl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/nurxl/anxiety_was_a_creepin_today/",
            "score": 16,
            "selftext": "but I smacked that creeper in the face!!!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety was a creepin' today",
            "url": "http://www.reddit.com/r/Anxiety/comments/nurxl/anxiety_was_a_creepin_today/"
        }
    ]
}