{
    "data": [
        {
            "author": "fatman90210",
            "author_created_utc": 1294549854,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4peew",
            "created_utc": 1297800422,
            "domain": "reddit.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/fm1id/crosspost_from_raskreddit_i_have_a_crippling_fear/",
            "id": "fm1id",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/fm1id/crosspost_from_raskreddit_i_have_a_crippling_fear/",
            "score": 3,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "(Crosspost from /r/AskReddit) I have a crippling fear of death. Can informed biologists/chemists/physicists/philosophers/spiritualists, or anyone else at all please answer some of my questions and offer some advice?",
            "url": "http://www.reddit.com/r/AskReddit/comments/fko1v/i_have_a_crippling_fear_of_death_can_informed/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1298400263,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/fqg5p/so_hows_it_going_with_you_talking_helps_lets_talk/",
            "id": "fqg5p",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/fqg5p/so_hows_it_going_with_you_talking_helps_lets_talk/",
            "score": 3,
            "selftext": "I'm particularly curious if anyone's else here has serious job-related anxieties. I'm thinking a nice chat about them would make us feel better about them. \n\nAs for myself, I got fired a month ago for from my position as a clerical administrator due to inaccuracies in my work. I was in that position in the first place because I've been too anxious for years to pursue something either related to my degree (marketing) or something I'd really like to do, like computer programming.\n\nSince then I've moved 13 hours away to a town where I know no-one but my girl friend, who is attending college here. I'm actually sneak-living in her dorm room, which is fine since she's in a single in a building where people keep to themselves and you hardly ever see another resident. Still, if her RA gets suspicious I'm kicked out into the freezing weather. I was smart to move! Yay! It was kind of a spur of the moment, I just got fired, move or /r/sucidewatch decision. I decided to moved.\n\nAnyways, my resume simultaneously isn't that bad but I've never stayed in a job for more than a year, and I clench up thinking about having to answer for myself in an interview situation. I'm also trying to find a psychiatrist and a therapist out here, since I've been cowering in our room for the past week and I obviously need help.\n\nOn top of all this, I've been diagnosed with adult ADHD, inattentive subtype, and while this goes a long way towards explaining why I've been inaccurate, I still feel like I'm a pile of poop and unhirable, which is a terrible attitude that makes it pretty much impossible to even look at job listings.\n\nWhew, feel better already. So. What's going on with you?\n\nedit:\n\nRandom update, a month later. Just completed my first week on Adderall. It feels like I'm on a caffeine high all the time, which is just about the best possible result. When I had enough caffeine in my system, I felt like I could actually prioritize my thoughts and could get stuff done. It's pretty awesome.\n\nIt came just in time, too, because I got a job in a call center. That's pretty weird for me, because I have anxieties about the phone in particular. Worse still is that I'm responsible for answering customer questions using some antiquated DOS looking thing that's crazy complex. The good news is that I've had a week of classroom training on taking calls, and the first couple of days you either navigate the computer screens or talk to the customer while a veteran does the other. Then I'll be in a classroom for the rest of that week and the next week with a single veteran between 3 other new hires. They really ease you in. I'm procrastinating on studying my notes for the computer system in prep of starting tomorrow morning with live calls. But I'll dig in and I'll get interested and I'll be well prepared.\n\nedit the second:\n\nA month into my job, and I'm doing awesome at it.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So hows it going with you? Talking helps. Let's talk about everything that we can't talk about with our friends.",
            "url": "http://www.reddit.com/r/Anxiety/comments/fqg5p/so_hows_it_going_with_you_talking_helps_lets_talk/"
        },
        {
            "author": "far_and_alone",
            "author_created_utc": 1298329322,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4vgmx",
            "created_utc": 1298422059,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/fqo9k/add_anxiety_long_story_edited_xpost_from/",
            "id": "fqo9k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/fqo9k/add_anxiety_long_story_edited_xpost_from/",
            "score": 1,
            "selftext": "I'm going to be as vague as I can be without killing my story because you never know who reads Reddit and I'm terrified someone might come along and know who I am. I'm also going to say it right here and right at the top: I am not suicidal. I am still a rational person and am gravely afraid of death. Crazy, but not stupid.\n\nI don't know where to begin. I guess I'll start by saying a few things about myself. I'm a young male. I abhor drugs. I never drink. I'm very law abiding. I'm atheist. I am incredibly disorganized. I lose focus at the drop of a hat. I am a master of irrelevant information. I know something about just about everything, but I only know everything about certain specific things. I suppose that's a hallmark of ADD. The ability to start a million different things at once but finish none of them. Then theres the hyperfocus that comes with ADD that allows me to intently focus on one thing and one thing only for days on end. I was placed into every gifted program at every school I ever went to, then I was blamed for not excelling in my regular studies. Well, obviously. Why the hell would I want to take English when my gifted studies class is learning programming and making games? I wound up dropping out, getting a meaningless job, going back to school a year later and getting my diploma.\n\nSeveral years ago, I moved far away from where I grew up. I made the decision to move out and away from my parents so as to shun their support and make myself fly so to speak. I moved almost a thousand miles away to a city I've never been before. I rented a basement, got a job, and the 'high' of being on my own masked the impending depression and anxiety that was due to set in.\n\nI did well at my job. I even went on business trips for them. I forgot I was still a retail peon, even if I was distinguished somewhat. I went on an epic road trip and after, depression started to set in. I missed the good times I had with my friend on the road trip. I missed my friends. I missed home.\n\nThe next couple of months was rough for me at work. Being in this strange city began to take its toll on me. I had to leave. I had no friends and the depression was unbearable.\n\nSo I went back to the city I used to live in. I found a place and moved in with a friend for a roommate.  It was at this point that my anxiety began to kick in. I began having panic attacks. Terrified, I saw a doctor and was prescribed Ativan. I changed my diet and removed caffeine. It would seem they brought it on. So my prescription for Ativan ran out, but I dealt with the anxiety without them. My panic attacks were a thing of the past, anyhow.\n\nI decided to go back to school. So I started going back to college and immediately found I wasn't going to go anywhere because of my ADD. It was really bad. I went to see a doctor about getting ritalin. I had taken it as a child, but stopped as I felt too spaced out and like a zombie on it. But now I needed it more than ever. But my doctor had a problem with prescribing it to me. I was morbidly obese and had very high blood pressure. He wanted me to monitor my blood pressure and get it down to an acceptable level before he would prescribe the ritalin.\n\nSo I cut salt from my diet. Actually, I cut just about everything from my diet. I was 345lbs and loved food. But the hyperfocus part of my ADD kicked in and treated it like something I wanted to do. So I kept to it and in two weeks I was able to bring my blood pressure down enough to be prescribed ritalin. He said it would help with the weight too.\n\nSo I took that first tablet. It was like taking it for the first time. I felt... motivated. I wanted to see how effective it was so I cleaned my vehicle. I cleaned the FUCK out of it. I was spaced out and zombiefied, devoid of all emotion. I just wanted to do it and my body said, \"sure thing, boss\". Once I was done I went in my room and didn't know what to think. Doing something like that for someone with ADD is incredibly hard. It's like trying to lift a mountain. It was incredibly monumental and fulfilling to me.\n\nAnd so I continued taking ritalin, my doctor increasing the dosage. My weight began to plummet. I started going for walks. I began to take control of my life. I had patience and could focus on things and complete them. Then I began to starve myself using the ritalin. By not feeling hungry, I didn't give in to cravings.\n\nNow I had planned to move back to the city I failed in those years ago. I had ritalin and I was thinner and this time I'll make it work! I drove 20 hours through hell, but arrived safely.\n\nAfter arriving in the city, I became emotionally numb. I took it as a good thing because I ought to be feeling nervous. I stayed with a friend and told him what I was doing. He called me an idiot. \"You're killing yourself, you keep blacking out. Eat something!\"  He was right. Every time I had a hunger pang, I responded to it by taking ritalin. That's how I fed myself. And I was waisting away. At 265lbs, I was still obese. I had set a goal of 175lbs, and I intended to meet it. \"Yeah, so what happens when you hit 175lbs? Are you going to eat again?\" I never gave it much thought. Would I have to decide between the ritalin and my weight? By now I realized it. I probably had anorexia. I'm a big guy, a little anorexia should be good for you, right? I still don't know what's going to happen when I hit 175lbs. The answer seems simple and I'm a rational person, but eating disorders are anything but rational.\n\nDriving through the city the next day, I felt a panic attack coming on. The numbness I had enjoyed the past few days were gone and the realization of my situation began to hit me. What the hell was I doing in a strange city and nearly no support group? I used rational thinking to stave off the attack. Sleep times got pushed further into the night as insomnia kicked in.\n\nI went to see a doctor. I explained that I had insomnia and some anxiety and I was asked if I wanted an anti anxiety med. I always hated drugs. Accepting the ativan a few years ago opened the floodgates into accepting the ritalin. Even though I wasn't being offered ativan, I thought about the fact that I was relying on drugs. I managed to choke out a depressed sounding no and asked for something to sleep. I am no drug addict, I convinced myself.\n\nI got a place at a hotel for a couple days while my apartment application was being approved. I gave in and tried the zopiclone. I wound up stumbling around, hallucinating, and waking up drugged, Chrome opened to a bunch of reddits I didn't remember opening.\n\nI went back to the clinic. I told the doctor I felt drunk, drugged, hallucinated and felt like shit. He wrote me up a prescription for trazodone. He told me it was an anti-depressant but it was sedating. \"great....\" I murmured. In for a penny in for a pound. I was going to use drugs to treat myself. I decided that when I took the ritalin, why should I be upset about this? I did feel better when on these drugs. That was the point, right? But it went against one of my core beliefs. \n\nSo I went home, tried the trazodone and waited. And waited. And waited. I caved and took a zopiclone and instantly went to sleep. I woke up feeling like a boss. None of this tossing and turning half awake for an hour until I had the courage to get out of bed. I just got up and felt completely refreshed.\n\nSo I went on for a couple days like this, fighting the anxiety as best as I could. I moved into my new place. But I could ignore it no longer. I had anxiety and depression. I started shunning public places. I had a friend who was agoraphobic. I watched him turn from an outgoing person into a recluse who had very few \"safe zones\". And THIS terrified me. I had seen what anxiety had done to my best friend. It crippled him. I had seen the unused drugs in the open at his house. He refused to take them because it made him feel tired. I couldn't understand his condition at the time. I encouraged to him to come out. I knew what agoraphobia was, but to understand it you have to have it.\n\nI forced myself to endure crowded malls and interactions with other people. I did it subconsciously at first, fighting the anxiety. As if to say, \"What? I'm not afraid, damn right I'll go over there and start a conversation!\"\n\nYesterday I accepted that I had anxiety. I am always thinking that the people I interact with and those around myself are judging me negatively. The sleeping aid I was prescribed was a very tiny dose of antidepressant and didn't do anything. I did research and I came to the conclusion I needed serious treatment. I saw a doctor yesterday. I was put on Cipralex. I think he knew there was a serious problem forming that the other doctor didn't see. I had my first dose yesterday and I know it'll be a few weeks before I see results. He told me to follow up in four weeks.\n\nSo here I am, the obese anorexic drug addict. I've lost nearly ninety pounds since starting the ritalin. I'm on anti depressants and sleeping pills. I'm alone in a strange, yet familiar city away from family and friends. Defying my core beliefs. Using drugs to overcome my short comings, deluding myself from the real world. I already know I can't live without the ritalin. I look like a normal person from the outside, but inside I'm a mess.\n\nI require the ritalin to function: to be even somewhat organized. And even when I stopped taking it for awhile, my eating disorder remained; I am afraid of food now. Is Cipralex effective? Will it help me through this? Or are more drugs bad?\n\nWhat the hell should I do? I feel as if I'm at the bottom of a dark pit and I'm making all the wrong decisions, but I can't stop and I don't have a guide.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "ADD, anxiety, long story, edited xpost from offmychest",
            "url": "http://www.reddit.com/r/Anxiety/comments/fqo9k/add_anxiety_long_story_edited_xpost_from/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1298833574,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/fttbk/easily_done_anxiety_reducing_techniques/",
            "id": "fttbk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/fttbk/easily_done_anxiety_reducing_techniques/",
            "score": 1,
            "selftext": "Does anyone know of any helpful tricks to reduce anxiety aside from deep breathing? I'm pretty much 95% on my way to having a panic attack at work and am just looking for something to get me through the next 4 hours. Thanks in advance!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Easily done anxiety reducing techniques?",
            "url": "http://www.reddit.com/r/Anxiety/comments/fttbk/easily_done_anxiety_reducing_techniques/"
        }
    ]
}