{
    "data": [
        {
            "author": "maskedrolla",
            "author_created_utc": 1305060750,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_57vd3",
            "created_utc": 1310769558,
            "domain": "anxietyguy.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/iqu2a/started_my_anxiety_blog_it_isnt_complete_yet_but/",
            "id": "iqu2a",
            "is_self": false,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/iqu2a/started_my_anxiety_blog_it_isnt_complete_yet_but/",
            "score": 13,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_iqu2a.png",
            "title": "Started my anxiety blog. It isn't complete yet, but it's a start.",
            "url": "http://anxietyguy.com/about/"
        },
        {
            "author": "HersheleOstropoler",
            "author_created_utc": 1302646069,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_53fiu",
            "created_utc": 1311628837,
            "domain": "myhealthnewsdaily.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/izjl4/planning_worry_time_may_help_ease_anxiety/",
            "id": "izjl4",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/izjl4/planning_worry_time_may_help_ease_anxiety/",
            "score": 13,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Planning \"Worry Time\" May Help Ease Anxiety",
            "url": "http://www.myhealthnewsdaily.com/worry-plan-time-1727/"
        },
        {
            "author": "takazua",
            "author_created_utc": 1309479813,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5gb2h",
            "created_utc": 1309765948,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ig8u8/any_advice_or_help_ive_been_dealing_with_anxiety/",
            "id": "ig8u8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ig8u8/any_advice_or_help_ive_been_dealing_with_anxiety/",
            "score": 12,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Any advice or help? I've been dealing with anxiety, social anxiety, and anxiety-depression for as long as I can remember. Any advice form individuals who have seek treatment, such as self-help methods are truly appreciated.  Thank you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ig8u8/any_advice_or_help_ive_been_dealing_with_anxiety/"
        },
        {
            "author": "Pzora",
            "author_created_utc": 1306787097,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5b353",
            "created_utc": 1310672192,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ippr2/my_story_of_living_with_social_anxiety/",
            "id": "ippr2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ippr2/my_story_of_living_with_social_anxiety/",
            "score": 12,
            "selftext": "Just found this subreddit, figured i would share my story.\nI have had social anxiety since i think 3rd or 4th grade, Anxiety got really bad for me towards 5th-6th grade. I started missing school, which progressed even worse every year, due to this absence i was placed on PINS sysem, then eventually taken out of my home. They put me on buspar (i think thats how you spell it) for my anxiety.\n\nThe first time i was taken out of my home was to a group home for 1 month, (luckily) or at least that is how i felt, they were last month of school so i didn't get enrolled and have to go. The second time i got removed from my home was an attempt to \"scare' me to go back to school, it was a maximum security lockdown facility for 1 week. The last place i went to was a facility where they had their own private school and bunch of other stuff, stayed there for 4 months, it actually made going to school easier and it was 4 months of no anxiety. They took me off buspar early into staying there iirc.\n\nWhile i was in the final facility we moved, which I was never old enough to remember doing, So new school district etc. That was good but only lasted about 3 months, i was 16 and to old to be forced back to school so my mom signed me out so in the future I'd have an option of going back. \n\nLater on that year my mom passed away, month later my aunt, month after that another aunt. I forgot to mention due to all the staying home and my parents being the type of people that, snacks and fastfood = happiness, i became morbidly obese. Over the years it got worse of course, computer being my safe zone, get lazy to fight the anxiety so just sit around and gain weight. I haven't seen a doctor since i was 18 and put on disability.\n\nI was going to have lapband surgery but they wanted me to lose 40lbs, if i could lose 40lbs i wouldn't need the lapband surgery, i make shitty food choices, i don't overeat.\n\nI called a therapist today because my sister feels i should talk to a professional about everything, decided to write my story on reddit while i had a bit of anxiety; phone calls, even with family gives me anxiety.\n\n\nLong story so, TL:DR Happy boy turns into happy fat man but anxiety stops me from going out and living life (bad excuse but somewhat truthful).",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My story of living with social anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ippr2/my_story_of_living_with_social_anxiety/"
        },
        {
            "author": "espen_f",
            "author_created_utc": 1303825847,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_55euq",
            "created_utc": 1310842057,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/irftu/give_us_your_best_advice_on_how_to_calm_down_a/",
            "id": "irftu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/irftu/give_us_your_best_advice_on_how_to_calm_down_a/",
            "score": 12,
            "selftext": "ill start, and im not saying this is a magic trick or something, but when lately have started that i \"go in myself\" and feel a anxiety attack coming, i stop the thoughts by multiplying by 9.. usually it ends before i get up to 271.  so what is your trick?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "give us your best advice on how to calm down a \nanxiety attack.",
            "url": "http://www.reddit.com/r/Anxiety/comments/irftu/give_us_your_best_advice_on_how_to_calm_down_a/"
        },
        {
            "author": "inkspots",
            "author_created_utc": 1310588662,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ieje",
            "created_utc": 1310593298,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/iotty/need_advice_with_anxiety_and_sharing_my_story_so/",
            "id": "iotty",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/iotty/need_advice_with_anxiety_and_sharing_my_story_so/",
            "score": 11,
            "selftext": "Hi all. I'm a guy, mid-20s and I've dealt with anxiety for over 7 years now. I want to share my story, and would like to hear if anyone has any advice for me. I apologize that my story may seem a bit fragmented.\n\nFirst of all, here's how my attacks feel like at present time. Whenever I am in a situation where an attack may occur I usually have an overall queasiness, like you are about to take an exam. If an attack hits me, then it begins by rippling through my body with sort of sickly tingling sensation. The worst physical effect I get is by far the nausea. It is horrible. I have thrown up a couple of times. There is an overwhelming desire to flee, and my mind begins to race as it tries to figure out ways to get out of whatever situation I am in. As for medication I have been taking 20mg of Cipralex for the past 4 years, both to combat the anxiety, but also because of bouts of depression that I have been experiencing. I also have some Oxabenz that I take prior to stressful situations.    \n\nI actually first experienced anxiety attacks when I was about 12. I was taking the train home from school when a guy sitting in the back moves forward and sits a couple of seats away from me. While making eye-contact with me, and looking like a freaking psycho, he draws out a gun and starts fidgeting around with it. I freaked out and ran off at the next station, telling the train operator about the guy (later my Mom read in the local paper that the cops had checked him out and that it had been a fake, prop gun). Anyway, for weeks after that I began suffering mild anxiety attacks whenever I had to ride the train. I don't remember how long it took, maybe a year, but eventually the attacks subsided and went away.\n\nFast forward until I'm 19. My Dad passes away after a 3 year battle with cancer. The last 6 months he had mostly lived at home, being immobilized due to the cancer spreading to his bones. For the majority of that time I had sort of isolated myself, living in my own little world where I would sleep most of the day and play games at night, having little responsibilities because I had finished school. I was having difficulties dealing with my Dad's illness, and basically refused to talk to anyone about it. I pretended everything was OK and numbed myself out. About 2 months after my Dad passed away everything suddenly caved in. I first began having trouble swallowing and my stomach was upset. Then one night I suddenly had a massive anxiety attack, and began vomiting. Next day I went to the Doctor who prescribed me Truxal. I also entered a weekly grief group with other young people that had lost parents (headed by psychologists). For about 6 months I steadily processed my Dad's illness and death in the group, and it helped a lot. In this period I suffered from generalized anxiety, where I was basically on edge most of the time, felt sick and sometimes experienced anxiety attacks because I was convinced I had cancer. This eventually subsided too, and despite occasional bouts with hypochondria I was becoming myself again.\n\nHowever, towards the end of the grieving sessions I suddenly began experiencing anxiety attacks when riding in trains again. I talked to a psychiatrist attached to the grief group, but she said it wasn't anxiety attacks I was feeling, rather just an overall sense of uneasiness. Gradually the train related anxiety went away, but instead I now began experiencing anxiety in social situations, which plagues me to this day. Although I'm naturally introverted, I have no problem holding conversations and I used to have absolutely no issues whatsoever. I get along okay with people at my University when I'm at classes and what not. My anxiety mostly manifests itself in situations where I have to go somewhere to meet someone. As in, I make an arrangement and am therefore obliged to stay somewhere for a while. I don't go to parties or make new friends, because my anxiety is way worse if it's with people I don't know well. For the same reason I don't see girls. I feel like I can't go somewhere and just \"go with the flow,\" I feel like I can't travel anywhere either. I can go out to concerts or to a cafe by myself and although I will be on edge, I won't have any straight out panic attacks, but I am usually mentally exhausted afterwards and need to decompress at home. When I'm with other people I do way better in situations where I don't feel \"trapped,\" e.g. walking around outside. If I sit still in a room with someone I don't know well, my anxiety begins to build quickly. Same goes with eating for some reason. Sitting still and eating in a potential stressful situation (besides with my family) is difficult for me. \n\nIt's basically crippling my life and I want to be back in control and be able to do whatever I want without constantly having to fear anxiety.   ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Need advice with anxiety and sharing my story so far",
            "url": "http://www.reddit.com/r/Anxiety/comments/iotty/need_advice_with_anxiety_and_sharing_my_story_so/"
        },
        {
            "author": "HersheleOstropoler",
            "author_created_utc": 1302646069,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_53fiu",
            "created_utc": 1311951996,
            "domain": "sciencedaily.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/j39f3/outoftheblue_panic_attacks_arent_without_warning/",
            "id": "j39f3",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/j39f3/outoftheblue_panic_attacks_arent_without_warning/",
            "score": 11,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_j39f3.png",
            "title": "Out-of-the-blue panic attacks aren't without warning: Body sends signals for hour before",
            "url": "http://www.sciencedaily.com/releases/2011/07/110727122651.htm"
        },
        {
            "author": "Horrible_anxiety",
            "author_created_utc": 1311046467,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5j9zy",
            "created_utc": 1311053345,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/itk0b/productivity_anxiety/",
            "id": "itk0b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/itk0b/productivity_anxiety/",
            "score": 10,
            "selftext": "I get horrible anxiety whenever I have to do a project, especially while at home by myself. I just can't get myself to do a lot of things. This is why I did horrible in high school. I was diagnosed back in middle school as being ADHD, but as I get older I think that this is inaccurate. It feels almost as bad as when I'm public speaking. I really really want to overcome this but my job doesn't allow for me to take prescription drugs for mental disorders so I need an alternative. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Productivity anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/itk0b/productivity_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1310664412,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/iplj7/how_do_i_stop_anxiety/",
            "id": "iplj7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/iplj7/how_do_i_stop_anxiety/",
            "score": 10,
            "selftext": "I'm 13, and whenever I have to meet new people, or do something that I have no control over, my throat starts to feel like its closing up and it gets sore, I go into a cold sweat, I get this horrible feeling in my chest that never stops, and I have trouble breathing. How do I stop this from happening? It's starting to take over my life.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How do I stop anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/iplj7/how_do_i_stop_anxiety/"
        },
        {
            "author": "gnovos",
            "author_created_utc": 1261725061,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3sgyx",
            "created_utc": 1309827473,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/igsgm/i_have_terrible_anxiety_and_panic_attacks_but/",
            "id": "igsgm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/igsgm/i_have_terrible_anxiety_and_panic_attacks_but/",
            "score": 9,
            "selftext": "Basically my last doctor won't give me any sort of benzo-type medication because I have really bizarre reactions to them (for example, hallucinations), but I have terrible feelings of panic and anxiety that last for days and days and seriously damage my quality of life.  \n\nThey are most irrational feelings, like just sitting at home and seeing cars drive down my block can trigger my heart racing and incredibly strong feelings of approaching doom.  I realize they are irrational, and I can intellectually say to myself \"being afraid of random cars is retarded\" but that doesn't change the physical reaction at all.  It's very uncomfortable to be in a constant state of hyper-vigilance, bordering on physically painful (especially having one's heart racing 24 hours a day, and being unable to sleep for days).  \n\nDoes anyone have any tricks or techniques that help them soften the blow of panic disorders without using drugs?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have terrible anxiety and panic attacks, but can't use drugs to treat them.  Any non-med ideas?",
            "url": "http://www.reddit.com/r/Anxiety/comments/igsgm/i_have_terrible_anxiety_and_panic_attacks_but/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1310741824,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/iqgcd/i_havent_talked_to_friends_or_family_about_this/",
            "id": "iqgcd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/iqgcd/i_havent_talked_to_friends_or_family_about_this/",
            "score": 9,
            "selftext": "At social events where I don't know anyone I get kinda shaky and quiet... get real nervous and want to run for the door. My legs kinda wobble and when people talk to me I stumble on my words... I also don't call my friends to ask them what they are up too because I don't want to be invasive on their plans. Then when they don't invite me places I think they hate me or something (i know it's not the case but thats how I feel). \n\nI've been trying to fight it by forcing myself to go out alone and enjoy myself but It isn't comfortable or enjoyable...\n\nIs this social anxiety? It just appeared in the last 2 - 3 years... I've turned into a real awkward person... I used to be super out going... ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I haven't talked to friends or family about this...",
            "url": "http://www.reddit.com/r/Anxiety/comments/iqgcd/i_havent_talked_to_friends_or_family_about_this/"
        },
        {
            "author": "anotherattempt",
            "author_created_utc": 1310319445,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5htvo",
            "created_utc": 1310320972,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ilpxy/desperately_need_help_not_sure_where_to_turn/",
            "id": "ilpxy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ilpxy/desperately_need_help_not_sure_where_to_turn/",
            "score": 9,
            "selftext": "Hi all,\n\nI am posting here for advice on where to go, what to do, and perhaps gain hope. Sit tight, it's a bit of a story.\n\nI first encountered problems with Anxiety after a bad mushroom trip almost three years ago. For three months I felt pretty screwed in the head, with symptoms of anxiety and dp/dr. During this time I avoided all substances (alcohol, weed) and remained sober. 3-4 months later I decided to try weed again while drunk, and it didn't have a negative effect for the most part -- and I began using it again frequently.\n\nOver a year ago I got a brilliant developer job working in the city -- the type of job which is very rare -- good money for my age, friendly directors/bosses (more friends!), etc.. I became very happy. I felt like the happiest person in the world, although perhaps a few things were missing. \n\nI commuted everyday for an hour and a half on the train (three hours a day), which meant that I was leaving at 7AM and not getting back until 8PM - 11PM every single working day. I was still smoking marijuana at this time.\n\nAbout 6 months ago I decided to give it up, and have tried it on and off (maybe 8 times in total) since then. Ever since I gave up I began to slip into depression and anxiety. I feel like I am loosing control of my mind. For the past three months, I have begun having panic attacks (severe) on the train, and I feel like I just don't have enough energy to cope anymore. I gave up on the train and stay in London, but I feel trapped in a city -- a city which is crowded with no countryside.\n\nI feel like I can't take it anymore. That, and I wonder if I should be going to university to get a degree and spending more of my life living and experiencing things before I give so much of my time away for money.\n\nI just don't know what to do anymore. Recently I feel like Iv'e been getting worse. Paranoid about things around me -- waiting for a 'glitch' in reality to confirm that I'm going psychotic or schizophrenic. At one point I even felt like I was surrounded by evil. I feel like I could get on a train and just completely lose it, smash the windows and jump out, jump off a bridge, whatever. Like I would completely lose it and kill myself almost as if it was an instant reflex. I have woken up screaming in the night because I thought I was either dying or my legs stopped working (rare).\n\nI get incredibly dizzy sometimes, everything seems to fly past, sometimes I litterally feel like I can't walk (perhaps described as legs turning to jelly.. but I feel more like I just cant move). Other times I just feel like I need to escape. More often that not I feel like I can never relax. Like what is happening to me is constant.\n\nI try to read things to find help, but people seem to give advice that doesn't seem to help. People that seem to think it's something that happens once and a while and then you're fine. Not something constant.\n\nA few weeks ago I ended up in hospital because I demanded that I needed tests done -- they seemed to think it was anxiety. I visited a pschologist twice but they just gave me some bullshit questionaires to fill in each week, so I demanded more help. I was transferred to another more senior psychologist but they dropped me because I didn't attend -- because they sent the letter to my home address and I was not home as I am staying in the city.\n\nWhat really annoys me is that I feel like I could have a perfect life, if it were not for the anxiety/depression and feeling so trapped.. and feeling like I'm never going to have any time again. Like I am a slave.\n\nI was prescribed medications, but have not taken them because of fear of worsening. Even if it makes me worse initially -- how am I supposed to commute to work? I wouldn't want to take them while staying elsewhere.\n\nI have tried excersizing -- that does not seem to help a whole lot. Maybe I am doing something wrong there. I just don't know what to do anymore.\n\nI want to live. I am only 21 years old. Although sometimes I feel like it's just going to end soon. That I can't possibly continue. That eventually I will cave. I think it's a miracle I havn't already. I think it'd take a miracle to save me now too. Like my mind is fucked beyond repair. Not that I did a whole lot of drugs.. mainly just alcohol and weed. \n\nSo if theres anybody out there. Anybody at all that can say something meaningful. Please come to my aid.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Desperately need help. Not sure where to turn.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ilpxy/desperately_need_help_not_sure_where_to_turn/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1312075411,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/j4ib2/is_it_a_problem_or_do_i_just_need_to_buckup/",
            "id": "j4ib2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/j4ib2/is_it_a_problem_or_do_i_just_need_to_buckup/",
            "score": 9,
            "selftext": "I've been struggling with this for a while now. \n\nI dread seeing other people, even friends and family. Social situations make me nervous, and a get a dream-like, distant sensation. \n\nI'm living with two people who treat me like I don't exist and I do whatever I can to avoid them. I don't venture into the rest of the house unless necessary. \n\nI desperately need to get a job or go back to school, but the thought of doing either makes me nervous, and just getting job applications sends me into panic attacks. \n\nFalling asleep is difficult, but waking up is even harder. I try to motivate myself each morning that there's a reason to get up, when really I wish I could just ignore my existence. \n\nGrowing up, my father was very much a \"pull yourself up by your bootstraps\" sort of man. No nonsense, don't be a pussy sort of thing. So I keep telling myself I just need to snap out of it, but my inability to do so thus far has only fueled my feelings of inadequacy. \n\nDoes it really help to talk to a doctor or a therapist? I have a fear of taking that profound of a step and being told by a professional that I just need to snap out of it. Just the mental image of myself going to someone and asking for help, saying \"I'm sad, everything is hard, boohoo\" makes me sick with myself. \n\nI just want a normal life, to be happy and productive. I want a job so I can afford to move out, and surround myself with people who don't make me feel like shit.  \n\nHas anyone been in this situation? And gone to a professional and it got better? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Is it a problem or do I just need to buck-up?",
            "url": "http://www.reddit.com/r/Anxiety/comments/j4ib2/is_it_a_problem_or_do_i_just_need_to_buckup/"
        },
        {
            "author": "Mastadave2999",
            "author_created_utc": 1285826224,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4e1nq",
            "created_utc": 1310547158,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ioa6v/new_to_the_panic_world/",
            "id": "ioa6v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ioa6v/new_to_the_panic_world/",
            "score": 8,
            "selftext": "I have had issues dealing with people from a \"social anxiety\" perspective most of my life, but never debilitating to the point were i felt unable to function.\n\nAt an early age I got involved in drugs, mostly of a psychotropic nature (IE Marijuana, LSD, mushrooms that sort of thing) but have avoided them for the last 10 years or so.\n\nOddly enough even with my aversion to people the only serious jobs I've ever held have been sales jobs. During the beginnings of my career this wasn't as big an issue working in a call center and being able to \"hide\" behind the phone really gave me the confidence to excel and I received lots of recognition, etc. Subsequent to this however i was promoted into management and forced again to deal with folks face-to-face.\n\nI haven't minded it and been successful doing so for the last 5 years. My anxiety of people easy enough to \"work around\" by keeping people at a safe distance and create comfort zones that still allowed me to build (mostly) healthy relationships with my peers.\n\nThe \"problems\" I usually face are severe lack of self confidence and self worth. Even stranger an odd fixation with my nose and eyes. My nose always \"itchs\" or I feel overly aware of it on my face. Additionally certain angles, corners, etc cause me discomfort in feeling threatened they could potentially jab my eyes. (completely unfounded) These problems seem to escalate when forces into social situations. \n\nThe fast paced corporate world and stress inducing expectations coupled with a boss that is a notorious \"mental bully\", seems to have come to a head here recently. I've experienced what I've considered \"social anxiety\" and discomfort most all my life but here recently it seems to have been kicked up a notch. The last week or two have been exhausting, placing me on edge almost 24/7. \n\nWhile on the job, I'm barley able to interact without what I feel is a complete meltdown. It is so hard for me to stare at another person in the face without sensory overload or \"eye\" paranoia. Strange is it can be were the person is standing in relation to what is behind them that emphasizes the issue, and who the person is. \n\nNormally the issues are compounded with physical fatigue. The \"constant vigilance\" of trying to keep it all together is exhausting so I've felt its a downward spiral. Even now my heart races thinking about the next \"panic\" wave.\n\nAm I going crazy? Are these types of \"social issue\" suppose to just surface this late in life (29 y/o) Are any of these symptoms of a specific disorder? I have an appointment with a Dr. tomorrow, but not even sure if thats the right approach.\n\nThanks for reading/advice",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "New to the \"panic\" world",
            "url": "http://www.reddit.com/r/Anxiety/comments/ioa6v/new_to_the_panic_world/"
        },
        {
            "author": "MyopicProphet",
            "author_created_utc": 1310069287,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5he5d",
            "created_utc": 1311264508,
            "domain": "legacy-control.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ivxbn/anxiety_has_its_perks/",
            "id": "ivxbn",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ivxbn/anxiety_has_its_perks/",
            "score": 8,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_ivxbn.png",
            "title": "Anxiety has its perks.",
            "url": "http://legacy-control.com/?p=231"
        },
        {
            "author": "Rosethorns",
            "author_created_utc": 1310158531,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5hkjr",
            "created_utc": 1310439123,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/in0zp/freedom_in_fits_and_starts/",
            "id": "in0zp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/in0zp/freedom_in_fits_and_starts/",
            "score": 7,
            "selftext": "Reddit has a place for everything doesn't it, so glad I have a place to vent.\n\nDo any of you out there find that they gain freedom from their disorder for periods of time, a week or so, maybe a month if your lucky but then something throws you straight back in?\n\nI have had a major anxiety disorder for most of my life I expect, but Identifiable over the last 4 years when it started manifesting as anxiety around my health. (thats also when it became an actual problem)\n\nThe therapist identifies it with me as \"Hyper vigilance\" you see, prior to the time I started 'worrying' about my health I had issues with my father, and would constantly be treading glass around him, this is where it started, constantly having one ear out listening for his diesel truck pulling into the drive, so I could quickly bury myself in some school work or something to appease him.\n\nWhen my father got help for himself and life evened out for me around the home, it seems my \"mental defense\" turned inward rather than being thrown out now that it wasn't needed. and now I will notice the slightest thing you could call odd about my health. a headache. a pressure in my chest. an ache in my neck. anything like that and instead of treating it as 1. headache 2.heart burn 3. tweaked muscles, it's 1. tumor, 2. heart attack, 3. shifted vertibrae\n\nWhy am I giving you my life story? well for context I guess :P maybe to vent a little too. So this freedom I'm talking about in the post title, sometimes I'll have a week, maybe even an entire month where I don't have an anxiety attack, I can get on with my life, I can make movements to improve, I can really knuckle down and /live/.\n\nBut always always always, the first anxiety attack after one of these 'holidays' will be a full. on. Panic attack, crippling, no sense of time, gibbering, hiding in my room, mess. And then for the next few days after I will have pretty nasty anxiety attacks.\n\nThis is day three after the return of the attacks, I'm sitting here writing this mostly because I want to talk about it with my fellow anxiety sufferers and partly because I'm trying distract my self from the anxiety attack I have been having all day. because of a mild headache no less. I do my tummy breathing, I do my relaxation therapy. I do all the things I learnt in the small amount of CBT I have done, it works when the attacks are weak. But not so much when they are strong like now.\n\nSpeaking of CBT it's hard to pay for, I had to stop only part way into it because I simply didn't have the funds to keep going. (it's hard to make money when you have to take every 3rd day off work on average because you have a panic attack that leaves you brainless the rest of the day)\n\nI just want my attacks to level out again, so that I can function day to day at a semi-reasonable level. Rather than this daily barrage.\n\nSO! do any of you experience these 'holidays' from anxiety? and do you always get slammed at the end of them?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Freedom in fits and starts.",
            "url": "http://www.reddit.com/r/Anxiety/comments/in0zp/freedom_in_fits_and_starts/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1311748981,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/j0xuk/im_starting_a_job_in_a_few_weeks_and_have_nothing/",
            "id": "j0xuk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/j0xuk/im_starting_a_job_in_a_few_weeks_and_have_nothing/",
            "score": 7,
            "selftext": "A little background; I have Pure-O OCD, which is a lot like an anxiety disorder.  Intrusive thoughts enter my mind, and then worry worry worry.  I think and think and think and think (about ex girlfriends, acquaintances who may or may not like me, how I drove a little bit drunk once a few years ago, etcetcetcetcetc inconsequential things) and it drives me batty. \n\nI graduated from college in May, and have been taking the summer off before I start working.  I was doing alright for the first two months, but now I can barely make a through half the day before I'm driving myself mad, and usually go to bed while fighting panic attacks until I pass out from exhaustion.  As such, my schedule has become almost nocturnal, which worsens the boredom because I can't really do outdoor things.\n\nI need a job to keep myself busy, and after a few months without constant responsibility, I'm cracking.  I don't want to wake up anymore, since all I do, sans hanging out with friends in the brief overlap of our schedules, is worry.  It doesn't help that there's the additional stress added of having to move to a new city for the job.  Anyone have similar experiences?\n\nTL;DR:  Bored and anxious.  Need something constructive for a nocturnal person to do.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm starting a job in a few weeks, and have nothing to do until then.  It's driving me up the wall.",
            "url": "http://www.reddit.com/r/Anxiety/comments/j0xuk/im_starting_a_job_in_a_few_weeks_and_have_nothing/"
        },
        {
            "author": "ladydoom",
            "author_created_utc": 1307282537,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5c10l",
            "created_utc": 1311572592,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/iyxth/my_so_has_severe_anxiety_and_im_looking_for/",
            "id": "iyxth",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/iyxth/my_so_has_severe_anxiety_and_im_looking_for/",
            "score": 7,
            "selftext": "Hey all, \nIf there is already a community set up for significant others of anxiety then please point me in that direction.  If there are others in my position who would like to share stories or seek advice, it would be nice to not feel so alone.  If those of you who suffer anxiety have advice, input, or stories of your own that you think could encourage significant others, I'd love to hear it.\n\nI'll start with my story.  Tonight, I'm feeling very discouraged, and admittedly, quite self-pitying.  I've been with my boyfriend for a year and a half.  He has been suffering from a severe anxiety disorder for probably 4 or more years.  This is my first serious relationship and the largest endeavor in humility I have ever undertaken.  I'm sure every healthy relationship requires a lot of sacrifice, but the difference is that if I choose not to sacrifice the eventual end is my boyfriend hiding in a safe place, hyperventilating and totally convinced he is going to die.  I don’t want to do that, intentionally or accidentally, and rarely are the choices even important enough to mind.  He would bend to me if I pushed it, but considering the consequences he must suffer, I can’t wittingly allow it.\n\nBut I feel it beginning to get to me.  We can’t often eat together and if we do it’s usually not my kind of food, we can’t often leave the house and if we do it is to one of the two places that he goes to, he can’t spend time with my parents who disapprove of him because they haven’t gotten to know him.  It’s the fear of the future that is really scaring me.  I don’t think that this will ever go away.  What if he never comes to my family get-togethers?  What if he can never travel and I don’t get my one dream of seeing the world?  Do I have to live my whole life with no definite plans because he probably won’t have the mental capacity to do so-and-so?\n\nAt this point in my line of worry, I truly begin to hate myself.  I volunteer to be in this with him, because he is worth it.  He is so loving and patient, he is the first man to treat me as an equal with valuable thoughts, and he tries to dang hard to be stronger than his anxiety.  He did not ask for this.  He’s the one that actually has to live with it, and he constantly astounds me with his consideration even in the midst of anxiety.  I know that he feels trapped in the few lifestyle choices he considers “safe”, but more and more I feel like I am completely incapable of doing or saying anything.  I am convinced that somehow I always make things harder for him.  He tried to re-assure me tonight that he doesn’t ever blame me, that he knows his anxiety is based off of completely illogical ideas, that I am good for him.\n\n I can’t help but feel like a failure.  It so difficult to accept that this is beyond my control and that when he’s losing his mind, I can’t pay him back for all the sunshine he brings into my life.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My SO has severe anxiety, and I'm looking for support.",
            "url": "http://www.reddit.com/r/Anxiety/comments/iyxth/my_so_has_severe_anxiety_and_im_looking_for/"
        },
        {
            "author": "rosemkay",
            "author_created_utc": 1294343723,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4p27n",
            "created_utc": 1309648343,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ifaa1/going_away_to_school_with_ocd_and_panic_attacks/",
            "id": "ifaa1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ifaa1/going_away_to_school_with_ocd_and_panic_attacks/",
            "score": 6,
            "selftext": "I currently go to therapy but am not on any medication. I have OCD on the severe end of moderate at its worst, mild end of moderate at its best. My panic attacks are frequent when things are bad, but rare when things are good. Things have been bad recently. I'm going away to school in the fall and I am desperately scared that I will have a panic attack and not be able to get help or scare the crap out of my roommate or have to leave in the middle of a lecture et cetera. I won't have a therapist at school but I have the university clinic open to me for meds. \n**tl;dr What do you recommend as a sort of safety for panic attacks when you are in a foreign environment?**",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going away to school with OCD and panic attacks.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ifaa1/going_away_to_school_with_ocd_and_panic_attacks/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1309941694,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ihyod/really_random_bursts_of_anxietyparanoia/",
            "id": "ihyod",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ihyod/really_random_bursts_of_anxietyparanoia/",
            "score": 6,
            "selftext": "Okay, so you don't know how glad I am that this community exists. \nI have really random paranoia bouts, and it's always about different things. Right now, it's really terrible paranoia that the cops will show up at my house and arrest me - even though it's 4:30 in the morning and I've done nothing arrest-worthy. It's been random stuff. Last month, right after my period, I was paranoid I was pregnant (I'm a virgin!) and it was killing me because I wasn't expecting my period any time soon. Last week, every time a plane went overhead, I'd brace myself for being nuked. &lt;___&lt;' and I KNOW these fears are irrational. \n\nI've only ever had legit panic attacks twice in my life. I've told my mom about this, and all she says is she used to get paranoid about losing her family when she had anxiety, so it's no surprise that I would too since we seem to be so close genetically and whatnot, and she doesn't seem to worried. It usually only happens late at night, so it's probably sleep-linked or something.\n\n;-; What should I do? Does this sound extreme? D: Should I seek medical attention? I'm at a loss. I usually trust my mother's opinion medically (she's not a doctor, but she works as a Pharm. Tech. and she's pretty learned), so I don't know whether to be worried or not, I figured you guys were a good third party view.\n\nOn top of that, I really don’t want to turn to drugs. Usually I can actually calm myself by sniffing lavender and chamomile oil. I dunno if it’s a placebo or what (probably is). \n\nDo you think it could be depression? That also runs in my family. D:\n\n(lol, in case you can’t tell, it also likes to show up as hypochondria.)",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Really random bursts of anxiety/paranoia.",
            "url": "http://www.reddit.com/r/Anxiety/comments/ihyod/really_random_bursts_of_anxietyparanoia/"
        },
        {
            "author": "rawlex",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1309580420,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ierql/addicted_to_anxiety/",
            "id": "ierql",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ierql/addicted_to_anxiety/",
            "score": 6,
            "selftext": "Hi all,\n\nI'm been an anxious sort of person my entire life, but currently going through a very rough patch of anxiety and depression amongst other things. \n\nI've always kind of had something to stress over, be it in school, university, work. What I found curious is that this afternoon (at work), I found myself truly calm for the first time in a while. This confused me as I hadn't been doing or thinking anything different, it just kind of happened. I was put off by this and I started questioning the calmness - what happened? why didn't thought patterns trigger the same feelings they did before? had I lost some kind of clarity of thought? \n\nI hate to admit it, but I then find myself trying to rediscover the anxiety, trying to find that panic that had just gone missing, like some kind of panic addict. Lo and behold I got it back soon enough, and then realised how stupid that was. It's like mental self-harm, I wanted the darkness back because it seemed more real than the calm.\n\nI guess I kind of wanted to get it off my chest, and see if anyone has heard of or shared this kind of experience.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Addicted to anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/ierql/addicted_to_anxiety/"
        },
        {
            "author": "needrelief",
            "author_created_utc": 1310879254,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5iyws",
            "created_utc": 1310879798,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/irt50/hypochondria_need_advice_on_moving_on/",
            "id": "irt50",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/irt50/hypochondria_need_advice_on_moving_on/",
            "score": 6,
            "selftext": "I'm pretty sure I experience some form of hypochondria attributed to anxiety and panic. By now I am really sick of it I have no one to talk to because no one wants to listen to my whining. I really want to just finally let go of this and just wish I could enjoy my life instead of worrying if this is the last moment on earth. With this I am suffering from \"hypnic jerks\" which don't allow me to fall asleep easily. It always feels like I am being awakened because my lungs forget to work. This is actually my biggest fear my lungs failing. Maybe because the anxiety tightens my chest and I have the feeling of heavy breathing or maybe I just focus on my breathing too much. Can someone give me motivation or peace of mind, I just want to be normal.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hypochondria, need advice on moving on..",
            "url": "http://www.reddit.com/r/Anxiety/comments/irt50/hypochondria_need_advice_on_moving_on/"
        },
        {
            "author": "leopardlova",
            "author_created_utc": 1303095041,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_54bcr",
            "created_utc": 1311721140,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/j0lxo/need_help_please_self_esteem_and_self_centered/",
            "id": "j0lxo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/j0lxo/need_help_please_self_esteem_and_self_centered/",
            "score": 6,
            "selftext": " I am a 27 yr old female who has dealt with major self esteem and selfishness issues and depression since I was little. This is a long post, sorry! So, I am pretty sure I have a good amount of self awareness. Ever since I was young, any friend I had abandoned me or dropped me. Talked bad about me behind my back. Growing up, my family placed a high importance in me making friends. I just never had a social group where I was accepted. My brother played every sport and had a ton of friends (actually he is still just as close with them). Because I was lonely, and never had self worth, I chose friends who weren't good for me. I am not lacking self esteem in appearance, more personality and my decisions. My mother made every decision for me and never encouraged me to make decisions on my own. I was very sheltered. A little backround on my family, very controlling mother with anger issues and very negative, father was passive and a push over. My mom would boss him around a lot. I will also add, that I was raised EXTREMELY SELFISH. I never had chores or responsibility. I always got what I wanted, never had patience or even cared about anything but what I wanted. once I started dating, I always chose guys who werent good enough for me. treated me like I was unimportant. My mother was pushing me to have a bf even in highschool and college, therefor I felt that if I was alone there was something wrong with me. on top of also having brain dead moron girlfriends as friends, I always felt unimportant. 3 years ago, When I was 23, my father passed of lung cancer at 50 yr old. 6 weeks later, I met a con artist on myspace. He pretended his dad was dead also to get in my pants, and stole over grand in cash from me and any sentimental jewelery I owned. After my father passing, the anxiety and depression went into full force. I dont believe I am capable of happiness, and I am constantly worried of terrible things happening now. Luckily 1 yr ago, I met an amazing man who I can say is the first person I have ever loved. He does nice things for me and treats me amazing. I am terrified every day of losing him, like us breaking up. I feel I will fall apart again if I lose him. Problem is also, I am self centered even though my self worth is non existent. I almost purposely sabotage our relationship, because I cant figure out why someone so amazing is in love with me! I only care for my interests, so If we go somewhere like a concert or a movie that HE likes, im completely uninterested and it shows. If we are getting ready to go out somewhere either the beach or dinner, He gets ready for the date a lot slower than me. When I have to sit and wait for him because he is taking longer than me, I feel extreme anger. I feel like hes taking his sweet time because he doesn't care or want to even go as bad as me. I have always been with men who let me control them, and allow me to speak to them any which way and boss them around. He is very strong minded and total opposite of this. I feel helpless because I dont want to be anxious around him like I could lose him any day now, almost expecting it. And I just want to be more selfless and less self centered. Any tips? Books? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "need help please!! self esteem and self centered issues, which is making me extremely anxious and depressed. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/j0lxo/need_help_please_self_esteem_and_self_centered/"
        },
        {
            "author": "batmanlight",
            "author_created_utc": 1294021302,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4oifl",
            "created_utc": 1310094526,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ijo9a/redditors_what_are_some_breathing_techniques_that/",
            "id": "ijo9a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ijo9a/redditors_what_are_some_breathing_techniques_that/",
            "score": 5,
            "selftext": "Hey guys, how about you share some of your different breathing techniques that help you for anxiety or when you feel a panic attack is coming on?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Redditors, what are some breathing techniques that you use for your anxiety? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/ijo9a/redditors_what_are_some_breathing_techniques_that/"
        },
        {
            "author": "socialanxiety10",
            "author_created_utc": 1308026890,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5debx",
            "created_utc": 1310504056,
            "domain": "psychology-tools.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/inrz5/how_bad_is_your_anxiety_score_online_version_of/",
            "id": "inrz5",
            "is_self": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/inrz5/how_bad_is_your_anxiety_score_online_version_of/",
            "score": 5,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How bad is your anxiety score? (Online version of the Beck Anxiety Inventory)",
            "url": "http://psychology-tools.com/beck-anxiety-inventory/"
        }
    ]
}