{
    "data": [
        {
            "author": "GhostMatter",
            "author_created_utc": 1293993143,
            "author_flair_css_class": "raised-leftfist",
            "author_flair_text": "GAD+Panic Disorder",
            "author_fullname": "t2_4ogut",
            "created_utc": 1308785354,
            "domain": "nataliedee.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i6nnp/a_lighthearted_image_that_made_me_laugh/",
            "id": "i6nnp",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i6nnp/a_lighthearted_image_that_made_me_laugh/",
            "score": 42,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_i6nnp.png",
            "title": "A lighthearted image that made me laugh",
            "url": "http://www.nataliedee.com/050908/now-im-a-superhero.jpg"
        },
        {
            "author": "GhostMatter",
            "author_created_utc": 1293993143,
            "author_flair_css_class": "raised-leftfist",
            "author_flair_text": "GAD+Panic Disorder",
            "author_fullname": "t2_4ogut",
            "created_utc": 1308937107,
            "domain": "29.media.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i88jn/haunted_by_the_past_xpost_from_pics/",
            "id": "i88jn",
            "is_self": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i88jn/haunted_by_the_past_xpost_from_pics/",
            "score": 32,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_i88jn.png",
            "title": "Haunted by the past (x-post from pics)",
            "url": "http://29.media.tumblr.com/tumblr_lldebedAQS1qf3ppeo1_500.png"
        },
        {
            "author": "tumbleweed1993sf",
            "author_created_utc": 1289279285,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4i75p",
            "created_utc": 1308878817,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i7p5z/tried_making_a_logo_for_this_subreddit_what_do/",
            "id": "i7p5z",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i7p5z/tried_making_a_logo_for_this_subreddit_what_do/",
            "score": 27,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_i7p5z.png",
            "title": "Tried making a logo for this subreddit, what do you think?",
            "url": "http://imgur.com/YgTjs.png"
        },
        {
            "author": "maskedrolla",
            "author_created_utc": 1305060750,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_57vd3",
            "created_utc": 1309041980,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i96ju/thinking_about_making_a_blog_about_anxiety/",
            "id": "i96ju",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i96ju/thinking_about_making_a_blog_about_anxiety/",
            "score": 13,
            "selftext": "After spending some time traversing the tubes of the internet. I have found that just talking and reading about anxiety makes my issues a lot more manageable. As such I am thinking about making a blog style website to document my exploration of this subject. Not sure if this will help or not, but I hope at the very least it will be a place that some people can stumble across to reassure themselves they are not alone in their anxiety. Since Reddit has helped me so much I thought I would post here first. Once I have it all setup I will post all the links and such here. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thinking about making a blog about anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/i96ju/thinking_about_making_a_blog_about_anxiety/"
        },
        {
            "author": "ambientanxiety",
            "author_created_utc": 1307929178,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5d6zq",
            "created_utc": 1307931810,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hy68i/hello_im_new_to_this_sub_please_read_my_story/",
            "id": "hy68i",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hy68i/hello_im_new_to_this_sub_please_read_my_story/",
            "score": 8,
            "selftext": "I'm a 23 year-old male, currently at university. In my life, I have experienced normal amounts of anxiety--that is, when I was supposed to. However, this has recently changed, and I am scared and confused at how to handle this new change in my mentality.\n\nI'm not sure when the \"change\" started to occur, it was probably a gradual developmental thing that has progressed over the past few months. Looking back to last November, I was completely anxiety-free (with the exception of the \"normal\" anxiousness anyone would get from anxiety-inducing situations). Last march, during spring break, I got sleep deprived and had been getting about three or maybe less hours of sleep per night. By the end of the week, I was an anxious mess--I felt all the typical symptoms: hopelessness, dread, urge to have a bowel movement, and sometimes a tightness in the chest. When I returned home from said vacation, I basically spent a few weeks recuperating and getting my sleep schedule back on track. I am now seeing a psychiatrist who has prescribed Clonazepam, 0.5mg three times a day (once every six hours). I've been on the medication now for about a month and I love it, it effectively eliminates this new \"ambient\" anxiety that I recently started feeling.\n\nHowever, I am new to medications in general and am now aware that my body has probably become physiologically addicted to the drug, and I've heard that the withdrawals are going to be intense. I do plan on eventually tapering off, and hopefully soon. Does anyone have any insight on the taper off? I've also heard mixed opinions about benzodiazepines--some say they're horrible, some say they're great, and my psychiatrist tells me there's nothing to worry about. Still, I am inquisitive about the nature of the drug.\n\nMy psychiatrist diagnosed me with \"episodic mood disorder,\" and had me get a blood test to check my thyroid for any hormonal imbalances. When the test came back, I was told that my TSH levels are high (3.9 on some unit scale that I'm not familiar with), which would imply hypothyroidism, which is the opposite of what would be expected since anxiety is usually linked to hyperthyroidism! He scheduled me to see an endocrinologist. The endocrinologist essentially told me that it's a guess-and-check with thyroid patients and he wants another blood test, which I'm going to get to him as soon as possible (been very busy this week). Does anyone else have any insight about the endocrine system and how it could affect the sympathetic nervous system? I've read a lot about what anxiety actually is, the \"fight-or-flight\" response, and it's supposed to be mitigated by the parasympathetic nervous system. I'm no brain scientist, so that's the extent of my knowledge about it. I've started practicing breathing exercises, which helps, but it's not that useful for me because my anxiety is almost perpetually there, in the background (when it's there).\n\nSome things I would like to add about my condition that I think are relevant and might help someone here diagnose my problem or perhaps give me some insight:\n\nI sleep at the same time every night for 8-9 hours and have little trouble getting to sleep thanks to Clonazepam (I'm pretty sure). I don't have anxiety for most of the day, it comes primarily at night, like around 6-7pm. I started lifting weights again a few days ago and I've been weak and having the typical muscle pains associated with working out for the first time in a while. I've noticed that in my weakened state, the anxiety is substantially worse, it even comes through the Clonazepam dose.\n\nI'm also scared about the current and eventual side-effects of Clonazepam. I've almost completely lost my libido and I feel weakened. Apparently Clonazepam is metabolized in the liver and has similar effects as alcohol, which would explain both side-effects. I'm really scared about the memory-loss that supposed to occur, but that doesn't happen for a while.\n\nAlso it should be noted that I've only had one panic attack; it came from smoking a joint (first time in my life) last December. Worst feeling ever, felt like I was going to die. I haven't had an attack since, but the anxiety is still a lingering thing. It comes out of the blue, seemingly completely unrelated to my thoughts at the time. Like tonight for instance, I was playing Minecraft and suddenly the anxiety just onset and I lost all interest in what I was doing, started getting that bowel-movement feeling, and am feeling just generally shitty.\n\nFor anyone who read this, I appreciate your time and am thankful for any replies or insight about the matter.\n\nEDIT:\n\nThank you all for your support, it has really calmed me down lately and I feel less frustrated and scared about this new condition. You're all wonderful people!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hello! I'm new to this sub; please read my story! Looking for advice about my anxiety problem.",
            "url": "http://www.reddit.com/r/Anxiety/comments/hy68i/hello_im_new_to_this_sub_please_read_my_story/"
        },
        {
            "author": "mitts2010",
            "author_created_utc": 1290556068,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4juet",
            "created_utc": 1308775534,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i6j3k/i_really_need_help_counseling_does_not_work_well/",
            "id": "i6j3k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i6j3k/i_really_need_help_counseling_does_not_work_well/",
            "score": 6,
            "selftext": "I have always been a worrier, but in the last five years it has got out of hand, and I am starting to see more OCD like habits appear.\n\nMy main problem is I will get something I worry or think about, and then I just cannot get the problem out of my head, all I do is think about it and worry about it every second of every day.\n\nDepending on the problem this may go on for days, and then when the worry goes away it stops, or it may just gradually reduce itself to a point where I only think about it every so often.\n\nI think so hard about things I start to get headaches and feel light headed.\n\nMy latest issue is this: http://www.reddit.com/r/AskReddit/comments/i480j/i_almost_hit_a_pedestrian_now_i_feel_guilty_and/\n\nAll I do everyday is think about this all day, and think of every possible situation that may occur, and in much detail.\n\nI went to a psychiatrist about 4 years ago (before the intense mind consuming worrying started) and he told me I just have GAD and I should try counseling.\n\nI have gone to a counselor about a similar situation to the one above, but they never really where much help, they just told me things I already knew from books. Or they just wanted me to learn to drop the issue and stop thinking about it completely, but I have to solve the issue to stop worrying about it.\n\nI really don't know what I should do, if my current problem (the one above) eventually leaves my mind, another one will just pop up again.\n\nThis is starting to effect how I act around others, I start to be less social and caring.\n\nWhat do I do?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I really need help, counseling does not work well with me, and my anxiety problems always sneak back up on me. What do I do, and what do I have?",
            "url": "http://www.reddit.com/r/Anxiety/comments/i6j3k/i_really_need_help_counseling_does_not_work_well/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1307287695,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hs5cp/just_moved_far_away_no_friends_here_anxiety_is_so/",
            "id": "hs5cp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hs5cp/just_moved_far_away_no_friends_here_anxiety_is_so/",
            "score": 6,
            "selftext": "The anxiety I'm feeling shows through in the title, doesn't it... I just moved to Chicago from Winnipeg. I'm all alone here. I absolutely hate it right now. I'm throwing up, I can't keep any food down, my whole body is tingly, my hands are sweaty, my mind is constantly racing. I start work tomorrow but I don't know how I'm going to make it through the day. I don't even know how I'm going to make it through today. I'm actually in the north suburbs rather far from the core city, it's a long drive in and I'm so tired of driving right now. I just want to give up and go home. But I haven't even had one day of work yet, and if I give up I know I will let everyone down, especially my girlfriend who wants to come here and live with me in a few months. Oh, I feel so terrible at this exact point in time. I can't even manage to get the tears to come, I don't know why. Sorry for rambling so much but these things are just spilling out of me and it feels like if I stop talking I might go insane...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Just moved far away, no friends here, anxiety is so strong, throwing up, help...",
            "url": "http://www.reddit.com/r/Anxiety/comments/hs5cp/just_moved_far_away_no_friends_here_anxiety_is_so/"
        },
        {
            "author": "Miniair",
            "author_created_utc": 1253902953,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3nbfa",
            "created_utc": 1308544878,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i42b4/herbal_supplements_for_anxiety/",
            "id": "i42b4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i42b4/herbal_supplements_for_anxiety/",
            "score": 6,
            "selftext": "Any good recommendations for herbal supplements that help with anxiety? I am currently taking klonopin and want to stop. Any help is appreciated.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Herbal supplements for anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/i42b4/herbal_supplements_for_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1309149675,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ia237/how_do_you_deal_with_guilt/",
            "id": "ia237",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ia237/how_do_you_deal_with_guilt/",
            "score": 5,
            "selftext": "Every time something happens to me, I feel guilty. I'm not worried about how it affects me, but I panic about how it's going to affect my loved ones.\n\nI'm constantly terrified that I'm going to hold my fiance back from his dreams of being an actor, and I feel sick every time I think of my dad paying my $3000/semester tuition bills. I do what I can to help for everything I feel guilty about, but I still can't do enough, and even though I know it's irrational, I'm convinced that I'm going to ruin everyone's lives.\n\nI've been keeping a \"worry journal\" where I write down what I'm worried about, the worst case scenario, and how I can change it. It helps a little, but not much.\n\nDoes anyone else have these feelings? How do you deal with them? I am at a loss... :(",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How do you deal with guilt?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ia237/how_do_you_deal_with_guilt/"
        },
        {
            "author": "hardman52",
            "author_created_utc": 1252958712,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3mptl",
            "created_utc": 1307803758,
            "domain": "nybooks.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hx5ql/the_epidemic_of_mental_illness_why_by_marcia/",
            "id": "hx5ql",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hx5ql/the_epidemic_of_mental_illness_why_by_marcia/",
            "score": 5,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_hx5ql.png",
            "title": "The Epidemic of Mental Illness: Why? by Marcia Angell | The New York Review of Books",
            "url": "http://www.nybooks.com/articles/archives/2011/jun/23/epidemic-mental-illness-why/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1308286822,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i1vo9/do_i_have_generalized_anxiety_disorder_or_am_i/",
            "id": "i1vo9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i1vo9/do_i_have_generalized_anxiety_disorder_or_am_i/",
            "score": 5,
            "selftext": "For at least the past year, probably the past 2 years, I've been debating whether or not I have Generalized Anxiety Disorder. I've taken Psychology and Abnormal Psychology classes at college as well as reading up quite a bit about it online but I can never really be certain. I would like to be able to visit a doctor or something for them to diagnose me, but: 1) I'd rather my parents didn't know. They overreact to most things so I dislike sharing bad things with them. 2) The family is a bit short on money and I'm not sure if our insurance would cover the diagnosis/treatment.\n\nI feel like there was more I meant to say in the intro, but I can't remember. Anyways, here are my symptoms:\n\n- I worry about nearly everything possible and even though I know it doesn't help, I continue to worry. (One of my major worries is forgetting things)\n\n- I have pretty bad muscle tension, so I feel like my muscles are cramped all the time so I have to constantly stretch or otherwise feel very uncomfortable.\n\n- My mind goes completely blank/I absolutely cannot think of what I wanted to think of incredibly often. I'd guess about 1 or 2 times every minute. It's extremely frustrating.\n\n- I sweat excessively. Even when I'm relaxed and in a cool area, I get quite a lot of armpit sweat. This is especially noticeable while I'm driving (even though I love driving and I have the temperature very cool).\n\n- I feel moderately restless most of the time. I find it hard to stay focused. For example, I love reading, but I find it incredibly difficult to stay focused on a book without my mind wandering (and almost always worrying about other things).\n\n- I'm incredibly irritable. Nearly everything that someone does that isn't the way I do things urks me.\n\nAnyways, the DSM-IV-TR criteria says that \"the anxiety, worry, or physical symptoms cause clinically significant distress or impairment in social, occupational, or other important areas of functioning.\" That's where I keep getting caught up in wondering if I have GAD or not. I function completely fine in all areas of my life, but my life isn't very enjoyable (always worrying, rarely every actually happy).\n\nSo anyways, what do you Redditors think? \n\nAnd also, is it possible that I have some thyroid disorder such as [Hyperthyroidism](http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001396/) (Most of the symptoms of Hyperthyroidism are very similar to GAD and some of the additional symptoms apply almost perfectly to me, such as increased appetite and heat intolerance)?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Do I have Generalized Anxiety Disorder or am I just an anxious person with no disorder?",
            "url": "http://www.reddit.com/r/Anxiety/comments/i1vo9/do_i_have_generalized_anxiety_disorder_or_am_i/"
        },
        {
            "author": "batmanlight",
            "author_created_utc": 1294021302,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4oifl",
            "created_utc": 1309396539,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/icti4/new_to_anxiety_whats_your_experience_with_lexapro/",
            "id": "icti4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/icti4/new_to_anxiety_whats_your_experience_with_lexapro/",
            "score": 5,
            "selftext": "hey guys, for the past few months I have had symptoms that i was convinced was caused by an underlined physiological medical problem such as hyperthyroidism or pheochromocytoma since i was suffering from heart palpitations, a nervous flush throughout my whole body that would cause my heart rate to skyrocket to 155, PAC's and whatnot but everything was scratched off and my docs are telling me its all anxiety. they prescribed me lexapro but im too scared to take it because I've read about people having side affects for the first couple of weeks making their anxiety even worse. hows your experience with it or any SSRI?\n\n*EDIT: Thanks you guys, you have been super helpful even with just the few comments. nice to know you're not alone.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "new to anxiety, whats your experience with lexapro?",
            "url": "http://www.reddit.com/r/Anxiety/comments/icti4/new_to_anxiety_whats_your_experience_with_lexapro/"
        },
        {
            "author": "herhighness",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1307474507,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/htz6h/having_a_tough_timenot_as_bad_as_others_but_i_am/",
            "id": "htz6h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/htz6h/having_a_tough_timenot_as_bad_as_others_but_i_am/",
            "score": 4,
            "selftext": "Hello, I am a 36 year old college student and I work a full time job. I am married but we do not have children. I am taking two classes right now, one of which is Trig which I am having an awful time with since math has never been my strong subject. I am already enrolled three classes for Fall, classes which seem 'heavy' to me. The problem is that in the last week and a half (basically since school started) I am having episodes of feeling very anxious, only three occurrences but up until now I have only experienced these feelings a couple times a year. The first two episodes were last week and the other was this morning.  I can't even describe with words how I feel. Physically there seems to be no symptoms like shortness of breath or anything, just a feeling of anxiety. The feelings last between 10 minutes to a couple hours. Since it happened I am concerned that I am taking on too many classes in Fall if this is how I am reacting to two classes. I have actually been in school for almost three years now but usually only with 2 classes.  Anxiety, depression, agoraphobia, and epilepsy run in my family. Personally I have only battled with depression, which I don't have any problems with anymore, and anxiety.  I am wondering if I should look in to medication for this. If I take less classes I feel like I am being a slacker but I am just not sure how I can handle the stress of it all emotionally. I don't even know what I am asking here. I don't know if my increased frequency is enough to be worried about. Meds or no meds? Not try three classes next semester? Advice on how to handle these anxious feelings? Any feedback is welcome. Thanks for reading. I am sure I babbled but my head is not in the right place right now. Also related, I was working on my Trig homework last night from 5pm to 12:30am so I am definitely low on sleep but the other times I have felt anxious I was well rested. I know getting good sleep is important but I had to get the work done.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Having a tough time...not as bad as others but I am growing concerned.",
            "url": "http://www.reddit.com/r/Anxiety/comments/htz6h/having_a_tough_timenot_as_bad_as_others_but_i_am/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1308491491,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i3kev/i_feel_stuck/",
            "id": "i3kev",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i3kev/i_feel_stuck/",
            "score": 4,
            "selftext": "As of recent, I've just found myself feeling like I'm in a rut. I need a job, but every time I think about getting one, I freak myself out for whatever reason and it makes me not want to go out and apply anywhere. I can't create shit (I thoroughly enjoy arts) because every time I try to, I hit a road block and instead of trying to find a way around it, it just makes me feel tight inside and like I'm never going to complete a thing and then I just start feeling anxious so I just drop whatever I'm doing and eventually try to pick it back up again but normally with the same results.\n\n\nI don't really know what to do. I don't want to do therapy for my anxiety. I've tried it in the past and it didn't really do anything for me, and I'm also stubborn as shit and am the type of person that just wants to be able to overcome any type of problem on my own...this time, I just don't understand how to go about doing that. I want to kick this before it gets any worse, I just don't know how to start. I smoke pretty much daily and have for quite some time (talking of weed) and I'm questioning if that itself has to do with a big part of my anxiety, even though I'd say it has also helped me out some. I'm tempted to give myself a break from it and see where it goes from there.\n\nI honestly don't really know why I'm even posting this...I'm just at a point where I feel like I need some sort of outside input that isn't therapy from a source that also has dealt with anxiety. Maybe I'm just going through some awkward teenage 'midlife crisis' stage (I'm 19). I don't know, I've just felt confused as fuck lately, and I'm not really sure of what, and it's bringing up anxiety towards almost everything and it's slowly becoming quite a hindrance and I'd just really like to find a way around it or a way for me to just grow some balls and get the hell over myself.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I feel stuck.",
            "url": "http://www.reddit.com/r/Anxiety/comments/i3kev/i_feel_stuck/"
        },
        {
            "author": "Ailise",
            "author_created_utc": 1284395764,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4c806",
            "created_utc": 1308004199,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hyw5m/hey_ranxiety_how_do_you_describe_your_anxiety_to/",
            "id": "hyw5m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hyw5m/hey_ranxiety_how_do_you_describe_your_anxiety_to/",
            "score": 4,
            "selftext": "I'm pretty open about suffering from mild-moderate anxiety with my friends/family, but it's often hard to get them to understand how it feels to carry this around all the time (especially on bad days). One way I thought of today was to compare it to when you put mentos in diet coke, but the cap can't come off. How do (or would you) describe how you feel to those who've never dealt with this?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey r/Anxiety, how do you describe your anxiety to other people?",
            "url": "http://www.reddit.com/r/Anxiety/comments/hyw5m/hey_ranxiety_how_do_you_describe_your_anxiety_to/"
        },
        {
            "author": "anxiouspenguin",
            "author_created_utc": 1309275065,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ftr5",
            "created_utc": 1309275642,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ibdih/best_practices_for_asking_your_primary_care/",
            "id": "ibdih",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ibdih/best_practices_for_asking_your_primary_care/",
            "score": 3,
            "selftext": "I'm 26, and have anxiety my whole life.\n\nDuring rough life situations, it becomes unbearable.  Right now, I am currently suffering from some of the worst anxiety I've ever experienced.\n\nI've been on depression/anxiety medication before for several years, but the side effects became too much to bear (I was tired ALL the time).  I stopped taking that medication, and switched to another that also did not work (I got suicidal, which I had never been before), and stopped taking that medication.\n\nIt has been approximately a year since I stopped taking any medication whatsoever.  I do feel that without medication included in my treatment, I am slowly retreating back into my anxious brain.  It is starting to affect my relationships and my work/home balance.\n\nI need help on asking for medication.  My doctor absolutely refuses to give me any medication that she deems \"addicting,\" saying that they do not give those out unless it is a \"special\" case (example: Xanax).  Many of my friends are offering to refer me to their doctors, but I'm nervous that I'll be seem as \"shopping\" for doctors in order to get medication, and that makes me terrified.\n\nAny help would be greatly appreciated.  I need to make this appointment as soon as I can.\n\nTL;DR: My primary doctor makes me uncomfortable asking for medication.  I need assistance on how I can effectively communicate how much anxiety meds are necessary for my mental health.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Best practices for asking your Primary Care Physician for anxiety medication?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ibdih/best_practices_for_asking_your_primary_care/"
        },
        {
            "author": "clitpuncher",
            "author_created_utc": 1306417349,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5afs6",
            "created_utc": 1307073094,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hqi57/here_i_go_again/",
            "id": "hqi57",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hqi57/here_i_go_again/",
            "score": 3,
            "selftext": "Makes 2 days i am full of anxiety. After 3 months of calmness it jumped into my life again. I dont know why. I dont know the cause. Cant sleep during the night. If i go to bed the fear creeps in and my heart starts pounding. I hate it. Then, when i finally sleep in the morning it feels good, relaxing.\n\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Here i go again",
            "url": "http://www.reddit.com/r/Anxiety/comments/hqi57/here_i_go_again/"
        },
        {
            "author": "Jelenfellin9",
            "author_created_utc": 1283132561,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4aico",
            "created_utc": 1307221339,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hrpn0/i_just_ordered_some_phenibut/",
            "id": "hrpn0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hrpn0/i_just_ordered_some_phenibut/",
            "score": 3,
            "selftext": "I bought it online. I tried searching for anything about it, on reddit, with no results. It's supposedly works very well for social anxiety. Although it's a \"dietary supplement\", it has strong withdrawal symptoms, and should only be taken up to 3 days per week. I've read that it has similar effects to alcohol without the negative side-effects. Which is good for me because alcohol is the only thing that helps suppresses my anxiety, however, I hardly ever drink, or have the time for it. I'm curious to know if anybody here has tried phenibut? What are you thoughts? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just ordered some phenibut...",
            "url": "http://www.reddit.com/r/Anxiety/comments/hrpn0/i_just_ordered_some_phenibut/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1308557060,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i461o/anxiety_and_pressure/",
            "id": "i461o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i461o/anxiety_and_pressure/",
            "score": 3,
            "selftext": "I have a few anxiety disorders, and lately I've been having trouble with blood pressure. It will start with something small, like a problem with my computer that slightly frustrates me. Then my arms and neck balloon up with blood pressure. I get tightness in my throat, like someone is strangling me. The pressure itself causes more anxiety and is really uncomfortable. \n\nDoes anyone else experience this, and what do you do when it happens?  I generally try a breathing exercise and lay down for a few minutes and try to clear my mind, but this doesn't seem to help.  I usually end up having to take a Xanax and Atenol, but those only help so much. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety and Pressure",
            "url": "http://www.reddit.com/r/Anxiety/comments/i461o/anxiety_and_pressure/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1309143511,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i9zmg/advice_needed_regarding_therapy_what_to_expect/",
            "id": "i9zmg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i9zmg/advice_needed_regarding_therapy_what_to_expect/",
            "score": 2,
            "selftext": "How did you handle seeing someone about your anxiety? Opening up to people isn't easy for me at the best of times, this is made worse due to the nerves associated with confiding in a complete stranger. \n\nMy experience talking to my family doctor/counselor was basically me going on a disjointed rant trying to explain my situation, then later on being consumed with embarrassment and self-loathing and finding any excuse to avoid that interaction in the future. \n\nI must have made a bad impression because he pretty much told me there was no point in talking unless I took his expensive meds (Pristiq). He seemed more focused on my depression (due to recent breakdown of my marriage) than the anxiety that was really the main cause of my suffering.\n\nI don't know if I can trust myself to communicate my mental state, there's a lot of pressure to explain things accurately since their whole diagnosis/treatment relies on it.\n\nAnyone have similar issues and how did you deal with them so your professional could help you heal?\n\nThanks for reading..",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Advice needed regarding therapy, what to expect and how to open up to the stranger.",
            "url": "http://www.reddit.com/r/Anxiety/comments/i9zmg/advice_needed_regarding_therapy_what_to_expect/"
        },
        {
            "author": "azwethinkweizm",
            "author_created_utc": 1282845164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4a5b3",
            "created_utc": 1309295129,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ibnri/high_blood_pressure_and_anxiety/",
            "id": "ibnri",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ibnri/high_blood_pressure_and_anxiety/",
            "score": 2,
            "selftext": "I helped out with a blood pressure screening and I got to examine a 22 year old with a blood pressure of 170/105. He tells me he sometimes gets panic attacks and has an underlining issue with anxiety. Also, he showed me a card from a dental hygiene office where his blood pressure was recorded as 120/76.\n\nHave you guys had an experience like that before with anxiety and high blood pressure?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "High blood pressure and anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ibnri/high_blood_pressure_and_anxiety/"
        },
        {
            "author": "criveros",
            "author_created_utc": 1301381332,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_51119",
            "created_utc": 1308949052,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i8eno/ones_dealing_with_health_anxiety_what_have_been/",
            "id": "i8eno",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i8eno/ones_dealing_with_health_anxiety_what_have_been/",
            "score": 1,
            "selftext": "I have experience muscle tension, constant fatigue for weeks, headaches, dizziness. And they come and go and usually when I have one symptom I don't have the other ones, and seem to arrive during periods of great stress.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Ones dealing with Health Anxiety, what have been your physical symptoms?",
            "url": "http://www.reddit.com/r/Anxiety/comments/i8eno/ones_dealing_with_health_anxiety_what_have_been/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1308630857,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i4z2k/i_dont_know_about_you_but_at_least_for_me_this/",
            "id": "i4z2k",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "xstandforitx",
                    "author_url": "http://www.youtube.com/user/xstandforitx",
                    "description": "Method Act from Touche Amore's 2011 release Parting The Sea Between Brightness And Me on Deathwish Records.",
                    "height": 363,
                    "html": "&lt;object width=\"600\" height=\"363\"&gt;&lt;param name=\"movie\" value=\"http://www.youtube.com/v/LCBZkbgog9M?version=3\"&gt;&lt;/param&gt;&lt;param name=\"allowFullScreen\" value=\"true\"&gt;&lt;/param&gt;&lt;param name=\"allowscriptaccess\" value=\"always\"&gt;&lt;/param&gt;&lt;embed src=\"http://www.youtube.com/v/LCBZkbgog9M?version=3\" type=\"application/x-shockwave-flash\" width=\"600\" height=\"363\" allowscriptaccess=\"always\" allowfullscreen=\"true\"&gt;&lt;/embed&gt;&lt;/object&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i1.ytimg.com/vi/LCBZkbgog9M/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Touche Amore - Method Act",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=LCBZkbgog9M",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;object width=\"600\" height=\"363\"&gt;&lt;param name=\"movie\" value=\"http://www.youtube.com/v/LCBZkbgog9M?version=3\"&gt;&lt;/param&gt;&lt;param name=\"allowFullScreen\" value=\"true\"&gt;&lt;/param&gt;&lt;param name=\"allowscriptaccess\" value=\"always\"&gt;&lt;/param&gt;&lt;embed src=\"http://www.youtube.com/v/LCBZkbgog9M?version=3\" type=\"application/x-shockwave-flash\" width=\"600\" height=\"363\" allowscriptaccess=\"always\" allowfullscreen=\"true\"&gt;&lt;/embed&gt;&lt;/object&gt;",
                "height": 363,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i4z2k/i_dont_know_about_you_but_at_least_for_me_this/",
            "score": 1,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I don't know about you, but at least for me, this song depicts anxiety perfectly.",
            "url": "http://www.youtube.com/watch?v=LCBZkbgog9M"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1308712464,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/i5v23/i_almost_hit_a_pedestrian_now_i_cannot_stop/",
            "id": "i5v23",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/i5v23/i_almost_hit_a_pedestrian_now_i_cannot_stop/",
            "score": 1,
            "selftext": "I was waiting to turn right out of a gas station onto a busy main street, I had looked to the right to make sure there were no pedestrians when I had pulled up, but when waiting to turn (looking to the left at oncoming traffic) I guess I got distracted and was not paying attention and when I went to pull up a bit because I thought there might be a break in traffic I saw a man in front of my car and it completely freaked me out, I braked right away, and he must have been startled and jumped forward another step to the other side of my car, he turned back and gave me an evil look, I waved and mouthed \"sorry\" and he turned back around and kept walking. At this point a car had stopped to let me in and I left.\n\nIt is while I am driving away I start to get very anxious, I remember the same thing happened to me before, I walked in front of a car trying to turn, and they went forward and saw me and braked right away, but they ended up actually just hitting my leg barely. They just drove away because I didn't even bother indicating I was hit and kept walking.\n\nI start to think, well, at the time I was sure I could not have hit him, he was vertical the whole time and I never felt hitting anything, and when he gave me an evil look he never said anything or looked at all distressed about being hit. I was so freaked when I hit the brakes I did not pay attention to see how far in front he was, and my hood slopes in a way the makes everything in front of your car look likes its closer than it is, so its hard to tell how close he is.\n\nThat night I could not sleep as I was shocked I was not paying attention, and I thought I should have just rolled the window and ask if I had hit him, instead of assuming I did not. If I had hit him, I just hit and ran, and if he got my plate he could report me, and it's a criminal charge.\n\nWould I have felt or definitely been aware if I had hit him even slightly?\n\nAnd if he was to report me, would it have to be proven that I was definitely aware that I hit him?\n\nThere was at least one car that saw this, and they never stopped, it has been 4 days since this happened and I still think about it, so should I just let it go and take it as a lesson?\n\nI have had anxiety problems with the same symptoms (thinking the same things over and over before), but I have always just pushed them out after weeks of thinking, but this one is not going away.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I almost hit a pedestrian, now I cannot stop thinking about it, how do I get over it (this type of thing always happens to me)?",
            "url": "http://www.reddit.com/r/Anxiety/comments/i5v23/i_almost_hit_a_pedestrian_now_i_cannot_stop/"
        },
        {
            "author": "tehjocker",
            "author_created_utc": 1289371718,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ibos",
            "created_utc": 1307847369,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hxjgw/i_dont_know_what_these_are_and_have_a_hard_time/",
            "id": "hxjgw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hxjgw/i_dont_know_what_these_are_and_have_a_hard_time/",
            "score": 1,
            "selftext": "I'd appreciate if anyone could tell me what this feeling is. I have always been an anxious person but in the last 5-6 years it has really affected my life for the worse. I have since matured a lot more, stopped this personal roller-coaster of behavior and habits, and with some counselling have stopped being so anxious and worried. However, the anxiety shivers remain. Does anyone else have this feeling? It's like when you start to become anxious, and you get a wave of dread and it feels like it goes down your back, and it might make you start to sweat if it persists. Would medication make this go away? Thank you...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't know what these are and have a hard time explaining them: Anxiety waves/shivers that run down your back, make you start to sweat?",
            "url": "http://www.reddit.com/r/Anxiety/comments/hxjgw/i_dont_know_what_these_are_and_have_a_hard_time/"
        }
    ]
}