{
    "data": [
        {
            "author": "fookenfaiken",
            "author_created_utc": 1300270418,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4yxlr",
            "created_utc": 1301164145,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/gc21o/do_i_have_general_anxiety_disorder_and_should_i/",
            "id": "gc21o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/gc21o/do_i_have_general_anxiety_disorder_and_should_i/",
            "score": 8,
            "selftext": "sorry long post but i could really use some suggestions here!\n\ni've been a very anxious person as long as i can remember. i'm a pretty functional person, i have intense social anxiety sometimes but usually i can push through it without it really hindering my speech or actions. i process the world externally and understand people well. but i'm very very often anxious, usually for no good reason. my anxiety seems almost more physical than mental a lot of the time (maybe something else then?). like half the time i'm awake it seems that i have the anxious feeling in my chest for one reason or another, or often no apparent reason. it's a feeling where i feel like i have to take a deep breath to relieve it, but if i'm more than a little anxious that doesn't get rid of the feeling, and even when it does it usually comes right back because i start to think about it. nothing is really bothering me right now, or nothing should be, but as i'm writing and thinking about it it's impossible to make the feeling go away. and the feeling is certainly unpleasant. makes me feel restless as fuck. unless i am very very tired i have trouble sleeping because i get anxious in bed.\n\nI seem to only be able to avoid anxiety when i'm busy or engrossed in something that is at least slightly enjoyable. exercise, studying (when it's not completely boring), reading, creative stuff, cannabis, and alcohol are examples (although i feel no real danger in becoming dependent on either of the latter two, especially not alcohol).\n\ni was wondering if this sounded familiar to anybody, is it general anxiety disorder? and whether you guys would recommend that i try out some drugs or something.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do I have general anxiety disorder and should I take drugs for it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/gc21o/do_i_have_general_anxiety_disorder_and_should_i/"
        },
        {
            "author": "pseudonym1",
            "author_created_utc": 1301182404,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_50mwe",
            "created_utc": 1301183128,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/gc7gm/i_dont_know_how_to_help_my_girlfriend/",
            "id": "gc7gm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/gc7gm/i_dont_know_how_to_help_my_girlfriend/",
            "score": 5,
            "selftext": "I'm not sure if this is the right subreddit, but if not, I'd be grateful if someone could point me in the right direction.\n\nMy girlfriend had a nasty experience with stress when she first went to university, resulting in her coming home after 10 days, taking a year out, then applying to a local university where she could live at home. After that experience, she had counselling and was able to regain most of her shattered confidence and overcome her fears about the future. She was given drugs to help with this (I'm afraid I don't know the name of them).\n\nSince then, she's been doing really well at her new university and, a few months ago, came off the pills (gradually).\n\nHowever, while she's fine generally, every so often something will cause her to panic/worry/doubt herself and nothing anyone can say can help her relax. For example, today she had a complete blank when entering her PIN at a cash point. I can imagine that forgetting something like that can be very disconcerting, but she ended up with horrible self-doubt and worrying about what this might be the beginning of, what everyone must think of her, etc.. This sort of thing happens every couple of weeks or so. I don't know if it's clinically a panic attack (there's no hyperventilation or anything) but she describes herself feeling tense and her mood changes completely. She's aware she's doing it, but no amount of reassurance can persuade her that she doesn't need to worry.\n\nI hate this situation, since she's suffering with it so much and I feel so powerless to help her. It isn't good for her.\n\nSo, any advice? How can I best support her? How can she support herself? Should she look into going back on the medication again? If so, how do I go about suggesting to her without it sounding like I'm saying, \"you're going crazy again, we need drugs to calm you down\"?\n\nI'm desperate to be able to do something but I have no idea what I can do. Please help. I know there've been plenty of tears from her, but she doesn't know there've been just as many from me. I don't know what to do.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't know how to help my girlfriend",
            "url": "http://www.reddit.com/r/Anxiety/comments/gc7gm/i_dont_know_how_to_help_my_girlfriend/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1301188606,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/gc8xv/is_exercise_helpful_all_the_time/",
            "id": "gc8xv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/gc8xv/is_exercise_helpful_all_the_time/",
            "score": 1,
            "selftext": "i figured out recently that intense exercise (running, cardio, weight lifting etc.) helps greatly with my intense/crippling anxiety.\n\nmy question is that will exercise be this helpful all the time as long as i keep doing it or the positive effects of it will fade away with time? \n\nsorry if i sound somewhat naive but the reason i am asking it is that, i am so tired of coming across to something helpful and then being beaten by anxiety at the end again.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "is exercise helpful all the time?",
            "url": "http://www.reddit.com/r/Anxiety/comments/gc8xv/is_exercise_helpful_all_the_time/"
        },
        {
            "author": "nervous_loser",
            "author_created_utc": 1300035442,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4yhna",
            "created_utc": 1300036255,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/g364u/work_anxiety/",
            "id": "g364u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/g364u/work_anxiety/",
            "score": 1,
            "selftext": "No judgements please, just advice needed!\n\nWherever I work I have had this problem:  People make loud and/or annoying and/or distracting noises designed to interrupt my flow.  And I am excluded subtly from the group.  (I work as a software developer - senior level but not confident about my skills)  Self esteem and assertiveness issues.  I wear headphones but it doesn't help, they can't block out all noise.\n\nIt sounds trivial but it keeps me up at night!  I _have_ to work to pay the mortgage and bills for my g/f and daughter.  \n\nOtherwise I would quit and run away somewhere.  So the only other option is the ultimate running away.  I have life insurance so at least that would cover the mortgage.  \n\n1am as I type this.  Got to get up in 4 hours.  ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Work anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/g364u/work_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1299225278,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/fx58m/first_time_ever_going_out_to_a_club_dubstep_party/",
            "id": "fx58m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/fx58m/first_time_ever_going_out_to_a_club_dubstep_party/",
            "score": 1,
            "selftext": "I hope this post is appropriate for this section. I couldn't think of a better subreddit to post it in.\n\nI recently started hanging out with a friend who invited me to go to a party with her tomorrow night. I am considering making up an excuse and just staying in, but I really want to learn how to push myself out of my comfort zone.\n\nI'm 20, female, and have a boyfriend. \n\nI have never stepped foot into a club before, have never been to a party larger than 20 people, and get nervous very easily. Neither one of us are drinkers. \n\nHow was your first club/party experience? Was it worth going? Did you get anxious? Did you end up leaving early due to your anxiety? Do you regularly go to these types of events now?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "First time ever going out to a club (dubstep party). What should I expect?",
            "url": "http://www.reddit.com/r/Anxiety/comments/fx58m/first_time_ever_going_out_to_a_club_dubstep_party/"
        }
    ]
}