{
    "data": [
        {
            "author": "aperson",
            "author_created_utc": 1200989994,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_32o7e",
            "created_utc": 1305600337,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hd24z/dae_have_a_persistent_ringing_sound_in_their_head/",
            "id": "hd24z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hd24z/dae_have_a_persistent_ringing_sound_in_their_head/",
            "score": 4,
            "selftext": "In the past few months I've been experienceing a ringing in my ears (though it doesn't seem to originate in a particular ear [in fact, I can have an ear ring on top of this ringing]).  It's been seemingly getting worse and now it seems it's there more often than not.\n\nDoes anyone else have a similar condition, and if so, is it caused by your anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE have a persistent ringing sound in their head/\nears due to Anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/hd24z/dae_have_a_persistent_ringing_sound_in_their_head/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1305328874,
            "domain": "taketheellievator.blogspot.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hawvv/can_we_show_her_some_reddit_love/",
            "id": "hawvv",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hawvv/can_we_show_her_some_reddit_love/",
            "score": 4,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Can we show her some reddit love?",
            "url": "http://taketheellievator.blogspot.com/2011/05/jar-of-hidden-things-and-secret.html"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1304632140,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/h552s/my_situation_seems_fucked_need_help/",
            "id": "h552s",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/h552s/my_situation_seems_fucked_need_help/",
            "score": 3,
            "selftext": "So, I'm an 18 year old male, senior in highschool, no big deal. My parents split up last January. I did fine all of last year until Christmas morning to be exact. The night before, I was playing some games with my friends and this one, little, fleeting though, changed my life. I was playing Fallout and some though of \"what if this is a dream, a game?.\" Like what's the purpose in life. What is our goal. I hope this doesn't get to anyone else that bad, but every since then I had been feeling unreal almost, detached. I started seeing a counselor and everything was going great. I started to feel better, although not completely. Lately, I took a drug called phentermine. Well, being the anxious person I am, I read that it can make your anxiety come back. I started to panic. I didn't want to feel like that again, but the very thought of going back to that has put me under stress trying to keep happy thoughts and look away. I don't know what to think about this. I've prayed to god every night hoping I can get help because I sure don't want to take any SSRI's or meds. I don't want to have to be on medication to feel normal damnit. I want to be me, normal old me. I want to be a child again when I didn't have a care in the world. Last night I had a dream that feds or somebody had been watching me (I was watching a movie about that before I fell asleep) and they told my mother that I was going \"mad\" like they would in the 50's. Well I freaked out and woke up in the start of a sweat like a panic attack. I fell so weak. Anything could control me right now, I have no more confidence in myself. Would someone please help me figure out where to start. Especially if you know what it feels like to be scared you're not even real. I don't feel so much like that anymore though, just feel like I'm going crazy.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My situation seems fucked. Need help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/h552s/my_situation_seems_fucked_need_help/"
        },
        {
            "author": "darkrom",
            "author_created_utc": 1276708321,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_44ga0",
            "created_utc": 1306717049,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hn540/anxiety_induced_nausea_often/",
            "id": "hn540",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hn540/anxiety_induced_nausea_often/",
            "score": 3,
            "selftext": "Does anyone else experience this.  Many or maybe even most days I experience nausea.  It all started after being sick for 4 months.  I know I have general anxiety, but is it common to feel nausea and sometimes vomit just from general anxiety?  I can't tell if I am anxious with a stomach problem, or just anxious causing my own stomach issues.  The anxiety about being sick seems to make sense after 4 months of intense nausea and testing (couldn't find anything but 99% sure it was a stomach virus that others at work got bad but not quite as long), but is it really possible that nothing is wrong and the nausea from anxiety is that bad?\n\nTLDR; What are your experiences with stomach troubles caused by anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety Induced Nausea OFTEN?",
            "url": "http://www.reddit.com/r/Anxiety/comments/hn540/anxiety_induced_nausea_often/"
        },
        {
            "author": "MegaWin",
            "author_created_utc": 1300231544,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4yutu",
            "created_utc": 1305527986,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hcd25/do_i_have_anxiety/",
            "id": "hcd25",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hcd25/do_i_have_anxiety/",
            "score": 3,
            "selftext": "So I just recently realized that there is a possibility that I may have general anxiety disorder (I definitely have social anxiety for sure). I always feel like I'm waiting for something, and I stress about little things to the point where I'm just annoyed by myself. Also for a few months I've been getting randomly depressed during the day. I feel like I can't enjoy life because I'm always tense and waiting for something (which I'm not). The only way I can be satisfied and enjoy the moment is through drugs.\n\nDo you guys think I have anxiety?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do I have anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/hcd25/do_i_have_anxiety/"
        },
        {
            "author": "tmga",
            "author_created_utc": 1288378673,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4h2r7",
            "created_utc": 1305355385,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hb416/never_had_anxiety_in_my_life_hit_me_suddenly_one/",
            "id": "hb416",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hb416/never_had_anxiety_in_my_life_hit_me_suddenly_one/",
            "score": 2,
            "selftext": "My entire life I have been fairly care free, and things that I worried about never made me have anxiety as I know it today. I never really knew what anxiety was until it hit me, and now I wish more than anything I could make it go away. \n\nI can honestly say I know exactly when it happened. I had been a recreational cannabis user for a few months. I smoked everyday, usually at night before I went to bed. It was always euphoric and never had a negative outcome. What began as an elevated heart rate for a few nights, and bit of deep scary thoughts after watching that HBO series Band of Brothers, eventually turned into one night being hit with the most horrible experience in my life. I started feeling tingling in my neck and arms, and began the dreaded racing thoughts of impending doom. I thought it was the start of a heart attack. My chest felt tight, and I couldn't convince myself I was alright. I eventually became very light headed and almost blacked out. I was able to calm a bit and was hit by the worst cold sweats I have ever had. Completely drenched in sweat. After the panic attack subsided, I was left with what I now know as anxiety. I assumed it would be gone after sleeping, and was I ever wrong. Ever since that night, I have had that fleeting pain in my chest, and sometimes a dull pain in my arms. I don't even have any thoughts in my head that would be contributing to the anxiety. It just sits there, in my chest, causing me discomfort and pain that I can't make go away. Some days it's really bad, some days its almost non-existent. I have had very close calls with more panic attacks, but have generally been able to make them go away by convincing myself that I am ok, and I have survived one before.\n\nI had to quit smoking cannabis because it instantly sends me into a panic attack. This doesn't bother me, because like I said I would give anything to make this go away. What bothers me the most is that I really can't even explain what is making me anxious. The only symptoms are physical. The chest pain scares me, it has changed my personality. I used to be lively, extrovert, loved to talk. Now when I have bad days, I can only sit and listen to people talk while I am in my own head trying to figure out what the hell is wrong with me. \n\nPlease reddit, I used to be a happy guy. Now I find myself just wanting to nap because I can't stand to be awake. I can't live with this everyday. The scariest thing is thinking that this may never, ever go away. It's like I am waiting for it to go away, the day it does I expect to feel the most refreshing feeling ever. Sadly, it hasn't happened yet. What do I need to do? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Never had anxiety in my life, hit me suddenly one night, now it won't go away.",
            "url": "http://www.reddit.com/r/Anxiety/comments/hb416/never_had_anxiety_in_my_life_hit_me_suddenly_one/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1305829794,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hf8in/inability_to_cry/",
            "id": "hf8in",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hf8in/inability_to_cry/",
            "score": 1,
            "selftext": "So.. I haven't cried in about 10 years.  I broke my back when I was a teenager and suffered through some deep depression.  I got out of the depression by basically suppressing every emotion I felt.. and now, in my mid 20s, I have no depression, but, I find that I have extreme anxiety in situations that I should have basic emotions.  I really feel that if I could cry, I would be much less anxious.  \nDoes anyone have any tips on how to cry after going so long without?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Inability to cry?",
            "url": "http://www.reddit.com/r/Anxiety/comments/hf8in/inability_to_cry/"
        },
        {
            "author": "redditforgotaboutme",
            "author_created_utc": 1297892931,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4uotc",
            "created_utc": 1304615518,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/h4y1t/reddit_i_need_your_help_with_my_gfs_anxiety_i_am/",
            "id": "h4y1t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/h4y1t/reddit_i_need_your_help_with_my_gfs_anxiety_i_am/",
            "score": 1,
            "selftext": "I have been seeing my GF for a little over a year. We live together and this morning was by far the worst \"attack\" I have seen. \n\nIt started at 6am, I am half asleep and get up to go to the bathroom. I guess my GF was already up. I get back to bed and lay back down to go back to sleep since I don't have to be up for another hour and a half for work. Literally 2 seconds after I lay down she flings the covers up, jumps out of bed, walks across the room and puts clothes on and storms out of our room to go outside to smoke. She comes back in, lays down facing me. I flip over (so I am not facing her) and I feel the bed start to shake. Then came the whimpering, then full blown hysteria.\n\nThe crying continues, I continually ask her what is wrong or what I can do to help. She is sitting up in bed at this point, crying her eyes out. I put my hand on her back to show some concern and she started twitching and screaming and jumped off the bed onto the floor where she repeated crying uncontrollably, shaking and at one point, hitting herself in the head repeatedly saying \"I hate myself, I hate myself, I hate myself\" She starts crying for help so I knelt down and put my arms around her to try and comfort her. At this point I have no idea WTF is going on. She eventually calms down but our whole morning has been devastated. \n\nWe have been seeing couples counseling for the past several months for communication problems. We were supposed to go together tonight but I texted her and told her she should go alone because she needs to talk to someone and get some help.\n\nShe refuses to take medication, but at this point Reddit, I don't know how much longer I can keep going like this. It kills me inside that this is some sort of \"disease\" and I can't help, but at the same time I have no idea what I should do/don't do. I can only describe the scenario as what I have seen closest to it and that is a little 4 year old boy having a tempur tantrum on his parents floor (that I witnessed at a friends house) and that is the closest I can describe it, except way freaking worse when she is hitting herself and saying she doesn't want to live.\n\nIf anyone could shed some light on the subject of anxiety, maybe some supportive comments or something. At this point im about to throw out a relationship with a girl I love because I just can't take this anymore. \n\n*Edit to add: My GF has been prescribed drugs in the past (I think welbutrin?) but she hated it. She doesn't have insurance or any money to see a specialist so we are kinda screwed on those options. \n\ntl;dr: My girlfriend has an extreme case of anxiety disorder that is crippling our relationship.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Reddit, I need your help with my GF's anxiety, I am at my whits end.",
            "url": "http://www.reddit.com/r/Anxiety/comments/h4y1t/reddit_i_need_your_help_with_my_gfs_anxiety_i_am/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1305828246,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hf7rx/overcoming_the_shaky_voice_and_nerves/",
            "id": "hf7rx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hf7rx/overcoming_the_shaky_voice_and_nerves/",
            "score": 1,
            "selftext": "How do you deal with nerves?  I have an interview coming up (purely behavioral) for a program I'm really interested in at my company, but I just had a mock interview and am very embarrassed about my anxiety/nerves (shaky/quivery voice, dry mouth, etc.).  It's only 30-45 minutes, but I know that I will have this pit-in-my-stomach sensation until it's over tomorrow, and I feel like this is slightly irrational.  I often get this way about any important conversations with people above me, interviews, presentations, or anything that I've deemed important and life-ending if I mess it up.  Does anyone have any strategies to get some of these nerves out before I totally embarrass myself??",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Overcoming the shaky voice and nerves",
            "url": "http://www.reddit.com/r/Anxiety/comments/hf7rx/overcoming_the_shaky_voice_and_nerves/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1305979185,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/hgmj9/taking_ativan_for_anxietyinsomnia/",
            "id": "hgmj9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/hgmj9/taking_ativan_for_anxietyinsomnia/",
            "score": 1,
            "selftext": "My exact anxiety condition is a big TL;DR but basically I have leftover anxiety due to a thyroid condition. Ive been taking ativan for it since December. I use it specifically to treat insomnia. For the last 2 months my dosage has increased significantly. I now take 3mg a night. I am wondering if anyone has any advice or experience with this or other benzos. Basically I don't need it anymore but ive become dependent on it. Im also terrified of withdrawal so ill have anxiety about it unless I can be convinced ill be okay.\n\nTL;DR: Does anyone have any experience with ativan? How likely is it that im addicted if ive been taking 3mg a night for 2 months?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Taking Ativan for anxiety/insomnia.",
            "url": "http://www.reddit.com/r/Anxiety/comments/hgmj9/taking_ativan_for_anxietyinsomnia/"
        }
    ]
}