{
    "data": [
        {
            "author": "whytofly",
            "author_created_utc": 1308858984,
            "author_flair_css_class": "test",
            "author_flair_text": null,
            "author_fullname": "t2_5f1wp",
            "created_utc": 1318009055,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/l4bnp/if_only_it_were_this_easy/",
            "id": "l4bnp",
            "is_self": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/l4bnp/if_only_it_were_this_easy/",
            "score": 84,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_l4bnp.png",
            "title": "If only it were this easy...",
            "url": "http://i.imgur.com/RlU2q.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1318797815,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ledis/is_anyone_else_afraid_of_their_voicemail/",
            "id": "ledis",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ledis/is_anyone_else_afraid_of_their_voicemail/",
            "score": 72,
            "selftext": "Okay, I have a lot of trouble using my phone. It takes some mustering before I can make a phone call, and I usually let an incoming call go to voicemail. The problem is, once a person has left a message, I still have a hard time checking it. Like as long as I don't check it, there's no message for me. Because who knows what could be on there! It drives me insane. Why can't I check my voicemail?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is anyone else afraid of their voicemail?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ledis/is_anyone_else_afraid_of_their_voicemail/"
        },
        {
            "author": "naboothatswho",
            "author_created_utc": 1298007739,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ux1i",
            "created_utc": 1317866307,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/l2i1b/anyone_else_get_incredibly_intense_nostalgia_on/",
            "id": "l2i1b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/l2i1b/anyone_else_get_incredibly_intense_nostalgia_on/",
            "score": 34,
            "selftext": "I am a very anxious person, to the point where it has and probably should still be medicated. In addition to all of my regular anxieties, sometimes I just look back and think how great things were just a few years ago, and I don't think they will ever be that good again, I just don't see it in the world. \n\nI think this is tied to my anxiety because it is kind of an anxious feeling, but anxiety is a lot about not being present in the current moment, which nostalgia is clearly not. \n\nI guess I am just curious if it happens to anyone else. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else get incredibly intense nostalgia on occasion? ",
            "url": "http://www.reddit.com/r/Anxiety/comments/l2i1b/anyone_else_get_incredibly_intense_nostalgia_on/"
        },
        {
            "author": "sad_sea_turtle",
            "author_created_utc": 1317663631,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5z20c",
            "created_utc": 1317686292,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/kzx98/finally_made_it_to_therapy/",
            "id": "kzx98",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/kzx98/finally_made_it_to_therapy/",
            "score": 33,
            "selftext": "I'm a 21 year old college student and I've suffered anxiety for years. Meeting new people and engaging in conversation has been really difficult and I'm filled with thoughts that cripple my productivity and ability to live my life. Most of the decisions I have made in my life are based on safety rather than whether it will make me happy\n\nMy anxiety finally culminated with a girl I had been seeing. I finally found someone I could trust with my true feelings and I let it all out, all of the fear and over-analyzing, all of the things I kept from my other friends and family to keep up appearances. She looked at me wide-eyed and told me that I have an anxiety disorder and should seek therapy. I had avoided thinking about it for years, but it finally got through. Calling the therapist was one of the hardest things I've ever done. One meeting down and I feel a little better. Medication was suggested, but I am reluctant.\n\nEven if no one reads this, it still feels good to let it out. Thanks reddit, you get me through the day.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Finally made it to therapy",
            "url": "http://www.reddit.com/r/Anxiety/comments/kzx98/finally_made_it_to_therapy/"
        },
        {
            "author": "Soda76",
            "author_created_utc": 1318618101,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_61kui",
            "created_utc": 1319832602,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lsk2c/i_just_made_the_first_call/",
            "id": "lsk2c",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lsk2c/i_just_made_the_first_call/",
            "score": 25,
            "selftext": "Well its been around  2 week sence my frist post and and i just made my frist call my appointment  is in a few days ill keep you all posted and thank you for all you help ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just made the first call",
            "url": "http://www.reddit.com/r/Anxiety/comments/lsk2c/i_just_made_the_first_call/"
        },
        {
            "author": "thrown_away44",
            "author_created_utc": 1317399041,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5yefz",
            "created_utc": 1318444631,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/l9ufy/daes_get_hot_when_the_get_anxious/",
            "id": "l9ufy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/l9ufy/daes_get_hot_when_the_get_anxious/",
            "score": 23,
            "selftext": "When someone catches me off guard or something triggers my anxiety I can feel the blood rush to my head.  My head and face feel hot and I might even start to sweat.  This has happened to me before when I was trying to be intimate with a woman and the face is the not the place that I want the blood to be flowing to at a time like that.  Is there anything I can do to prevent this or maybe slow it down?  What are your experiences?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE's get hot when the get anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/l9ufy/daes_get_hot_when_the_get_anxious/"
        },
        {
            "author": "anxiousthrowawaythis",
            "author_created_utc": 1319922888,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6539l",
            "created_utc": 1319927959,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ltla6/anxiety_induced_nausea_downward_spiral/",
            "id": "ltla6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ltla6/anxiety_induced_nausea_downward_spiral/",
            "score": 21,
            "selftext": "Anyone out there get trapped in a downward spiral of anxiety about an event that leads to nausea and then get anxiety about throwing up and then get more anxiety because you are anxious about throwing up etc...? car rides where I am not the driver fuck with me. \n\nIt's the worst fucking thing in the world to me. I think it might be the fact that if I am out and about and I need to throw up I won't have a place to do so in private. For the record, I only throw up about once a year if that and it's usually due to having the flu or a cold. I know it's irrational and I am an extremely rational person usually. \n\nI try to say \"fuck it\" lets do it and when I do that after the fact I usually really enjoyed what I did but the dread going into new experiences with unknowns is a trigger I think. \n\nI don't want to go on drugs so that's out. anyone have any coping techniques that work for them? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety induced nausea downward spiral. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/ltla6/anxiety_induced_nausea_downward_spiral/"
        },
        {
            "author": "Sara_Sorta",
            "author_created_utc": 1309974185,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5h70b",
            "created_utc": 1318985782,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lgxm4/i_got_such_a_good_supportive_response_to_my_last/",
            "id": "lgxm4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lgxm4/i_got_such_a_good_supportive_response_to_my_last/",
            "score": 21,
            "selftext": "I had posted here about being an Agoraphobic and I got such a supportive response I thought I would create a sub just for us. Agoraphobia is directly linked to anxiety and I will stay active on this board, but I thought a small place to talk about the quirks of being specifically an Agoraphobic would be nice. Thanks for reading, hope to see you there. \n\ntl;dr New sub, hope to see you there. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I got such a good supportive response to my last post, I created /r/Agoraphobia",
            "url": "http://www.reddit.com/r/Anxiety/comments/lgxm4/i_got_such_a_good_supportive_response_to_my_last/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1320018075,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lujkx/the_3_times_that_in_my_life_that_i_felt_normal/",
            "id": "lujkx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lujkx/the_3_times_that_in_my_life_that_i_felt_normal/",
            "score": 21,
            "selftext": "Hi guys, first time posting here (first time finding this sub-reddit as well).\n\nI'm male, 28, been diagnosed with SAD/GAD about 10 years ago and tried various things to help cope with it.  The only 3 times in my life where I've found myself to have ZERO anxiety was when the 2 times that I took shrooms with some booze and the first and only time where I tried Speed.\n\nOn those 3 occasions I felt like a normal human being!  No worries about whatever, just having fun and enjoying myself, not giving a fuck about what others thing.  Normally I'd be antisocial in a group until I'm comfortable with them (usually takes a while) but on those times it didn't matter who was around, I would carry my own and it was great! My quality of life would greatly be increased if I could live in those moments again but only everyday.\n\nI'm going to the doc in a few days to be put back on some meds again, it's at the point where it affects my job and willingness to just go outside even if it's just for a walk.  I hate it.  I have done therapy before, I know the mental triggers where the anxiety kicks in and I tell myself that it's nothing to worry about but when it comes to that my body had already reacted and it's too late.  I get the shakes, I can't think straight, can't communicate properly or clearly and etc.\n\nSo does anyone know of medicine where it replicates the anxiety removal effects of said shrooms and speed without the trippyness? (Although I wouldn't say no if there was a bit of wheeeeeeee involved).\n\n\nTL:DR - Always had big anxiety problems, tried some trippy drugs and the anxiety stopped during those times and was immensely social.  Need to replicate said effect with a prescription without tripping balls (ie remain functional for work).\n\nUPDATE: Dr prescribed Zoloft to begin with.  Small doses of 25mg a day for the first week, 50mg for the second week followed by 100mg a day for the rest.  Another checkup is scheduled in 3 weeks to see if the meds have also helped with the ADD since a lot of the symptoms overlap for both conditions.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "The 3 times that in my life that I felt normal",
            "url": "http://www.reddit.com/r/Anxiety/comments/lujkx/the_3_times_that_in_my_life_that_i_felt_normal/"
        },
        {
            "author": "rmm45177",
            "author_created_utc": 1273115428,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_41i1k",
            "created_utc": 1319758789,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lrkj5/i_just_had_my_first_tour_of_a_college_and_i_feel/",
            "id": "lrkj5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lrkj5/i_just_had_my_first_tour_of_a_college_and_i_feel/",
            "score": 20,
            "selftext": "I started to have an anxiety attack while I was being given he tour. It still hasn't gone away yet and now I feel like I'm going to pass out.\n\nThe school only had 3900 students (about 1500 more than my high school), but it felt huge. I don't know if I could handle being around so many people.\n\nMy therapist said that going to visit a college and auditing a class would help with getting over my fear or going to college, but I feel like visiting today just made it worse. I really don't know of I'll ever be able to do anything with my life after high school.\n",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just had my first tour of a college and I feel terrified. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/lrkj5/i_just_had_my_first_tour_of_a_college_and_i_feel/"
        },
        {
            "author": "anxinducedthrowaway",
            "author_created_utc": 1312174295,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5lkle",
            "created_utc": 1318501165,
            "domain": "self.Anxiety",
            "edited": 1,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/laojn/the_first_call/",
            "id": "laojn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/laojn/the_first_call/",
            "score": 20,
            "selftext": "Even with a throwaway I'm hesitant to go into too much detail. I'm making an appointment with a psychiatrist soon. Granted soon for me has always meant hitting the proverbial snooze button for a month or so, repeatedly. It's so damn hard to just pick up the phone, speak with someone I don't know/am not familiar with, and make an appointment. The anxiety is getting worse thinking about it, writing about it, posting an anonymous thread under a nondescript account on a section of a website that (I hope) can likely sympathize.. I can't wait for it to be lessened. Through drug treatment and continual therapy I know it will, but over a decade of feeling anxious about most things, panic attacks, and deepening depression will not be fixed quickly. All the more reason to start now. It's still so hard.\n\nI mean, I haven't left my house is 5 years but a few times. Before that I only went out for schooling that I frequently skipped or called in sick for because of the anxiety. If I get through this phone call, will I even make the first appointment? Staying inside is so much more comfortable compared to how I felt over half a decade ago, when I had some semblance of a normal life, but I also became miserable and suicidal because of the incredible stress of constant anxiety. I'm miserable now, also, which is what's scaring me as I've minimized anything that can put me into those horrible feelings of anxiety. Depression, anxiety, panic attacks, and in some instances either anger, or when I deny myself that self-hating rage - incredible sadness coupled with self-hatred. I'm at the same time looking forward to, and not looking forward to the appointments - I hope all this effort will be worth it.\n\n\n\nI'm not sure what the point of this thread was other than to quasi-rant and maybe get some perspective on others' experiences. To give this post more of a point I'll ask a question: Has anyone been as far gone as me in regards to ~~letting~~ having anxiety completely destroy their life and how was your journey back?\n\nThank you for reading.\n\nEdit: I forgot to mention in the post, that while this is probably discouraged behavior as it's me continuing to avoid situations that cause me anxiety which is the exact opposite of what CBT would have me do, I had originally had a family member call them to set up an appointment for me but they require anyone over the age of 18 make an appointment themselves - for privacy reasons. I'm not quite sure how I feel about that, and I have no idea if that's common practice.\n\nEdit 2/Update: Well I actually made the call. I'm looking at the appointment date and time that I wrote down, as well as the email the receptionist sent me and still a bit in disbelief that this is finally happening. I nearly had a panic attack trying to call, and then when eventually getting through I felt like throwing up - so I'm a bit 'winded' from the whole experience. But there's also a slight feeling of relief. I'm finally getting help. I'm optimistic but still a bit 'shaken'. I hope the treatment works out.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The first call.",
            "url": "http://www.reddit.com/r/Anxiety/comments/laojn/the_first_call/"
        },
        {
            "author": "nikki_sixx",
            "author_created_utc": 1285274013,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4daz4",
            "created_utc": 1319642248,
            "domain": "nccam.nih.gov",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lprek/chamomile_tea_can_help_with_anxiety_its_helped_me/",
            "id": "lprek",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lprek/chamomile_tea_can_help_with_anxiety_its_helped_me/",
            "score": 19,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/RIodpcDpzr9m50qc.jpg",
            "title": "Chamomile Tea Can Help with Anxiety; its helped me at night, worth a shot.",
            "url": "http://nccam.nih.gov/news/newsletter/2010_may/chamomileanxiety.htm"
        },
        {
            "author": "soupypsouperson",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1319505791,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lntzg/my_favorite_goya_etching_the_sleep_of_reason/",
            "id": "lntzg",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lntzg/my_favorite_goya_etching_the_sleep_of_reason/",
            "score": 18,
            "selftext": "",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://thumbs.reddit.com/t3_lntzg.png",
            "title": "My favorite Goya etching- \"The Sleep of Reason Produces Monsters.\" Reminds me of how I feel when my anxiety manifests itself in my dreams. ",
            "url": "http://i.imgur.com/6GFpx.jpg"
        },
        {
            "author": "Coldchaser",
            "author_created_utc": 1318371527,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_60vjp",
            "created_utc": 1318372306,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/l8tqv/first_therapy_session_and_already_the_relief_has/",
            "id": "l8tqv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/l8tqv/first_therapy_session_and_already_the_relief_has/",
            "score": 18,
            "selftext": "I made it to my first therapy session today, and the doctor said I should go on medication considering how long I've had panic disorder (almost 10 years now). I'm open to trying it out, along with CBT, although I would have to inform my family. And this appointment is in a little more than a week...so I'm growing increasingly nervous. My panic triggers are stuffiness and heat, and tomorrow will jump to a toasty 90 degrees from today's 76 (which was already a bit troubling for me). I'm so scared of becoming agoraphobic (I've already avoided going out to classes for a week). Breathing exercises don't help much since my first symptom is trouble breathing. :( Does anyone have any suggestions or advice? Thank you!",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "First therapy session and already the relief has faded",
            "url": "http://www.reddit.com/r/Anxiety/comments/l8tqv/first_therapy_session_and_already_the_relief_has/"
        },
        {
            "author": "stelladoll",
            "author_flair_css_class": "",
            "author_flair_text": "Panic Disorder + Social Anxiety",
            "created_utc": 1318447002,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/l9w2a/was_diagnosed_yesterday/",
            "id": "l9w2a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/l9w2a/was_diagnosed_yesterday/",
            "score": 17,
            "selftext": "I always kind of expected it, but didn't really believe it until yesterday.\n\nThis past Spring I had problems with depression, over the summer it got worse and I wound up going to my family doctor in order to get a referral for a psychiatrist. Since it takes a long time apparently to get an appointment to see one (almost three months apparently) I opted to have my doctor prescribe me medication (50mg of Zoloft). \n\nOnce coming back to school and starting therapy at the counseling center I asked my therapist if I could get an appointment with a psychiatrist on campus, just for a consultation to be sure I was on the right medicine and what not. My appointment was yesterday. \n\nNot only has my dosage of Zoloft doubled (100mg) but it has the possibility to quadruple (200mg). I also apparently have problems with social anxiety as well as panic disorder, which are co-morbid with depression. \n\nI am both relieved and saddened by this diagnosis. I don't know. I just wanted to share this. Get it off of my chest.    ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Was diagnosed yesterday. ",
            "url": "http://www.reddit.com/r/Anxiety/comments/l9w2a/was_diagnosed_yesterday/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1319872141,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lt1ty/how_do_you_prep_your_significant_other_to_deal/",
            "id": "lt1ty",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lt1ty/how_do_you_prep_your_significant_other_to_deal/",
            "score": 17,
            "selftext": "I never had a chance to explain to my current boyfriend what a panic attack feels like, but one day he showed up while I was in the middle of a freakout and busted out some two-person breathing exercises he'd looked up online. I was grateful for that, and realized I had never had the energy or courage to fully explain to him what it's like and how to react.\n\nWhat words have you personally used with your SO to prepare them for a possible panic attack?\n\nDo you know any two-person exercises or activities that can help?\n\nCrossposted a similar topic to r/BipolarReddit about manic episodes, if you're interested.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you prep your significant other to deal with your panic attacks?",
            "url": "http://www.reddit.com/r/Anxiety/comments/lt1ty/how_do_you_prep_your_significant_other_to_deal/"
        },
        {
            "author": "aubergineneophyte",
            "author_created_utc": 1291606453,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4l7lt",
            "created_utc": 1319040767,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lhlqt/sick_note_from_psychiatrist/",
            "id": "lhlqt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lhlqt/sick_note_from_psychiatrist/",
            "score": 16,
            "selftext": "I've been out of work for the past week and half due to awful panic attacks in the morning or just calling in sick so I don't have to go through the panic attack. I've been out of work previous to this, just never longer than a couple of days. So, as expected, work called me today and said that I can't miss anymore work without a doctor's note.\n\nI started to see a psychiatrist two weeks ago about my anxiety. He wrote me a prescription for sertraline but said it'll probably take at least four weeks for it to start working.\n\nI really don't want to face work tomorrow. I'm panicing just thinking about it. Do psychiatrists write doctors notes? How would I go about getting one?",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "sick note from psychiatrist?",
            "url": "http://www.reddit.com/r/Anxiety/comments/lhlqt/sick_note_from_psychiatrist/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1317544521,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/ky82s/hey_dae_have_problems_with_anxiety_and_being/",
            "id": "ky82s",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/ky82s/hey_dae_have_problems_with_anxiety_and_being/",
            "score": 16,
            "selftext": "I had a very negative coming out experience, and was kind of anxious to begin with, so that bit got worse.  Stayed in a bad situation for too long, lost all my friends, and kind of internally freak out whenever I run into homophobic crap on the internet or in real life.  Anyways, anyone have any experience with dealing with this?  So far medications have been helpful, and I finally found a good therapist.  My last two were terrible, and the most recent one was trying to practice covert ex-gay christian therapy on me.  Talk about violation of professional ethics, anyways...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey, DAE have problems with anxiety and being lgbtqiaabbq?",
            "url": "http://www.reddit.com/r/Anxiety/comments/ky82s/hey_dae_have_problems_with_anxiety_and_being/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1317519115,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/kxz7j/is_this_typical_of_social_anxiety/",
            "id": "kxz7j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/kxz7j/is_this_typical_of_social_anxiety/",
            "score": 16,
            "selftext": "I have suffered from social anxiety for over ten years (25 year old female here). My school yearbooks are full of comments like \"nice but quiet\", \"don't talk much\", etc. I'm not sure if my anxiety is caused by not knowing how to socialize with others, or if the anxiety causes the social awkwardness. I am confident in structured environments, where I know exactly what behavior is expected of me, and am confident talking about facts/theories/etc. I am also confident communicating via text/internet. I fall apart in unstructured settings (bar/club/get-together) and feel as though I must \"force\" myself to make any small talk. This sometimes leaks into the structured environments like the workplace, where socializing is expected. ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Is this typical of social anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/kxz7j/is_this_typical_of_social_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1319509118,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lnw35/i_need_help/",
            "id": "lnw35",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lnw35/i_need_help/",
            "score": 16,
            "selftext": "Hello,\nI've been meaning to post here for a while. I've been tweaking and rewriting what I was going to say here for 3 weeks now : / \nIt's been hard to explain exactly how I feel to people who've never had panic attacks. So maybe it will be easier to talk about to you guys. \n   I've finally broken out of a year long depression and have recently started taking baby steps to get back on track. I'm 19 years old and instead of partying at college I've pretty much cut myself off from the world, I hit rock bottom and just wanted to disappear. I got what I wished for. I only have a select few that I've kept in my life now. Although I do force myself out of the house everyday for a short period of time, it's always alone or with my stepbrother. This is going to be a pretty long post, but I would really be grateful if someone reads through it..\n    I moved in with my dad during freshman year of high school. He moved to China years ago for business. My dad was successful and I was given the opportunity to go to a British school there. It wasn't worth it in the end. My father has a history of beating his wives. A month after I moved in with him I overheard him yelling at his wife while I was doing homework. She tried arguing back and my dad being the power freak that he is, lost it. His wife ran into my room crying and actually hid behind me. All of this was happening while his friend/business partner was there trying to calm him down and physically hold him back. My dad came stomping down the hallway after throwing some furniture around and ran into my room to see this woman on the floor crying behind me. He was about to shove me into the wall to get to her. He's a big guy. So I fought back. I went for his throat.. Stunned, he glared at his sobbing wife and stormed out of the room. After that day, she thanked me every chance she got until she moved out. She said my dad would have seriously hurt her again if I wasn't there.\nHe continued to show how angry and insecure he was. I stopped being angry at my dad, I pitied him. From shoving me into walls because he didn't believe me that football practice was cancelled that day. Calling me a loser. Saying that I would have been a complete loser if I hadn't moved in with him. Saying that I was broken and I needed the Marine Corps to fix me. The sad thing was, I believed him.\nHe constantly berated me. I became insecure. \nI had a large circle of friends that I could hang out with every weekend and had a great girlfriend. I never allowed my self to stay home for too long.\nI never contacted my mother or anyone else because I didn't want them to worry. I was going to a great school and had amazing friends and I just couldn't 'give up' and leave. In my mind my dad would win if I left. So I stuck with it for 3 years. Until one morning I was about to head out to the bus when my dad stopped me and asked if I was \"really going to wear that jacket\" I tried to walk past him. He tried heckling me and when I snapped back he floored me and got some punches in on me while I was on the ground. I kicked him and kept him at a distance with my legs until he called me a pussy and left. I went outside, missed the bus and started walking around the city crying. I was ready to leave after that. I came back and told him that I wanted to go back to the US. We got into some fights and a couple days later he pulled me out of school and wouldn't really let me go out until I changed my mind. He said I was just going through a phase. I decided to play his game. I stuck it out for 2 months. My dad still wouldn't buy a plane ticket for me to go back home. Junior year was almost over. I finally called my mother to buy me a ticket back to America. My dad would pick up the phone from his room and listen in on all of my conversations every night. I was a wreck. I became nocturnal. I stayed up all night so I could sleep most of the day and not have to see my dad. \"Loser\" became his favorite thing to say. I believed him. Everything he said got to me eventually. I started drinking before sunrise and smoking a cigarette so I could sleep without feeling terrible. The ticket finally came through and the date was set without my dad knowing. I snuck out and hosted a going away party a couple of days before I was supposed to leave. I was a mess. I didn't want to be at my own party. I was just awkwardly swaying back and forth staring down at my feet while my ex girlfriend tried to snap me out of it the whole night and cheer me up. She thought I was sad that I was leaving. I didn't know how to feel.\nThe day I was leaving, I called for a taxi to pick me up. I packed everything I could, said goodbye to my dad and left. \nI hadn't come back to the States since I moved in with my dad, it had been almost 3 years. I got back to my mothers place and I was enrolled into the local high school a couple days later. Something wasn't right with me. I didn't want to be around anyone. I wandered around the school by myself checking in on all my new friends. I forced myself to hangout with everyone. I still held on to the idea that if I told anyone what I went through and told anyone I was hurting, I was weak and a loser and nobody wanted to hear my problems. I then found out that my new school was waiting on my transcripts and grades to transfer over. Turns out that my dad had to pay a fee to the foreign school for pulling me out early and only he could pay it and until it was paid, my transcripts would not be released. My dad never paid the fee. And he never contacted the school to release my transcripts. To my new school, it looked like 3 years of school never even happened. When I first got back and showed the school my old homework and tests, they told me I was doing advanced work and it wouldn't be covered until I got to college. Still, I had no official grades so they told me I would have to test out and get my GED. They just said that with my level of education I would do really well on it.  \nI imploded. I stopped talking to everyone. I dropped off the face of the earth. I really was a loser. I did fail. Just like my dad said I would.\nA few days after this I had to go to the school to gather all my things and empty my locker and I had my first panic attack on the way to the school bus. I didn't know what happened, I thought I was finally losing my mind. I became severely depressed. I refused any and all help I was offered. I was too stubborn to accept something was wrong with me. I didn't want any help with MY problem.\nI became worse. \nI started having 'waves' of de-realization leading up to and ending with a panic attack. I would start walking around in a dream like state, wondering if the tv I was watching was real, or if my brother was actually there in front of me. I was hit with it no matter what I was doing. The most terrifying feeling/experience in the world had no trigger. I was so wound up inside that my mental state was literally caving in on itself. And I refused to tell anyone any of it. \nAfter a few weeks I went and took my GED to get it over with. I nearly aced it. The certificate says that my score was on par with the top 10% of normal high school graduates. I still felt terrible. I was on the other side of the earth but my dad was still talking down to me in my head. I decided that I actually was broken and the Marine Corps would help me sort my life out like my dad said. They don't accept GED recipients. More depression. \nMy family forced me to go to the doctor and tell him I had some anxiety problems. I was given prozac, but it only intensified my feelings and made the de-realization last longer. I quit it soon after and just began smoking cigarettes, it was the only time I felt relaxed and the smell brought back good memories of spending time with my friends at my old school. I'm finally coming out of this depression after a year. I was close to killing myself once. I did some research on all the popular religions and set the time and date for my suicide for 5 months later. It was supposed to be around this time, so I'll just mark that as an accomplishment.  \nI'm still trying to deal with my social anxiety. I have some trust issues. I'm still not able to have my hair stylist stand behind me without me getting really nervous. I used to have panic attacks about that. I still can't look anyone in the eye without cringing or stay in a group of people without getting too nervous and leaving. I don't know anyone in the U.S. except for my family. \nI'm visiting a therapist when I can. \nI just don't know where to start anymore. I'm a lot better than I was though. I'm afraid to \"show\" myself to the world. I really want to go to University but I just can't the way I am. \nI don't have any self confidence. I can joke and have fun with my brother but I can't handle anyone else right now really. It's killing me. \nIf anyone has any tips or advice, it would really help me, no matter what it is. Thanks for reading such a long post",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I need help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/lnw35/i_need_help/"
        },
        {
            "author": "lessthanthreechrissy",
            "author_created_utc": 1312938987,
            "author_flair_css_class": "",
            "author_flair_text": "owning anxiety since 1998",
            "author_fullname": "t2_5n7gn",
            "created_utc": 1319754471,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lrhu4/i_started_an_anxiety_journal/",
            "id": "lrhu4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lrhu4/i_started_an_anxiety_journal/",
            "score": 16,
            "selftext": "[So here it is.](http://anxiousdaysahead.tumblr.com/)\n\nI've been told it's good to get everything out and so I started one. If you have one or start one too, I'll follow yours if you give me a link. It's nice to have a support group and all, at least I think so.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I started an anxiety journal",
            "url": "http://www.reddit.com/r/Anxiety/comments/lrhu4/i_started_an_anxiety_journal/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1319066418,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/li1u3/my_mom_just_called_and_said_she_was_worried_about/",
            "id": "li1u3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/li1u3/my_mom_just_called_and_said_she_was_worried_about/",
            "score": 15,
            "selftext": "I've been having a rough few months. I had beat my anxiety and been doing quite well for a few years and then suddenly it came back with a vengeance and I have been having low level anxiety all day with random panic attacks.\n\nMy mom called today and said that she was worried about me and how i was able to make my bills and such. She asked if i had any friends, etc. \n\nThen she said \"i didnt want to call because you always act like im intruding its just i am worried you are going to kill yourself. Are you thinking about suicide?\"\n\nWhat. The. Fuck.\n\nMe and my mom dont have the best relationship. She has a history of being a drama queen and making all my problems about her. When my anxiety first came back I was staying for her for various reasons. She ended up leaving for a week because she \"couldn't deal\".\n\nThe problems is that now that I got off the phone with her all i can do is worry. What if I DO commit suicide? what if i have such a bad episode that i cant handle it and end up hurting myself? \n\nI've been finding myself thinking about death a lot lately. I worry about what will happen after i die, how much i would hate being buried underground even though i would be dead, about the world ending via zombie apocalypse/2012 bullshit. Which is annoying because I don't actually believe any of the conspiracies but what if im wrong?\n\narrrghh it is a vicious cycle and I need help getting out.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My mom just called and said she was worried about me",
            "url": "http://www.reddit.com/r/Anxiety/comments/li1u3/my_mom_just_called_and_said_she_was_worried_about/"
        },
        {
            "author": "xMIASMAx",
            "author_created_utc": 1312892495,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5n3di",
            "created_utc": 1318845065,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lez5a/anyone_else_do_this/",
            "id": "lez5a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lez5a/anyone_else_do_this/",
            "score": 15,
            "selftext": "Ok so I cannot talk to people if it involves me.. but whenever friend have problems they come to me. I turn into like dr.phil montel williams shit...is this normal for someone with social anxiety? ",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else do this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/lez5a/anyone_else_do_this/"
        },
        {
            "author": "barbados_slim92",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1318833961,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/levtq/i_dont_know_how_to_deal_with_this/",
            "id": "levtq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/levtq/i_dont_know_how_to_deal_with_this/",
            "score": 15,
            "selftext": "I'm a pretty typical nineteen year old white guy. I've always been a worry wart but never really had a problem with it. About a year ago I started smoking marijuana. One day about three months ago I had a really bad high and ever since then I have been extremely anxious. I haven't smoked since that day. The symptoms I've had all point to anxiety. General weakness, fatigue, heart racing, intrusive thoughts. However I've been able to sleep just fine.\n\nNow I understand this all points to anxiety but what I don't understand are the problems I'm facing that are causing the anxiety. I'm a pretty social person and don't have too much trouble approaching people or being in public so I've ascertained from that much that it's at least not social anxiety. I haven't been getting anxious about normal everyday things. Instead I've been getting extremely anxious about large questions in life. \"Why are awe here?\"and \"Is life meaningless and if so then what's the point of anything?\" and \"If emotions like love and happiness are simple chemicals released in our brains then whats the point of thought?\" and \"If concepts such as right or wrong don't exist and are societal constructs then what's the point?\" The list goes aon and on. These thoughts are so intrusive. I just want to be able to ignore them and accept things for what they are. \n\nAs for seeing a therapist or a psychiatrist, I won't be able to until January when my insurance kicks in. So until that point I don't know what to do? I want to live life in the moment without having my mind consume me. I just don't know what to do...",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't know how to deal with this.",
            "url": "http://www.reddit.com/r/Anxiety/comments/levtq/i_dont_know_how_to_deal_with_this/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1318825266,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/lervi/thinking_youre_going_crazy/",
            "id": "lervi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/lervi/thinking_youre_going_crazy/",
            "score": 15,
            "selftext": "I've had anxiety for most of my life, undiagnosed until about a year and a half ago. Due to a combination of environmental factors (being alone, isolated, and under enormous stress), I felt like I was starting to lose touch with practically everything, forcing me to withdraw from college last year. I've since gotten back on my feet, back to school, medicated, and in a less-introverted style of living.\n\nBut every now and then, not quite as bad as it used to be, I have that feeling like my brain is short circuiting, like at any moment I might become a different person, or maybe that the world around me might cease to exist, like I'm for lack of a better term, going crazy. It's difficult to explain. \n\nSome people have debilitating physical illnesses, some are blind, some are deaf. And some people like me have uncontrollable thoughts that often lead to places that can be uncomfortable and even painful. Just have to deal with it I guess. I'm not posting this thread necessarily to simmer in my own self-pitying stew, I do that on my own time, haha. I guess I'm just trying to see if anyone's anxiety, like mine, leads to just fear of losing your mind.",
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Thinking you're going crazy.",
            "url": "http://www.reddit.com/r/Anxiety/comments/lervi/thinking_youre_going_crazy/"
        }
    ]
}