{
    "data": [
        {
            "author": "imepicwin",
            "author_created_utc": 1336016908,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7mew6",
            "created_utc": 1397578193,
            "domain": "self.Anxiety",
            "edited": 1397619950,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/233p7h/anyone_else_have_constant_air_hunger/",
            "gilded": 0,
            "id": "233p7h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 56,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/233p7h/anyone_else_have_constant_air_hunger/",
            "retrieved_on": 1441579070,
            "score": 125,
            "secure_media_embed": {},
            "selftext": "Since about 6 months ago, the day I started my first career job after college, I have been experiencing a lot of anxiety. It has mainly manifested itself in the form of \"air hunger\" - a constant feeling that I'm not getting enough air and that I can't get satisfying breaths. I am constantly yawning/sighing and it is driving me crazy! \n\nHas anyone else experienced this type of symptom that could shed some light on ways to cope with it?\n\nEdit: I was really afraid to post on here but I am really thankful for the overwhelming response. I'm glad to know that I am not the only one experiencing this. I can't wait to try the techniques you guys suggested! It's been a good day.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else have constant \"air hunger\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/233p7h/anyone_else_have_constant_air_hunger/"
        },
        {
            "author": "e_0",
            "author_created_utc": 1386097602,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_e6mwt",
            "created_utc": 1397533917,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/232e03/does_anyone_else_ever_feel_extremely_worthless/",
            "gilded": 0,
            "id": "232e03",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/232e03/does_anyone_else_ever_feel_extremely_worthless/",
            "retrieved_on": 1441579682,
            "score": 116,
            "secure_media_embed": {},
            "selftext": "Hey guys, I've posted here once before but with no help, so I'm going to give it another go..\n\nSo today I put in new contacts, straight from the package. I went to school for seven hours, then worked for another six hours. I came home and was dead tired. I had reminded myself throughout the day that my old contacts were still in my case, so I *NEED* to get those out before I put my new ones in it with them, without realizing it. By the time my day had ended, I had forgot and done exactly that. No big deal, I can just take the ones on the bottom and throw them away, thus solving my problem. When I tried to do this, my mind went to autopilot and I threw away the first, new contact, then it hit me. It's okay, it might've landed on a tissue that was wadded up in the trash can, a good cleaning job on the lens and it should be fine. I looked at the trash can, saw that there was nothing in it but the nasty, uncleaned bottom of the can littered with gum and other gunk, and my brand new contact lens.\n\nEven though this is the most trivial mistake to make, and it was kind of humorous in a way, I felt dread. I felt like I was a hopeless excuse for someone about to go to college in the fall. I just wasted a perfectly good lens that cost a decent sum of money, all because of my incompetence. I felt like crying or punching something, which nearly escalated into a full-blown panic attack had I not calmed myself down. Does anyone else ever experience things like this? Is there any way to not get so emotional over such trivial things? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else ever feel extremely worthless over menial mistakes?",
            "url": "http://www.reddit.com/r/Anxiety/comments/232e03/does_anyone_else_ever_feel_extremely_worthless/"
        },
        {
            "author": "ouchmybutt",
            "author_created_utc": 1313507553,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5oeht",
            "created_utc": 1397873269,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23enm4/banned_really/",
            "gilded": 0,
            "id": "23enm4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 59,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23enm4/banned_really/",
            "retrieved_on": 1441573897,
            "score": 113,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Banned? Really?",
            "url": "http://www.reddit.com/r/Anxiety/comments/23enm4/banned_really/"
        },
        {
            "author": "B0o",
            "author_created_utc": 1311625478,
            "author_flair_css_class": "",
            "author_flair_text": "GAD / Depression / Panic Disorder",
            "author_fullname": "t2_5ke3p",
            "created_utc": 1398048181,
            "domain": "self.Anxiety",
            "edited": 1398187372,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23k6em/going_in_for_surgery_tomorrow_could_use_an/",
            "gilded": 0,
            "id": "23k6em",
            "is_self": true,
            "media_embed": {},
            "num_comments": 75,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23k6em/going_in_for_surgery_tomorrow_could_use_an/",
            "retrieved_on": 1441571297,
            "score": 110,
            "secure_media_embed": {},
            "selftext": "I am having an exploratory laparoscopy tomorrow to try and find the cause of intense abdominal pain that I have been having for a month now. \n\nI hate having general anaesthetics, I get very anxious and scared and my worst case scenario thinking comes out in full force.\n\nI am struggling to stay calm about it tonight. Even though I know it is a relatively minor procedure, they will not know what they need to do to resolve any problems until they are in there.\n\nI know my surgeon and trust her, but it is still scary to me and I am going over all the things that could go wrong in my head. It is not helping that I am having to take strong painkillers and they are clouding my ability to process my thoughts logically.\n\nI am going to be a nervous wreck going in there, and last time I remember crying as they put me under because I was so scared that I was never going to wake up again.\n\nSo I am feeling miserable and in pain and just looking for a bit of support and sympathy :-(\n\n\n**edit** So I am home safe and sound, but minus one ovary. I will find out more tomorrow when my surgeon cals. Thanks for all the hugs and comments of to take my mahooosive painkillers now xxxx\n\n\n**edit** **2** so it was a twisted fallopian tube abd scar tissue surrounding the ovary. No wonder it hurt!!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Going in for surgery tomorrow. Could use an internet hug.",
            "url": "http://www.reddit.com/r/Anxiety/comments/23k6em/going_in_for_surgery_tomorrow_could_use_an/"
        },
        {
            "author": "MyKindOfLullaby",
            "author_created_utc": 1372997361,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c9nzg",
            "created_utc": 1398023461,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23j6iu/does_anyone_else_get_anxiety_from_spending_money/",
            "gilded": 0,
            "id": "23j6iu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23j6iu/does_anyone_else_get_anxiety_from_spending_money/",
            "retrieved_on": 1441571764,
            "score": 90,
            "secure_media_embed": {},
            "selftext": "I always have anxiety about spending money. Even if I buy a small $4 tea or something, my brain is like \"you should have spent that money more wisely!!!!!\"  \n\nIs anyone else like this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else get anxiety from spending money?",
            "url": "http://www.reddit.com/r/Anxiety/comments/23j6iu/does_anyone_else_get_anxiety_from_spending_money/"
        },
        {
            "author": "forensikat",
            "author_created_utc": 1396890893,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g0waq",
            "created_utc": 1397625411,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/235r8x/you_cant_have_anxiety_because/",
            "gilded": 0,
            "id": "235r8x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 45,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/235r8x/you_cant_have_anxiety_because/",
            "retrieved_on": 1441578110,
            "score": 81,
            "secure_media_embed": {},
            "selftext": "I cannot stand it when someone actually has the audacity to say something as rude as, \"What? You have anxiety? No way!\" And then inserts some justification as to why I'm making that up.\n\nFor me, it's usually \"You can't have anxiety! You do speech and debate!\" Yes, I can get up in front of a room of 1-7 people and give a practiced speech. I love it! But that does not negate that I have trouble meeting new people, am incredibly sensitive, have crippling phobias, and get incredibly nervous when talking to people I don't know well. And yes, I can do prelim rounds pretty easily, but if I break to out-rounds, I'm a mess and can barely function, I get so nervous!\n\nJust because I like doing something that doesn't fit your definition of anxiety does not mean that there are not other aspects of my life in which I struggle with anxiety. It's really the same as saying, \"Oh, you're smiling now so you can't be depressed!\" or \"You don't seem to be in pain so your foot can't be broken.\"\n\nSpeech and debate is something I'm happy to be able to do. Not everyone can, and my anxiety is not as severe as others. I get that, and I understand that my anxiety is nothing compared to the struggles many go through everyday. But I absolutely cannot stand it when I feel that I can trust someone with knowing I struggle with anxiety and they throw back \"but you do speech!\" ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "\"You can't have anxiety because...!\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/235r8x/you_cant_have_anxiety_because/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1397758774,
            "domain": "self.Anxiety",
            "edited": 1415843044,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23aequ/help_my_boyfriend_doesnt_want_me_taking/",
            "gilded": 0,
            "id": "23aequ",
            "is_self": true,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23aequ/help_my_boyfriend_doesnt_want_me_taking/",
            "retrieved_on": 1441575878,
            "score": 70,
            "secure_media_embed": {},
            "selftext": "-",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] My boyfriend doesn't want me taking anti-depressants",
            "url": "http://www.reddit.com/r/Anxiety/comments/23aequ/help_my_boyfriend_doesnt_want_me_taking/"
        },
        {
            "author": "puppyth",
            "author_created_utc": 1395201614,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_fraz8",
            "created_utc": 1397799879,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23c4b5/i_can_never_go_to_bed_early_is_there_anyone_like/",
            "gilded": 0,
            "id": "23c4b5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23c4b5/i_can_never_go_to_bed_early_is_there_anyone_like/",
            "retrieved_on": 1441575080,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "I just have a relentless thought that I am missing out on something, and I haven't accomplished much through the day so I have to stay awake. There's also feeling of deep lonliness that holds me back from sleeping early. I have to entertain myself to fill up the loneliness.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can never go to bed early. Is there anyone like me?",
            "url": "http://www.reddit.com/r/Anxiety/comments/23c4b5/i_can_never_go_to_bed_early_is_there_anyone_like/"
        },
        {
            "author": "CatoAsAPun",
            "author_created_utc": 1271851247,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_40ive",
            "created_utc": 1397853164,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23dv1x/i_feel_great_hoping_at_least_somebody_reads_this/",
            "gilded": 0,
            "id": "23dv1x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23dv1x/i_feel_great_hoping_at_least_somebody_reads_this/",
            "retrieved_on": 1441574269,
            "score": 50,
            "secure_media_embed": {},
            "selftext": "\nI'll try not to get way too detailed with this, but I just have to share this experience I had with you all, as you all are the only people I know will understand this at this moment. I'm not the best writer in the world so I might go into a bit of a tangent with some stuff but all this is being written with pure retrospective emotion which I hope adds to it a bit:\n\n I've been struggling with crippling general anxiety for a couple years now, and health anxiety (which has gotten very serious in the past few months). Throughout the time I've been suffering with this I've been experiencing long term depersonalization/derealization which has taken a huge toll on me mentally and physically. I would wake up confused and feeling weak, go through the day completely terrified and go to bed focusing only on death and what I could possibly have that might be killing me. Of course I acknowledged many times that \"it's just my anxiety making it worse\" or \"it's all in my head\" but those acknowledgements alone weren't enough to help me in the long term. Around last year in the 4th quarter of the year around October or November, I started to have mild GERD, and over the last few months it's gotten significantly worse and has mutated my anxiety into a powerful force that has been completely corrupting my conscience and has been turning me into a shell of a person. I recently went to a friend's wedding and in the duration of that trip I almost felt normal again, but there was that lingering feeling of not being real or complete that would instantly bring me down and ruin everything. After I came back from the trip, I felt like I was reaching a breaking point, and I was absolutely right. The last few days I had been sinking deeper and deeper into a depressed state, and yesterday I was starting to get suicidal. I started to feel exhausted and took a nap, and when I woke up something happened that put me into a falling out with another family member, and I was about to go through with the suicidal contemplation (but I'm still unsure of whether or not I was actually going to do it). And after I didn't go through with it, I broke out into tears and felt  completely dead for the succeeding hour. Eventually I started to feel a bit better (as better as I could at this point) and the day moved on. Then today, everything was feeling pretty average. Wake up feeling slightly sick and uneven, worried about everything involving my health, spend an hour in the bathroom because of IBS, and go downstairs and sit at my computer for a couple hours. Then I was about to take one of my daily walks when I began to have this rushing feeling of being unreal and crazy, but far worse than ive experienced frequently. I thought taking the walk would subdue the feeling but it only got worse and I decided to go to my backyard deck and have a seat and try to relax. I slouched on a deckchair, listened to the new Antlers album and tried to relax, as difficult as that was, and the more I relaxed the more my anxious mind started to think I was actually dying. But this time the feeling was different, it wasn't worried feeling of foreboding death...but a relaxed one. I was ready to take it in and let it happen, and of course it didn't and it was just my regular mind being relaxed. The music was still playing, and there I was sitting having a real relaxing moment in my backyard, looking around at the trees in front of me day dreaming about being somewhere of natural beauty like Switzerland or Norway, when I see a squirrel running across the tree branches. My eyes followed the squirrel, moving from branch to branch, temporarily altering the still nature of those trees only for a moment, when something truly wonderful happened. I don't know why this happened, and as hard as I try to make sense of it I still cant (not that that matters to me)....but I felt true joy. Something I haven't felt in over 2 years and I couldn't contain it. I started to laugh and feel like I was a real, normal, living human being with a personality. All the while the music still played in my ears and only boosted the emotions I was feeling. \n\nAnd eventually it was over, but this time I didnt go back into a slouch of depression. This time I realized something I hadn't really though before, and that's that everything that worried me about death doesn't matter. Of course physical health and well-being is important, but my exaggerated thoughts about it could be subdued because I still have that potential of feeling true joy, while still feeling completely dead, and those feelings are what is the most important to look back on before it all ends. The events that transpire to make those feelings are beautiful in their own right, but the feelings that they actually give you are what coats those memories and gives them meaning and a more thorough context.\n\nI'm not trying to make a central/focused point with all this but If I were to do that, it would be that however bad your anxiety/depression is, theres always that potential for even a short moment of clearness that will shine a light on everything, and it's those moments short or long that you have to hold onto, because it's the moments that are always potentially ahead of you until you die.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel great (hoping at least somebody reads this)",
            "url": "http://www.reddit.com/r/Anxiety/comments/23dv1x/i_feel_great_hoping_at_least_somebody_reads_this/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1397830355,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23cudc/does_anyone_here_have_an_expressive_communication/",
            "gilded": 0,
            "id": "23cudc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23cudc/does_anyone_here_have_an_expressive_communication/",
            "retrieved_on": 1441574742,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I have an expressive communication problem along with anxiety. When I have to talk to people my brain can't find the words I want to use fast enough and sometimes I end up mentally and physically not being able to speak at all. I have made A LOT of progress over the years but now my biggest problem is job interviews. \n\nI am 21 and I have to start looking for a job but during interviews I get anxiety which makes my communication problem even worse. When I am asked questions I can't speak fast enough and start to get very nervous. Most times I even start to cry because I am so flustered. \n\nIf anyone has a similar situation or any ideas on how to combat this I would like to know so I can finally start getting on with my life.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone here have an expressive communication problem on top of anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/23cudc/does_anyone_here_have_an_expressive_communication/"
        },
        {
            "author": "Anxyouty",
            "author_created_utc": 1398015710,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g7zi8",
            "created_utc": 1398017976,
            "domain": "self.Anxiety",
            "edited": 1398168844,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23iydb/boyfriend_was_honest_and_said_anxiety_outbursts/",
            "gilded": 0,
            "id": "23iydb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 45,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23iydb/boyfriend_was_honest_and_said_anxiety_outbursts/",
            "retrieved_on": 1441571867,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "I am a 26 yr old male and my anxiety outbursts and perfectionism are ruining my relationship with my 27 year old boyfriend. I'll try to keep this short. \n\nEssentially, I've had anxiety my whole life. I was raised by anxious perfectionistic abusive parents. I realized when I was twenty what exactly anxiety was and I've been working on it for what feels like an eternity. I've had several long term romantic relationships throughout my twenties. All of them have ended for various reasons, but all of them were definitely affected negatively by my anxiety. I can see that now, retrospectively. \n\nIn my day-to-day life all is usually well. Work goes smoothly. I have good friends. Etc. But sometimes certain things just trigger these incredible anxiety outbursts. My body locks up. I shake. I'm terrified of losing my mind or hurting myself. I want so desperately to communicate with my boyfriend but my throat and voice are locked up. I cry and scream and feel so shameful and apologize during and after the episodes. They last ten minutes to one hour. The aftermath lingers for days. Lots of suicidal thoughts after due to shame. I would never kill myself though. I just get this overwhelming sense that everyone would be happier without my craziness polluting the planet. \n\nOften times they are triggered when the bf and I are debating issues or fighting. I'm also very perfectionistic on myself and on him. I have goals in my head that I've set for him regarding diet and exercise, drinking, smoking, and I get overwhelmed and annoyed/anxious when he is not reaching goals. Even though he is making great progress at times. I do the same thing to myself. I exercise twice a week always but still beat myself up because i don't always go four times a week. I do heavy heavy lifting. Full body. \n\nI feel like a total piece of shit when I realize what I am doing. But in the moment I can't tell how perfectionistic I am being or how insane my outbursts must seem. It's definitely not normal. Scary tv shows can trigger an anxiety outburst. Things I see on the news or on the street can trigger them. My boyfriend has said he doesn't feel like he can share any negative emotions with me--whether it's being upset with me/disagreeing with me about anything, or any negative emotion unrelated to me--and is always anticipating me having a \"breakdown.\" It's not healthy for him either. \n\nPlease. Any help is appreciated. I just need somewhere to begin. A type of therapy? A type of medication? A name for these \"outbursts\" so I can do more research. I've tried lexapro and hated it. No sex drive. \n\nI've considered that maybe we are just incompatible but it's not the case. We have a great sex life when it's \"on\" and shared dreams and plans. He is caring and wonderful with kids. My family loves him. I love him. This problem will just follow me to another guy. \n\nEDIT 04-22-14\n\nI've bought the book \"when panic attacks\" because it was highly ranked on Amazon with great reviews. It's essentially a CBT workbook. I've done these sorts of CBT worksheets in the past. I've set a goal to make this a part of my life. Not just for now but for a good while. It's taken 26 years to build the man that I am... I can't expect to change my thinking instantly. The author talks a lot about how doing the exercises is very essential, not just reading the book. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Boyfriend was honest and said anxiety outbursts are ruining relationship.",
            "url": "http://www.reddit.com/r/Anxiety/comments/23iydb/boyfriend_was_honest_and_said_anxiety_outbursts/"
        },
        {
            "author": "0123123",
            "author_created_utc": 1359074881,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_acrmp",
            "created_utc": 1398102197,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23ltve/i_havent_left_my_house_in_two_years_help/",
            "gilded": 0,
            "id": "23ltve",
            "is_self": true,
            "media_embed": {},
            "num_comments": 39,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23ltve/i_havent_left_my_house_in_two_years_help/",
            "retrieved_on": 1441570525,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I havent left my house in two years, because i have really bad anxiety. Im only 17 years old, but anxiety is really affecting me. I kept on having panic attacks at school,  and sometime i was sent home, sometimes i was told to suffer through it, sometimes i couldnt leave my house and go to school. My parents decided to finally home school me. \n\nThe only things that help with my anxiety are pacing, i sometimes am walking back and forth my house from the time i  wake up and the time i go to sleep, i just cant calm down enough to sit down. Some times i cant sleep good, i once was up three days in a row because i coudnt calm down. \n\nDo you know any tips to help me calm down?\n\nI was on a medication once but it made me feel weird and i havent tried another.\n\nSorry for the bad grammar i typed this in a hurry.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I havent left my house in two years. Help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/23ltve/i_havent_left_my_house_in_two_years_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1397699790,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/238gpb/rant_so_angry_right_now/",
            "gilded": 0,
            "id": "238gpb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/238gpb/rant_so_angry_right_now/",
            "retrieved_on": 1441576786,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "So angry right now.  It's burning in the back of my mind.  I can't get what I need so I always just curl up and get out of peoples way.  WHY!  Why get out of the way?!  So they can ignore me?  So they won't be inconvenienced?!?  Why should I care so much what they think or feel?  It's like I got swallowed up by an empathy monster and now I can't feel what I'm feeling because I'm so worried about what other people might think of what I'm feeling.  That's not even empathy is it!  That's a great FREAKING plan isn't it?!  Right up to the point where the only answer I have left is to punch that jerk in the face!  Just break his nose and feel the blood splash over everything.  Then maybe people would take me more seriously.  Maybe that's all they ever listen to.  You try to be nice right up to the point where you die and then all they have to say is \"gee, why did he do it?  Why did he just give up like that?!\"  I'm pretty sure I wasn't born this way.  I'm pretty sure I was fairly healthy and strong at one point.  But then what happened?  OTHER PEOPLE HAPPENED.  Terrible people.  And now here I am.  Broken.  Way too old to be fumbling with trying to even talk to another human being.  To the point where I feel ghoulish, where I go for days, weeks, sometimes months without physical contact with another person or even a conversation beyond \"hey.\"  Then when I do reach out to someone, anyone, to have some kind of meaningful conversation or moment or anything, I can't make it come out right and they shrink away from me.  They leave, they ignore me, they seen put off and walk away, and I just try to keep out of peoples way again because that's the nicest thing I know how to do for people where I won't mess it up........ok..........I don't feel angry anymore.  Now I just feel really sad.  That's better right?  Right?  I'm going to listen to music now.  If you read this far, thank you for listening, even if I never tell you in person it means a lot to me.  If you didn't read this far, then you're not reading this now so I could type anything and you'd be none the wiser...rutabaga. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[RANT] So ANGRY right now",
            "url": "http://www.reddit.com/r/Anxiety/comments/238gpb/rant_so_angry_right_now/"
        },
        {
            "author": "throwaway3287",
            "author_created_utc": 1329067521,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6wlwc",
            "created_utc": 1397687725,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/237ycb/does_anybody_elses_anxiety_flare_up_when_they_get/",
            "gilded": 0,
            "id": "237ycb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/237ycb/does_anybody_elses_anxiety_flare_up_when_they_get/",
            "retrieved_on": 1441577085,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "Back before I started taking Lexapro, when I got into a heated argument with someone, I would get pissed and honestly my rational thought just screeched to a halt and I couldn't defend myself because I was so pent up with emotion / stress. This would lead to me not being able to defend myself nearly as often even when I was clearly in the right.\n\nNow that I'm taking Lexapro I feel like I can think more rationally under stress. Maybe it's not even anxiety.. I'm not sure what it was, maybe just overwhelming?\n\nMaybe a weird side effect.. But worth noting!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else's anxiety flare up when they get pissed off? Lexapro has helped me out a lot with this.",
            "url": "http://www.reddit.com/r/Anxiety/comments/237ycb/does_anybody_elses_anxiety_flare_up_when_they_get/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1397795417,
            "domain": "self.Anxiety",
            "edited": 1397828219,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23bz6i/i_called_my_mom_out_today_on_her_little_sister/",
            "gilded": 0,
            "id": "23bz6i",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23bz6i/i_called_my_mom_out_today_on_her_little_sister/",
            "retrieved_on": 1441575147,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "Sigh",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I called my mom out today on her little sister abusing me when I was little",
            "url": "http://www.reddit.com/r/Anxiety/comments/23bz6i/i_called_my_mom_out_today_on_her_little_sister/"
        },
        {
            "author": "Omnommers",
            "author_created_utc": 1310427211,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5i1ur",
            "created_utc": 1397872169,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23em8r/the_curse_is_lifting_and_it_will_for_you_too/",
            "gilded": 0,
            "id": "23em8r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23em8r/the_curse_is_lifting_and_it_will_for_you_too/",
            "retrieved_on": 1441573915,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "So I had been stricken with Agoraphobia with Panic Disorder for over 2 years and have been homebound, unable to seek medical help because the 2 mile drive to the doctor was too much, unable to see my friends, and wasn't even able to leave my block without panic attacks.\n\nAt the beginning of this year I decided to say, \"fuck it,\" and got to the doctor. I had a huge panic attack while there, but I managed to force myself to wait there for over an hour to see my doctor.  \nI was prescribed Lexapro and have been on a journey of exponentially getting better. I spend the majority of my time out of the house now, and am even starting to apply for work!  \nThanks to my SO, GP, and Therapist I have been able to make huge strides, when I never thought I would be able to have a life again.  \n\nI guess what I'm trying to convey is that I believe everyone can make it through. Just remember in times of panic and anxiety that it can not harm you in any way. All panic will subside after a while, and you'll be happy when you stuck with a situation that scared you shitless and made it through.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The curse is lifting, and it will for you, too!",
            "url": "http://www.reddit.com/r/Anxiety/comments/23em8r/the_curse_is_lifting_and_it_will_for_you_too/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1397969189,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23ho83/does_anyone_else_fear_having_children/",
            "gilded": 0,
            "id": "23ho83",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23ho83/does_anyone_else_fear_having_children/",
            "retrieved_on": 1441572472,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "Not in the \"I don't know how i'll be able to handle having my own kids to take care of\" sense, but more along the lines of passing down psychological issues.\n\nI just found out both my parents are suffering from depression (my dad's been on and off, my mother was diagnosed after she had my brother and I) and just recently, I started having panic attacks (i'm 21) which had never happened before. Knowing full well I suffer from panic and anxiety now, and possibly even depression in the future, it's become very real to me that I might not ever want to have kids because I wouldn't want to subject them to what I've dealt with and been through. I might reconsider of course; depends on who my partner is, though.\n\nis anybody else like this? what are your thoughts/feelings on the topic?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone else fear having children?",
            "url": "http://www.reddit.com/r/Anxiety/comments/23ho83/does_anyone_else_fear_having_children/"
        },
        {
            "author": "homicidal_turtle",
            "author_created_utc": 1394559284,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_fniwg",
            "created_utc": 1397679860,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/237l0c/how_to_not_take_things_so_personally/",
            "gilded": 0,
            "id": "237l0c",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/237l0c/how_to_not_take_things_so_personally/",
            "retrieved_on": 1441577258,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "Hi Reddit,\n\nI've been struggling on and off with my SO and my anxiety/depression whenever he decides to do something with his friends or without me, and to me, it seems like a blatant choice against me, which I take very personally (and as a reflection of my poor personality). It gives me anxiety to feel that I did something wrong and that he perhaps hates me for being so clingy. In general, my anxiety has been under control through the combination of therapy and medication, but I was wondering if anyone else has experienced this sort of thing. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How to not take things so personally?",
            "url": "http://www.reddit.com/r/Anxiety/comments/237l0c/how_to_not_take_things_so_personally/"
        },
        {
            "author": "ramenforone",
            "author_created_utc": 1355072573,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9uclh",
            "created_utc": 1397682050,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/237ovh/i_feel_like_an_outsider_with_everyone_around_me/",
            "gilded": 0,
            "id": "237ovh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/237ovh/i_feel_like_an_outsider_with_everyone_around_me/",
            "retrieved_on": 1441577208,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I just ask myself why I can't be normal like them and be happy.\nMy therapist asks if I would really want to conform to being normal but bored (since we've established I'm a bit different from the norm. She suggests that maybe I just haven't found my own group that meshes well). I can see her point of view and her quote of \"stranger in the world of normal\" but I just want to have it all. Be myself, be happy, love life.\n\nI find things that others think is so amazing and fun to be neutral, take it or leave it. My anxiety mixes with depression.\n\nJust wondering if anyone can agree with me/see my point of view. My anxiety stems from me feeling inadequate, different, unaccepted.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like an outsider with everyone around me enjoying life and being happy.",
            "url": "http://www.reddit.com/r/Anxiety/comments/237ovh/i_feel_like_an_outsider_with_everyone_around_me/"
        },
        {
            "author": "MmmRavioli",
            "author_created_utc": 1393436403,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fgoaw",
            "created_utc": 1397667670,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/237033/anxiety_at_work/",
            "gilded": 0,
            "id": "237033",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/237033/anxiety_at_work/",
            "retrieved_on": 1441577529,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Hi Reddit. First post regarding my anxiety and panic. On a new medication that makes me nauseous. I do not do well with nausea. I have a fear of throwing up in public places. (weird thing to think about I know) After several bathroom trips to try to splash cold water on my face and get it together I just got the shakes. Shakes went from bad to worse. My heart was pounding, getting the vertigo, couldnt breathe, and then came the worst- jelly legs. I could barely type out a letter to my supervisor letting her know I have to miss work (yet again). I started to panic because not only were my coworkers who didnt know I suffered this watching me in horror- I'm immobile and cant get to my husband's car. Finally my kind hearted coworker grabbed a wheelchair (i work in a hospital) and quickly wheeled me away to the lobby where my husband was waiting in the car. I was terrified to come in today. But seem to be OKAY for now. Thought i'd share as that was one of the worst, scariest attacks I've had in awhile. thanks for reading. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety at work",
            "url": "http://www.reddit.com/r/Anxiety/comments/237033/anxiety_at_work/"
        },
        {
            "author": "Aavenell",
            "author_created_utc": 1319084119,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_62uwt",
            "created_utc": 1397956277,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23h7zm/feel_sick_to_my_stomach_at_school_possibly_caused/",
            "gilded": 0,
            "id": "23h7zm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23h7zm/feel_sick_to_my_stomach_at_school_possibly_caused/",
            "retrieved_on": 1441572684,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Hey everyone who bothers to read this. A couple of weeks ago, I got kinda sick. Nothing bad, just common cold. Anyway, the feeling of \"I'm gonna puke\" has stayed with me ever since, and it gets amplified at school. I can only assume this is due to anxiety at school. I think I'm anxious that something bad is going to happen, and that causes stress, and it makes me feel like I am going to puke. I think coughing is what starts me on it. I don't know. I really don't know what to do at this point, help?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feel sick to my stomach at school, possibly caused by anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/23h7zm/feel_sick_to_my_stomach_at_school_possibly_caused/"
        },
        {
            "author": "outlooker707",
            "author_created_utc": 1349128513,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_96j4s",
            "created_utc": 1397612309,
            "domain": "self.Anxiety",
            "edited": 1397615990,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2359pb/feeling_short_of_breath_heres_why/",
            "gilded": 0,
            "id": "2359pb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2359pb/feeling_short_of_breath_heres_why/",
            "retrieved_on": 1441578337,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I saw that there was quite a few people with this problem so please take a minute and read this post. If you have asthma this also worth a read!\n\nI know that some of us with anxiety have developed a condition called \"air hunger\" the feeling of not being able to get a satisfying breath. I suffered from this for many months and had several medical tests taken to rule out anything else, but i'm proud to say that I have reversed this condition and I would love to share on how I did it.\n\nLong story short, the reason why you feel air hunger is because your body has low carbon dioxide levels as a result of stress. When under stress, you breathe in more air and exhale a greater amount of carbon dioxide. This creates a viscous cycle causing your body to inhale more and more deeply to maintain the carbon dioxide level. If you continue to do this over a prolonged period of time, then your body deems your increased breathing volume as \"normal\" and as a result you will constantly feel short of breath unless you keep taking in big breaths.\n\nYour goal is to break this habit and restore your oxygen/carbon dioxide levels back to a healthier level. You can do this by practicing the Buteyko method. Dr. Buteyko spent decades researching how our breathing affects the body. There is a lot of info to follow so I left a link at the bottom of this post, but the goal is to reduce your breathing volume by practicing simple exercises. One thing to remember is that you should be breathing through your nose and into your belly. Mouth and chest breathing is a bad habit that many people don't realize.\n\nThe following is a simple way to measure your carbon dioxide level: Also called the Control Pause technique.\n\nStep 1: Take a few small breaths and try to relax your breathing. Make sure to have a stopwatch handy.\n\nStep 2: Slowly exhale completely and once you have done so, hold your breath and start the timer.\n\nStep 3: Stop the timer when you feel the first urge to breathe, remember this is not a test of how long you can hold your breath, if you find yourself gasping for air then you held it for too long.\n\nStep 4: Record how long you held it for before needing to breathe, this is your Control Pause score.\n\nIf your CP is below 10 seconds then you are breathing several times over the regular amount. 10-20 means you're breathing over double the regular amount. Your goal is to consistently hit 30 or higher. A higher score means your body is more oxygenated and is not deprived of carbon dioxide.\n\nNext up is a technique to restore your carbon dioxide levels. While sitting, place your finger horizontally under your nose. Do your best to breathe only through the opening of your nose for 5 minutes. This will help you increase your carbon dioxide level. Now repeat the Control Pause Technique and record your score.\n\nRepeat this three times in sequence and do it twice a day. Keep a journal of your progress. Don't get discouraged if some days you don't do well, keep at it! \n\nRemember, try not to take big deep breaths throughout the day, instead practice taking small amounts through your nose! It may be hard at first but it gets easier and easier.\n\n\nI encourage anyone suffering from air hunger to check out this website and give it a thorough read. This is going to take dedication, but once your reach the finish line you will be much stronger person that ever before. Several people already have messaged me about their great results!\n\nPlease search Buteyko method on Youtube and you will find a lot of valuable information and more breathing techniques.\n\nLink to websites: \n\nhttp://articles.mercola.com/sites/articles/archive/2013/11/24/buteyko-breathing-method.aspx\n\nhttp://www.normalbreathing.com/buteyko-method.php\n\nLink to book: http://www.amazon.com/Anxiety-Free-Featuring-Breathing-Mindfulness/dp/0954599640/ref=sr_1_3?ie=UTF8&amp;qid=1368231690&amp;sr=8-3&amp;keywords=buteyko\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feeling short of breath? Here's why.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2359pb/feeling_short_of_breath_heres_why/"
        },
        {
            "author": "phorensic",
            "author_created_utc": 1335466917,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7kcuk",
            "created_utc": 1397996861,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23i8fw/sometimes_i_cant_get_to_sleep_until_the_sun/",
            "gilded": 0,
            "id": "23i8fw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23i8fw/sometimes_i_cant_get_to_sleep_until_the_sun/",
            "retrieved_on": 1441572203,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "It's like the prospect of a new day comforts me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sometimes I can't get to sleep until the sun starts to rise.",
            "url": "http://www.reddit.com/r/Anxiety/comments/23i8fw/sometimes_i_cant_get_to_sleep_until_the_sun/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1397614507,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/235cz7/rant_im_real_sensitive_and_i_hate_it/",
            "gilded": 0,
            "id": "235cz7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/235cz7/rant_im_real_sensitive_and_i_hate_it/",
            "retrieved_on": 1441578295,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I've always been sensitive about certain things, but lately that list has been growing. Not only has the list been growing, but I've been reacting more.  \nIf someone had made fun of my incompetence 2 years ago, I would have laughed it off and made fun of them back.\n\nBut now... now I can't even stay in the same room, even if I know they're just joking. I instantly get up, leave, and sit outside for half an hour trying to calm myself down.\n\nAnd I hate it. I hate it a real lot, especially because my roommate loves to generally make fun of me, and I make fun of her back, but sometimes she gets these sensitive spots, and *always* in front of other people. And then when I tell her that it hurt me, she apologizes but complains about me not being able to take a joke.\n\nIt's not my fault, I try not to take it personally.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] I'm real sensitive, and I hate it",
            "url": "http://www.reddit.com/r/Anxiety/comments/235cz7/rant_im_real_sensitive_and_i_hate_it/"
        },
        {
            "author": "WZQITS",
            "author_created_utc": 1393285930,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ffmq3",
            "created_utc": 1397898911,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/23fc3x/had_an_anxiety_attack_i_think_in_one_of_the_worst/",
            "gilded": 0,
            "id": "23fc3x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/23fc3x/had_an_anxiety_attack_i_think_in_one_of_the_worst/",
            "retrieved_on": 1441573579,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I'm on a trip with my college course and it's an over night camping thing. I was fine mostly until I was laying down in the tent trying to fall asleep. Then my stomach started to hurt, like it does when I'm having anxiety, so I tried to get through it but it was getting worse. So I woke up one of my tent mates, who was already aware that I was uneasy, and we changed locations to this empty community center building across the street (this is where the bathrooms where that we were supposed to use). That place was a tad bit creepy so that wasn't exactly helpful. Then we returned to the tent and my stomach was even worse. We have to be up very early to complete the tasks we ate here for so it is terribly inconvenient to have no sleep tonight. Also, there is no comfortable place around. No cars to take me somewhere, we're an hour and a half from home and we are in such a small town that it doesn't have any permanent residents, only the people that pass through for research ever occupy the town. So I'm basically stranded. It's the worst attack I've had before, at least because the situation amplified it. I've not seen a doctor about my anxiety but now feel that I should maybe in order to avoid situations like this one, sleepless, uncomfortable and embarrassed. I don't really know why I'm posting this but it's helping pass the time until everyone gets up. Well, thanks for reading if you did.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Had an anxiety attack (I think?) in one of the worst possible situations. No where to escape to.",
            "url": "http://www.reddit.com/r/Anxiety/comments/23fc3x/had_an_anxiety_attack_i_think_in_one_of_the_worst/"
        }
    ]
}