{
    "data": [
        {
            "author": "Collywot",
            "author_created_utc": 1326362648,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6naod",
            "created_utc": 1407240709,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2coju6/three_weeks_on_meds_and_now/",
            "gilded": 0,
            "id": "2coju6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 58,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2coju6/three_weeks_on_meds_and_now/",
            "retrieved_on": 1441234568,
            "score": 120,
            "secure_media_embed": {},
            "selftext": "I have battled for ten years with anxiety.  GAD, I have struggled to work, I lived in fear of answering the phone.  My stress levels sat so high, any little thing would set me off, rage and terror, fight or flight. Isolated for so long, so finally, after meditation, eating right, therapy, gym sleepless nights, every avenue exhausted I fell under that giant wheel of endless exhaustion and anxiety. I finally caved and took paroxetine..... I've realised I no longer grind my teeth, clench my fists, yell at my family, worry about the bills, have that eternal bullshit conversation in my head about how everything I do sucks. I no longer hold  my breath, I no longer obsess over small shit. I went to a party and didn't stress for days before. I didn't hyperventilate over meeting a new person. After ten long fucking years I can breathe, in and out in a long sweet sigh of relief. It ain't perfect, but it's the most amazing feeling. Just wanted to share. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Three weeks on meds, and now.....",
            "url": "http://www.reddit.com/r/Anxiety/comments/2coju6/three_weeks_on_meds_and_now/"
        },
        {
            "author": "truelovevip",
            "author_created_utc": 1393888217,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fjey4",
            "created_utc": 1407186161,
            "domain": "headspace.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cmhk4/headspacecom_truly_wonderful_web_app_to_bring/",
            "gilded": 0,
            "id": "2cmhk4",
            "is_self": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cmhk4/headspacecom_truly_wonderful_web_app_to_bring/",
            "retrieved_on": 1441235531,
            "score": 88,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/j_BeRvfPwwNu5Zfn.jpg",
            "title": "headspace.com - truly wonderful web app to bring some calm into your day and reduce anxiety. Just signed up and did my first ten minutes, cooled my mind right down. Seriously, try this.",
            "url": "https://www.headspace.com"
        },
        {
            "author": "sandrastic",
            "author_created_utc": 1321245430,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_68mnc",
            "created_utc": 1407284453,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cqnwo/i_was_offered_a_job_today/",
            "gilded": 0,
            "id": "2cqnwo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cqnwo/i_was_offered_a_job_today/",
            "retrieved_on": 1441233582,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "I never ever ever would have imagined being in this position. A year ago I wouldn't have believed it. I almost let my anxiety fear me out of not going to my interview yesterday but I fought through it and nailed the interview! I am just so thankful for everyone in this sub, because before I found it I felt so alone. After feeling like I has hit rock bottom I sought multiple sources to help me get back up on my mental feet and put my life back together. I went to my therapist, I started medication, I started going to church, I started working out, I looked for support (online and family) and I completely cleaned out my room. Although at times I felt like I was never going to be okay, times like these show me that I am stronger than what I know. I am stronger than my anxiety. I don't always have to think the worst, I can think of the possibility instead. The possibility that maybe I am worthy of something, maybe someone will like me. So today I was offered a job and I am going to take it! I don't know if this paragraph is well written I am just so excited and wanted to write about it!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I was offered a job today!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cqnwo/i_was_offered_a_job_today/"
        },
        {
            "author": "PM_ME_YOUR_SOUL__",
            "author_created_utc": 1405009143,
            "author_flair_css_class": "",
            "author_flair_text": "General Anxiety",
            "author_fullname": "t2_hcaws",
            "created_utc": 1406900122,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cc18j/this_ebola_thing_is_really_freaking_me_out/",
            "gilded": 0,
            "id": "2cc18j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 67,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cc18j/this_ebola_thing_is_really_freaking_me_out/",
            "retrieved_on": 1441240506,
            "score": 84,
            "secure_media_embed": {},
            "selftext": "For some reason I thought the U.S. was protected from Ebola somehow but now after a few googles I realize just how easy it is for it to end up here. Twice, someone almost brought Ebola over here. This is a very real possibility and I'm insanely nervous. Any stats or facts that could help me ease my anxiety?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This Ebola thing is really freaking me out.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cc18j/this_ebola_thing_is_really_freaking_me_out/"
        },
        {
            "author": "MajesticMallifus",
            "author_created_utc": 1406939144,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hombf",
            "created_utc": 1407152211,
            "domain": "self.Anxiety",
            "edited": 1409054799,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ckwc4/i_21m_have_a_form_of_gad_where_i_get_a_lot_of/",
            "gilded": 0,
            "id": "2ckwc4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ckwc4/i_21m_have_a_form_of_gad_where_i_get_a_lot_of/",
            "retrieved_on": 1441236335,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "First off I'm waiting on CBT to deal with this, so far counselling has helped this to an extent but the thoughts keep coming. \n\nI get something similar to OCD-type 'intrusive thoughts'. They often go hand in hand with the stigma. \n\nOne of my great self-pereptuating problems is believing that having this condition is not as an excuse to feel/display its symptoms or behaviours, and that I 'should' function just like everybody else. Essentially I call myself weak, lazy, needy etc. a lot for how I feel, I am not always very kind to myself. I take mottos such as 'sleep is for the weak' and 'no pain no gain' literally. Most of the time it has been one of my tutors who recommended me to go get an extension or appeal for mitigating circumstances in University, I always said \"my problem's not that bad/it's kind of my fault, I don't deserve this\" etc.  My ideal role model is Superman, so it's a little lofty. \n\nAn extended example of these thoughts: \n\n-&gt; Anxiety sometimes makes it harder for me to get enough sleep; either I can't get to sleep, I wake up early or I wake up but don't feel rested. A part of me thinks that my family/boss *wants* me to be this way, just like any adult, because at least I'm not lazy. So it is in fact good to be sleep deprived and not do anything about it or complain, it is a sign of stoicism. However sleep deprivation is not an excuse for being late, slow to do something/in conversation, make a mistake etc. I 'should have tried harder'. \n\n-&gt; Hand in hand with this, I try to keep reasonably fit although panic attacks have killed my confidence exercising, as cardio has similar symptoms. I still get about and sometimes make it to the gym, but I feel bad about this. My family/friends/colleagues etc. don't need to go the gym to reduce stress, so I shouldn't have to, it is 'weak' of me to do so. In a weird way it is 'lazy' because the non-lazy thing to do would be to carry on working through exhaustion and burn-out. But because everybody is supposed to exercise, it is 'lazy' to *not* go, so I am lazy anyway.  \n\n-&gt; Because it is 'lazy and weak' to need to lead a healthy lifestyle for stress management and confidence, I should also not need erections to have confidence sexually. It is good if I can't get it up and have low testosterone, and I'm sleepy weak tired stressed and out of shape all the time. But it's my fault if I am so tired I get ran over or feel sick, which has happened before today when symptoms are bad.    \n\n-&gt;However if I am unfit, impotent/struggle to get it up, or sleepy, that is a good enough reason to get rejected on dates, dumped or cheated on. My girlfriend should expect me to be in great shape and never tired or stressed, never complaining about it if I am, so if I am these things I deserve to get dumped. However I am a terrible lazy son and employee if I am not impotent.  \n\n-&gt; So basically, I have to be sleepy and impotent because it shows I am a hard worker, and also not go to the doctor's or anything about it because it shows I'm strong, but I also have to never be sleepy and be able to perform really well and be amazing shape at the same time, or I deserve to get abused by my girlfriends. I will inevitably have to choose whether I will be a good son/employee or lover and either way I have failed and need to be punished. \n\n-&gt; Sometimes I will also binge eat and have considered making myself drink on the way to work then telling myself I deserve to get dumped for putting on the weight and not taking care of my gf's sexual needs as well as being a irresponsible employee for drinking before work. \n\nThis is just one example of the intrusive thoughts going through my head. It leads to scenarios where I end up staying up late to ensure I don't get enough sleep for work/lectures the next day and berating myself for getting there late feeling ill and tired while also deliberately fucking up my date by being late and too tired to say much while doing what I can to encourage my date to leave.  \n\nEssentially there is a part of me which takes sick pleasure in obsessively setting myself impossible/draconian 'goals' that will make myself ill tired and unhappy just to prove my own fortitude or lack thereof so that it can chastise me for my weakness and cowardice if I am unable to function like everyone else. I will then be telling myself angrily to 'man up' 'get over it' and so forth. \n\nIf I *don't* follow through with these thoughts I feel quite anxious and guilty, like I am letting people down for not simultaneously having a high and low sex drive, big and small penis, exhausted and energised, etc. \n\nThe easiest way to explain this is that I have been known to consider my anxiety not as a disability but almost as an unfair advantage (?), and then taken steps to drag myself down so that I have to deal with 'real problems'. This is despite the fact that the Learning Teaching Support Officer at Uni kept insisting that I actually *have* a disability and am either in denial (which is unlikely considering how much I utilised the counselling service) or partially blame myself for my mental illness. \n\n*What I am doing is, I realise, being given a walking stick for a bad leg I lost use of in a horrible car accident, only to tell myself that if I were stronger I would have been able to pick up the car and throw it off me, throwing the stick away in anger at myself for abusing the state and then pouring acid on my leg instead, just to see if I am so weak that I will complain about the burn-and also berating myself for being unable to run a mile with my PTSD-inducing acid-drenched broken leg.*\n\n*tl;dr* In short I am horrendously self-stigmatising of my anxiety disorder.  \n\nThe thoughts I have are *incredibly* stupid because they are physically impossible goals to achieve at the same time, but in line with Superman and the 'alpha male', fearless and free of insecurity and need, I expect myself to at least try to overcome these and function on the same level as any other individual without my problem. I am a perfectionist who believes in self-improvement and have very high standards for myself, or did, I have somewhat scared myself out of anything now. \n\nHow the hell I can think so stupidly, and act so stupidly, and still graduate from Uni I have *no* clue but hey I did!\n\nI already had social anxiety, occasional bouts of insomnia and panic attacks, so these thoughts are really unhelpful. I mean really, it is bad enough when you have mild insomnia, it's completely unnecessary to *encourage* your mind to be that way and criticise yourself for not being that way. \n\nThere is a simple reason for why I am so critical of my 'illness': I live in the First World, I'm by no means rich but live far from poverty, I have food shelter access to clean water, I have loving and supportive family (yes) and friends (mostly?) I am in good health generally, it's not like I NEVER SLEEP, nor is it like I have cancer or had a heart attack or my friend has died. The only really 'tragic' things I've had in my life are my parents divorcing when I was 16, developing panic attacks and the GAD diagnosis at 18 and GAD basically causing a breakup with my first serious partner this year. It's not like I'm in a war-zone. \n\nBefore anybody asks I am not a troll, I have had a former Reddit account and people believe from the threads on that that I am psychologically disturbed beyond GAD. I don't know I'm waiting for CBT for that, I might have OCD after all.\n\nHas anyone ever had to deal with thoughts like this or similar things? Thanks  \n\nedit: Sorry that I took over 3 weeks to respond! I am trying to cut down on rumination/self-help/reassurance-eseeking, and limit threads such as this. But the massive up voting of this post, and the amount of distress it causes myself and others, means I will try to keep this open and a priority. You are all amazingly brave individuals. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I (21M) have a form of GAD where I get a lot of bizarre intrusive thoughts that encourage me to make my life harder than it already is just to prove I'm not as weak as my mind will make me believe. Please help",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ckwc4/i_21m_have_a_form_of_gad_where_i_get_a_lot_of/"
        },
        {
            "author": "PhenomFace",
            "author_created_utc": 1360039903,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ahbhj",
            "created_utc": 1407274153,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cq6lu/just_remember/",
            "gilded": 0,
            "id": "2cq6lu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cq6lu/just_remember/",
            "retrieved_on": 1441233807,
            "score": 57,
            "secure_media_embed": {},
            "selftext": "One day in this life that you are living, you're going to have a breakthrough. Whatever you are going through, especially if you feel that this is the lowest you have ever been in your life, you will overcome one day. Hang in there, you can overcome whatever it is you are going through. Anything is possible! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just remember..",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cq6lu/just_remember/"
        },
        {
            "author": "TomorrowCries",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406944391,
            "domain": "self.Anxiety",
            "edited": 1406996332,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ce2hx/had_an_epiphany_about_anxiety_that_may_help_some/",
            "gilded": 0,
            "id": "2ce2hx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ce2hx/had_an_epiphany_about_anxiety_that_may_help_some/",
            "retrieved_on": 1441239557,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "I've had anxiety/depression as long as I can remember, and somewhere along the way I learned to force myself to stay \"positive\". I spent an entire decade trying to fix myself, coming up with a new solution every week. Notes to myself, inspirational things, cognitive behavioral therapy, etc. I stayed positive, and I never gave up on trying to fix myself.\n\nI don't remember exactly how it happened, but about a month ago I realized the \"I need to fix myself\" mindset was the problem. I had never realized that these \"positive\" thoughts were messing me up. \n\nI had tried CBT in the past, but I had never seen these thoughts as negative. I never really had any seriously negative thoughts, which confused me, because I was very depressed/anxious.\n\nOnce I applied CBT to these \"fix myself\" thoughts and identified them as damaging, things have gotten a lot better for me. I was being too hard on myself without realizing it, and that's what was creating my anxiety.\n\nEdit: It turns out I can still work on self-improvement in this mindset. I just ask myself if I actually **want** to do it, and if it will make me happy. Turns out I actually enjoy running/eating healthy/etc.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Had an epiphany about anxiety that may help some of you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ce2hx/had_an_epiphany_about_anxiety_that_may_help_some/"
        },
        {
            "author": "mastermalinger",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1407094704,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2civik/pervasive_sadness_and_anger_over_childhood_years/",
            "gilded": 0,
            "id": "2civik",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2civik/pervasive_sadness_and_anger_over_childhood_years/",
            "retrieved_on": 1441237278,
            "score": 49,
            "secure_media_embed": {},
            "selftext": "I was diagnosed in February of this year after a very severe panic attack that occurred at work.  I didn't know that that was a panic attack and after being told what was physically happening to me at the emergency mental health centre, I realized that I had been having attacks for most of my life.  I am doing well in general since starting medication and attending counselling, but I have been feeling very down and empty and anxious the last few weeks...  There's a lot on my mind, but the subject of this post is what I've been dwelling on most.\n\nI had a good home life compared to many people on this forum.  The only problem was, my baby sibling was diagnosed with cancer and as anyone who has witnessed the effects of childhood cancer on a family knows, it can tear a family apart if not dealt with.  And it wasn't.  There were no counsellors or therapists to talk to me and my other siblings (I was the oldest) about what was happening.  No family meetings to discuss the treatment and what my parents needed to do in order to get that treatment.  My parents are not bad people, not by any stretch, but failing to provide guidance to us was a terrible mistake.\n\nMy family became very separate.  We didn't do much together and when we did, it was marred by my father's explosive, terrifying anger and my mother's stress, empty threats/promises, guilt trips.  Family trips were torturous and full of anger and boredom.  I spent 8+ hours on the computer a day, even more in the summer and weekends.  On computer binges, I wouldn't shower, would hold my bladder until it was ready to burst (jesus christ - that detail JUST came back to me and is probably partly responsible for my bladder problems now!), would only eat things that were instant if I ate anything at all, keep myself awake by burning the soles of my feet on the radiator...  \n\nI started a highly ritualized self-harm habit that became my closest guarded secret when I was about 12.  I DID reach out in misguided ways - I told a friend my age about my self harm and a couple weeks later she told me she started doing it too.  I cut contact with her out of shame and guilt and fear that I would fuck her up even more.  I felt wholly responsible.  My mom found my knife in my drawer one day and confronted me.  I denied and I honestly can't remember how I got her to drop the subject - I know for sure, however, that she knew undeniably that I was cutting myself.  I remember telling her that I felt sad one day and she snapped at me to shut up because she had it so much worse as a kid.  I have always struggled with the idea that my feelings are \"real\" and \"valid\". I One day, I had what I now know was an anxiety attack, but I just thought I was going crazy or I was just being hysterical.  I called the kidshelpphone and they urged me to talk to my mom about seeing a counsellor.  I was comforted by that hotline and felt resolved to get help and felt that I really needed it because these were not normal and I wasn't just being \"too emotional\".\n\nI told my mom.  We had a long talk and she said she was going to get me help.  We went to the hospital some weeks later and I got blood work done to check for hormonal imbalances.  She snapped at me while I cried in the waiting room, saying my sibling had to get hundreds of needles all over his body for the cancer treatment and this was nothing.  I was/am afraid of needles (not nearly as bad any more) and that's why I was crying.  Plus, I was really afraid of finding out I was going to be fucked up forever and feel like that forever because of some illness.  I had no clue about mental illness.  Depression was a synonym for sad to me.  Anxious meant \"excited, can't wait\".  Weeks went by and I was never told of the results and I was too terrified to ask so it just faded into the background again.  She found my cutting tools once mroe after that and again, I don't remember how I got her to drop it, but it didn't go anywhere.  I hid them much better from that point on and they were never discovered again (I threw them out years ago, thank god).\n\nShe and I have a much better relationship now, though it's a little strained at the moment.  Recently when we were chatting on the phone, I made a comment like \"I'm glad I'm finally dealing with these problems that are almost a decade old!\"  and she said something to the effect of, \"Oh yes, by the way I'm sorry we never got you into counselling.  I tried but there was no way to do it.\"  I had to end the conversation because I felt ill suddenly.  Now that I know of the resources around me... I know she lied.  I know she was too consumed with my sibling's cancer and I don't blame her for that - I can't fucking imagine going through that!  My dad was a horrible support for her at the time too.   But it just really winded me to realize that I DIDN'T have to have all these scars, physical and mental, because she SHOULD have gotten me help.  I was cutting myself and she saw them!!  She saw undeniable proof and she chose to not help me.  She didn't protect me.  And it hurts knowing I lost almost ten years of my life to these ailments...\n\nI know it's not her fault.  It's just very hard to... just deal with this loss.  I'm grieving.  And I thank you, whoever is reading this.  This has been a good exercise to get these feelings out.\n\nThank you.  I'm here for anyone who would like to chat.  I'm in a much better place now.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Pervasive sadness and anger over childhood years lost to anxiety/depression",
            "url": "http://www.reddit.com/r/Anxiety/comments/2civik/pervasive_sadness_and_anger_over_childhood_years/"
        },
        {
            "author": "ebah1",
            "author_created_utc": 1405565400,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hft4j",
            "created_utc": 1407009593,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cg3id/overthinking_situations_paranoia_racing_mind/",
            "gilded": 0,
            "id": "2cg3id",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cg3id/overthinking_situations_paranoia_racing_mind/",
            "retrieved_on": 1441238610,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "I was wondering if many other anxiety suffers experience this and what they do to help it. \n\nI always find myself \"overthinking\" any type of situation, creating unnecessary stress and anxiety. I find myself asking \"What if...?\" all the time regarding any situation, big or little. Many times I end up avoiding the situation all together, which later can lead to depression.\n\nThis happens with basically every situation. I always think the outcome will be the worst possible. I have anxiety and a general \"racing mind\" every minute of the day, it's a never ending process and it really hinders my daily life. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Overthinking Situations, Paranoia, Racing Mind",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cg3id/overthinking_situations_paranoia_racing_mind/"
        },
        {
            "author": "Akomplice88",
            "author_created_utc": 1390583164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_eykdv",
            "created_utc": 1407425837,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cw3lm/i_hope_this_helps_you_at_least_a_litttle/",
            "gilded": 0,
            "id": "2cw3lm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cw3lm/i_hope_this_helps_you_at_least_a_litttle/",
            "retrieved_on": 1441230984,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "Well im off camping deep into the mountains for 4 days. Im putting this to help me and hopefully help some of you. Its from one of my favorite anxiety sites. Happy Weekend to all!\n\nMany people ask me what they should do to eliminate their anxiety or how do I get rid of this particular symptom? I was one of those people who went over and over things, trying to find a solution to the way I felt, constantly trying to stop myself feeling this way. Well that was my mistake, I was ‘Trying not to feel a certain way’. One thing that I learnt very quickly is that “Trying to rid ourselves of anxiety only increases it”. Yet this is what most people attempt to do and just end up more entrenched in the habit. I say the opposite and tell people to feel it, to go towards it, do nothing to try to get rid of it. People develop safety behaviours and avoidance techniques that can severely restrict their lives because they don’t want to feel it. How can this be the way forward? The truth is that it is not, I only turned my life around when I finally accepted that I had anxiety and it was not going to go over night, I shook it by the hand and said “If you are going to be around for a while then we may as well get along”.\n\nTo recover from anxiety we have to be willing to feel it and that’s means taking it with us wherever we go. Yes for a while we will still feel anxious, we may still feel detached or have anxious thoughts hanging around, that’s fine and only to be expected. We also have to be willing to feel it for a while, not a day or a week, but as long as it takes. I have people email me and say some lovely things about the book after reading it, but I had one a few weeks ago saying ” Paul I have just finished your book, but I am not cured”. I am struggling to understand which book she read as it says nothing about getting to the end and a magic wand comes down and cures you. This is the sort of person that will be off next week to try another miracle cure hoping that it will instantly go away, she has no intention of feeling anxiety for a minute longer.\n\nThe more desperate you look for recovery, the further away it can seem as you are putting so much pressure on yourself to feel better and making it your whole life. Why not just step back and do nothing, whilst getting on with your life as you normally would, this will do you far more good long term. I am not trying to make it sound easy, it is not at times and I used to want to hide away at home and shut out the world, but I refused to as I wanted to be part of that world again. Just so there is no confusion, when I talk about doing nothing, I mean no longer trying to fix or figure it all out, not doing nothing by sitting at home looking at the ceiling. Go out and live your life, uncomfortable or not, take all your insecurities with you and feel it all at will. You don’t have to wait until anxiety leaves you to have a life, you can have one now. If you want to be part of the outside world again then go and join it, don’t let how you feel stop you.\n\nThe constant stress and battle to feel better is what kept me in the cycle, it consumed me and my day. So just try not to become one of those people. I know we feel like we must keep on top of things, to get the better of this thing, but it has the opposite effect. One of calmest and most together people on the planet are Buddist monks and their whole belief is to just be, to not over think or worry about things. Since my own recovery I have a new outlook on life and don’t worry about trival things or things I can’t control. I am also a far more forgiving and laid back person and it is what I learnt through my own recovery. -Paul David",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hope this helps you at least a litttle :)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cw3lm/i_hope_this_helps_you_at_least_a_litttle/"
        },
        {
            "author": "Robogles",
            "author_created_utc": 1394726336,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_foj3c",
            "created_utc": 1407066277,
            "domain": "self.Anxiety",
            "edited": 1407421159,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2chv1u/everything_that_is_happening_in_the_news_is/",
            "gilded": 0,
            "id": "2chv1u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2chv1u/everything_that_is_happening_in_the_news_is/",
            "retrieved_on": 1441237787,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I'm really good at having issue with things outside my sphere of control, and these days with all of the chaos happening in the world, I am freaking out. \n\nMaybe I just need to avoid /r/worldnews ? It seems like anything about climate change, disease, war, or some other event is occupying my mind constantly.\n\nEDIT: Thanks everyone for your advice. I'm already considered a person with anxiety (thus meds), but I made the mistake and read news and worldnews while on vacation last week and it ruined a part of it until you good folk brought me to my senses!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Everything that is happening in the news is freaking me out",
            "url": "http://www.reddit.com/r/Anxiety/comments/2chv1u/everything_that_is_happening_in_the_news_is/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406972295,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cew4r/i_just_met_a_cute_girl_for_the_first_time_in/",
            "gilded": 0,
            "id": "2cew4r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cew4r/i_just_met_a_cute_girl_for_the_first_time_in/",
            "retrieved_on": 1441239173,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I'm terrified, because she's one of the coolest people I've ever met, I feel comfortable around her, she's taken interest in me, she's reciprocated my advances, and I'm very attracted to her.\n\nI'm terrified, because there actually might be some potential with her, and the idea of having an actual girlfriend - or a real relationship right now - scares me.\n\nI'm on three different dating sites, and have been for years. Nothing has ever come of it... until just tonight. This is the first girl I've actually found online, and subsequently met up with in person. This is a huge milestone for me. My first successful \"online date\", if you will.\n\nI was stupidly nervous at first. Turns out I didn't need to be. She struggles with anxiety too, and we talked about it for a bit. She's one of the most sincere, honest, open-minded, non-judgmental people I've ever encountered. By the end of the night I was feeling extremely comfortable with her (it probably helps that I had a few drinks). I've never been around someone so understanding and down-to-earth. We talked about everything.\n\nWhat particularly scares me, is that she has much more experience than me. She's older than me, she's dated a lot of guys, she's been through a lot of ups and downs, and she's had a lot of sex (as opposed to me, who has had none). We discussed this a bit, and I told her how easily I can get jealous of people who have sexual experience. She put me at ease in a way no one quite has before, explaining to me that it's perfectly OK and I'm better off for taking it slow.\n\nAt the end of the night, she smiled at me (she has a ridiculously cute smile holy fuck), we gave each other an amazing hug, and then she kissed me, which totally caught me off guard. I told her very casually and politely that I we should do something again sometime, perhaps even tomorrow. She was like, \"I totally don't have anything going on tomorrow\" like she was completely open to hanging out again soon. Not in a pity way, but in a way like she is actually legitimately interested in seeing me again.\n\nI'm so excited and scared at the same time. No one has ever taught me how to handle stuff like this. I don't have any date ideas. I don't know what to do. I don't know how to proceed. I don't want to fuck something up. I'm pretty sure I'm infatuated with her. This is what happens when you're extremely lonely, and someone comes along that you meld really well with... you instantly become attached to them. Gotta remember to keep my guard up.\n\nI haven't done this since high school (I'm in my twenties). Any ideas for dates are welcome.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I just met a cute girl for the first time in years... and I'm terrified",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cew4r/i_just_met_a_cute_girl_for_the_first_time_in/"
        },
        {
            "author": "rebelplum",
            "author_created_utc": 1391631571,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f50l5",
            "created_utc": 1407351008,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ct868/i_feel_like_my_anxiety_isnt_as_intense_as_others/",
            "gilded": 0,
            "id": "2ct868",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ct868/i_feel_like_my_anxiety_isnt_as_intense_as_others/",
            "retrieved_on": 1441232387,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "My heart beats so hard and fast at the smallest hint of possible drama or intense conversation.  I had to leave my room mate a note asking about her move out plans and every time I think about it my stomach feels like it's filled with acid and my heart beats so hard that I can almost hear it in my ears.\n\nIf something is out of place, or done \"incorrectly\" by the room mates I get anxious when I hear my boyfriend come home because he is going to be annoyed by it. (My boyfriend is really wonderful, it's all me being over dramatic. Ugh, that still sounds like he is a bad guy. He isn't I swear).\n\nI get anxious whenever I get a text. Whenever my phone rings. Whenever I have to meet new people.\n\nI even got dressed up for a costume party other night. My boyfriend drove us all the way across town. We got there and I saw some people weren't as dressed up as me so I panicked and we didn't go in and we just went home. \n\nI don't really know what the point of this post is. I looked up symptoms of anxiety and I feel like my symptoms are different. Do I even have anxiety? \n\nEver since I can remember, speaking in front of people, or to people about an issue I have causes my heart beat to be super intense and I can't stop shaking. Whenever I have to have a \"serious\" conversation, I shake like I am cold. \n\nI'm really good at faking confidence sometimes, but as soon as I am alone, it all falls apart.\n\nI even get shaky and worked up about minor driving confrontations, like if someone is tailgating me, or honks at me, ugh I can't stand it. \n\nI just needed to vent I guess. My room mate and I aren't speaking cause she asked for space, I guess I pushed her too hard. She isn't very grown up and I guess I threw too much grown-up life at her. Every day going home is awful. My stomach turns over and over and I just rush to my room. \n\nThankfully our lease is up this month. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like my anxiety isn't as intense as others' and I should just \"get over it\". [Rant?]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ct868/i_feel_like_my_anxiety_isnt_as_intense_as_others/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1407378603,
            "domain": "self.Anxiety",
            "edited": 1407430519,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cuixs/help_finding_a_job_for_my_teenage_self_that_wont/",
            "gilded": 0,
            "id": "2cuixs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cuixs/help_finding_a_job_for_my_teenage_self_that_wont/",
            "retrieved_on": 1441231719,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "Hello, everyone. I'm a 16 year old heading into my senior year of high school in 2 weeks. I really should have a job. I should have some sort of income to save for college, maybe a car (if I ever get my license, but that's a whole other anxiety issue, one at a time), or just for disposable income to go to the movies and what not. My friends all have jobs and whenever we go out they absolutely insist on buying me food if we go out to eat and paying for me at other places such as the movies. I hate it and it makes me feel terrible. I constantly tell them not to but they still do it. It makes me feel pathetic that I'm the only one without money all the time because I don't have a job like they do. They have jobs or volunteer, drive, have bank accounts. I don't have any of that because anxiety restricts me from everything. I know this sounds like a typical case of trying to grow up too fast, but it's really not. These are kind of normal things at this stage in someones life. And I'm not doing ANY of them or even making an effort to do any of them because of anxiety. \n\nI literally (and I don't use that word hyperbolically) have not done a single productive thing this summer. I haven't visited colleges, tried to get a job or internship or volunteer, gotten my permit, etc. I sleep til around 12pm through 2pm, then just go on the computer or play 3DS or watch Netflix all day. Almost every single day of summer has consisted of just that. My moods and energy levels are all over the place. I fear for my future everyday and thoroughly believe I will end up homeless because I'm just too afraid to do anything. This is my last year of high school. After that, then what? What the fuck do I do?\n\nThe problem is that the jobs available to people of my age are mainly retail jobs, like a cashier or some sort of customer service. I do NOT want that at all. I could go on and on listing my irrational fears, but some of them include completely forgetting how to give change or do simple arithmetic even though the fucking cash register tells you how much to give because of the anxiety I'll experience of a person waiting on me to give them change and then having them yell at me, not knowing the answer to customers' questions and basically customer/human interaction in general, turning red (I have a huge fear of this and to help that I'm the palest person on the face of the earth) or just completely making a fool of myself during a job interview or on the job.\n\nOne of my biggest fears is seeing people I know in public. This has now become a HUGE problem for me because I've started see people I recognize from school fucking EVERYWHERE working at places I go to. It's especially terrible because these aren't people I talk to. I'm not friends with them. I'll just happen to know their name and they'll know me because I had a class with them or something. I couldn't even imagine working alongside one of them.\n\nSo I guess what I'm asking is are there any jobs I could get at my age that involve very minimal human interaction? Maybe accept online applications too? I would LOVE a job where I just clean tables or wash dishes. I can totally handle that. And I mean, that seems to be a pretty common job, right? The whole busboy gig. Just washing dishes/cleaning tables. I see people at restaurants doing it all the time. But I'm afraid that if I apply to a restaurant and start doing that they might want to promote me to cashier or something else at some point.\n\nWell this was a hell of a lot longer than I wanted it to be. Sorry about that. It's really hard for me to make anything short, especially on this subject.\n\nI'm trying so hard to fight this and not let it run my life, but it's just so extremely difficult. I've been feeling very suicidal for a while now. It's beating me right now. It's winning.\n\nEDIT: Wow. I stopped checking this post last night and then fell asleep thinking that it was just gonna get buried. Then I wake up to a bunch of thoughtful comments. I did not expect this at all. Thank you all so much. I'm reading every single one of them.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Finding a job for my teenage self that won't make my anxiety go through the roof?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cuixs/help_finding_a_job_for_my_teenage_self_that_wont/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1407094378,
            "domain": "reddit.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2civ1h/pet_sandal_xpost_rfunny/",
            "gilded": 0,
            "id": "2civ1h",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2civ1h/pet_sandal_xpost_rfunny/",
            "retrieved_on": 1441237284,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/VntWQRu7BJh24crx.jpg",
            "title": "Pet Sandal (xpost r/funny)",
            "url": "http://www.reddit.com/r/funny/comments/2ci6sk/always_wanted_one_of_those_as_a_kid/cjfsji9"
        },
        {
            "author": "phuckwang",
            "author_created_utc": 1369610493,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bte7d",
            "created_utc": 1407372589,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cu9lg/my_fear_of_going_crazybecoming_psychotic_is/",
            "gilded": 0,
            "id": "2cu9lg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cu9lg/my_fear_of_going_crazybecoming_psychotic_is/",
            "retrieved_on": 1441231841,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "It feels as if I'm always on the cusp of falling into psychosis. I have depersonalization and PTSD from a bad trip and these have triggered an irrational and obsessive fear of going crazy. No matter how much I tell myself that crazy people don't know it, the obsession persists. Ironically though, the high anxiety from this fear is kind of pushing me over the edge. My thinking has become scattered and black and white and my memory is disappearing which only reinforces my fear that may be becoming a reality. Have any of you dealt with this before and how did you overcome it? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My fear of going crazy/becoming psychotic is actually bordering on psychotic. How do you deal?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cu9lg/my_fear_of_going_crazybecoming_psychotic_is/"
        },
        {
            "author": "stephwithstars",
            "author_created_utc": 1320825541,
            "author_flair_css_class": "",
            "author_flair_text": "Panic Disorder",
            "author_fullname": "t2_67l8h",
            "created_utc": 1406868247,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cb4ur/does_anyone_else_get_the_worst_attacks_the_day/",
            "gilded": 0,
            "id": "2cb4ur",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cb4ur/does_anyone_else_get_the_worst_attacks_the_day/",
            "retrieved_on": 1441240926,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I have my usual triggers - flying, being stuck at stop lights/in traffic. And then I have just horrendous panic attacks the day after drinking. No headache, no nausea or any sort of hangover, just panic attacks.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else get the worst attacks the day after a night of drinking?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cb4ur/does_anyone_else_get_the_worst_attacks_the_day/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406965197,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ceqnp/writing_anxiety/",
            "gilded": 0,
            "id": "2ceqnp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ceqnp/writing_anxiety/",
            "retrieved_on": 1441239243,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "Do any of you have writing anxiety? Or anxiety over presentations or the like? I've had all summer to work on a proposal, and my advisor wanted it Aug. 1st....My chest gets tight and I can't move when I think about working on it. And then my brain remembers how I'm running out of time, or in most cases, I let the deadline pass..\n\nAnd then I just feel like a failure. :(\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Writing Anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ceqnp/writing_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1407425758,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cw3fx/how_to_cope_with_the_fact_that_there_is_an/",
            "gilded": 0,
            "id": "2cw3fx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cw3fx/how_to_cope_with_the_fact_that_there_is_an/",
            "retrieved_on": 1441230986,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "The internet has ruined me. Everytime I go online and see something that I have an interest in but I know that I might never experience that in my life it gives me a panic attack. It's gotten to the point where I have to avoid certain things altogether so I can function normally.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How to cope with the fact that there is an infinite amount of things that I'll never do, see, or experience",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cw3fx/how_to_cope_with_the_fact_that_there_is_an/"
        },
        {
            "author": "worryingwanderer",
            "author_created_utc": 1406866789,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ho60p",
            "created_utc": 1406867157,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cb3e0/glad_to_find_this_place/",
            "gilded": 0,
            "id": "2cb3e0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cb3e0/glad_to_find_this_place/",
            "retrieved_on": 1441240945,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "Started panicking tonight and decided to do some research on the web. I read a couple posts and felt some relief. It is reassuring to know people who can understand are out there. Have not had much luck with my doctor. I look forward to reading and sharing with all of you. Good night for now.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Glad to find this place.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cb3e0/glad_to_find_this_place/"
        },
        {
            "author": "Omholt",
            "author_created_utc": 1383004028,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dorom",
            "created_utc": 1407085195,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cigui/i_think_i_have_ergophobia_fear_of_work/",
            "gilded": 0,
            "id": "2cigui",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cigui/i_think_i_have_ergophobia_fear_of_work/",
            "retrieved_on": 1441237468,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I have a severe case of GAD. I've lost all of my jobs because of it. I'm talking about part time jobs such as restaurants and stores since I'm still in school. I was fired from one due to it, let go from two others (they said costumers thought I was on drugs) and then quit the last three due to sudden and sever anxiety. The last time it got so bad that I couldn't even enter the workplace to tell my boss I had to quit, so my mom had to do it for me. I'm 20, so that's really embarrassing.\n I've feared work for some time now, but now it has gotten so bad that I'm unable to sign up for any jobs at all. Almost anything makes me really anxious. I have started crying while looking for a job or sending in applications. I have no money now, what so ever... Can anyone relate? Do you think it's ergophobia?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think I have ergophobia (fear of work)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cigui/i_think_i_have_ergophobia_fear_of_work/"
        },
        {
            "author": "bitesizedbean",
            "author_created_utc": 1406959327,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hoqn9",
            "created_utc": 1406962264,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ceo34/my_boyfriend_has_an_anxiety_disorder_how_can_i/",
            "gilded": 0,
            "id": "2ceo34",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ceo34/my_boyfriend_has_an_anxiety_disorder_how_can_i/",
            "retrieved_on": 1441239277,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "My boyfriend has chronic anxiety that has recently become overwhelming for him. He doesn't believe that therapy will help him, and I'm not sure how to convince him otherwise. He has wonderful family and friends who are understanding, but they have also noticed changes -- suddenly lashing out at his family, friends and me over perceived criticism, exhaustion, constantly worried about his appearance, constantly worried about his performance... he is so sensitive, everything hurts. Nobody knows entirely what's going on, he says different things to everyone. I don't think he's slept over an hour each night for over two months. \n\nHolding him doesn't help. Telling him that I believe in him, that he's extremely capable and extremely smart and hilarious and handsome and that I'm here for him doesn't seem to mean anything to him, even though all of it is 100% true. He is going through a lot right now... New city, new job, etc. It's very stressful, but I worry that even if he finds a way to cope, the next stressful thing will set him off again. \n\nHow do I help him? I just want him to be well. He's not taking medication for his anxiety, and as I said he doesn't believe in therapy. If anyone has advice for him, or me, I would be grateful. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My boyfriend has an anxiety disorder - how can I help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ceo34/my_boyfriend_has_an_anxiety_disorder_how_can_i/"
        },
        {
            "author": "31_LemonDrops",
            "author_created_utc": 1369803233,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bucpv",
            "created_utc": 1407285696,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cqpvu/agoraphobics_what_do_you_do_for_workincome/",
            "gilded": 0,
            "id": "2cqpvu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cqpvu/agoraphobics_what_do_you_do_for_workincome/",
            "retrieved_on": 1441233557,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I have severe panic disorder, agoraphobia, and a terrible fear of driving. I am single with children, and desperately need some kind of income because our financial circumstances have changed. \n\nMy psychiatrist has suggested I apply for mental disability, but she said the process can take up to a year and a half before you receive any benefits. \n\nI would really like to find a work from home job. Over the last few months of looking online, I haven't been able to find any legitimate jobs. \n\nDoes anyone have any suggestions on places I can work or what to do? I'm so scared I'm going to lose my kids because I can't afford our bills.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Agoraphobics: What do you do for work/income?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cqpvu/agoraphobics_what_do_you_do_for_workincome/"
        },
        {
            "author": "Vaka78",
            "author_created_utc": 1392069821,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f7pty",
            "created_utc": 1407014996,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cgb8j/started_reading_hope_and_help_for_your_nerves/",
            "gilded": 0,
            "id": "2cgb8j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cgb8j/started_reading_hope_and_help_for_your_nerves/",
            "retrieved_on": 1441238510,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "..and it's already proving to be quite helpful! I feel calmer tonight than I have for a while. Maybe I'll even get a decent sleep. I highly recommend, fellow anxious friends :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Started reading 'Hope and Help for Your Nerves\"..",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cgb8j/started_reading_hope_and_help_for_your_nerves/"
        },
        {
            "author": "projimo87",
            "author_created_utc": 1331214787,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_74cy7",
            "created_utc": 1407341036,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2cspm7/people_with_chest_painanxiety_how_often_do_you/",
            "gilded": 0,
            "id": "2cspm7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2cspm7/people_with_chest_painanxiety_how_often_do_you/",
            "retrieved_on": 1441232627,
            "score": 15,
            "secure_media_embed": {},
            "selftext": "I've heard from alot of sources that chest pain from anxiety only lasts up to 10-30 minutes, but I pretty much have it all the time. I would have intense pressure and tightness around my chest that would last for days without stopping.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "People with Chest pain-anxiety.. How often do you have chest pain?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2cspm7/people_with_chest_painanxiety_how_often_do_you/"
        }
    ]
}