{
    "data": [
        {
            "author": "motorguytehnarwhal",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419543579,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qe5rg/how_i_feel_drinking_coffee_during_a_panic_attack/",
            "gilded": 1,
            "id": "2qe5rg",
            "is_self": false,
            "media_embed": {},
            "num_comments": 72,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qe5rg/how_i_feel_drinking_coffee_during_a_panic_attack/",
            "retrieved_on": 1441001149,
            "score": 377,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/8J1gYr9fgvDthC2tIVZcogePD0IBaEzvUut3HDj3LBY.jpg",
            "title": "How I feel drinking coffee during a panic attack",
            "url": "http://i.imgur.com/v6QkiaV.gif"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419437802,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qacdc/merry_xmas_to_us_loners/",
            "gilded": 0,
            "id": "2qacdc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 118,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qacdc/merry_xmas_to_us_loners/",
            "retrieved_on": 1441002990,
            "score": 271,
            "secure_media_embed": {},
            "selftext": "Many of us who suffer from anxiety and/or depression celebrate x-mas among other holidays completely alone for a million different reasons. So Merry X-mas to all of you who are all by yourselves, I dedicate my thoughts to you tonight :) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Merry X-mas to us loners.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qacdc/merry_xmas_to_us_loners/"
        },
        {
            "author": "zhezow",
            "author_created_utc": 1308685614,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5ep0c",
            "created_utc": 1419254693,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q2evg/does_anybody_here_suffers_from_always_feel_guilty/",
            "gilded": 0,
            "id": "2q2evg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 75,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q2evg/does_anybody_here_suffers_from_always_feel_guilty/",
            "retrieved_on": 1441006779,
            "score": 163,
            "secure_media_embed": {},
            "selftext": "I'm 31 old man. I have a pretty good life that I can't complain. But also I feel guilt. I feel guilt for the world's ills. I feel guilt for not help people with all my power. If I see someone at street with a broken car, even know that I now shit about cars, I feel guilt if I don't stop and help.\nI feel guilt to spend my money on superfluous stuff instead of give it to charity. \nI see animals suffering and I think that is my fault to not help. I see poor children that will not get anything from Christmas, and I feel It's my fault for not help. I know that I can help all kids, but... I feel guilty anyway.\n\nMy moms passed away 3 years ago. At that time, I felt guilt for her disease (she's got cancer).\n\nIt's like it's all my fault.\n\nDoes anybody here have the same feeling?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody here suffers from always feel guilty?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q2evg/does_anybody_here_suffers_from_always_feel_guilty/"
        },
        {
            "author": "AnnaLogous",
            "author_created_utc": 1417730385,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jt103",
            "created_utc": 1419506164,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qcw2c/hey_you_yes_you/",
            "gilded": 0,
            "id": "2qcw2c",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qcw2c/hey_you_yes_you/",
            "retrieved_on": 1441001802,
            "score": 146,
            "secure_media_embed": {},
            "selftext": "Whatever today holds, I hope you find some peace and have some smiles :) You deserve them, you wonderful being.\n\nIt is human to have blips, to revert to our old coping mechanisms, it is what we do after which shows how far we have come in recovery.\n\nYou are loved, you are valid and you matter in this world.\n\nMerry Christmas, and I will be about if anyone wants a message :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hey you (yes, you!)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qcw2c/hey_you_yes_you/"
        },
        {
            "author": "BloodGuts_AngelCake",
            "author_created_utc": 1415217145,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j7vb0",
            "created_utc": 1419764252,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qlzd7/rant_i_always_feel_like_everyone_secretly_hates_me/",
            "gilded": 0,
            "id": "2qlzd7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 56,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qlzd7/rant_i_always_feel_like_everyone_secretly_hates_me/",
            "retrieved_on": 1440997499,
            "score": 124,
            "secure_media_embed": {},
            "selftext": "I'm so sick of it. It doesn't matter what I do or who I hang out with. I could be hanging out with my best friends and when I come home and sit down to relax I replay everything I said and did and somehow I convince myself that they hate me. I wish I could stop but I feel like it's so impossible. I don't necessarily think I'm a horrible person. I'm stuck in a bit of a rut right now, I don't have a job, I had to move back in with my parents but it's not the end of the world. So why do I have to keep torturing myself like this? I know that half the shit I think about isn't even true so why does this bug me so much? \n\nI'm sorry for ranting, guys. I just really need to get this off my chest.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[RANT] I always feel like everyone secretly hates me..",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qlzd7/rant_i_always_feel_like_everyone_secretly_hates_me/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419612833,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qgf0a/stop_staring_at_phone_go_take_a_shower_do_some/",
            "gilded": 0,
            "id": "2qgf0a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qgf0a/stop_staring_at_phone_go_take_a_shower_do_some/",
            "retrieved_on": 1441000096,
            "score": 92,
            "secure_media_embed": {},
            "selftext": "My list of shoulds right now.  Been doing the shoulds for the holidays, I just want to go to my hole.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Stop staring at phone. Go take a shower, do some long-planned projects or something, pay attention to kids, etc.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qgf0a/stop_staring_at_phone_go_take_a_shower_do_some/"
        },
        {
            "author": "thefaith1029",
            "author_created_utc": 1339385335,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7yiy8",
            "created_utc": 1419310038,
            "domain": "upworthy.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q57e4/a_mother_doesnt_understand_why_her_daughters/",
            "gilded": 0,
            "id": "2q57e4",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q57e4/a_mother_doesnt_understand_why_her_daughters/",
            "retrieved_on": 1441005447,
            "score": 81,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/J65cXpKKTEMRCE4koBsVotKDjaRPsWfqOZ3zfHyzmdA.jpg",
            "title": "A Mother Doesn't Understand Why Her Daughter's Depressed. Her Daughter Clears That Up For Her.",
            "url": "http://www.upworthy.com/a-mother-doesnt-understand-why-her-daughters-depressed-her-daughter-clears-that-up-for-her?c=ufb1"
        },
        {
            "author": "LunchLadyDoris24",
            "author_created_utc": 1416176114,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_je4ga",
            "created_utc": 1419705804,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qjsc2/does_anyone_else_experience_increased_anxiety/",
            "gilded": 0,
            "id": "2qjsc2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qjsc2/does_anyone_else_experience_increased_anxiety/",
            "retrieved_on": 1440998524,
            "score": 76,
            "secure_media_embed": {},
            "selftext": "I'm on medication for depression and anxiety and have noticed that during the few days leading up to my period my anxiety goes through the roof. I start getting worried about nonsense, experience shortness of breath, pounding heart, and a nervous stomach. Has anyone else dealt with this? If so, what things helped calm you down? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else experience increased anxiety while PMSing?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qjsc2/does_anyone_else_experience_increased_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419344294,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q6c69/help_after_5_years_i_cant_sit_here_and_deny_my/",
            "gilded": 0,
            "id": "2q6c69",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q6c69/help_after_5_years_i_cant_sit_here_and_deny_my/",
            "retrieved_on": 1441004859,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "I'll put the TLDR on top cause this got lengthy. I opened the flood gates. \n\nTLDR: I need help coping with life. I'm agoraphobic, anxiety ridden, addicted to anything that makes the worry in my head go away and if I don't fix it soon I'm going to kill myself. I don't want to do it but it's my last resort option and I'm not above doing it. Can someone tell me what to do? please? I feel so fucking pathetic and hopeless. I hate myself.\n\nI'll cut to the chase. The last 5 years have been the most incredibly stressful years of my life and while most people my age (24 Male) are stressed about college, careers and starting families, my stress seems to all be around avoiding leaving the house at ALL costs. When I say at all costs I mean it. I dropped out of school because I had a panic attack there and managed to justify dropping out to never go back. I've had one part time job as a cashier. Barely managed to hold it together and quit after I blacked out worrying about my till count being off $0.32. That was 2 months after dropping out of school. The saddest part is that the anxiety was so bad from just the THOUGHT of explaining why I was quitting to my boss that I just never talked to him or the company again and have never been there since. After that I locked myself in my room and besides to move a couple times, go shopping a few times and the damn holiday season I've managed to convince myself that sitting on my computer for 18 hours a day with no life, dreams, friends, romantic interests, ambitions or goals is okay. It was almost like a form of denial where I knew what the real problem was but the idea of dealing with it caused so much anxiety and worry that I'd either self medicate or force myself to disconnect by being on the computer for 80% of my day. (I probably sleep more than 20% but you get the idea)\n\nBy self medicate I mean a slew of unhealthy addictions I justified with a million bullshit excuses and have managed to get clean and stay clean this time (even cigarettes) so I've decided to stop being a little girl about this, grow some fuckin balls and do something about it. But I don't know how to go about it... I don't have a license because the idea of panicking and wrecking a car is making my palms moist right now and thinking about the crowded dmv makes my neck hurt. The doctors office closest to me is WAY too far to walk because when I do manage to force myself outside its a few blocks MAX and its usually with headphones drowning out the outside world and my glasses that are almost like horse blinders in a way. Before it was only when I had opiates, benzos or alcohol but getting clean over the last 2 years has forced me to adapt new coping methods. But that's the problem, I don't want to cope with it, I want to be fuckin normal. I want to WANT to go to the store or a friends house. Ive had 3 fillings fall out of my teeth over the last 4 years and I'd really like to get this shit fixed before i die in my sleep from an abscess. I have a plethora of health problems I need to get checked out like the weird baby smooth patch of fucking bald skin on my head that seemingly appeared over night. \n\nYou always here the first step is admitting it. Well here it is, on reddit so I can't take it back or slowly slip back into denial. But what should I do? Would a doctor come to me? do I get personal in home therapy? I need to acquire a way to make an income or I'm afraid my family is gonna force me out and honestly that thought just made me start to breathe heavy and my chest hurt. I feel so overwhelmed and hopeless and on top of it all I'm a 24 year old living at home with no job experience, money, education or social skills. I'm a neckbeard and a basement away from bringing a stereotype to life and I hate myself for it. I fucking hate myself. Is it normal to resent yourself?\n\nOn top of it all I worry about my mental health. Am I depressed? Am I crazy? Am I a sim with a REALLY low Social bar? (joke to lighten the mood?) but really I'm starting to develop OCD like habbits. Neurotic level shit. I bite my nails till they bleed then I chew the skin on my fingertips till they bleed. I spend all my time either worrying or distracting myself from worrying. It's a very fucking sad existence and I cant do it anymore.\n\nI don't want to say this, but for the sake of honesty and putting it all out there I've been thinking about suicide a lot more lately. It's part of the reason I'm posting this. I've decided that I'll at least try to get help and deal with the shame in the hopes of leading a normal life but if it fails and I'm still like this at 30 I'll just end it. I just can't do it anymore. This is as real as rock bottom gets and this is either where I rise from my ashes or roll over and die a disgrace to my family name.\n\nThis is my literal cry for help... \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] After 5 years I can't sit here and deny my agoraphobia anymore. This is my literal cry for help. Help me?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q6c69/help_after_5_years_i_cant_sit_here_and_deny_my/"
        },
        {
            "author": "sparklydicks",
            "author_created_utc": 1368137482,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bmcl0",
            "created_utc": 1419370355,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q7pk4/anyone_else_suffer_from_scopophobia_fear_of_being/",
            "gilded": 0,
            "id": "2q7pk4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q7pk4/anyone_else_suffer_from_scopophobia_fear_of_being/",
            "retrieved_on": 1441004219,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "I've suffered from this as long as I can remember, but it is only recently that I discovered a name for it. Being looked at makes me feel sick and intensely anxious. Maintaining eye contact with people is a nightmare for me, and I always breathe a sigh of relief when they leave or look away. I'm in a long-distance relationship, and Skype calls make me nearly have a panic attack. Skype is one of the worst offenders for this- I find it almost unbearable usually.\n\nI suspect this is a subset of social anxiety rather than regular anxiety, but I thought some people here might be able to relate. I've had a lot of bad experiences with therapy, and I wonder what the options are when it comes to treating this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else suffer from scopophobia (fear of being looked at)?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q7pk4/anyone_else_suffer_from_scopophobia_fear_of_being/"
        },
        {
            "author": "itscarlawithak",
            "author_created_utc": 1398175798,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g8zpj",
            "created_utc": 1419499699,
            "domain": "self.Anxiety",
            "edited": 1419834280,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qcr9c/does_anyone_else_find_themselves_doing_compulsive/",
            "gilded": 0,
            "id": "2qcr9c",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qcr9c/does_anyone_else_find_themselves_doing_compulsive/",
            "retrieved_on": 1441001864,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I do. It depends on what I'm currently anxious about, but I find myself doing repetitive, compulsive things. Sometimes I have to play with my phone or check my email/reddit/facebook multiple times in a row, and I cannot stop. Sometimes I get focused on cleaning *one* thing really well, or going through and reorganizing something over and over because it's never \"perfect\". It makes the anxiety so much worse because I become so engrossed in whatever it is and I know it isn't helping, but I can't really stop.\n\nI only do this when I'm anxious or really depressed, other than that I have no compulsive or obsessive behaviors. I do have ADHD, so I think that contributes a lot, but it's so odd it isn't an issue if I'm not having those feelings.\n\nIf you do this, how do you work on correcting or stopping it? I have tried distracting myself but it doesn't always work, so I'm open to suggestions if there are any. Thanks\n\n**EDIT: Wow, sorry it has taken so long to reply, but I really appreciate everyone's input, support, and comments. It is so nice to finally be apart of a community that understands what this is like! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else find themselves doing compulsive or obsessive behavior when you're anxious or depressed?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qcr9c/does_anyone_else_find_themselves_doing_compulsive/"
        },
        {
            "author": "JustMandie",
            "author_created_utc": 1413224146,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iu8pb",
            "created_utc": 1419276849,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q3hq8/3_things_i_do_that_help_me_reduce_my_anxiety/",
            "gilded": 0,
            "id": "2q3hq8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q3hq8/3_things_i_do_that_help_me_reduce_my_anxiety/",
            "retrieved_on": 1441006275,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "Those 3 things are really effective and work for me, but only for the short term.\n\n1. When I am starting to feel stress and panicking, I contract all of my body muscles for like 10-15 seconds and then release them all at once. I repeat it 2 or 3 times. (if you are around people, just go to the bathroom and do this).\n\n2. I take a few deep breathes and tell myself \"I am safe\", \"everything is OK\".\nI inhale deep to my stomach, hold it for 3 seconds and let it go for 5 seconds.\n\n3. I force myself to smile. That makes me feel better in no time. Sometimes I even try to remember something funny to neutralize the anxiety I feel.\n\nWhat are your \"instant anxiety release\" ways? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "3 things I do that help me reduce my anxiety right away",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q3hq8/3_things_i_do_that_help_me_reduce_my_anxiety/"
        },
        {
            "author": "SilverF0xy",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419385638,
            "domain": "self.Anxiety",
            "edited": 1419443736,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q8hek/im_always_afraid_that_i_have_a_brain_tumor_or_any/",
            "gilded": 0,
            "id": "2q8hek",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q8hek/im_always_afraid_that_i_have_a_brain_tumor_or_any/",
            "retrieved_on": 1441003858,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I guess I could say I've been dying my whole life, always terrified I was dying of one disease or another I just never went to the doctor because of how terrified i am of them and hospitals and lastly finding out that I actually was dying and having to live a limited lifestyle. So i guess my parents always thought i was fine when i really i wasnt but i didnt even understand what was really wrong with me\n\nthat was all from probably 9 to 12, then the social anxiety started to kick in...im sort of a loud person. i guess i compensate. people dont totally understand that im pretty shy, well actually sometimes i come off really shy. it just depends on who im with and where you meet me. \n\nI'm 22 now, i hate the way i sound. i hate my face and body. hate my words. the words are the worst. i say  or do something that seems okay in my head but when i do it its never cool or funny. \n\nI have failed in relationships. Lots of times. Can't even begin to explain. \n\nI try not to eat. Except at night but that really has to do with all of the holiday parties I've been going to, lots of food there. \n\nI guess i goto alot of parties, like one every night for the past week and a half. But i go alone, i leave alone. I might get a cab or a ride or pass out on a friends couch. I always embarrass myself with my words. \n\nI chainsmoke cigarettes. That started when I went to school, but it stuck. \n\nis this anxiety? \n\nEdit: Thank you all so much for your advice",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm always afraid that I have a brain tumor, or any kind of cancer, spinal meningitis, pregnant, ect...it just recently occurs to me that this is anxiety [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q8hek/im_always_afraid_that_i_have_a_brain_tumor_or_any/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419290832,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q49rt/i_havent_left_my_house_for_4_years_think_i_might/",
            "gilded": 0,
            "id": "2q49rt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q49rt/i_havent_left_my_house_for_4_years_think_i_might/",
            "retrieved_on": 1441005883,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "I haven't been outside at all since the summer of 2010. I haven't been able to get diagnosed with anything due to being unable to leave my house (doctors don't do home visits unless you're dying here, basically), but I think I've got agoraphobia because most of the symptoms seem to apply to me. I'm worried that if I don't leave the house soon I might end up literally spending the rest of my life as a shut-in. I also think lack of sunlight is affecting my health because I've been indoors for so long. I was wondering if anyone has been in a similar situation or has any advice. Were you able to overcome it on your own? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I haven't left my house for 4 years, think I might be agoraphobic",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q49rt/i_havent_left_my_house_for_4_years_think_i_might/"
        },
        {
            "author": "Runaway_dragon",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419245559,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q25jk/rant_i_have_to_make_a_phonecall_i_hate_it_writing/",
            "gilded": 0,
            "id": "2q25jk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q25jk/rant_i_have_to_make_a_phonecall_i_hate_it_writing/",
            "retrieved_on": 1441006900,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I hate calling people. I'm just writing this to gather my courage. I hope they don't answer. It's an official call and although I don't technically have to do it right now, it has to be done, and I decided to do it today. If I don't I'm going to go around worrying about that every day until it's dealt with.\n\nI really don't want to. I find myself thinking \"what is the worst the can happen if I ignore this?\" or \"could I ask someone else to do it for me?\". Making phone-calls is one of the most stressful things. I've learnt to call my friends, but that's about it. Despite this I wince everytime the phone rings, praying that it is only my mother calling to let of some steam.\n\nStop rambling. I need to make the call... I don't think I'm going to. But I have to. Gah, I hate this.\n\nI'm just going to pick up the phone, dial the number without thinking. Once I've done that I can freak out. Not thinking is the key. Once I start thinking, I won't go through with it. Just do it. Start simple. Put in the number... done. don't click dial just yet... Remember to ask if they speak English (I have it when I don't know the language!) Introduce yourself, explain the situation and ask for a solution. That's it... Be brave. Be a someone else. Be a strong. Do it... now.\n\nI did it. Such a relief. It went well and the guy was nice and easy to talk with, but now my heart is beating like crazy. It's weird, although I feel really relieved, I still feel anxious and sort of embarrassed. The way you do when you have made a fool out of yourself.\n\nI wasn't going to post this first, but I thought you guys might appreciate this. Thanks for the help. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] I have to make a phonecall. I hate it. Writing this to gather some courage.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q25jk/rant_i_have_to_make_a_phonecall_i_hate_it_writing/"
        },
        {
            "author": "scottisherenow",
            "author_created_utc": 1405715440,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hgr58",
            "created_utc": 1419308339,
            "domain": "youtu.be",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q54mz/autism_and_anxiety_girl/",
            "gilded": 0,
            "id": "2q54mz",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "Scotty Tipton",
                    "author_url": "http://www.youtube.com/user/scotttiptonmedia",
                    "description": "One woman's story living with Autism and Anxiety.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2Fc2bgTcURrqQ%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dc2bgTcURrqQ&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fc2bgTcURrqQ%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i.ytimg.com/vi/c2bgTcURrqQ/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Autism and Anxiety Girl",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=c2bgTcURrqQ",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtu.be"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2Fc2bgTcURrqQ%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dc2bgTcURrqQ&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fc2bgTcURrqQ%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q54mz/autism_and_anxiety_girl/",
            "retrieved_on": 1441005483,
            "score": 26,
            "secure_media": {
                "oembed": {
                    "author_name": "Scotty Tipton",
                    "author_url": "http://www.youtube.com/user/scotttiptonmedia",
                    "description": "One woman's story living with Autism and Anxiety.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fc2bgTcURrqQ%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dc2bgTcURrqQ&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fc2bgTcURrqQ%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fc2bgTcURrqQ%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "Autism and Anxiety Girl",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=c2bgTcURrqQ",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtu.be"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fc2bgTcURrqQ%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dc2bgTcURrqQ&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fc2bgTcURrqQ%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/9xBxKqDcx2zcgZYJHNVi0dJOo6AItyDZN_eLrQeuUtI.jpg",
            "title": "Autism and Anxiety Girl",
            "url": "http://youtu.be/c2bgTcURrqQ"
        },
        {
            "author": "thepicklette",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419652779,
            "domain": "self.Anxiety",
            "edited": 1419714231,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qi4y9/i_just_wish_you_were_normal/",
            "gilded": 0,
            "id": "2qi4y9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qi4y9/i_just_wish_you_were_normal/",
            "retrieved_on": 1440999294,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "Today, the one person that I thought has actually accepted me, anxiety and all, said this to me... I feel so alone now. I really thought this person was there for me, and now I just feel so bad. If even they can't put up with my issues, how will anyone else be able to? I'm starting to lose hope that I'll ever be \"normal\" again.\n\nEdit: For those saying that maybe they just mean they wanted me to be better for my own good-- Before saying this, this person had spent several minutes telling me how hard my anxiety is on him, how much he hates dealing with my issues all the time. It wasn't a good conversation, and this statement was yelled at me. As much as I hate to say it, he was only concerned with how unfair the situation is for him. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "\"I just wish you were normal.\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qi4y9/i_just_wish_you_were_normal/"
        },
        {
            "author": "happypirate33",
            "author_created_utc": 1352349927,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9jeui",
            "created_utc": 1419381402,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q8a54/support_tell_me_to_go_to_my_therapy_appointment/",
            "gilded": 0,
            "id": "2q8a54",
            "is_self": true,
            "media_embed": {},
            "num_comments": 49,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q8a54/support_tell_me_to_go_to_my_therapy_appointment/",
            "retrieved_on": 1441003952,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I've been struggling for years and tomorrow morning is my first session.  All I want to do right now is cancel it or skip out.\n\n\n ^Sorry ^if ^I ^broke ^any ^rules ^with ^this ^post.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Support] Tell me to go to my therapy appointment tomorrow. please.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q8a54/support_tell_me_to_go_to_my_therapy_appointment/"
        },
        {
            "author": "ORSTFAN",
            "author_created_utc": 1393364235,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fg7kv",
            "created_utc": 1419760223,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qlwbx/im20_have_regret_or_remorse_for_all_my_actions/",
            "gilded": 0,
            "id": "2qlwbx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qlwbx/im20_have_regret_or_remorse_for_all_my_actions/",
            "retrieved_on": 1440997538,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Background, I come from an upper middle class family with possibly overly controlling parents. I have never had to fret about money unless it was something stupid and useless. I was an honors student in high school and now attend a state college in a fraternity and in a engineering field I have succeed well in college. Maintaining a 3.5+ GPA. My last relationship was over a year long and she was emotionally abusive. It was in high school, I am now a sophomore.\n\nI can't help but feel anxious about everything I do. Something is always going to go wrong even though nothing ever does. From checking if something is locked 10 times to freaking out my close friends are mad at me and don't want to talk because I miss spell something. Things that obviously are just other people living there life's or things that won't change like a door being locked. \n\nI feel that everything I do will be taken wrong by everyone and they won't talk to me later or will be mad. That nothing I do is ever right, (my ex kinda beat(not literally) in to me she is always right). Everything I do I think is wrong and I should have done different or not at all. I have always said I think logically and act emotionally. I want to be my self and enjoy life but I am confined to thinking of my actions and their effect. Always bidding behind a wall of \"what will happen if\". \n\nI just want to enjoy my life and not hate it, like I do now :'(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I[M]20 have regret or remorse for all my actions even ones that have no impact on life.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qlwbx/im20_have_regret_or_remorse_for_all_my_actions/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419697935,
            "domain": "self.Anxiety",
            "edited": 1419698366,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qjg96/i_have_a_huge_crush_on_my_coworker/",
            "gilded": 0,
            "id": "2qjg96",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qjg96/i_have_a_huge_crush_on_my_coworker/",
            "retrieved_on": 1440998681,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "Damn, I really hate feeling this way. I haven't had a crush on someone since I was about 11 or 12. I'm 19 now.\n\nI liked it better when I was in control of my emotions..Like, I still am, but this girl is on my mind all the time. The most random shit will remind me of her and frankly I'm tired of it. Just wish I could erase her from my memory.\n\nIt's really awkward because two other people I work with also like her. She has a boyfriend in the Army and she talks about marrying him sometimes, so there's that.\n\nShe seems to be the type that is naturally flirty, which kind of drives me crazy when she touches me and shit. Once when a coworker asked me to do something I was trying to avoid I replied \"Ah alright..\" With what I guess was  a sad look on my face. She then leaned over and put her hands on my cheeks and said \"aww poor baby\". I felt so awkward but I loved every second of it. \n\n\nShe did that again recently. I worked Christmas eve with her a few other people and I was bit more tired than usual. After I yawned she put both hands on my face and said \"WAKE UP\". She then said that usually wakes people up. ..She was right.\n\n\nBut anyway, she's not just like this with me, she's like this with other people.. I hate when I see her paying attention to other guys. God damn it pisses me off. I know it must be unhealthy to feel like this, so I need to find a way to just not care anymore.\n\nThat reminds me, since these two other guys are more social than I am, I guess they're all friends already. They made plans to go over to her house and drink for new year's eve. When I found out about that  I got sad as fook. Not only because I wasn't invited but because these guys have no trouble when talking to her, which I am envious of.\n\nI don't know what to say to her most of the time.. So sometimes I'll say the stupidest shit just so I can talk to her and she'll talk to me. But when she talks to me or tells me a story I have no idea what to say back..So I end up saying something like \"Ah, that's messed up\" Or \"Damn, that sucks\". I just can't keep a conversation going . :(\n\nWhen I'm home and feel like seeing her face, I just go on her facebook for a second and look at her profile picture. This is the first time I have ever facebook \"stalked\" anyone.\n\nOverall, I just wish I was fun to be around. Oh well.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I have a huge crush on my coworker",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qjg96/i_have_a_huge_crush_on_my_coworker/"
        },
        {
            "author": "nicholas181997",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419414603,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q9m7p/help_coping_with_parents/",
            "gilded": 0,
            "id": "2q9m7p",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q9m7p/help_coping_with_parents/",
            "retrieved_on": 1441003329,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "My parents are really awkward about my anxiety. Refuse to talk about it. Refuse to accept it. When my dad finally did speak up about it today he said that it was caused by my selfishness and that he's a better person than me because he doesn't have to see a psych or \"Take drugs to cope with reality\". Just wanted to say sometimes it's really hard and it feels like no-one understands especially when it's family.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Coping with parents",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q9m7p/help_coping_with_parents/"
        },
        {
            "author": "AndTheHawk",
            "author_created_utc": 1325574861,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6kkut",
            "created_utc": 1419314951,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q5fb9/watching_mr_rogers_neighbourhood_to_relax/",
            "gilded": 0,
            "id": "2q5fb9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q5fb9/watching_mr_rogers_neighbourhood_to_relax/",
            "retrieved_on": 1441005345,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "Hi all!  \n  \nHas anyone ever tried watching Mr. Roger's Neighbourhood to calm themselves down? 'Cause I have. And it works pretty well for me!  \n  \nHis voice is very calming, as is the music, and his messages are quite therapeutic. I actually really like his messages. The audience is definitely children, but even the oldest person can take something away from them. Especially that of accepting yourself just as you are!  \n  \nThe length of each episode and the availability is a plus as well (under 30 minutes, easily found on YouTube). You can choose a theme that is completely unrelated to whatever is causing your anxiety symptoms, or choose one that relates if you're trying to work things out.  \n  \nI frequently watch episodes to help me sleep and I am generally asleep 5-10 minutes in. I recommend doing this for anyone who prefers falling asleep to sound, though I'd stay away from the episode about quiet and noisy sounds for obvious reasons.. Learned that the hard way!    \n  \n[Here's an example to start you off.](https://www.youtube.com/watch?v=AejN46S1VXQ)\n  \nHopefully this is helpful for at least one person. Bye!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Watching Mr. Roger's Neighbourhood to relax!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q5fb9/watching_mr_rogers_neighbourhood_to_relax/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419401604,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2q975x/i_cant_even_get_a_job_because_of_my_fucking/",
            "gilded": 0,
            "id": "2q975x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2q975x/i_cant_even_get_a_job_because_of_my_fucking/",
            "retrieved_on": 1441003524,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "I feel like I'm crazy. A prospective employer called me today. 4 years ago, I would have been the most polite and professional person, eager to pick up the phone and engage this person as an individual. Today, I've grown so bitter and depressed that I talked myself out of the job as soon as I saw the number come up. How? I realized that I'd have to meet this person, and as soon as I shook my cold, soaking-wet-with-sweat hand and saw the fear in my eyes (of people), they'd have no fucking reason to hire me. \n\nI can't do anything. I shake at the first sign of conflict. My heart starts racing and I can't catch a breathe. I start visibly shaking and stutter. I get awkward, shut down, and start sweating like I'd just run a mile. I'm also only 125 lbs (probably less now), so I look like a fucking crack addict when this happens.\n\nHow do I calm down? I'm pretty sure I'm beyond saving...my dad is a Christian minister and my mom is a zionist-charismatic-crazy person. Together, they royally fucked up my whole existence for the first 18 years of my life (in the name of our Lord Jesus Christ). Then, adopting some good morals and attempting to bring them with me into society-confidence=worst fucking idea ever. \n\nAnyways, I'm too much of a wimp to kill myself, so I need to fix this. Do I just need to make friends? Why would anyone want to be friends with a fucking crazy, sweaty, dumb-hipster douchebag? Why would I girl start to crush on a guy who is too afraid to shake someone's hand? Or go to the grocery store alone?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't even get a job because of my fucking anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2q975x/i_cant_even_get_a_job_because_of_my_fucking/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1419675370,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qiu8t/my_anxiety_is_stopping_me_from_receiving_an/",
            "gilded": 0,
            "id": "2qiu8t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qiu8t/my_anxiety_is_stopping_me_from_receiving_an/",
            "retrieved_on": 1440998966,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "I don't know how to deal with this anymore. I'm a 19 year old female and about 3-4 years ago was when I realized I have anxiety/panic attacks. It used to affect me mainly during exam week in school, that's when I would get maybe 2 hours a sleep a night and constantly panic over everything.\n\nA little bit of an intro: I was on Prozac for depression since I was about 15 years old...and have switched over to the lowest dose (10mg) for about 2 years now. However, it's been nearly 2 weeks since I've completely stopped taking it as I don't want to have to rely on medication. Plus, I don't think it made much of a difference. I used to see a psychiatrist for about 1 year or so (maybe 5 sessions), however she was completely useless and if anything, made me feel worse. \n\nMy anxiety varies, many times it's health related - if my ear pops I begin to panic...it sounds odd but I think it has to do with the fact that my very first SERIOUS panic attack had to do with that and since then I've attached horrible, horrible memories to my ears popping as it lasted a few days and therefore it was days of panicking.  When I get sick I also tend to panic. \n\nThis next one is very odd and I don't even understand it myself, however, if I go to bed late, 3-4am for example, and I have to be up early, I panic and can't fall asleep as I'm afraid I won't wake up on time. But, I'm also afraid of waking up too late...then I begin to panic because if I don't sleep, much, I'll get lightheaded, headaches etc. \n\nNormally, when I have a panic attack I also begin to think about the future. My dream has always been to go to law school, however, I can barely finish my high school degree as soon I begin to do write an essay, I can't fall asleep at night worrying about how I won't manage to finish it and I think \"If I can't get through this, there's no way I can manage university.\" I used to love swimming, and visiting Portugal because of the beaches...now I worry about drowning and my ears popping or something getting in my eyes. I don't know how to explain it. \n\nI'm moving abroad next year to England from Canada...away from my biggest support system - my parents. That freaks me out as well, and I'm constantly panicking about that at night. How will I manage without them. \n\nI don't know what I'll do with my life because my anxiety is keeping me back from everything.  I have to be up at 8 today for my first day of my driving school course and it's already 5am. I've been panicking since about 2 am. \n\nI just can't deal with this anymore. I'm thinking I'm feeling especially bad due to going off my Prozac...could these be withdrawal symptoms?  I realize this is a lot of rambling...but I just need to air this out. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My Anxiety is stopping me from receiving an education. What has helped you most with your anxiety? Have any of you tried cognitive behavioral therapy?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qiu8t/my_anxiety_is_stopping_me_from_receiving_an/"
        },
        {
            "author": "tortue_genial",
            "author_created_utc": 1380988309,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_de9e2",
            "created_utc": 1419597882,
            "domain": "theguardian.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qfxzy/after_my_cancer_diagnosis_my_anxiety_disappeared/",
            "gilded": 0,
            "id": "2qfxzy",
            "is_self": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qfxzy/after_my_cancer_diagnosis_my_anxiety_disappeared/",
            "retrieved_on": 1441000317,
            "score": 14,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/YrUfMIDv3ITspsgGwZhKkgJGX4ZCMVEsAqz-nRhRPZQ.jpg",
            "title": "After my cancer diagnosis, my anxiety disappeared",
            "url": "http://www.theguardian.com/commentisfree/2014/dec/22/after-my-cancer-diagnosis-my-anxiety-disappeared-now-ill-do-anything-to-keep-this-body?CMP=fb_gu"
        }
    ]
}