{
    "data": [
        {
            "author": "feyek",
            "author_created_utc": 1364809436,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b5ben",
            "created_utc": 1392883487,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yfbzy/ive_been_drawing_pictures_about_my_personal/",
            "gilded": 0,
            "id": "1yfbzy",
            "is_self": false,
            "media": {
                "oembed": {
                    "description": "Imgur is home to the web's most popular image content, curated in real time by a dedicated community through commenting, voting and sharing.",
                    "height": 550,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fimgur.com%2Fa%2FPRJXL%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FPRJXL&amp;image=http%3A%2F%2Fi.imgur.com%2FZfApiD2.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "Imgur",
                    "provider_url": "http://imgur.com",
                    "thumbnail_height": 2003,
                    "thumbnail_url": "http://i.imgur.com/ZfApiD2.jpg",
                    "thumbnail_width": 2009,
                    "title": "imgur: the simple image sharer",
                    "type": "rich",
                    "version": "1.0",
                    "width": 550
                },
                "type": "imgur.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fimgur.com%2Fa%2FPRJXL%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FPRJXL&amp;image=http%3A%2F%2Fi.imgur.com%2FZfApiD2.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 550,
                "scrolling": false,
                "width": 550
            },
            "num_comments": 58,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yfbzy/ive_been_drawing_pictures_about_my_personal/",
            "retrieved_on": 1441904676,
            "score": 497,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://d.thumbs.redditmedia.com/PmrkRDEd6dWgs--W.jpg",
            "title": "I've been drawing pictures about my personal struggle with anxiety. They help me explain to my therapist and to my SO how I feel. I hope they help you in some way.",
            "url": "http://imgur.com/a/PRJXL#0"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392739605,
            "domain": "i.imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y90dq/as_someone_with_social_anxiety_this_seems_all_too/",
            "gilded": 0,
            "id": "1y90dq",
            "is_self": false,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y90dq/as_someone_with_social_anxiety_this_seems_all_too/",
            "retrieved_on": 1441907626,
            "score": 474,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "As someone with social anxiety this seems all too familiar.. (image taken from hyperbole and a half: depression)",
            "url": "http://i.imgur.com/wzBZG48.jpg"
        },
        {
            "author": "xresplendencex",
            "author_created_utc": 1369934323,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bv3mq",
            "created_utc": 1392941442,
            "domain": "livememe.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yhmmh/xpost_from_advice_animals_thought_this_sub_would/",
            "gilded": 0,
            "id": "1yhmmh",
            "is_self": false,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yhmmh/xpost_from_advice_animals_thought_this_sub_would/",
            "retrieved_on": 1441903604,
            "score": 199,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://f.thumbs.redditmedia.com/-SwqOHsvUlUeEpn_.jpg",
            "title": "X-post from Advice Animals. Thought this sub would appreciate it.",
            "url": "http://www.livememe.com/geo0w5d.jpg"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392541129,
            "domain": "self.Anxiety",
            "edited": 1392625387,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y1t2f/help_dae_have_intense_feelings_of_doom_about/",
            "gilded": 0,
            "id": "1y1t2f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y1t2f/help_dae_have_intense_feelings_of_doom_about/",
            "retrieved_on": 1441911048,
            "score": 121,
            "secure_media_embed": {},
            "selftext": "I have horrible anxiety about going to work each day. There isn't ever a time I feel at ease before heading to work and it carries over to my days off too. \n\nI fear so many different things. I worry customers will be mean to me. I worry my boss will yell at me. I worry I will have to talk to someone in the break room. I worry I will be late. I worry I won't do a good job. I worry I will get fired. I also have more irrational fears (e.g. my clothes will rip and I'll be exposed, something bad will happen to my dog while I am work, etc.)\n\nBy the way, this isn't something specific to my current job but I have felt this way with every job I have ever had. I have enough money saved to get by if I were with out a job for a short time so it has nothing to do with that. It's just this overwhelming feeling like something bad will happen. It's so bad that I can't relax after work because all I can focus on is that I have to go back tomorrow and I replay these horrible scenarios in my head. Here I am posting about it when I wish I could enjoy my time away from there. Life shouldn't be this way.\n\nI have anxiety disorder and obviously this affects me in a huge way but does anyone have any tips on ways I can separate my time at work from my time at home? How do I relax?\n\nTL;DR I'm stressed about having a job. I want to learn to accept it and feel better. I need tips on how to worry less about work and not let it consume my life.\n\nEdit: Thank you so much for all the responses. All of you have made me feel a lot better. I love reading your stories and appreciate all the advice. It's good to feel like I am not alone.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] DAE have intense feelings of doom about going to work?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y1t2f/help_dae_have_intense_feelings_of_doom_about/"
        },
        {
            "author": "feyek",
            "author_created_utc": 1364809436,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b5ben",
            "created_utc": 1392700485,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y7saj/today_everyday/",
            "gilded": 0,
            "id": "1y7saj",
            "is_self": false,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y7saj/today_everyday/",
            "retrieved_on": 1441908258,
            "score": 117,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/uMyVPbJoWZQrFEET.jpg",
            "title": "today. everyday.",
            "url": "http://imgur.com/1qRhjer"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392849050,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1ydtth/am_i_a_loser/",
            "gilded": 0,
            "id": "1ydtth",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1ydtth/am_i_a_loser/",
            "retrieved_on": 1441905378,
            "score": 84,
            "secure_media_embed": {},
            "selftext": "I'm 43. Had to move in with my mom after a bad relationship with my ex GF who had borderline personality disorder. She manipulated me and left me in a lot of debt.\n\nNow I am working a $10hr job. I'm humiliated. \n\nBottom line is I feel like a total loser/failure. It's getting the best of me. I've convinced myself of this.\n\nMy anxiety is through the roof. To the point where I think it's putting me at risk for a heart attack. The self beating up and stress are overwhelming me.\n\nI'm on an SSRI and have a small dose of klonopin. Thank goodness for the benzo as needed or I would be in a worse place.\n\nI throw up every morning.\n\nIt's tough to leave the house to go to my crappy job.\n\nI'm embarrassed and feel like I've lost everything and I'm a total loser.\n\nDoes anyone else feel this way?\n\nDoes anyone have any advice or words for me? \n\nI would be most grateful because I'm not sure I can take this much longer....",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Am I a loser?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1ydtth/am_i_a_loser/"
        },
        {
            "author": "paradigm_shift1",
            "author_created_utc": 1392447855,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fa6w5",
            "created_utc": 1392469653,
            "domain": "self.Anxiety",
            "edited": 1392470925,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1xz8we/tips_on_improving_your_life_reduce_anxiety_stress/",
            "gilded": 0,
            "id": "1xz8we",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1xz8we/tips_on_improving_your_life_reduce_anxiety_stress/",
            "retrieved_on": 1441912302,
            "score": 79,
            "secure_media_embed": {},
            "selftext": "Hi everyone-\n\nI've been a long time lurker of this great website, and I finally decided to make an account today because I feel like I have something useful I can share with you all.  If even one of your lives is changed for the better by my post, I'll feel like it was worth my time to write this out.  \n\nSo, before I get to the list of tips, I just want to preface it with a short story about myself.  I had been struggling with stress, social anxiety and depression for a while before this, and it got to a point where I was actually thinking of talking to my parents about it and seeing if I could find some meds that might help me.  Before it got to that though, I decided on doing some research on various topics which might help me with my anxiety.  There is a lot of great information that I came across (which I will mention later), that helped me deal with my problems.  \n\nI think the first step we need to take to improve our lives is to become conscious of what we say to ourselves every day.  A lot of us don't love ourselves like we should.  We call ourselves nasty things because we make even the simplest of mistakes.  We do something embarrassing, and we'll beat ourselves up for it for the longest time.  Things on TV and advertisements are constantly telling us that we aren't good enough and that we're too ugly or not skinny enough.  \n\nI finally decided that I was sick and tired of always feeling shitty about everything in my life, and I learned that all you have to do is change the way you look at the world.  I was just going to opt for the quick fix of drugs, which mask the problems, but don't deal with the root of it all.  I feel like this is becoming a major problem in the world.  We all have these problems in our lives, so we go get some drugs so we don't have to deal with our feelings.  If you are feeling shitty, it's because there is something wrong with the way you are seeing the world and thinking about things.  \n\nI know there are some people who actually do have serious problems such as severe anxiety and depression, and some of those people do need medication to help, but I think a huge number of people diagnosed with depression, anxiety, and a number of other problems don't need to be on meds, and if they can just take the time and effort to better their lives, they can do it.  \n\nI wish I could say this is an easy process, but it isn't.  It took me a long time to find the right information, and practice the things I will outline below.  There were a lot of other techniques that I tried, and they didn't work for me, so please take note that some things will work for you while others will not.  You have to find your own way which is effective for you.  \n\nSorry for dragging out the intro for so long.  Without further adieu, here are the tips that I have found along my journey which i personally think will improve your life if followed:\n\nTips on Improving your Life:\n\n#1 - Become conscious of your thoughts.\n\n- What are you saying to yourself each day?  Are you constantly criticizing yourself for your mistakes? Are you generally a positive or a negative person?\n\n#2 - Practice positive thinking.\n\n- Now that you've realized how you are talking to yourself, it's time to change it to a way that will benefit you.  Every time a negative thought comes into your head stop it!  One way to do this would be to keep a rubber band on your wrist, and snap it every time you have a bad thought.  this way, your brain will equate negative thoughts with pain, and will reduce the amount of negative thoughts you create.  Keep practicing consciously thinking positively.  For a person who is stuck in a pattern of negative thoughts (like i used to be), this will be really hard at first!  Don't give up!  The more you consciously create positive thoughts, the easier it will get.  I would say that if you work hard at this for about a month, it will become a habit, and you will naturally become a positive person.\nMeditation is also another great way of quieting your mind, and will help you with controlling your thoughts.\n\n#3 - Ask yourself the right questions.\n\n- This goes off of tip #2 a bit, but listen to the kinds of questions you are asking yourself.  When you make a mistake, are you asking yourself:  a) why am I so stupid?  or  b) What can I do that will help me to avoid this problem in the future?  Try to start asking yourself more questions like choice b).  When we ask ourselves questions, our minds try so hard to find answers, even to questions that don't have right answers.  We might as well be asking ourselves productive questions that will help us improve ourselves.\n\n#4 - Love yourself no matter what.\n\n- I think this is one of the things that helped me the most.  I used to hate the person that I was.  Whenever I could, I told myself these 6 golden words:  \"I love myself no matter what.\"  At first I didn't believe it, but I kept telling myself those words, and eventually, I did believe them.  Just like with the positive thinking, I think it takes up to a month of these affirmations to really get the full effect, but I guarantee you will start feeling better within the first week of doing this!  Once i finally started to believe what I was telling myself, I felt much happier because I didn't need other people's acceptance or love; I loved myself already.  For that reason, I also reduced my anxiety greatly because i wasn't worried about how other people thought of me because I already accepted myself.  Through this one tip, I became a happier, less anxious, and more confident person.\n\n#5 - Be grateful (don't complain or talk negatively about others)\n \n- Try to take a moment out of your day to just reflect on the things that you are grateful for.  We live in a beautiful world with wonderful people who love and care about us.  If we are complaining or bad-mouthing others, we are not being grateful.  If you have 5 minutes, watch this video: \nhttps://www.youtube.com/watch?v=3Zl9puhwiyw&amp;feature=youtube_gdata_player \n\n#6 - Work on improving yourself each day.\n\n- There is always room for improvement.  look for ways you can improve your knowledge and skills.  Know that you will be a greater version of yourself tomorrow and the following days ahead. \n\n#7 - Read and educate yourself.\n\n- Make it a habit to start reading books.  Find a good story or read about topics that interest you.  Novels are great, but I would recommend doing a lot of your reading on non-fiction books.  I personally love learning about psychology and reading how our brains work, but like i said, find subjects that don't bore you.  Self help books also provide great information on bettering your life.  I highly recommend reading \"7 Habit's of Highly Effective People\".  It has a bunch of relevant info, some of which I have used in this list.  \nThere are also a lot of great educational videos out there.  I would suggest starting with these:  \n\n- Vice TV:  www.youtube.com/vice\n\n     - Lots of interesting documentaries and videos on here.\n\n-TED Talks:  https://new.ted.com/talks\n\n     - A site filled with a bunch of great talks on various subjects\n\n- Diving Deep (Infinite Waters):  www.youtube.com/Kemetprince1\n\n     - Just a guy's youtube channel, but he has a lot of insight on how to improve your life and attitude.  I watch one\nof his videos every morning on my way to work, and it puts me in a great mood for the day!\n\nTry to reduce your time spent watching tv shows and movies, not that there's anything wrong with them, but if you are spending the majority of your free time watching tv, then you need to find a better way to spend your time.  These programs that we watch don't give us any useful information.  \nI'm not saying that you should stop watching movies and shows all together.  It's great to have your favorite shows and movies, and there's a lot of great shows and books that make us laugh and feel good.  If something makes you laugh/smile, then it isn't a waste of time.  Just don't make watching tv the only thing you do when you get home.\n\n#8 - Find something you are passionate about.\n\n- Everyone has something that they are passionate about.  Maybe you just haven't found it yet.  Go out and try new things until you find it.  Having a hobby is a great way of blowing off steam and taking your mind off of things like work.  If you can turn your passion into your work, that is a bonus!\n\n#9 - Make guidelines on how you should live your life (a mission statement)\n\n- Put some time aside to come up with your mission statement.  What are important values to you?  Always go back to your guidelines and add/refine lines as you are progressing on your journey.  I know this can be time consuming, but once you have guidelines on how to live your life, you will making decisions and behaving in ways that match with the values you have recorded.\n\n#10 - Have clear goals, and a plan on how you are going to get there.\n\n- Many of us don't have any goals in life, but would you run in a race with no goal or end point?  We need to start thinking of what we want out of life.  Where do you want to be 5 years from now?  What kind of person do you want to be?  We need things to work toward.  And don't just have big goals.  We need the small victories along the way to keep us going.  Start making a to-do list for your day, month, and even year.  It feels so good to check off the things you've accomplished.  Writing your goals down will also help to motivate you to go through with them, since it is no longer just a thought in your head.  \n\n#11 - Try and see things from other people's perspectives. \n\n- your first objective in any interaction should be to understand the other person.  Many of us can't wait to have our say, or give people our advice, and we aren't really listening or caring about what the other person has to say or how they feel.  Listen to what they are saying and try to put yourself in their position and feel how they would feel being under those circumstances.  This will greatly improve your communication with others, as well as strengthen your relationships.  \n\nWell, that's what I've got so far.  If I come up with some more useful tips, I might consider making a part 2 of this thread, but we'll see.  I hope at least some of the things i expanded on above will help you along your journey.  If anyone has anything to add, be it any good books or videos relating to anything mentioned above, or if you have some tips of your own, please share them with us! \n\nHere are some additional resources to check out that I would highly recommend:\n\n- 7 Habits of Highly Effective People:  http://www.amazon.com/The-Habits-Highly-Effective-People/dp/1451639619/ref=sr_1_1?ie=UTF8&amp;qid=1392466718&amp;sr=8-1&amp;keywords=7+habits+of+highly+effective+people\n\n- A guide to rational living:  http://www.amazon.com/Guide-Rational-Living-Albert-Ellis/dp/0879800429/ref=sr_1_1?ie=UTF8&amp;qid=1392466803&amp;sr=8-1&amp;keywords=a+guide+to+rational+living\n\n- The Power of Habit:  http://www.amazon.com/The-Power-Habit-What-Business/dp/081298160X/ref=tmm_pap_title_0?ie=UTF8&amp;qid=1392466888&amp;sr=8-1\n\nWill add more if I remember.\nThank you taking the time to read this!\n\n-Paradigm_shift1\n      ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Tips on improving your life: Reduce anxiety, stress, depression, etc.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1xz8we/tips_on_improving_your_life_reduce_anxiety_stress/"
        },
        {
            "author": "TheWhiteNoise1",
            "author_created_utc": 1306261472,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5a4ct",
            "created_utc": 1392970819,
            "domain": "self.Anxiety",
            "edited": 1392971250,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yis4u/does_anyone_get_anxiety_dealing_with_the_phone/",
            "gilded": 0,
            "id": "1yis4u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yis4u/does_anyone_get_anxiety_dealing_with_the_phone/",
            "retrieved_on": 1441903066,
            "score": 79,
            "secure_media_embed": {},
            "selftext": "Specifically, for me, I know I avoid the phone because I'm an introvert and hate talking to people on the phone. But besides that, I started getting anxiety and intrusive thoughts every time the phone rang. I never talked to my parents on the phone, and so they only called when someone died...and my dog, uncle, and grandmother all died within a short period of time so that any call after... I immediately would begin thinking someone died.\n\nTo this day, when someone calls, my first thought is why is this person calling me out of nowhere? Who could have died?\n\n\nAnother thing I do is freak out if someone doesn't text me back, particularly if I'm attracted to them. I spiral, think the friendship is over, and waste hours on end ruminating about what I had said and whether it was really funny or worth saying. It can get me really depressed.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone get anxiety dealing with the phone?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1yis4u/does_anyone_get_anxiety_dealing_with_the_phone/"
        },
        {
            "author": "Shinizter",
            "author_created_utc": 1329419683,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6xw2j",
            "created_utc": 1392662618,
            "domain": "self.Anxiety",
            "edited": 1392690060,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y5yj7/i_feel_so_much_better_and_here_is_whyhow/",
            "gilded": 0,
            "id": "1y5yj7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y5yj7/i_feel_so_much_better_and_here_is_whyhow/",
            "retrieved_on": 1441909111,
            "score": 77,
            "secure_media_embed": {},
            "selftext": "Hello everyone, i have been suffering from chronic anxiety for about 7 months now (probably pretty short compared to some other users).  It was starting to get really bad, and about a month and a half ago i started my medication. My anxiety focused pretty severely on 2 things:\n\n1. My health: I was worried that i was dying, that i had some terminal disease, or that i was going to have a heart attack and no one was going to be around to help me. \n\n2. My personal safety: In alot of situations I felt very physically threatened, and usually in these scenarios i would inevitably make up in my head, i would end up dead. Absolutely terrifying.\n\nWell i would like to confidently say I feel pretty much cured of my Chronic anxiety, especially the second fear. Here is how i was able to overcome it and convince myself that everything was going to be ok.\n\nFirst off a HUGE shout out to /u/epicshift and his post on my most recent and only post when i was mid anxiety attack:\n\n&gt;In order to understand how to clear anxiety you need to understand how the subconscious mind and anxiety works.\nSimple example:\nAt the age of 2 you're on the floor, crawling around like 2 year olds do at the neighbor's house when all of a sudden a big german sheppard gets out of it's kennel and starts running towards you barking. The owner grabs the dog before it reaches you but it scares you shitless.\nThe subconscious mind wants to protect us and because this traumatic event was your first encounter with a dog, your subconscious flags dogs as a threat to your safety. From this moment on, at the subconscious level, your brain has decided it will fire off chemicals to create a fear response when you're in the vicinity of dogs. This is COMPLETELY outside of the control of your conscious mind.\n20 years later you're 22, and you've completely forgotten about this incident yet even the smallest poodle triggers you to go into a sweaty and uncomfortable fear even though the rational conscious mind can't talk you out of it.\nThis is how anxiety is created. It's can be through trauma, repetitive behavior (often our parents), etc ...\n\n&gt;ALL forms of anxiety have a root cause. They can also be cleared.\nHow ? By using techniques such as EFT (emotional freedom technique) and NLP (neuro-linguistic-programing - techniques for communicating with the subconscious) to alter the patterns. It's EXTREMELY simple. I've seen someone completely get over 10 YEARS of agoraphobia after a single 90 minute session.\n\n&gt;Most people have 0 awareness that these services exist and that they are very easy and effective.\n\n&gt;I hope this helps ... not only cope but understand that there is a root cause of your fear AND that it is clearable.\n\nI'd say he was the first person to put into words what anxiety is and why it is there. Frankly for the longest time, i was terrified for a specific reason, but i couldnt figure out why that specific thing terrified me.  He was able to put it into words, and i was able to finally reasonably explain and rationalize my anxiety. \n\nSecondly i looked into what Timeline Therapy and NPL are, and what the process is to go through a \"session\". I HIGHLY recommend that anyone suffering from anxiety goes through and reads up on those 2 techniques. Whether or not you decide to follow through and take sessions, the ideas behind the 2 techniques just make SO MUCH SENSE.\n\nNow i personally didn't take any sessions, i started with super basic self meditation, i looked back onto my past and pin pointed every single traumatic experience that could possibly relate to the fear i now felt. This was probably one of the hardest steps for me to personally take. It took a while to admit to MYSELF that these specific events traumatized me. Memory is often an issue, like in the quote from /u/epicshift, a traumatic experience can happen while you are extremely young, so i talked to my parents and guardians and went back as far as i could to find any traumatic experiences.\n\nI looked back on those experiences and removed all negative connotations of them. This took time, however i am a strong minded individual(like i'm sure many of you are) and i feel like i conquered that really quickly. After removing the negative feelings of those traumatic experiences, i **IMMEDIATELY** felt a weight lifted off my shoulders. \n\nA big step that i am working on, and will continue to work on for some time, is convincing myself that these traumatic experiences were actually positive experiences, i subconsciously dwelled on the negative aspect of these experiences and completely ignored the positives. \n\nThe final thing i finally taught myself how to do is to **Live in the moment**. I'm sure most of you have been told to do this and for a while people would say it to me, i would respond with \"That just isn't a logical/a thing people do\". But it is, it truly is. When you have a plan for the future it alters the way you live your day to day life. Obviously if it is a good plan, a vacation for example, planning for the future isn't necessarily a bad thing. \n\nBut planning for the future and obsessing about the future are two different things. and unfortunately i can't really put that more into words or elaborate more on that, because it was a very personal rationalization. It's best to not live in the now in anticipation for the future.\n\nSorry for the wall of text and the fact that i'm an awful typist, i did my best to put it into words for people to read and hopefully to be as helpful as possible.  I am far from being rid of my anxiety, but i would have to say that i feel about 90% better, than i did even a week ago.  I am completely off my xanax, and have just finished weening myself off my zoloft and i feel amazing.  \n\n**TL;DR Look into NPL and Timeline Therapy, Live in the now, enjoy life to the fullest.**\n\n\nEDIT: As /u/twitchymite said in his comment: It happened to work quickly and efficiently for me, obviously, a disorder like anxiety can be extremely specific to the person. It worked quickly for me it can take years for another, never give up hope that you can rid yourself of your fears!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel SO much better and here is why/how, hopefully this will help others.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y5yj7/i_feel_so_much_better_and_here_is_whyhow/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392498858,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y0c0t/spent_3_months_in_a_psychiatric_hospital_uk_for/",
            "gilded": 0,
            "id": "1y0c0t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 77,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y0c0t/spent_3_months_in_a_psychiatric_hospital_uk_for/",
            "retrieved_on": 1441911795,
            "score": 75,
            "secure_media_embed": {},
            "selftext": "I'm a 29 year old male and for the past year I've had a full blown breakdown after coming off SSRI's which I was on since 17 years old. \n\nHad to move back home with my dad whilst I seemingly got worse and worse and eventually gave up. I was self harming daily to try and take my mind off the crippling anxiety and depression that I was feeling and my dad couldn't take it anymore. One night after a very bad cut, he called the police and I was taken away and sectioned. Spent 48 hours in a police cell in what they call a 'suicide suit'. Having also developed agoraphobia, I hadn't left the house for 6 months so being taken away from the safety of my bedroom to a police cell was the worst experience of my life. \n\nI was then assessed by three mental health professionals and carted over to local NHS mental health hospital where I spent 3 months. \n\nThis was last July 2013. \n\nI know that for a lot of people with anxiety, we often think 'what happens if things get so bad! Will I have to go into hospital?' \n\nI did this AMA incase anyone had any questions about what goes on in there, what they do for people with anxiety, what scary things I saw there etc. \n\nI hope it's of interest to some people to tell you about my person experience of what it's like in a UK NHS psychiatric hospital. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Spent 3 months in a psychiatric hospital (UK) for anxiety. AMA",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y0c0t/spent_3_months_in_a_psychiatric_hospital_uk_for/"
        },
        {
            "author": "Mushubeans",
            "author_created_utc": 1348359935,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_93es6",
            "created_utc": 1392689221,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y79fy/do_you_guys_ever_feel_like_youre_getting_dumber/",
            "gilded": 0,
            "id": "1y79fy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y79fy/do_you_guys_ever_feel_like_youre_getting_dumber/",
            "retrieved_on": 1441908503,
            "score": 73,
            "secure_media_embed": {},
            "selftext": "The last 5 months have been a living hell. On and off meds and having panic attacks hourly. I know that there's no way this has actually caused damage to my brain but I just feel like I'm getting progressively dumber. My memory has gone to shit, can't spell, have trouble reading, I can't think of anything to say, and my vocabulary has shrunk immensely. My speech has slowed quite a bit too and I can't finish sentences. I know I'm probably reading into it a little too much but other people have noticed. Have any of you experienced this after prolonged high stress?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you guys ever feel like you're getting dumber?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y79fy/do_you_guys_ever_feel_like_youre_getting_dumber/"
        },
        {
            "author": "Bench888",
            "author_created_utc": 1337427944,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7r9d9",
            "created_utc": 1392562228,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y28mo/do_any_of_you_get_anxiety_attacks_while_youre/",
            "gilded": 0,
            "id": "1y28mo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y28mo/do_any_of_you_get_anxiety_attacks_while_youre/",
            "retrieved_on": 1441910846,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "Well here I am, watching the Olympics, just for shits n giggles. And out of nowhere I get the typical cold feet, hands. Nausea, high heart rate, slight shakiness, and feeling of doom surrounding me. Do any of you get these types of panic/anxiety attacks?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do any of you get anxiety attacks while you're sitting around (playing games, watching tv?)",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y28mo/do_any_of_you_get_anxiety_attacks_while_youre/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392600054,
            "domain": "self.Anxiety",
            "edited": 1392656394,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y3tct/i_dont_know_how_to_get_rid_of_my_biggest_fear/",
            "gilded": 0,
            "id": "1y3tct",
            "is_self": true,
            "media_embed": {},
            "num_comments": 75,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y3tct/i_dont_know_how_to_get_rid_of_my_biggest_fear/",
            "retrieved_on": 1441910111,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "As long as I can remember I've always been haunted with that thought :'' Omg someday I will die, I will be no more'' Even sometimes in the middle of the night Ill wake up in panic running around in my appartment holding my face with both my hands saying Nooo noonooooo omg I don't ever want to die. I don't want to cease to exist, its really taking all of my energy and haunting me 24/7. Its been more than 20+ years, i need to get this out. I need to move on. \n\nEdit: Thanks to everyone who replied here and gave me some support. Sorry for the syntax and ortograph should have said at first im french to avoid some cringe reactions from native english speaker ;p\n\nEdit#2: Wow I cant believe so many people go through the same than me. Thankyou to every one and each one of you for your replies. I am definitely seeking help at the moment looking for some therapist. Unfortunately I have to take care of my physical health as well in the same time. Getting surgery next week. Im only 25 and its my 3rd surgery for different health problems.... it certainly feeds my fear of death in a way. Thankyou so much everyone xxxxxxxxxxx",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I don't know how to get rid of my biggest fear ever. My own death.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y3tct/i_dont_know_how_to_get_rid_of_my_biggest_fear/"
        },
        {
            "author": "nansafran",
            "author_created_utc": 1392350613,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f9mwu",
            "created_utc": 1392597928,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y3q22/just_a_small_tip_to_cope_grounding_yourself/",
            "gilded": 0,
            "id": "1y3q22",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y3q22/just_a_small_tip_to_cope_grounding_yourself/",
            "retrieved_on": 1441910153,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "This is my first time posting in any sort of reddit format. I recently discovered the joy of reddit and great subreddits like this one. \n\nShort bio: I have had extreme anxiety for the past couple years and I have found many ways to cope with it. \n\nThe technique I will be describing is called \"Grounding Yourself\"\nSay you are in a meeting, sitting in a classroom, or just talking with a friend and your anxiety levels are slowly rising. In these situations it is hard to escape or take a step back without making a scene. So what I do is I ground myself. I take a deep breathe, and in my mind, I start to describe things in the room to myself. I'll analyse a desk, count how many blue things are in the room, or see if I can find all the objects in the room that start with the letter \"A\".\nIt keeps your brain distracted while you sit your way through a panic attack or any moment of intense anxiety. \n\nI hope this helps :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just a small tip to cope: Grounding Yourself",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y3q22/just_a_small_tip_to_cope_grounding_yourself/"
        },
        {
            "author": "floofy_bunny",
            "author_created_utc": 1390943067,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f0sm7",
            "created_utc": 1392753774,
            "domain": "flickr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y9qnl/every_time_im_forced_to_socialise_lol/",
            "gilded": 0,
            "id": "1y9qnl",
            "is_self": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y9qnl/every_time_im_forced_to_socialise_lol/",
            "retrieved_on": 1441907285,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/ZO-lcvzVb-mlkld4.jpg",
            "title": "Every time I'm forced to socialise... Lol",
            "url": "http://www.flickr.com/photos/gemmacorrell/6425407653/"
        },
        {
            "author": "missusmoonwinkle",
            "author_created_utc": 1379209177,
            "author_flair_css_class": "",
            "author_flair_text": "Agoraphobia/panic disorder/depression/derealisation",
            "author_fullname": "t2_d5nnf",
            "created_utc": 1392941120,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yhm5d/went_inside_the_grocery_store_this_week/",
            "gilded": 0,
            "id": "1yhm5d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yhm5d/went_inside_the_grocery_store_this_week/",
            "retrieved_on": 1441903610,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "With my SO and mother, had to leave at the tills, but still! Considering i dont leave my house i think i did pretty well :D Managed to cope well enough to choose some food items too! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Went inside the grocery store this week!",
            "url": "http://www.reddit.com/r/Anxiety/comments/1yhm5d/went_inside_the_grocery_store_this_week/"
        },
        {
            "author": "Coralblues",
            "author_created_utc": 1392820537,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fclh0",
            "created_utc": 1392822761,
            "domain": "self.Anxiety",
            "edited": 1393447664,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yci0k/terrified_of_my_new_job/",
            "gilded": 0,
            "id": "1yci0k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yci0k/terrified_of_my_new_job/",
            "retrieved_on": 1441905998,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "Hello there. \nI just started my new job this week and it feels like the worst situation I have ever experienced in my whole life. Even though I should be very happy because I was unemployed for 1,5 years all my anxieties seem to emerge at the same time. \n\nI feel way too stupid for this job, even though I'm highly overqualified. \nThe next minute I think they make fun of me because they all have better jobs than me.\nIt's my third day at work and I feel like people don't like me because I am weird and say stupid things. \nI can't sleep anymore at night and I am so tired at work.\n\nAll in all I feel like I don't deserve a job because I am too weird, too stupid and not at all a useful member of this society. \nI am a fraud in disguise (but I still think I look normal).\n\nI am so scared I will make mistakes as this is probably my last chance jobwise.\n\nI've never had a therapy and live a totally normal life apart from continuing job problems. My friends, boyfriend and family like me a lot and they've supported me financially.\n\nI just feel I can't fit into society, I am very introverted and scared to death of meeting new people. My whole body is only a frozen mass :-(\n\n\n\n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Terrified of my new job",
            "url": "http://www.reddit.com/r/Anxiety/comments/1yci0k/terrified_of_my_new_job/"
        },
        {
            "author": "Fruitloopes",
            "author_created_utc": 1377027761,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ctx30",
            "created_utc": 1392665444,
            "domain": "self.Anxiety",
            "edited": 1392696468,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1y63a1/anyone_ever_had_derealization/",
            "gilded": 0,
            "id": "1y63a1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1y63a1/anyone_ever_had_derealization/",
            "retrieved_on": 1441909049,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Could you explain how it feels, I've had it before and it's utter hell. \n\nI just want to see how people explain it and what happens when they get it. Seems like I usually get it in crowds, night time, places or situations I'm unfamiliar with.\n\nThanks.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone ever had 'derealization'?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1y63a1/anyone_ever_had_derealization/"
        },
        {
            "author": "garshara",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392964579,
            "domain": "self.Anxiety",
            "edited": 1393017338,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yilyf/how_does_anxiety_effect_your_vocabulary/",
            "gilded": 0,
            "id": "1yilyf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yilyf/how_does_anxiety_effect_your_vocabulary/",
            "retrieved_on": 1441903147,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I notice that I begin sentences with \"I think\", or \"Maybe\" or some way of avoiding a permanent declaration. \"I feel\" is another one. Do you have any others? Speech or written word.\n\nEdit:\n\nI am really glad that this thread got so many responses because I knew I wasn't the only one for who anxiety effected my vocabulary. The way we speak really reflects our state of mind, and anxious people don't like to get themselves cornered in conversations. \"I guess\"es and \"Maybe\"s and starting sentences with \"I feel/I think\" leave me with a way out of feeling shame - after all, I was never positive, it was only a maybe. Or, I only THOUGHT something, I didn't say it was written in stone.\n\nI don't think these are BAD to say, I just think that the anxious person uses them more often than the non-anxious person does and I am still not sure exactly why.\n\nKeep them coming, it's interesting how many of your examples I've used myself!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How does anxiety effect your vocabulary?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1yilyf/how_does_anxiety_effect_your_vocabulary/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392830847,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1ycwb7/rant_anxiety_when_not_understanding_things/",
            "gilded": 0,
            "id": "1ycwb7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1ycwb7/rant_anxiety_when_not_understanding_things/",
            "retrieved_on": 1441905812,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I hope this doesn't sound stupid! I've recently started university and I'm frequently overwhelmed by my assignments.\n\nWhenever I get the feeling that I don't understand something my head seems to shut down completely. My heart starts racing, I don't understand even the simplest things anymore, I feel like the best choice would be dropping out and I'm starting to hate myself for being so stupid.\n\nNow the only thing so far that's helping is to stop working and do something else for a while. Usually I just lay down and try meditating a little. These breaks really interrupt my studying because it takes me 30 minutes to an hour to calm down. Afterwards, most of the time I realize that it has actually been a really stupidly simple problem. And it doesn't help that I have these attacks every few hours while studying. I'm wasting so much time with being scared of things I don't even need to be scared of.\n\nIt's not nearly as bad as before I started with my medication but it sucks big time. How am I supposed to be productive if I keep freaking out because things are not as easy as they were in school?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] Anxiety when not understanding Things",
            "url": "http://www.reddit.com/r/Anxiety/comments/1ycwb7/rant_anxiety_when_not_understanding_things/"
        },
        {
            "author": "rme_2001",
            "author_created_utc": 1311249398,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5jotj",
            "created_utc": 1392460216,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1xz2m8/powerful_ted_talk_about_anxietypanic_by_summer/",
            "gilded": 0,
            "id": "1xz2m8",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "TEDxTalks",
                    "author_url": "http://www.youtube.com/user/TEDxTalks",
                    "description": "Summer Beretsky enjoys writing about her experiences with anxiety, panic, and Paxil. She had her first panic attack as an undergrad at Lycoming College and plenty more while she worked toward her M.A. in Communication from the University of Delaware.She wears many hats.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FS8FNcOBkhN4%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DS8FNcOBkhN4&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FS8FNcOBkhN4%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i1.ytimg.com/vi/S8FNcOBkhN4/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Anxiety: Hibernate, Adapt, or Migrate: Summer Beretsky at TEDxWilliamsport",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=S8FNcOBkhN4",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FS8FNcOBkhN4%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DS8FNcOBkhN4&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FS8FNcOBkhN4%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1xz2m8/powerful_ted_talk_about_anxietypanic_by_summer/",
            "retrieved_on": 1441912384,
            "score": 22,
            "secure_media": {
                "oembed": {
                    "author_name": "TEDxTalks",
                    "author_url": "http://www.youtube.com/user/TEDxTalks",
                    "description": "Summer Beretsky enjoys writing about her experiences with anxiety, panic, and Paxil. She had her first panic attack as an undergrad at Lycoming College and plenty more while she worked toward her M.A. in Communication from the University of Delaware.She wears many hats.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FS8FNcOBkhN4%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DS8FNcOBkhN4&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FS8FNcOBkhN4%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FS8FNcOBkhN4%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "Anxiety: Hibernate, Adapt, or Migrate: Summer Beretsky at TEDxWilliamsport",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=S8FNcOBkhN4",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FS8FNcOBkhN4%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DS8FNcOBkhN4&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FS8FNcOBkhN4%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/OmIkxZBOwP9ysblT.jpg",
            "title": "Powerful TED talk about Anxiety/Panic by Summer Beretsky",
            "url": "https://www.youtube.com/watch?v=S8FNcOBkhN4"
        },
        {
            "author": "feyek",
            "author_created_utc": 1364809436,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b5ben",
            "created_utc": 1392771788,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yaoce/a_drawing_for_unecurata_who_described_his_anxiety/",
            "gilded": 0,
            "id": "1yaoce",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yaoce/a_drawing_for_unecurata_who_described_his_anxiety/",
            "retrieved_on": 1441906849,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://e.thumbs.redditmedia.com/QupR7g7OBMxBUBcd.jpg",
            "title": "a drawing for /u/necurata who described his anxiety as having a \"giant bee hive in my brain\". I hope this helps you explain things better to people that don't understand.",
            "url": "http://imgur.com/FfHu1Dq"
        },
        {
            "author": "smeckledorffed",
            "author_created_utc": 1365117553,
            "author_flair_css_class": "",
            "author_flair_text": "Hypochondria l GAD I Depression",
            "author_fullname": "t2_b76lq",
            "created_utc": 1392807714,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yc111/dae_get_internal_tremors/",
            "gilded": 0,
            "id": "1yc111",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yc111/dae_get_internal_tremors/",
            "retrieved_on": 1441906218,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "After waking up some mornings I'll feel a rapid \"shaking\" but on the inside. Almost like shivering bit I'm not cold. In fact I'm usually warm. I just woke up from a nights sleep but I had a nightmare. Normally I don't but I think that made it worse. I just got a new apartment and I just woke up feeling so alone and vulnerable. Idk if that's just me or my anxiety but I was just curious if anyone has similar sensations. I'd love to know I'm not alone in dealing with this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get internal tremors?",
            "url": "http://www.reddit.com/r/Anxiety/comments/1yc111/dae_get_internal_tremors/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1392801779,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1ybw3n/just_posting_this_gives_me_anxiety/",
            "gilded": 0,
            "id": "1ybw3n",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1ybw3n/just_posting_this_gives_me_anxiety/",
            "retrieved_on": 1441906282,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "Okay this might be a long one, lol.\n\nI'm gonna start with my step-dad. He is bipolar, verbally abusive, and an alcoholic. I don't want to say that I'm \"scared\" of him, but I hate to leave my room when we're alone in the house. He's never touched me, or hit me, or anything like that, thank goodness, and he's never even picked on me when my mom was gone. But I hate when he acts like we're good pals. We're not. I'd go so far as to say we hate each other. We fight over my mom like we're siblings. He makes me feel like my relationship with her is gross and inappropriate. He loves to confirm their \"romantic bedroom plans\" in front of me, like he's bragging or something. Sometimes I sit in my room for hours with a full bladder and painful growling stomach because I'm so scared to leave my room. Once, I walked in on him peeing, because he didn't shut the door all the way and I thought it was available. He just stared through me. He was completely trashed. He'll come in and out late at night, and I'll be too scared to lock the doors because he gets really mad when I lock him out. He thinks I do it on purpose. He thinks I do a lot of stuff I don't do, or don't do on purpose. Sometimes when he's yelling at me and my mom, I start laughing because I don't want to cry, and that only makes him worse. \n\nMe and my mom have a best friend type relationship. I am her youngest, and she treats me like a baby, which doesn't help the situation. Sometimes when I cry, it's because she tries to coddle me when he lists all my failures.\n\nI have a sister whose about ten? years older than me, and she has a temper. Once, I accidentally spilled water on her floor and she yelled at me. Now she wonders why I shake when I'm alone with her, and why I can't talk to her on the phone, or text her. I love her so much, and she's a great sister. But she's very unpredictable. She tries to tell me to respect my step-dad, that he really tries and that he does love me. It makes me so mad, because my dad was her step-dad, and she used to scream back and put holes in walls when they fought. I've never lost my temper like that. \n\nI cannot talk on the phone, my mom is the only person I can talk to on the phone. My best friend is the only person I can text without shaking. I love playing video games, and I love reading, and I have a great sense of humor. I say this, because I think I'd be great in a relationship, except I can't talk to guys. I get so scared. I think it's because I was bullied in middle school, so much so that I dropped out in the sixth grade. Now I'm so scared of failing the GED test over and over and over that I won't even try... I failed my driver's test just as I started it, and I've been scared of getting back on that horse...\n\nMy step-dad thinks he motivates me, but telling me what a failure I am does not in any way motivate me. I just want to hide in my room...And I know I can't, and I make myself sick with all this stress. I like to tell myself I'm going to be so independent, that I'll never need a man to fix my car, or pay my bills, or give me medical/car insurance, but I am not in any way, independent... \n\nThe thing is, if I'm alone in public, I can buy my own movie tickets, or order my own food. So it's like half of me is this anxious little child, and the other half isn't. Anyway, it felt good to get this stuff off my chest. Tomorrow I might totally freak out and delete this, but tonight I feel good. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Just posting this gives me anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/1ybw3n/just_posting_this_gives_me_anxiety/"
        },
        {
            "author": "feyek",
            "author_created_utc": 1364809436,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b5ben",
            "created_utc": 1392955134,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/1yi910/i_had_a_job_interview_this_morning_this_is_how_i/",
            "gilded": 0,
            "id": "1yi910",
            "is_self": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/1yi910/i_had_a_job_interview_this_morning_this_is_how_i/",
            "retrieved_on": 1441903314,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/zWXtr17ijQyDfllN.jpg",
            "title": "I had a job interview this morning - This is how I was feeling the entire time.",
            "url": "http://imgur.com/pxU748g"
        }
    ]
}