{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404495407,
            "domain": "jessiedoodles.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29u9ze/found_a_comic_that_i_thought_some_of_us_could/",
            "gilded": 0,
            "id": "29u9ze",
            "is_self": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29u9ze/found_a_comic_that_i_thought_some_of_us_could/",
            "retrieved_on": 1441282995,
            "score": 274,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/rgMx0YDxXHpygUm8.jpg",
            "title": "Found a comic that I thought some of us could relate to.",
            "url": "http://jessiedoodles.tumblr.com/post/90594526638/why-does-it-take-actual-effort-to-sound-calm-and"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404600786,
            "domain": "self.Anxiety",
            "edited": 1404854482,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29xfuu/i_just_got_out_of_the_hospital_its_gonna_be_okay/",
            "gilded": 0,
            "id": "29xfuu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29xfuu/i_just_got_out_of_the_hospital_its_gonna_be_okay/",
            "retrieved_on": 1441281519,
            "score": 104,
            "secure_media_embed": {},
            "selftext": "Hey y'all,\n\nI just got out of my stint in the  psychiatric unit of my local hospital.  After having multiple panic attacks per day I checked myself in.  My doctor said my anxiety was the worst he's seen since he graduated medical school nearly 20 years ago.  \n\nI haven't worked in more than 2 years.  I used to be the dude that could go anywhere, do anything.  Now, I could barely leave the house.  \n\nLong story short, my anxiety had crippled me to the point that I'm on disability and made it nearly impossible to go outside.  Just walking to 7-11 would result in a borderline panic attack.  \n\nAfter some intensive therapy and lots of support, I feel better.  I'm not cured and never will be, but at least I can manage going to the store!  \n\nBeing afraid sucks, having severe anxiety is no walk in the park but just wanted to shout out to my doctors, nurses and friends, you know who you are.  All y'all have quite literally saved my life!\n\n\n**EDIT**:  Thanks for all of the support!  You have no idea how much this means to me.  The last two years have been a **huge** struggle and it's nice to know people care.  Thanks again yall\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I just got out of the hospital. It's gonna be okay.",
            "url": "http://www.reddit.com/r/Anxiety/comments/29xfuu/i_just_got_out_of_the_hospital_its_gonna_be_okay/"
        },
        {
            "author": "AnxiousBlogger",
            "author_created_utc": 1404083472,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h6svs",
            "created_utc": 1404153346,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29hsgt/anyone_else_find_it_hard_to_hold_down_a_job_with/",
            "gilded": 0,
            "id": "29hsgt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 90,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29hsgt/anyone_else_find_it_hard_to_hold_down_a_job_with/",
            "retrieved_on": 1441288883,
            "score": 95,
            "secure_media_embed": {},
            "selftext": "Why is it so hard to just have a normal job?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else find it hard to hold down a job with anxiety/panic disorder?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29hsgt/anyone_else_find_it_hard_to_hold_down_a_job_with/"
        },
        {
            "author": "somethingnew__",
            "author_created_utc": 1401147622,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gq77j",
            "created_utc": 1404203437,
            "domain": "self.Anxiety",
            "edited": 1404237331,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29jr2p/posting_commenting_on_reddit_makes_me_anxious/",
            "gilded": 0,
            "id": "29jr2p",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29jr2p/posting_commenting_on_reddit_makes_me_anxious/",
            "retrieved_on": 1441287968,
            "score": 73,
            "secure_media_embed": {},
            "selftext": "Common thoughts that go through my mind are:\n\nIs my post interesting?\nIs it original (not a repost)?\nDoes it offend anyone?  Especially so if I appear to get downvotes, I wonder what I've said that is wrong.\n\nI often don't write anything at all because of these worries, and the same anxieties apply to this post, but I'm going for it.  This is my first draft, so what is written here is completely unedited, so as so not let my anxieties gain any hold on what I write.\n\nEdit: I forgot to put this too: I always try to put the right or correct opinion.  I've been noticing recently that I skip over the learning part to form my own opinion and just go with the opinion I see as correct.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Posting + commenting on reddit makes me anxious",
            "url": "http://www.reddit.com/r/Anxiety/comments/29jr2p/posting_commenting_on_reddit_makes_me_anxious/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404698010,
            "domain": "self.Anxiety",
            "edited": 1404698206,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a0hhq/zoloft_just_kicked_in_and_feeling_wonderful/",
            "gilded": 0,
            "id": "2a0hhq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a0hhq/zoloft_just_kicked_in_and_feeling_wonderful/",
            "retrieved_on": 1441280099,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "I've been posting here a lot about my experiences starting Zoloft after a bout with severe panic, anxiety and some depression kept me out of work for two weeks resulting in a hopeless state of despair and fear.\n\nI began on 25 mg on Zoloft and didn't feel much of anything for 8 - 10 days, and then felt some relief. I was still anxious often and panicky at times, but it wasn't constant and the depression/depersonalization \"fog\" lifted.\n\nI then moved up to 50 mg Zoloft after about three weeks. For the first 3 days, I won't lie, I experienced elevated anxiety and constantly sleepy. I had also been taking klonopin throughout this process and the combination of the two drugs caused me to sleep for 14 hours a day or more.  I worried that I was \"losing progress\" or going back to my old state of anxiety/panic/fog.\n\nMy therapist told me to resist the urge to sleep and to stay active. I took his advice, although at times I felt completely miserable because of the fatigue and just wanted to hide in bed. Sometimes I did just hide in bed, but I made a trip to a friend's lake, another trip to the beach in a group, and went to a bar to watch a soccer game. I tried my best to stay active, with some setbacks and some victories.\n\nThis weekend, I feel like the med suddenly began to kick in (8 days into taking it). The fatigue is gone, no more fog, and I feel like I am a huge step closer to being \"Me\" of many years ago before I even had anxiety. I went to the beach and played frisbee in the waves with my friends, stopped on the way home for a huge lobster dinner, spent another day grilling and having fun by the pool and making Smores. My phobias in the past would have prevented me from doing or enjoying any of these things. The past two days I have felt \"free\". \n\nI have also begun to phase out the klonopin with no issues. Down to 1/2 pills (they are only .5 mg anyway).\n\nI wanted to post here to encourage those thinking about trying meds or in the process because I feel it saved my life in a way. \n\nHoping for peace and patience for everyone on this board tonight. We will all get there :) \n\nI also want to add that I found meditation EXTREMELY helpful while starting the med / increasing the dose to get me through periods of anxiety. I have started using it as a coping mechanism when needed and it is awesome. I also do it regularly once per night. I have heard there is some science behind it actually changing the brain to encourage more mindfulness / present moment thought patterns and less anxiety about the past/future. Not sure about the science of it, but it is definitely helping me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Zoloft just \"kicked in\" and feeling... wonderful!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a0hhq/zoloft_just_kicked_in_and_feeling_wonderful/"
        },
        {
            "author": "instantrobotwar",
            "author_created_utc": 1240872009,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3gmht",
            "created_utc": 1404747976,
            "domain": "self.Anxiety",
            "edited": 1404748173,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a218t/ive_developed_severe_anxiety_and_panic_attacks/",
            "gilded": 0,
            "id": "2a218t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a218t/ive_developed_severe_anxiety_and_panic_attacks/",
            "retrieved_on": 1441279375,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "Hi all. [trigger warning].\n\nFor the past 6-12 months, for no reason, I've been getting increasingly phobic, with horrible feelings of terror and impending doom while doing normal things. \n\nI first noticed that I felt increasingly afraid of being on airplanes, because I kept imagining they would crash very vividly, and I couldn't convince my brain that it wouldn't happen. Slowly it has been coming into other areas of my life - I live in Switzerland and I'm afraid of driving off a cliff or the road collapsing when we drive through the small, windy mountain roads. I feel impeding doom (fuck this feeling) and I freak out and have to get out of the car if I can. I can't sleep in the dark anymore because every noise and movement of shadow turns into a monster in my mind, and I've been sleep deprived for many months. I can't even get dental work done, because if anything comes towards my mouth I start panicing, sobbing and we have to reschedule. \n\nIt seems to be highly tied to my imagination and visual stimulus. Someone also told me they all seem to be tied to claustrophobia and not being in control of the situation.\n\nLogically, in my mind, I know nothing bad is going to happen. I know I will be fine. But I'm SO AFRAID OF PANICING. I know I will panic, and I do, and it sucks so fucking much. The extreme terror is so bad I can't even describe it. I feel like I'm left as an exhausted shell of a person after an attack.\n\nAnd I know it's just fear, and I'm just afraid of fear, but I can't seem to fucking do anything about it! I exercise, I eat well, I have friends and family, I have a great relationship with my husband, I have a good job, I do yoga and meditate and constantly try to express and better myself. I regularly do Cognitive Behavioral Therapy, exposure therapy, reading books, etc. (and have tried Tyrosine, Rhodiola Rosea and DLPA), to try and combat all of these feelings - I do it when sane like I'm supposd to, but it doesn't seem to help when I panic. \n\nWhat the hell happened to me? 2 years ago I got on an airplane from California to Europe and had no problems. I had cavities drilled with no problems except slight annoyance. I was even an adrenaline junkie - I went on roller coasters, mountain biked and road biked at dangerous speeds, I liked to swim out in the ocean too far, I've gone canyoning and rappelling (130 feet down a cliff wall was my biggest rappel), went on dangerous fair rides, which now I can't even walk near them because I'm afraid they'll snap and fall over into the crowd. I can't do these things anymore. :(\n\nI kind of feel like I had a great life, then died and been thrust into limbo and forced to come to terms with suffering, pain, terror and dying, and I just can't cope with it. \n\nI don't know how this can even happen. I thought anxiety was something that you developed in childhood. I thought it couldn't happen to a normal person unless they went through something traumatic (like PTSD). How could this happen to a normal person, coming out of nowhere?\n\nMy leading theory (but which I feel is pretty much bullshit) and some relevant info - I've been depressed for most of my life. I was on an antidepressant for most of 2013. For the first time in my life, I'm legitimately happy, and my emotions are not so horrendously painful. I kind of wonder if I've developed this extreme anxiety because I'm happy, and now I have to learn to cope with loss. Before this, I was ok with dying, because I felt I had no future and had nothing to live for. \n\nAny ideas or similar experiences?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've developed severe anxiety and panic attacks over the past 6-12 months, for seemingly no reason at all, and no signs of letting up. How could this happen? I was a normal person 2 years ago, and now I can't get through normal activities without severe panic-attacks.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a218t/ive_developed_severe_anxiety_and_panic_attacks/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404662356,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29z2r6/my_mom_just_cant_accept_that_i_have_anxiety_over/",
            "gilded": 0,
            "id": "29z2r6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29z2r6/my_mom_just_cant_accept_that_i_have_anxiety_over/",
            "retrieved_on": 1441280756,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "Basically, a friend of my parents is wondering if I am interested in a job.  I'm not thrilled about it but I would accept if it was close to my house.\n\nIts a lengthy commute with really horrible traffic.  I went and did a test run and I got incredibly anxious.  I told my mom I just couldn't do it and she went ballistic.  I went to a therapist the other day and he told me that I'm the type of person who needs to avoid stressful situations and that I need to do things that really interest and excite me.  I told my mom what the therapist said and she said he was a quack.  My mom is the one who made me go to this therapist in the first place!\n\nShe thinks she is right 100% all the time.  I cant take it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My mom just can't accept that I have anxiety over certain things",
            "url": "http://www.reddit.com/r/Anxiety/comments/29z2r6/my_mom_just_cant_accept_that_i_have_anxiety_over/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404252119,
            "domain": "self.Anxiety",
            "edited": 1404326496,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29ll4u/whats_the_funniest_or_most_fun_thing_about_your/",
            "gilded": 0,
            "id": "29ll4u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 95,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29ll4u/whats_the_funniest_or_most_fun_thing_about_your/",
            "retrieved_on": 1441287112,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "I find making light of anxiety to br beneficial.  After all it can't kill you so why not make it a joke? When I think about it it is really a funny illness. I fear fear so much that it causes me irrational fear.  I'm terrified of panic so I panic it's actually hilarious if you thibk about it. I try to enjoy the fear as much as possible,  people pay good money to sky dive and bungee jump to feel the fear I feel sitting at my desk at work.  Im an adrenaline junkie that doesn't have to leave the house.\n\nLet's make our anxiety something positive (or funny) what's your funniest symptom or what's the best about anxiety for you? Just trying to keep it light :)\n\nEDIT: Thanks for all the replies and sharing everyone. Here's a funny one about mine, being anxious about going \"crazy\" makes me look up symptoms and drive myself to the point of going \"crazy\" before I realize that I am just applying every vague thought to a symptom.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "What's the funniest (or most fun) thing about your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29ll4u/whats_the_funniest_or_most_fun_thing_about_your/"
        },
        {
            "author": "legpainburner",
            "author_created_utc": 1403467325,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h376m",
            "created_utc": 1404663150,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29z3sm/constantly_scared_of_getting_in_trouble/",
            "gilded": 0,
            "id": "29z3sm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29z3sm/constantly_scared_of_getting_in_trouble/",
            "retrieved_on": 1441280743,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "Today I realized that a good percentage of my social and communications issues come from the idea that I believe I'll somehow \"get into trouble\" if I do or say the wrong thing. I don't know if this is true or not, but when I was a kid (13-21) any time I told my folks I was making a change in my life, they'd blow up at me.\n\n\nIf I was getting a new job, it'd be a screaming match about how I shouldn't have quit my old job. If I was going to spend the weekend with my girlfriend, it'd be about how they hated my girlfriend and I should be studying instead. Any time I changed something, I'd get yelled at, and then if I thought about it and decided to change back, I'd get yelled at again. For the past two years they've been switching between \"if you want to go to grad school after you just left undergrad you're an ungrateful little shit\" and \"if you don't go to grad school you'll never get a job because your degree is useless\".\n\n\nThey hate my girlfriend because she was born and raised in a town my band and I got mugged in once. The mugging wasn't actually that scary, and I handled it better than most of the people there. Gearing up to tell my folks about it was so scary it physically hurt, which none of the people in the band understood. \n\n\nI don't know if this actually made a difference in the way I view people but for some reason I see authority figures, professors, cops, even guys who are younger than me but more confident as \"scary\" and I feel like if I do the wrong thing I'm constantly going to get yelled at or get in trouble. This whole past year I'd skip appointments with professors because I thought my work wasn't good enough and I'd get yelled at. I avoid driving as much as possible because I'm afraid I'll get stopped by the police or someone on the road will think my driving isn't good enough.\n\n\nThing is, I love my parents, and they're not like this all the time, only when I try to change something happening in my life. How the fuck do I get over this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Constantly scared of \"getting in trouble\".",
            "url": "http://www.reddit.com/r/Anxiety/comments/29z3sm/constantly_scared_of_getting_in_trouble/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404408769,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29r8qu/nsfw_im_pretty_sure_my_anxiety_has_prevented_me/",
            "gilded": 0,
            "id": "29r8qu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 36,
            "over_18": true,
            "permalink": "/r/Anxiety/comments/29r8qu/nsfw_im_pretty_sure_my_anxiety_has_prevented_me/",
            "retrieved_on": 1441284413,
            "score": 50,
            "secure_media_embed": {},
            "selftext": "Title basically says it all. I'm a 24 year old female, and I've never had an orgasm. In fact, I don't even masturbate because I feel like it never goes anywhere so there's no point in wasting my time. Sex feels great, but I'll never climax. For most of my life I've just sort of accepted that I may be one of those people who will never experience an orgasm. \n\nWell, I don't want to be that person anymore because I think I realize now that my constant anxiety is almost like a mental barrier preventing me from release. I used to think I had no sex drive, and now that I have a much higher sex drive than I used to I'm enjoying sex a lot more, but I still can't get over that stupid barrier and have an orgasm. I can get so close, too. I know that it's just right there within my reach but I never get there. \n\nIt's frustrating for my girlfriend, too, because she thinks she's not doing a good job. She's actually the best sexual partner I've ever had, but she feels inadequate because I can't orgasm. Believe it or not that doesn't add too much pressure on me because I've explained it to her. Most of the pressure comes from being frustrated with myself. It's nearly impossible to relax completely during sex. I'm always wondering if she's okay down there or if I taste okay, maybe I didn't shave close enough or I missed a spot. All these stupid thoughts going through my head that I can't get rid of even when my girlfriend is making me feel fucking amazing. I just want those thoughts to piss off for a little while, you know? \n\nDoes anyone have any tips for how you handle anxiety during sex? Not to be frank, but I feel like I'm more than due for an orgasm. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "nsfw",
            "title": "[NSFW] I'm pretty sure my anxiety has prevented me from ever having an orgasm. How can I deal with this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29r8qu/nsfw_im_pretty_sure_my_anxiety_has_prevented_me/"
        },
        {
            "author": "Hadabreakthrough",
            "author_created_utc": 1404302915,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h80hs",
            "created_utc": 1404305422,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29n9sn/i_just_had_a_major_breakthrough/",
            "gilded": 0,
            "id": "29n9sn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29n9sn/i_just_had_a_major_breakthrough/",
            "retrieved_on": 1441286265,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I was finally able to step back and examine the root causes of my social anxiety and really understand where it comes from. For me my fears and anxieties come from assuming something negative will happen to me. I feel silent judgement from every stranger I walk past on the street even though I know logically it's all in my head and that in reality they barely notice my existence.\n\nI realized that I had a shallow opinion of people and that I measure my self worth, my value as a person based on that opinion. I don't believe these views were something I was born with but rather something I learned from my bad childhood. I was bullied a lot and told I was worthless which has made me afraid to be around people. I fear going back to that state of helplessness and being treated like nothing. So I avoid people. I can't embarrass myself or be thought less of by other people if I just avoid other people all together.\n\nFor me it goes back to having no self esteem and no self worth. I try to find value in myself by other peoples and my parents validation of me. I should have no natural fear of people especially strangers because they don't know me. If they make a shallow surface judgement of me as a person that shouldn't affect me internally. I shouldn't place value and truth in that judgement. Assuming the worst scenario could happen puts me into a state of fear, panic and anxiety. I feel anxiety because I am constantly flinching from imagined threats to my self esteem.\n\nMy lack of self esteem came from poor parenting. I was made to feel utterly worthless every time I misbehaved or broke something. I was always treated like an adult that should already be aware of their actions rather than the small helpless child I actually was. I rationalized away their absurd behavior for many years.\n\nI was spanked hard several times when I did something wrong. In my mind it was like \"well I misbehaved of course that should happen.\" It took a long time to understand how toxic that view was. You don't try to modify the behavior of a small helpless child with violence. We don't treat animals that way.\n\nImagine if the dog pooped in the house. Well I'm angry and that's wrong. So I'm going to kick him hard and ignore his cries and whimpers because he has to learn.\n\nThat was the view I had growing up about my own abuse. There was plenty of shouting, screaming and verbal abuse as well. Even now I'm so quiet and try to make as little noise as possible because of the implications it had when I was a child. I never had a voice. When my parents were angry or upset my opinions never mattered. If I ever tried to speak up for myself they would simply scream back \"how dare you talk back to me.\" Thus I spent years not talking back to anyone and just taking the abuse because that's what I was taught to do.\n\nHopefully this post resonates with a few other people who struggling to understand where their anxieties come from.   \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just had a major breakthrough",
            "url": "http://www.reddit.com/r/Anxiety/comments/29n9sn/i_just_had_a_major_breakthrough/"
        },
        {
            "author": "MaxMouseOCX",
            "author_created_utc": 1379621555,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_d7u8t",
            "created_utc": 1404675379,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29zl24/were_addicted_to_thoughts_theyre_our_drug/",
            "gilded": 0,
            "id": "29zl24",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "Tragedy &amp; Hope",
                    "author_url": "http://www.youtube.com/user/tradgedyandhope",
                    "description": "An important message that will ring true too many people, spoken by the late philosopher Alan Watts. Audio Courtesy of: alanwatts.org Created by Tragedy &amp; Hope",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FemHAoQGoQic%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DemHAoQGoQic&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FemHAoQGoQic%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i1.ytimg.com/vi/emHAoQGoQic/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "The Mind - Alan Watts",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=emHAoQGoQic",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FemHAoQGoQic%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DemHAoQGoQic&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FemHAoQGoQic%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29zl24/were_addicted_to_thoughts_theyre_our_drug/",
            "retrieved_on": 1441280519,
            "score": 37,
            "secure_media": {
                "oembed": {
                    "author_name": "Tragedy &amp; Hope",
                    "author_url": "http://www.youtube.com/user/tradgedyandhope",
                    "description": "An important message that will ring true too many people, spoken by the late philosopher Alan Watts. Audio Courtesy of: alanwatts.org Created by Tragedy &amp; Hope",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FemHAoQGoQic%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DemHAoQGoQic&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FemHAoQGoQic%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FemHAoQGoQic%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "The Mind - Alan Watts",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=emHAoQGoQic",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FemHAoQGoQic%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DemHAoQGoQic&amp;image=http%3A%2F%2Fi1.ytimg.com%2Fvi%2FemHAoQGoQic%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/rJ5UV5fdDH_u2Cx2.jpg",
            "title": "We're Addicted to thoughts... they're our drug.",
            "url": "http://www.youtube.com/watch?v=emHAoQGoQic"
        },
        {
            "author": "ProfessorNoFap",
            "author_created_utc": 1338344714,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7ueu3",
            "created_utc": 1404360268,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29pohq/how_do_you_stop_negative_thinking_when_part_of/",
            "gilded": 0,
            "id": "29pohq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29pohq/how_do_you_stop_negative_thinking_when_part_of/",
            "retrieved_on": 1441285141,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "For me its like negative self talk makes it impossible for self-help to work because I'm already convinced nothing will work to change me. Its like a unbreakable cycle that nothing can stop :(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you stop negative thinking when part of the negative thinking is that nothing will work to stop it or improve my life?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29pohq/how_do_you_stop_negative_thinking_when_part_of/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404578909,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29wnak/just_missed_my_first_day_of_work/",
            "gilded": 0,
            "id": "29wnak",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29wnak/just_missed_my_first_day_of_work/",
            "retrieved_on": 1441281890,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "My anxiety has actually been improving lately, except that I have been dreading starting my new job. Well today was the day that I started that job - or was supposed to. Last night, a firework exploded in the middle of the night and set off a car alarm, and simultaneously set off one of the worst panic attacks of my life. I felt like I was going to have a heart attack. \n\nThen I woke this morning, and I just could. Not. Do. It. I tried all of the things I normally do to control my anxiety: break down the problem into little steps and take it one step and a time - but it didn't help. Even putting on my uniform seemed too terrifying. It's not even like this is some important job. It's retail. This isn't the first time that this has happened to me either. Nope. This is the third job I've gotten and then was too anxious to show up for. I feel pretty mentally healthy in most situations nowadays, and yet I cannot even THINK about a job without getting short of breath and wanting to cry. I'm so frustrated with myself. I just wish I could disappear off of the face of the planet.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Just missed my first day of work.",
            "url": "http://www.reddit.com/r/Anxiety/comments/29wnak/just_missed_my_first_day_of_work/"
        },
        {
            "author": "Kass1207",
            "author_created_utc": 1334631223,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7h568",
            "created_utc": 1404357439,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29pkm8/how_can_i_stop_saying_sorry_for_every_little_thing/",
            "gilded": 0,
            "id": "29pkm8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29pkm8/how_can_i_stop_saying_sorry_for_every_little_thing/",
            "retrieved_on": 1441285191,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "I do it all the time. At work, school, with friends and family, in public- everywhere. I say it when I don't need to say it and people either make fun of me (which **sooo** helps /s) or get mad. The only person who doesn't get mad at me is my friend/teacher (I'll just call her Ms W). She always tells me it's ok and to not apologize so often because I don't have to. Everyone else just makes it worse. It's a bad habit when I get anxiety and I just can't stop it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How can I stop saying \"sorry\" for every little thing?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29pkm8/how_can_i_stop_saying_sorry_for_every_little_thing/"
        },
        {
            "author": "DontHateMasticate",
            "author_created_utc": 1313709172,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5owb3",
            "created_utc": 1404276992,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29mkbi/for_you_all_in_relationships_how_do_you_cope_with/",
            "gilded": 0,
            "id": "29mkbi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29mkbi/for_you_all_in_relationships_how_do_you_cope_with/",
            "retrieved_on": 1441286595,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "My boyfriend has been gone all day. Since 9am and he's still not back. He's been hanging with his family. \n\nEver since 3pm, I've had this nagging anxiety. Like, my body shakes, my hands and feet are cold, my back hurts, my stomach hurts. I keep thinking he's not going to come home. That I'm a horrible girlfriend and he's decided to not come home.\n\nI know this is ridiculous. Or at least that's what I'm telling myself. He has not shown any signs of wanting to leave. But my physical anxiety is getting to me. And I know I'm going to get into a fight with him when he gets home. But I don't want to. But I know I will... I hate myself.\n\nWhat do I do with this pent up negative energy?\n\nWhat do you do when you're catasraphising your relationship? \n\nHelp, please.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "For you all in relationships, how do you cope with your anxiety about your partner?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29mkbi/for_you_all_in_relationships_how_do_you_cope_with/"
        },
        {
            "author": "throwaway713910702",
            "author_created_utc": 1404394028,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h8jxp",
            "created_utc": 1404395146,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29qn6w/case_of_imposter_syndrome_has_me_stuck_in_my/",
            "gilded": 0,
            "id": "29qn6w",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29qn6w/case_of_imposter_syndrome_has_me_stuck_in_my/",
            "retrieved_on": 1441284691,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Hello Internet Friends.  Longtime lurker posting under a throwaway, as you can see.\n\nI was up (way too early) this morning reading r/anxiety when I came across the Dunning-Kruker effect, and subsequently, imposter syndrome.\nFor those who are unfamiliar, as was I, imposter syndrome is a \"psychological phenomenon where people are unble to internalize their accomplishments.\"\nThis was a huge discovery for me as this is a big way my GAD manisfests itself.   \n\nOver the past few years I have worked my way from a Bachelor's Degree that was effectively useless outside of its field into what others would call a quite successful technology career.  Since joining my current \ncompany, I have even been promoted - indicating success in my current role.  \n\nHowever, I constantly am questioning myself - (Do I belong here? I don't deserve to be here.... I am not smart enough to be on this team..., I am too socially awkward for my job, I don't deserve to be leader in my company).   I am surrounded by people with \nbetter work experience then myself and those with much better schooling, including Ivy League MBAs.   \n\nAll of this anxiety and these negative thoughts I fear are hindering my further progress in my career - and driving me generally insane in my personal life.  \n\nHas anyone experienced these sorts of feelings?  How did you get past them?  How did you seperate the rational from the irrational?  \n\nThanks for your thoughts everyone.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Case of Imposter Syndrome Has me Stuck In My Career",
            "url": "http://www.reddit.com/r/Anxiety/comments/29qn6w/case_of_imposter_syndrome_has_me_stuck_in_my/"
        },
        {
            "author": "throwaway2014aug",
            "author_created_utc": 1404339447,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h897l",
            "created_utc": 1404339721,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29ott4/im_going_to_ruin_my_proposal/",
            "gilded": 0,
            "id": "29ott4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29ott4/im_going_to_ruin_my_proposal/",
            "retrieved_on": 1441285539,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "BF (30m) and I (27f) have been together a few years. I know he's going to propose in the next 6 weeks. I have terrible anxiety. Started out as a result of a bunch of other medical problems but has no progress to include social anxiety and anxiety about pretty much everything I do these days. I've been managing to function better lately because of some new meds but I'm having a hard time with this. I know that I want to marry him, there's no question there. It's the surprise that's bothering me. I hate surprises. I plan everything out in great detail and suffer from a lot of stress if anything deviates. I want to give him this surprise because it means so much to him. My question is how am I supposed to sit and wait without driving myself crazy or stressing myself out to the point where there's no fun or romance left in this situation? Any and all advice is much appreciated.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm going to ruin my proposal",
            "url": "http://www.reddit.com/r/Anxiety/comments/29ott4/im_going_to_ruin_my_proposal/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404455665,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29t4bp/anybody_have_physiological_symptoms_despite/",
            "gilded": 0,
            "id": "29t4bp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29t4bp/anybody_have_physiological_symptoms_despite/",
            "retrieved_on": 1441283536,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I have been having a lot of weird symptoms lately, most of them consistent with General Anxiety Disorder.  From the GAD wiki \n&gt;Fatigue, fidgeting, headaches, nausea, numbness in hands and feet, muscle tension, muscle aches, difficulty swallowing, bouts of difficulty breathing, difficulty concentrating, trembling, twitching, irritability, agitation, sweating, restlessness, insomnia, hot flashes, and rashes\n\n However, mentally I have been taking it easy this summer.  I don't work, I stay at home watch movies, make music, etc etc.  Not very anxiety producing tasks at all.  My dr. and therapist are both convinced the symptoms are because of my ~anxiety~ but I rarely have any really fearful, panicky thoughts?! If anything I get anxious about noticing a symptom like random aches or chest pain, but thats it.  Anybody have a similar experience?   ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anybody have physiological symptoms despite having a seemingly \"relaxed\" mind",
            "url": "http://www.reddit.com/r/Anxiety/comments/29t4bp/anybody_have_physiological_symptoms_despite/"
        },
        {
            "author": "--0--",
            "author_created_utc": 1394033045,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fkfk2",
            "created_utc": 1404289323,
            "domain": "self.Anxiety",
            "edited": 1404290233,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29mw90/visitors_ive_never_met_are_downstairs_and_i_need/",
            "gilded": 0,
            "id": "29mw90",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29mw90/visitors_ive_never_met_are_downstairs_and_i_need/",
            "retrieved_on": 1441286440,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "Blegh. I hate this. I'm 19 and staying with my dad and stepmum for a few days (been living with my mum for the last 6 months or so). I managed to sleep all day and out of the blue they've brought a bunch of colleagues home and they've all-but settled in for the night talking, drinking, etc. I need to go back to my mum's but of course this means going downstairs, fixing myself dinner, etc. before leaving.\n\nBut these situations cause me such severe anxiety it's excruciating.  I don't know what kind of interaction would be typical/expected in this context but I know it's something I'm totally not capable of mustering. It's the \"what do you do\" question that really fucking gets me because \"I don't study or work at the moment because I have a plethora of mental illness and brain injury related issues causing me to feel suicidal on a daily basis so functioning like a normal human being is about as difficult for me as juggling on a unicycle is for you\" isn't something you bring up in the kind of brief interactions normal people have with other normal people on the daily. But it's the inevitable destination of literally every interaction with other human beings and a huge part of the reason I'm so socially evasive. \"So what do you do?\" \"Err... Nothing at the moment\". You see the realisation dawn on them that you're one of *those* people, the dropkicks, and can almost hear the cogs tick as they contemplate *how* you could be such a fuck up. \n\nI can hear them downstairs laughing and exchanging anecdotes and my anxiety is just snowballing by the minute, I'm fucking paralyzed. I hate this whole fucking situation. *Why* do I have to be such a broken human being. These people aren't doing anything wrong by trying to interact with me as they would with literally anyone else. It should just be a casual, lighthearted exchange. \"Oh, I work up the road at X.\" \"I'm just in Uni at the moment.\" \"I'm just going out to catch up with some friends.\" Etc. But I'm just this hugely self-conscious, self-loathing mess of a human being and I just don't gave the wherewithal to function in this world. When I look down the barrel of a lifetime riddled with these awkward interactions, the severe judgment and stigma from everyone else in the world, of a lifetime pursuing disability pensions and psychiatrist appointments just to sustain this existence I spend hating existing, suicidal thoughts just seem like the only logical fucking conclusion. What are all those adages about living, but not *living*? They all fucking apply to me.\n\nAnd I know I'll barely feature in their evening. Just one random person of a thousand random people they have fleeting interactions with every week. These are just people having a relaxed gathering as people do. Why can't I do it? Why can't I just breeze through there quietly and be gone again just as quickly as I entered? But stepping into these fucking intense social environments to me is just suffocating.  I'm picturing myself reaching the bottom of the stairwell and my brain just seizes. What do I do? What will they do? I won't be able to call upon the social spontaneity necessary to adapt to whatever curveballs they throw at me in a passable manner, I know it. I reach the bottom of the stairs, multiple pairs of unfamiliar eyes laser lock into my gaze, and I...??????? What? \n\nAnd then it's frustrating that my dad just can't empathize with me enough to recognize that there's an issue for me here. I've been like this for over a fucking year now and he still just doesn't get it. Why does he think I moved to my mum's in the first place? Because of this kind of shit. I know it's normal for him, I know it should be normal for me, but it's not and I can't deal with it like a mentally well person can. Random dinner parties and stuff that I'm just expected to participate in despite always coming up against these agonising social barriers. Detours on the way home from my psychologist appointments to giant family gatherings I didn't know about. He couldn't have let me know last night that they had this gathering planned? Called me during the day so I could have left earlier? Why doesn't he know by now that having these things sprung on me is incredibly distressing?\n\nAnd the more anxious I get, the more my brain freezes up and the less able I'll be to bluff my way through any minimal excruciating interaction. I always wind up in this godforsaken Catch 22. \n\nAnd then it's just hilarious that I'm cooped up in my room writing a fucking essay about how difficult it is for me to walk through someone else's laid back social gathering. I'm literally genuinely contemplating climbing out a second story window. All that's preventing em from doing so is the shame of being the freak who's so socially retarded that he climbed out a window to avoid basic human intetaction. How fucking self-involved. This is what my life has come to. I'm a total fucking write off as a human being, goddamnit. \n\nAll I want in this world, more than anything, is to have the most basic fucking normal life. A mind numbing job, a couple of friends, a boyfriend I settled for, a tax bill, a hobby, a weekly trip to the pub for a few too many drinks or whatever. The bare minimum necessary to be a normal member of society.\n\nI don't really know what I want to get from sharing this here. I'm just ranting, I suppose.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Visitors I've never met are downstairs and I need to leave...",
            "url": "http://www.reddit.com/r/Anxiety/comments/29mw90/visitors_ive_never_met_are_downstairs_and_i_need/"
        },
        {
            "author": "graushus",
            "author_created_utc": 1404751752,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_haial",
            "created_utc": 1404752202,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a28sr/shutin_agoraphobic_and_trapped_in_a_cycle_without/",
            "gilded": 0,
            "id": "2a28sr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a28sr/shutin_agoraphobic_and_trapped_in_a_cycle_without/",
            "retrieved_on": 1441279278,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I am trapped in this circle of not wanting to better my life because I hate myself, and hating myself because I am not a different person. I have this ideal self that I wish to be, and it is SO far removed from my reality, but it is basically to be a normal person, it is what everyone else seems to have.\n\nI am putting this in /anxiety/ because that is my main problem, I have a fear of talking and interacting with other people because I'll be judged in any way, and it keeps me indoors permanently. It's been shut-in for 8 years and I am just going in circles, thinking about committing suicide. At this point, suicide makes sense to me and I am actively planning it, without any kind of sadness. I don't feel depressed, just suicidal. If that makes sense. I haven't felt depressed in years, or maybe I feel it all the time now and so I don't notice it. The internet is my only means of human contact outside of paying rent and grocery shopping, I've been on disability all these years.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Shut-in, agoraphobic, and trapped in a cycle without any way to get out",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a28sr/shutin_agoraphobic_and_trapped_in_a_cycle_without/"
        },
        {
            "author": "anx1",
            "author_created_utc": 1404468432,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h8zqm",
            "created_utc": 1404471500,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29thm7/rant_unemployment_is_getting_to_me/",
            "gilded": 0,
            "id": "29thm7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29thm7/rant_unemployment_is_getting_to_me/",
            "retrieved_on": 1441283363,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I quit school when I was 17 years old (26 now) and has since had about 12 jobs and spent almost three, nonconsecutive years being unemployed. \nI've been studying for the last two years so I can finally get in to a university because I grew incredibly tired of hunting jobs I weren't interested in.\n\nThe university doesn't start until the middle of august and since the beginning of june I've been sitting at home.\n\nNeither my girlfriend or I had a job when school ended so we had to go to the social services. Here in Sweden we have to be registered at the employment office if we're going to recive money. Both the employment office and social services require us to apply for all jobs (at least twenty per month) of which we're qualified for and report back to them every month.\n(I get this, because there will always be people who abuse the system, and the rules are there for a reason.)\n\nSince I've been unemployed for long periods of time before, I knew exactly how my body were going to react: For the first few weeks I'd be applying for everything there is, but the longer I'm at it, the more depressed I get and the anxiety is an unwelcomed, guaranteed by-product.\n\nSchool starts in about 6 weeks and I just don't see the point any more.\n\nI've been going to a psychologist because of my social anxiety, but she didn't think I'd need it during the summer (plus she's on vacation).\n\nSo far I've had one interview opportunity for a job which required me to be at a new work place every week, which basically is my worst nightmare. (I would not be able to handle that many strangers). So, I declined.\n\nNowadays I only apply for jobs I know I won't get while I sit around being scared that the government will find out that I declined a job offer.\n\nI know that a lot of people can't stand being unemployed, and there's a reason for it: Our lives are on pause. We can't do anything. We're on this constant mission from the government and if we surrender, we'll lose our money and, in my case, probably be homeless (my parents live 1000 km away).\n\nThis is the reason I went back to school; so I wouldn't have to apply for jobs I didn't want. It feels like I'm back at square one and two years of studying for nothing.\n\nI know it sounds like I'm looking for a reason to continue leeching of the welfare system so I can continue sitting at home doing nothing, but I don't like it. I grew up with the notion that welfare is something to be ashamed of.\n\nI do not enjoy this cocktail of anxiety, shame and depression. Yuck.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] Unemployment is getting to me",
            "url": "http://www.reddit.com/r/Anxiety/comments/29thm7/rant_unemployment_is_getting_to_me/"
        },
        {
            "author": "falnangel",
            "author_created_utc": 1398141487,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g8tgg",
            "created_utc": 1404207458,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29ju7d/help_anyone_else_feel_as_if_their_anxiety_is/",
            "gilded": 0,
            "id": "29ju7d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29ju7d/help_anyone_else_feel_as_if_their_anxiety_is/",
            "retrieved_on": 1441287927,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "I feel as if my anxiety is keeping e from being an independent person and I'm not sure how else to cope aside from taking my medication.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Help- Anyone else feel as if their anxiety is keeping them from being independent and if so how do you cope?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29ju7d/help_anyone_else_feel_as_if_their_anxiety_is/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404413945,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29rhl5/giving_up_coffee_have_any_of_you_done_this/",
            "gilded": 0,
            "id": "29rhl5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29rhl5/giving_up_coffee_have_any_of_you_done_this/",
            "retrieved_on": 1441284297,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I'm a big coffee drinker, and have been for decades. I probably have a minimum of two cups per day, maximum a whole pot (rare). In the hopes of clearing my head and minimizing my anxiety, I'm going to give up caffeine and track the changes over a month...hopefully it will make a difference. Have any of you done this? Did it help? It hasn't even been a day and I miss it already. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Giving Up Coffee: Have Any of You Done This?",
            "url": "http://www.reddit.com/r/Anxiety/comments/29rhl5/giving_up_coffee_have_any_of_you_done_this/"
        },
        {
            "author": "ZapZapZapZapZapZap",
            "author_created_utc": 1357905487,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a6oep",
            "created_utc": 1404354950,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/29ph1c/explaining_anxiety_to_someone_who_doesnt_get_it/",
            "gilded": 0,
            "id": "29ph1c",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/29ph1c/explaining_anxiety_to_someone_who_doesnt_get_it/",
            "retrieved_on": 1441285238,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "So I've hit the problem of explaining my anxiety to just about everything. Unless they experience it, they are unable to relate. So I've been trying to find a way to explain it.\n\nA little background. I'm a 21 year old woman and I have extremely severe health anxiety. My physical state is very poor, struggling with stress induced IBS, poor heart response to activity, and other anxiety related issues, along with the mental fatigue and stress. And being able to explain it at least has helped me rationalize it to a mental problem, not a physical one. So I thought maybe this would help others rationalize it themselves and explain to others.\n\nSo we all know someone who likes to scare people. Let's call him Dave. Dave's a bit of an asshole. He likes to walk up behind people and scream \"**RAAAAGH**\" very suddenly to scare people. People have a response to that. Your blood pressure and heart rate change massively. You struggle for a moment, thinking where the hell did that come from? Then you realize what's happened. Dave's pulled a nasty prank. You remark in an exaggerated tone \"Damnit, Dave, you almost gave me a heart attack.\". You didn't mean it, but it stands because you felt abnormal, uncomfortable sensations due to what he just did to you.\n\nDave's become a little psychotic in recent weeks. He's doing it at random, and for some reason, nobody's listening to you when you're telling them he's doing this to you. He starts doing it more and more. You realize after a while that you have a huge build of adrenaline every time, just like the first time, but there's a change in your reaction. Dave has done this so much, that you know it's him within a half second now, not after a few good seconds. Instead, you feel no other choice but to be the victim. You instead focus your energies on the uncomfortable sensations. Wishing them away. But it seems to make them worse. That sinking stomach feeling, even the changes in blood pressure and heart rate. They're very exaggerated, they last longer, and you don't feel good about it.\n\nIt has started getting worse. Dave is now doing it all the time. You don't even know what's going on anymore. You spend most of your time very worried about the next terrifying attack he unleashes on you. You are starting to feel very sick. The stress of waiting, the tension and the pain of the screaming attacks he unleashes on you are mounting. You start having digestive issues, palpitations, stress and sleep disturbances.\n\nEvery time Dave attacks, he does it in a slightly different way too, which occasionally makes you question just what's going to happen next. Or even what caused him to change his strategy. You start trying to develop defense mechanisms. You curl up into a ball, you listen to music, you do anything you can. Curling up into a ball seems to make you not feel very well. Adopting a defensive position most of the day means you get less exercise of course, and you start feeling worse and worse. You stop leaving your home. You retract from society. \n\nDave is now your life. He dictates to you when you get up, when you go to bed, if you leave the house, if you stay inside, how you feel, what's going on. You feel victimized, and although you want control, you are afraid. You notice that Dave *does* let up when you take positive action, such as exercise, or anything, because you're able to get away from him when you're not worrying about him so much, but it doesn't last long. You have little energy at this stage, and he's able to drag you down much easier.\n\nDave is a very simple metaphor. A metaphor for 'anxiety'. Something that is invisible, unseen by the rest of the world, and exists in the mind of the beholder. Sadly, he sneaks up in a form we often can't understand. We can't hide from him. He just is. \n\nPeople like to tell us what to do to overcome. But the further into severe anxiety we are, the worse it can become. Many say \"Life is hard\" when they have to work hard to make ends meet, and keep up with their own household. But with people having panic attacks, they can burn through that sort of mental energy in a day just coping with going through the disorder. To put in the extra effort requires some unknown amounts of strength, consistently, with no let up. And it becomes an impossible uphill climb when you can tumble back down within a matter of minutes.\n\nAnd anxiety wins every time.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Explaining anxiety to someone who doesn't get it",
            "url": "http://www.reddit.com/r/Anxiety/comments/29ph1c/explaining_anxiety_to_someone_who_doesnt_get_it/"
        }
    ]
}