{
    "data": [
        {
            "author": "geeky_latina",
            "author_created_utc": 1393170787,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_feszj",
            "created_utc": 1406122263,
            "domain": "buzzfeed.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bhrm8/29_phrases_people_with_anxiety_are_tired_of/",
            "gilded": 0,
            "id": "2bhrm8",
            "is_self": false,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bhrm8/29_phrases_people_with_anxiety_are_tired_of/",
            "retrieved_on": 1441254872,
            "score": 126,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/nBJClnw8wkBpfgef.jpg",
            "title": "29 Phrases People With Anxiety Are Tired Of Hearing",
            "url": "http://www.buzzfeed.com/robynwilder/phrases-that-people-with-anxiety-are-tired-of-hearing?s=mobile"
        },
        {
            "author": "prettyjunglekitty",
            "author_created_utc": 1381375691,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dgc7n",
            "created_utc": 1406062355,
            "domain": "self.Anxiety",
            "edited": 1406066965,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bfiba/poem_i_wrote_about_panic_attacksanxiety/",
            "gilded": 0,
            "id": "2bfiba",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bfiba/poem_i_wrote_about_panic_attacksanxiety/",
            "retrieved_on": 1441255987,
            "score": 117,
            "secure_media_embed": {},
            "selftext": "Do you see me, little bird?\n\nPale and trembling, quite absurd?\n\nSun is shining, world is green\n\nThrough my eyes it's all obscene.\n\nI don't see what lies around,\n \nweeping here without sound\n\nEverything seems dark and fearful\n\nI'm in panic, yet you're cheerful.\n\nSwoop above me, \n\nWings unfurled,\n\nWake me to the living world.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Poem I wrote about Panic Attacks/Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bfiba/poem_i_wrote_about_panic_attacksanxiety/"
        },
        {
            "author": "JunkyGS",
            "author_created_utc": 1364976650,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b6ese",
            "created_utc": 1406485584,
            "domain": "self.Anxiety",
            "edited": 1406485787,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bvhy2/my_guide_to_conquering_anxiety/",
            "gilded": 0,
            "id": "2bvhy2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bvhy2/my_guide_to_conquering_anxiety/",
            "retrieved_on": 1441248341,
            "score": 102,
            "secure_media_embed": {},
            "selftext": "I've been a lurker on this sub-reddit for a while and I have gotten so much help from stuff people have posted I decided I want to give back as much as i could. I am an 20yr old male in the US (I think this is bland enough for reddit's guidelines) and have been dealing with severe panic disorder,agoraphobia and depression for years now so i wanted to past down some tips I've learned over the years that have helped me stay calm, conquer panic attacks and overall empower myself to live my life without anxiety controlling it. \n\nNote I'm not a professional or anything like that, this all just simply my experience with it that I hope at least one person could get use out of.I tried to make it this make sense and as organized as possible, so I'm going to split it up into 3 big categories and I guess if you people want to ask me ANY questions regarding this feel free, I'll add like a FAQ section at the bottom for asked questions or might do an AMA corresponding with this post if popular enough.\n\nGuide / Tips on\n\n 1* Preventing anxiety prior to an anxious situation  \n\n 2* Preventing anxiety while being in an anxious situation \n\n 3* Calming down during / after a panic or anxiety attack\n\n1* Ways To Reduce or Avoid Panic / Anxiety Before Being In An Anxious Situation\n\n1) Prior Knowledge you NEED to know\n\n-Some information that you need to know before you can get over anxiety / anxiety disorder is to know PANIC ATTACKS CAN NOT KILL YOU. Now some of you might be thinking \"no shit\" but when you are in the mix of a panic attack or feeling anxious what gives the anxiety control / power over you is fear! You are scared of feeling a certain way, passing out, or even dying. \n\n-You need to know that anxiety isn’t this separate being that has control over you, YOU give it its power, it doesn’t disappear due to circumstances or places, it is you controlling that, not the other way around. A perfect quote about this is \"Our deepest fear is that we are powerful beyond measure. It is our light, not our darkness, that most frightens us.\" - Marianne Williamson. So you need to go into this knowing you have the power to control and change your anxiety, NOT your anxiety will control or change you.\n\n\n2) Know Your Triggers\n\n-You can’t prevent something if you don’t know when that something is going to happen. Most people should be aware of what triggers their anxiety, but if you don't know what your triggers are, think about being in different situations and see what ones make you anxious, and if multiple scenarios do, think about what similarities there are between those scenarios.\n\n3) Write Down Your Goals, Do Something EVERYDAY &amp; keep track of your progress!\n\n-One of the biggest problems with having an anxiety disorder is that you will avoid scenarios that cause you anxiety cause you don’t want a panic attack (obviously lol) and that will most likely interfere with your day to day life and/or happiness. But one of the WORST things you can do is avoid those situations because you are giving power to the anxiety and letting that fear control you.\n\n-So in order to get over anxiety you NEED to write (Yes i actually mean write, as in with a pen/pencil and on a piece of paper) your goal. (According to new research, people who write down their goals are 33% more likely to achieve them. Also writing is a GREAT stress relief) It doesn't matter the size of the goal, it can be something small or your BIG ultimate goal.\n\n-But now you have your goal written down, the best way I learned how to make sure I keep making progress towards getting over anxiety / that goal and reducing the consequences if you have a setback is to keep a daily journal of what you do day to day towards that goal or in general how you handle anxiety. Make sure you write down how you felt, before, during and after you did an uncomfortable scenario. (I personally use the notepad app on iphone because of convenient it is, but if you want to write down your day to day stuff also that is encouraged.)\n\n-Now I am telling you it WILL NOT BE a straight climb up. You WILL have set backs or not make as much progress as you did previous days, but the benefit of having that daily journal is you can look back on previous days and KNOW you were able to do it at one point and KNOW you can get back to that point or do that situation again. Also re reading your feelings does help you handle that similar situation A LOT better than if you don’t write it down and just try to remember \n\n4) Practice deep belly breathing!\n\n-What often times brings on a panic attack and / or the symptoms of one is a lack of oxygen getting to your body which causes the dizziness, light headedness, sweat, shakes, rapid heartbeat etc. So in order to get rid of those symptoms is to simply breathe, but during that panic you are doing quick breathes that only make it worse.\n\n-So to help you when you are in one of those situations is when you are in a calm environment to practice deep breathing. How I have been taught to deep breathe is to\n        1- Sit up straight and put one hand flat on your belly and one hand flat on the middle of your chest, a bit below your collar bone. \n        2-Breathe in through your nose into your stomach (you should feel your stomach expand) for about 5-6 seconds.\n        3- Hold it in for about 4-5 seconds.\n        4- Then SLOWLY breathe out through your mouth for 8-10 seconds and feel your belly return to normal. Make sure you get all of your breathe out, so if necessary do a expel it through your mouth quickly in order to reset the process.\n        5- Do this for about 2-3 minutes and you should feel calmer.\n\n-After getting the gist of it you should be able to do it anywhere and it is the key to staying calm and keeping those uncomfortable symptoms at bay while also keeping your mind off of the panic and instead focusing fully on your breathing.\n\n5) Think About What Makes You Angry and Find an Outlet\n\n-You are probably thinking what I mean by this or \"But I'm not an angry person\". But I have learned from many professionals and people that have anxiety that the biggest cause of anxiety or stress that turns into anxiety; is your anger about somebody or something without even realizing it. When I was first told this or asked what made me angry I was confused because I rarely get angry over anything, but most of the time you can be angry about stuff and not even knowing it or be aware of it (a bit weird right?) So it goes sort of back to the triggers part, if you know what makes you angry being aware of it allows you to plan out how you can calm yourself down afterwards or avoid the situation entirely if you can. I personally listen to music or go for a walk as an outlet, but it could be anything writing ,reading, sports, running, photography, designing, video games etc.\n\n-If you DONT know what triggers your anger or you're not even aware you are angry about anything you should still take time to find some sort of outlet you enjoy and give yourself some \"me time\" daily or weekly depending on what it is, preferably physical because it burns away stress hormones that create anxiety symptoms, tires your muscles, reducing excess energy and tension,release endorphins which improve overall mood, forces healthier breathing and It gives you such great benefits and helps take off the edge if you do get into a situation that makes you anxious.\n\n\n2* Preventing anxiety while being in an anxious situation\n\n1) Things You Can Tell Yourself\nThese are all things I have told myself to reduce anxiety or people who have anxiety have also told themselves to stay calm in an anxious situation or take away power from anxiety.\n\n-Ask yourself \n\"Is there a reason to believe something is wrong?\"\n\"What proof is there that something is wrong?\"\n\"Is there a chance I'm blowing this out of proportion?\"\n-\"Okay, you're anxious. So what?\" \n-That you are fine and It Can't Hurt You [see 1) under 1*]\n-Think of one of your happiest memories or imagine yourself in your personal happy place.\n-Remember to Breathe!\n-Observe small details of an object in your environment (color, texture, lighting etc)\n-Distract yourself\n\n\n2) Things You Can Physically DO and Specific Exercises\n-The MOST successful exercise that I have been taught to INSTANTLY relieve anxiety is to \nClench or Tighten EVERY part of your body you can think of while taking a breathe in then slowly release every tighten body part while exhaling. Make sure to Belly Breathe while doing this.\n\n-Belly Breathe [see 4) under 1*]\n\n-Chew Gum\n\n-Clench your fists (or toes if you don’t want to be obvious) as hard as you can for 5 seconds and then slowly release them for 5 seconds.\n\n\n3* Calming down during / after a panic or anxiety attack\n\n1) Things You Can Tell Yourself\n-Tell yourself to have a panic attack. I know this sounds weird since nobody wants to have one or experience anxiety, but from what I learned so much of what brings upon anxiety for me is feeling out of control and telling yourself to have a panic attack makes you in control, not anxiety. Every time I told myself to have a panic attack it never happened and calmed me down, so it is worth trying out and helps you gain confidence in yourself and your own ability to handle anxiety.\n\n2) Things You Can Physically DO and Specific Exercises\n-Clench your fists (or toes if you don’t want to be obvious) as hard as you can for 5 seconds and then slowly release them for 5 seconds and the other exercises I listed before. \n\n3) Allow yourself to feel proud \n-The reason this sub-reddit is as popular as it is because sadly not a lot of people understand anxiety unless they have first hand experience. This causes people to not fully understand the scale of something when you do it (not give into a panic attack, do something that usually gives you anxiety etc) so the most valuable lesson I learned is to look only at yourself for approval and not expect others to give you validation. \n\nThat's it, again as I said feel free to ask me any questions and I will help you as much as I can. :) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My Guide to Conquering Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bvhy2/my_guide_to_conquering_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406530472,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bxb5w/i_would_like_to_preach_the_benefits_of_watching/",
            "gilded": 0,
            "id": "2bxb5w",
            "is_self": true,
            "media_embed": {},
            "num_comments": 50,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bxb5w/i_would_like_to_preach_the_benefits_of_watching/",
            "retrieved_on": 1441247496,
            "score": 94,
            "secure_media_embed": {},
            "selftext": "Watch. Cheesy. Movies. I mean it. Mystery Science Theater (seriously recommend) has been my saving grace. The Princess Bride? Watch it. The Goonies, Hook, watch them. They aren't necessarily cheesy, but they are so nostalgic and happy. There have been so many times I have been having a serious panic attack; throat swollen up, buzzing in my ears, tunnel vision, racing heart, trouble breathing; and a cheesy movie helped me. I know it probably seems impossible sometimes. My partner has had to force me a few times actually. But, after about 15 minutes of a ridiculous movie, I'm feeling a lot better. \n\nMovies like this put you in a different place. You can curl up with tons of pillows, eat some ice cream, drink a beer (or not because it can create more anxiety), take your Xanax (not at the same time as the beer please!), drink some tea, eat some leftovers, do whatever (except read WedMD)! Just take some time for yourself to relax and LAUGH. I know you're probably thinking: \"This won't work for me\" \"My anxiety is obviously worse than this persons\" \"I can't sit still for that long while I'm freaking out\". I don't care! Try it anyway! At least once. Don't let your anxiety kick your ass *all the time*. Take some time back for yourself! Introverts unite, separately in your own homes!\n\nDo you have any movie recommendations? Preferably movies without loud explosions (unless they are funny explosions), complex plot lines, people yelling or abusing each other, or other general anxiety provoking things.\n\nFeel better guys. We are okay. I hope you find some solace in movies full of cheese. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I would like to preach the benefits of watching cheesy movies",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bxb5w/i_would_like_to_preach_the_benefits_of_watching/"
        },
        {
            "author": "EverydayRapunzel",
            "author_created_utc": 1328843936,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6vw0e",
            "created_utc": 1406311245,
            "domain": "self.Anxiety",
            "edited": 1406348274,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bplyk/do_not_ever_stop_taking_lexapro_without_the_help/",
            "gilded": 0,
            "id": "2bplyk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 193,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bplyk/do_not_ever_stop_taking_lexapro_without_the_help/",
            "retrieved_on": 1441251149,
            "score": 92,
            "secure_media_embed": {},
            "selftext": "I'm sure this applies to most antidepressants as well.  But holy fuck I feel so horrible right now.  Not even mentally; that'd be easier to deal with.  My body just can't function right now.  I'm dizzy and my heart is racing and I can barely breathe.  It's awful.\n\nAnd yes, I am in touch with my doctor now.  But just wanted to put this out there for anyone else thinking about it.  I did it because I ran out of meds and money to refill them.  But it was the worst choice ever.\n\nEdit: sorry guys, Reddit Now is not being my friend at the moment so all my replies are going in all the wrong places. I'll fix them when I can get to my computer.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DO NOT EVER stop taking Lexapro without the help of a doctor",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bplyk/do_not_ever_stop_taking_lexapro_without_the_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406411797,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bt7fv/going_to_kill_myself_cause_of_anxiety/",
            "gilded": 0,
            "id": "2bt7fv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 155,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bt7fv/going_to_kill_myself_cause_of_anxiety/",
            "retrieved_on": 1441249471,
            "score": 80,
            "secure_media_embed": {},
            "selftext": "I've had anxiety all my life. As long as I can remember, I've had all the thoughts and symptoms associated with anxiety but thought it was normal. It's been interfering with my life more and more, getting in the way of relationships, school, and my career. I started seeing a Psychiatrist and a Psychologist. The pills don't work, been trying different things for the last 10 months. My psychologist is never helpful. I keep feeling like I'm getting worse and I have no idea who I would even start to get better. Suicide seems like a better idea than descending further and further down the anxiety rabbit hole.\n\nTL;DR - I have always had anxiety. Tried to get help, got worse. Going to end my life.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Going to kill myself cause of anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bt7fv/going_to_kill_myself_cause_of_anxiety/"
        },
        {
            "author": "Kass1207",
            "author_created_utc": 1334631223,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7h568",
            "created_utc": 1406217837,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2blrum/someone_at_work_yesterday_went_to_see_me_to_say/",
            "gilded": 0,
            "id": "2blrum",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2blrum/someone_at_work_yesterday_went_to_see_me_to_say/",
            "retrieved_on": 1441252998,
            "score": 69,
            "secure_media_embed": {},
            "selftext": "I work at a craft store- and I love it. Most of the time (some customers can be mean, not all, but some. And all the people I work with are really nice)\nOn Tuesdays we get our trucks of restocks so we have to unpack all the boxes. I usually can't work Tuesdays because I have police explorers but my manager has had me work during the days so I was able to this week. It was my first time working in the back. I've been here for four months but am usually a the registers or putting stuff back. I wasn't familiar with where to put things in the back so one other employee (well call her A) told me to just ask her so nothing would get misplaced. A is really cool, some might think she's \"scary\" but she's just got a really good sense of humor and as others say \"is honest.\"\n\nWell, that was on Tuesday. I worked again yesterday but only at the registers. A went over to me while I was waiting for the manager to get my register ready. She said she wanted to tell me she really liked working with me, she never heard me talk and I guess I talked a lot on Tuesday and made her laugh. She said I wasn't afraid to ask questions for where things went. I also told a few people back there about some interesting or annoying customers I had- which made a few laugh. Typically I have a hard time asking questions and talking, but I did better on Tuesday so much to where A thought it was awesome (and shocking) that I can actually talk. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Someone at work yesterday went to see me to say she enjoyed working with me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2blrum/someone_at_work_yesterday_went_to_see_me_to_say/"
        },
        {
            "author": "cantsleep44",
            "author_created_utc": 1406239124,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hk4g1",
            "created_utc": 1406240169,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bmylp/i_cant_sleep_because_my_mind_keeps_racing_anyone/",
            "gilded": 0,
            "id": "2bmylp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bmylp/i_cant_sleep_because_my_mind_keeps_racing_anyone/",
            "retrieved_on": 1441252444,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "Whenever I try to sleep, I end up playing out scenarios in my mind. Stuff like, \"What would happen if I were to do this?\". I think about what I would say, what would happen, etc. This keeps me awake, and for some reason I can't stop thinking about whatever my mind decides to focus on. My mind never gets tired. If I have nothing to think about, my mind makes stuff to think about. The sleep deprivation makes my anxiety really bad. I take 100 mg of Benadryl when things get really dire, but it makes me feel like crap in the morning. By the way, don't drink 4 cups of coffee on a Benadryl hangover, especially when you have an anxiety disorder. I found that out the hard way today. How do you get to sleep when your brain runs at a crazy rate all the time. Anyone have any tricks?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't sleep because my mind keeps racing. Anyone else have this problem?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bmylp/i_cant_sleep_because_my_mind_keeps_racing_anyone/"
        },
        {
            "author": "thepotagold",
            "author_created_utc": 1387466064,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_efgkw",
            "created_utc": 1406386100,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bs5eh/got_suspended_cause_had_a_anxiety_attack_and/",
            "gilded": 0,
            "id": "2bs5eh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bs5eh/got_suspended_cause_had_a_anxiety_attack_and/",
            "retrieved_on": 1441249963,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "i only went to the park across the road to get away from people and skipped one lesson, but is there a way to control your anxiety attacks? dont have any meds.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "got suspended cause had a anxiety attack and walked out of school without thinking",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bs5eh/got_suspended_cause_had_a_anxiety_attack_and/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406036792,
            "domain": "self.Anxiety",
            "edited": 1406071784,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2be6mw/for_all_the_things_we_could_be_sad_about_angry_or/",
            "gilded": 0,
            "id": "2be6mw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 45,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2be6mw/for_all_the_things_we_could_be_sad_about_angry_or/",
            "retrieved_on": 1441256605,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "I'm moving to nj in 3 weeks and I can't wait to explore nyc! I love how I'm comfortable reaching out. I do my best to help people when I can. I also love the fact that I'm small and am not afraid of a good challenge. I like to face it than flee it. It took years of gaining my confidence to just even be able to walk outside and pass people not caring about what they think of me. I'm doing a lot better at it. The only thing I still get anxious about is people close to me and I'm always worried that things are doomed to fail or when something small and even irrelevant goes wrong, that something bad will happen. I've been doing okay at thinking it through and focus on the good things because even if bad things happen, I want to be strong. I still cry here and there and my mind race, my heart race, I feel like curling up in fetal position but I know all these negative feels won't last forever. At least, I'm fighting so it won't.\n\nEdited: I couldn't stop smiling the entire day today. My friend caught me smiling while I was on my phone and thought my bf sent me something cute lol. I was reading all your posts!! I'm so happy for all of you!! :D :D :D ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "For all the things we could be sad about, angry or worried. Let's focus on something good. Share what is good going on in your life and name one thing you love about yourself or two or more if you wanna!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2be6mw/for_all_the_things_we_could_be_sad_about_angry_or/"
        },
        {
            "author": "ArchHero",
            "author_created_utc": 1363564841,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_azftw",
            "created_utc": 1406260599,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bnumi/does_anyone_else_get_really_bad_anxiety_when/",
            "gilded": 0,
            "id": "2bnumi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bnumi/does_anyone_else_get_really_bad_anxiety_when/",
            "retrieved_on": 1441251970,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I don't know why it even matters to me. I also get anxiety after drinking coffee, and I stopped drinking it. Coffee also makes my head, and stomach hurt. I really love the flavor though. Sometimes I'll have anxiety for no reason. Then I'll get anxiety if anyone ever mentions rape, but that's getting better.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else get really bad anxiety when you're downvoted even just once?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bnumi/does_anyone_else_get_really_bad_anxiety_when/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406113384,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bhhdc/how_can_i_get_over_my_horrible_social_anxiety/",
            "gilded": 0,
            "id": "2bhhdc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bhhdc/how_can_i_get_over_my_horrible_social_anxiety/",
            "retrieved_on": 1441255005,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "So let me begin with a little bit of basic information about me. I am 18 year old male and have been dealing with social anxiety for about two and a half years. \n\nIt started one day when I was giving a group presentation in front of the class and one of my friends pointed out my face was turning red. \nBefore this event I had never had a problem giving presentations and. I actually kind of enjoyed them. Eventually, I started to hate giving presentations and from there I started having anxiety about being in front of people whether it was being in a seat in front of someone or standing in a line or in front of a crowd. From there, I started hating being in a classroom, being at school, and eventually just being near people. \n\nMy social anxiety started spiraling out of control and I started to notice that it affected me everywhere. Whenever I am around someone I feel intimidated by or someone I feel I have to impress I get my symptoms of anxiety. I eventually gave up on public school and started online school so I didn't have to be near anyone.\n\nSocial anxiety has made my life a living hell. I can feel when my face turns red, I feel the blood running through my cheeks and the rest of my face. I can hardly keep my eyes open when I feel anxious because they feel like they are dry and they burn even though I blink a thousand times a minute. My hands are always sweaty and clammy and they never stop trembling. I sometimes cannot walk straight because I am trying to walk \"normally\". Whenever I try to turn my head I feel that the movement is shaky and not calm and smooth. I stutter and stammer because I lose my train of thought and I can't think straight. The slightest noise startles me because I am always on edge. I feel as if everyone is talking about me or judging me when they look at me because I think one of my physical symptoms is showing. I cannot make eye contact with people and I have no clue why for this one. \n\nI have tried many solutions to get over my social anxiety but nothing has made it easier. I have tried to change my diet, working out, exposing myself to my fears, talking to people and therapists about it, and I even take medication but its still there.\n\nI am tired of living my life like this and I really want to just not care about anything and live a \"normal\" life. I have a lot of goals and aspirations but it seems everything I want to do is impossible because of my social anxiety. I am extremely lucky to have been able to get a job with people I know and it makes work bearable.\n\nMy dream is to join the Navy after I finish high school and I need to conquer my social anxiety in order to get there. Thank you for reading my extremely long story and any advice that you can give me to help me get one step closer to my dream will be greatly appreciated. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How can I get over my horrible social anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bhhdc/how_can_i_get_over_my_horrible_social_anxiety/"
        },
        {
            "author": "my-selfreflection",
            "author_created_utc": 1394084753,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fku3m",
            "created_utc": 1406208630,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2blcpm/about_to_have_a_severe_anxiety_attack_at_work/",
            "gilded": 0,
            "id": "2blcpm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2blcpm/about_to_have_a_severe_anxiety_attack_at_work/",
            "retrieved_on": 1441253195,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "If you look thru my past youll know why I am so usually all the time anxious, and its just a matter of suppression/repression/distraction (basically im doing thru a really emotionally destroying break up where I gave my all to a girl I loved and also had borderline personality disorder, and brain cancer and in the end she basically told me she never loved me as much as i loved her and shes moved on and happy because i wasnt enough)\n\nBut now on top of all that my only true friend is going thru so much she told me \"im sorry but I cant handle your problems right now, I care, i really do but I am handling too much  right now\"\n\nIve never felt more alone. Everyone in my life has let me down and as long as I had my ex (before all this) and my best friend I was fine. I could always rely on them to understand me and atleast let me vent a little. \n\nBut now... My ex and i will never talk again. I would of died for her at one point, I gave her my everything and was ready to take my next step in life with her. And now? Ive never been further from someone and its absolutely crushing. \n\nMy best friend, I cant be mad at her. She is going thru her own anxiety and depression and just cant handle more stress. doesnt mean it leave me alone.\n\nI cant do this. I dont know if i can breath thru this one. My nails are already digging into my palms. I can feel them tingling. I always lose feelings in my hands during these things. My breathing is getting faster. this cant fuckin happen.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "About to have a severe anxiety attack at work.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2blcpm/about_to_have_a_severe_anxiety_attack_at_work/"
        },
        {
            "author": "LunchDrunk",
            "author_created_utc": 1376272798,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cq18c",
            "created_utc": 1406160851,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bjqm2/does_anyone_have_their_anxiety_triggered_by/",
            "gilded": 0,
            "id": "2bjqm2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bjqm2/does_anyone_have_their_anxiety_triggered_by/",
            "retrieved_on": 1441253949,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "Every Thursday in my office the group that has control of the music plays house music ALL DAY. The recurring beats make me feel so anxious for some reason, I just came close to having a full fledged panic attack. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone have their anxiety triggered by certain types of music?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bjqm2/does_anyone_have_their_anxiety_triggered_by/"
        },
        {
            "author": "hopefullyex-fatguy",
            "author_created_utc": 1317159696,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5xpmh",
            "created_utc": 1406235517,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bmpjl/so_i_started_prozac_today_extremely_optimistic/",
            "gilded": 0,
            "id": "2bmpjl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bmpjl/so_i_started_prozac_today_extremely_optimistic/",
            "retrieved_on": 1441252562,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I finally took the next step of treatment and decided to get some medication to beat this disease. I talked to my doctor and was completely serious and honest with him, telling him everything. Prozac is like a two-for-one special, treating my anxiety and depression together. I'm extremely excited, and even though he said it may take three weeks to notice a difference, I already feel like I do after just one dosage. Depression and Anxiety have tortured me every single day since I was a small child, and hopefully this is a new beginning. I also got a bunch of labs and a couple x-rays to see if I'm okay health wise, and also a thyroid test to help with the weight. I have lost almost 100 pounds in the last year or so, so he was worried because of the fluctuating weight. Anyone have any experience with Prozac? How big of a change did you feel after three weeks? Please no negativity though, as a fellow person with anxiety you should know what it's like to have your head filled with worries and non-sense.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So I started Prozac today, extremely optimistic and excited about the future!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bmpjl/so_i_started_prozac_today_extremely_optimistic/"
        },
        {
            "author": "creakybones",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406468872,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2buve3/how_do_you_know_if_its_bad_enough_to_go_consult_a/",
            "gilded": 0,
            "id": "2buve3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2buve3/how_do_you_know_if_its_bad_enough_to_go_consult_a/",
            "retrieved_on": 1441248694,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I've always felt anxiety after eating too much food or when a friend is about to leave after a fun day out. But those instances never happened more than once a month.\n\nI started having bad anxiety and panic attacks almost everyday since the end of January this year. I had horrible thoughts running non-stop in my head, a racing pulse, an inability to concentrate, shaky hands, and I broke down crying at least every other day. I think that was understandable then since I was under a lot of stress until the beginning of June.\n\nNow that my stress sources are almost down to none, my panic attacks have gone down in intensity and frequency (from everyday to at most four times a week). I had expected my anxiety to disappear when my stress did. Instead, I'm always feeling mildly to moderately anxious about everything my brain latches onto, or nothing at all when it can't find a reason. It gets much worse near my period where I break down crying and shaking almost everyday a week before I expect to get it.\n\nGetting mental help has a VERY negative stigma in my country. My mother yells at me while hugging me to learn to handle it myself and deal with it when I start crying. \n\nI'm afraid to get help and i'm not sure if what I'm feeling is bad enough to go to a doctor. I'm anxious and it has affected my life. I find it more difficult to concentrate and find the drive to do anything. BUT I can still function everyday.\n\nHow do you know if it's bad enough to see a doctor? or should i just wait until it goes away? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you know if it's bad enough to go consult a doctor?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2buve3/how_do_you_know_if_its_bad_enough_to_go_consult_a/"
        },
        {
            "author": "RainMantis",
            "author_created_utc": 1341621728,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_88zog",
            "created_utc": 1406059863,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bfdgi/does_anyone_else_here_gag_when_nervous/",
            "gilded": 0,
            "id": "2bfdgi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bfdgi/does_anyone_else_here_gag_when_nervous/",
            "retrieved_on": 1441256050,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "How do you deal with it?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else here gag when nervous?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bfdgi/does_anyone_else_here_gag_when_nervous/"
        },
        {
            "author": "throwaway01291",
            "author_created_utc": 1406367992,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hkvj9",
            "created_utc": 1406370110,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2brr5v/could_really_use_some_help_reddit/",
            "gilded": 0,
            "id": "2brr5v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2brr5v/could_really_use_some_help_reddit/",
            "retrieved_on": 1441250149,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "Hi there guys, I really have no idea on where to begin.\n\nMy name is Josh, i'm 23 and have no idea what i am doing with myself. I know so far this doesn't sound like an anxiety issue, but i'll explain further on.\n\nI work part-time at a local supermarket. I don't particularly enjoy it, but who would. I have always been anxious, but it's only progressed on worse. I can't even leave the house without feeling incredibly nervous. I tend to mumble 24/7, which makes everything a whole lot worse. \n\nMy ex girlfriend has recently broken up with me, because of all this fucking issues that are taking place. I don't blame her at all. I don't mean to sound like i'm grieving attention or anything, but it's true. Who would want to be somebody that has no direction in their life?. I do miss her like crazy though. There's no way we're getting back together though. She's dating somebody else. \n\nI'm the jealous type and often paranoid over silly things. This also contributed to the breakup. \n\nOk, i know this story has no structure at all, which i do apologize. That would be my poor English grammar and punctuation. I don't possess any skills. When i was in school i had no drive. I came out with pretty much nothing, and was told by 'friends' that i wouldn't amount to much. Over the years i have developed an interest towards computers. The only thing that is keeping me sane is this interest. I have always pictured myself developing software and having a solid understanding of open source operating systems. \n\nBut at the rate I'm going at the moment, it's gonna take a very long time to achieve this. I can't seem to focus on one thing at a time. I go through phases; i.e writing a daily routine. This would only last for about a week though, before falling back into this hole.\n\nI'm always feeling overwhelmed. And have often had thoughts about just ending life. I'm stronger then/than?(don't even know which to use...) though. It just passes my mind every so often. It just seems like an easy option then putting up with this shit. \n\nPlease help me :(\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Could really use some help Reddit :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/2brr5v/could_really_use_some_help_reddit/"
        },
        {
            "author": "Jpro124",
            "author_created_utc": 1358624955,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_aae9i",
            "created_utc": 1406021501,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bdpx2/just_got_broken_up_by_a_girl_i_cared_about_more/",
            "gilded": 0,
            "id": "2bdpx2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bdpx2/just_got_broken_up_by_a_girl_i_cared_about_more/",
            "retrieved_on": 1441256825,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "Dated a girl for 6 months and it ended last night. The anxiety usually affects me when I'm alone in bed and I'll wake up in the middle of the night (twice already) and my brain will immediately remind me what is going on and I'll start having an anxiety attack and have no one to help calm me down. Can somebody give me any advice?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just got broken up by a girl I cared about more than anything. Anxiety is going insane right now",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bdpx2/just_got_broken_up_by_a_girl_i_cared_about_more/"
        },
        {
            "author": "put_the_past_away",
            "author_created_utc": 1406330527,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hkod2",
            "created_utc": 1406368670,
            "domain": "self.Anxiety",
            "edited": 1406422536,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2brq4u/things_are_going_well_but_im_constantly_thinking/",
            "gilded": 0,
            "id": "2brq4u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2brq4u/things_are_going_well_but_im_constantly_thinking/",
            "retrieved_on": 1441250161,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I thought I'd post this here as r/anxiety have proven very supportive and friendly in other posts. But it is pretty scary for me to write this here.\n\n\nSome background about me. Turning 30 soon. I've got a good job, I'm doing something I enjoy and it pays well. I have a girlfriend, she is a nice and we've been together nearly 5 years, she is supportive but doesn't understand me. I have friends who I hang out with, but I have social anxiety so I feel more comfortable hiding at home. I'm rather heavily medicated for anxiety and depression, but I've been stable for a while so I've been doing ok in this regard.\n\n\nIf i think rationally, my life is going rather well considering these medical issues. But inside me, it may sound childish, but I have an inner desire to just run away. I guess we're always told to go to school, get a job, get married, have kids, retire and then die. There is nothing wrong with that, but I feel trapped and uncomfortable with the way things are in my life and where they are going. I feel as if running away I could leave behind all my inter conflict and finally relax, where I can be myself and find comfort.\n\n\nOn the other hand though, starting fresh is scary, especially with general anxiety and social anxiety, how would I cope? I'm not so bad that I couldn't function, but I spent so long getting through dark times as a teenager/early 20s, that I'm scared to go back to that place. \n\n\nI believe I should follow my desires, but on the other hand, facing my fears and throwing everything away is terrifying. Has anyone here been through something similar?\n\n\nEdit 1: Thanks for your responses. I definitely feel better and have definitely got some things to think about- I'm actually kind of excited at the fact that I have something to work towards, like the light at the end of the tunnel. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Things are going well, but I'm constantly thinking of running away and starting fresh, but terrified of what could happen [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2brq4u/things_are_going_well_but_im_constantly_thinking/"
        },
        {
            "author": "randomfanboy1",
            "author_created_utc": 1352230425,
            "author_flair_css_class": "",
            "author_flair_text": "Thinks too much.",
            "author_fullname": "t2_9iv04",
            "created_utc": 1406065301,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bfnv5/overthinking_and_overanalysing_has_wrecked_me/",
            "gilded": 0,
            "id": "2bfnv5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bfnv5/overthinking_and_overanalysing_has_wrecked_me/",
            "retrieved_on": 1441255854,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I hate being alone with my thoughts...\n\nMy mind always has to drown me in a torrent of negative thoughts whenever someone happens to me, good or bad. For example, when someone compliments me, or makes me feel like a good person, I'll feel euphoric for a while, but then my mind starts to say things like \"Did he/she really mean that?\" or \"Are they just mocking me for some amusement?\"\n\nI know that they really do mean it because they're very nice people, but my subconscious keeps trying to convince me that they do not mean it, and that they cannot stand me. This starts to make me feel inferior towards that person, therefore triggering anxiety.\n\nIf anyone has any tricks to stop my habit of overthinking and overanalysing, please share them in the comments, because this is really getting me down, and I'm worried that close friendships could end if this carries on.\n\nThanks for showing some concern, and if anyone else suffers from constantly overthinking negative things, you are not alone! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Overthinking and overanalysing has wrecked me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bfnv5/overthinking_and_overanalysing_has_wrecked_me/"
        },
        {
            "author": "inahc",
            "author_created_utc": 1315612513,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5tuwu",
            "created_utc": 1406516563,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bwtjm/til_i_can_practice_assertiveness_on_myself/",
            "gilded": 0,
            "id": "2bwtjm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bwtjm/til_i_can_practice_assertiveness_on_myself/",
            "retrieved_on": 1441247724,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "so earlier today, instead of going \"oh god I'm on reddit again why am I on reddit aaaaugh I'm still on reddit\" and getting all stressed out about it, my brain went \"actually I don't want to be on reddit at the moment, kthxbai\" and actually succeeded at leaving reddit. without any angst or anxiety or self-loathing.\n\nand then I noticed that the feeling of doing that was just like the (rare) feeling when I manage to be assertive about my needs/desires at someone else.  I thought that was kinda neat. :)  maybe if I practice it, I'll get better at standing up to jerky parts of my brain (anxiety, depression etc) without it turning into a war.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "TIL I can practice assertiveness on myself",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bwtjm/til_i_can_practice_assertiveness_on_myself/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406114453,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2bhie7/my_husband_doesnt_love_me_anymore/",
            "gilded": 0,
            "id": "2bhie7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2bhie7/my_husband_doesnt_love_me_anymore/",
            "retrieved_on": 1441254992,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "Sort of rant and first post in this sub. Sorry if everything about this sucks. This will probably be long and depressing, so feel free to skip.\n\nMy husband and I got married two years ago and were together long before that. He is in the military and after we were married we moved across the country from our families. I have always had ADD and GAD and have had a hard time functioning like a normal human being but it got especially bad after moving away from my family and my career into an unfamiliar place. He knew about my issues when we were married but it has never really been as bad as it is now.\n\nHe says I've stopped putting any effort into anything, and he's right. I spend a lot of time in bed because I always feel tired and I'm literally scared to get up and do basic necessary things like eat, clean, and go to work. I cry a lot at random nonsense and my self-esteem is pretty much non-existent. I don't do much for my appearance anymore, but he also has always told me that he likes me to look natural anyway so I'm not sure how much that is an issue, but I understand why his feelings for me have changed.\n\nHe says I put no effort into our relationship and I feel like that's not true because I do try to communicate with him... but I also feel like I'm wrong a lot lately. I know he's not my therapist and he shouldn't have to be, but I wanted to be able to rely on him a little. I've tried to talk about how I feel with him and he'll say things like \"why don't you just do the things you have to do?\" and \"you don't have any real reason to be upset.\" While these are valid points, they are the same things I scream at myself inside my head on a regular basis and it doesn't feel great to hear him say them.\n\nI made some appointments to see a therapist and to get refills on medicine (something I've been forgetting to do for a while) and I was talking to him about it and I asked if in the future he would come with me to one of my therapy appointments so he could get a better understanding of what I'm dealing with. I'm new to the whole therapy thing so maybe this was a universally bad idea and I was just stupid, but he got really mad. He said that he didn't love me anymore, that I was a burden on him, and he told me to \"fix myself and then come back\" after he said that we don't have a relationship anymore.\n\nI'm hurt and in shock and I feel horribly, horribly guilty because I know this was my doing. I'm having a hard time looking at this from his perspective because I feel hurt and I'm habitually selfish, I guess. I was wondering if anyone had a similar experience or some advice for understanding how he feels and hopefully fixing what I have broken.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My husband doesn't love me anymore",
            "url": "http://www.reddit.com/r/Anxiety/comments/2bhie7/my_husband_doesnt_love_me_anymore/"
        },
        {
            "author": "Nobodybody",
            "author_created_utc": 1399561893,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ghc73",
            "created_utc": 1406292508,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2borby/just_looking_for_advice_on_being_an_adult_with/",
            "gilded": 0,
            "id": "2borby",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2borby/just_looking_for_advice_on_being_an_adult_with/",
            "retrieved_on": 1441251545,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I'm 35 and almost embarrassed to talk about it...in a nutshell I experienced heavy rejection in school, with family (step parents, divorce etc.), and by high school I was very withdrawn, so shy I'd only speak quietly to a few friends I considered very close. Was always extremely intimidated by popular or outgoing people.\n\nBut I grew up, and out, of most of that. However, some of it still lingers from.time to time. My wife is.very social, prefers to be right in the center of the action while I'm the quiet lurker. We just moved to a new state, where she's from, and she's having a handful of friends over Saturday. She organized it, then I read about them all talking about it on Facebook. I have nothing to add to the conversation, so immediately feel like an outsider, and these feelings and warning signals of rejection, anxiety, etc., kick in. It feels so childish but I can't control it. I end up trying to discuss it with my wife, and she gets angry because it's been an ongoing issue for years, every time.there is a social situation that. I didn't organize or control I have some issue, and can't manage it properly.\n\nI take xanax, which helps but makes me tired. I just want it to stop.\n\nWhen it coes to being social, I'm fine. I like people, can approach and conversate well, can seem reallly outgoing and make people laugh. But the second somethi.g goes wrong...I see others grouping up and not including me, someone makes an offensive comment even if it was in jest, I am overcome with these childish feelings of rejection, anxiety, and can't regain my composure well.\n\nJust looking for some help. I feel like my personality has an exposed nerve.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just looking for advice on being an adult with lingering, childlike social anxiety issues..",
            "url": "http://www.reddit.com/r/Anxiety/comments/2borby/just_looking_for_advice_on_being_an_adult_with/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1406570064,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2byppo/i_23_m_only_have_anxiety_during_relationships/",
            "gilded": 0,
            "id": "2byppo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2byppo/i_23_m_only_have_anxiety_during_relationships/",
            "retrieved_on": 1441246840,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I've been dating my girlfriend for around 5 months and she's wonderful. I've known her for a while before we started dating and know she'd never cheat on me or has given me any reason not to trust her. However whenever she takes a long time to respond to my texts, my mind runs crazy and I get a deep anxious feelin in my stomach that doesn't stop. All I think about is that she doesn't care about me or she's probably hanging out with a guy (something she'd never do) but I still get that feeling I can't control. \n\nCan anyone help me out? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I (23 M) only have anxiety during relationships. What should I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2byppo/i_23_m_only_have_anxiety_during_relationships/"
        }
    ]
}