{
    "data": [
        {
            "author": "weeanimalcule",
            "author_created_utc": 1387242873,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ee5zw",
            "created_utc": 1404995937,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2abszj/my_boyfriend_is_finally_starting_to_get_it/",
            "gilded": 0,
            "id": "2abszj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2abszj/my_boyfriend_is_finally_starting_to_get_it/",
            "retrieved_on": 1441274756,
            "score": 229,
            "secure_media_embed": {},
            "selftext": "I don't post much but I just wanted to share a huge thing that happened last night.  I've been dealing with anxiety for about 7 years now and it has been decently stagnant over the past year and a half.  A little over a year ago was when I met my current boyfriend.  Anyways, throughout the past year there have been little scares that my anxiety would rear its ugly head, but I was able to cope and control and really pushed myself (especially because I didn't want to scare him off at the beginning).\n\nHowever, over the past 3 weeks, things have been going a bit downhill, building up to a panic attack a couple days ago and since then I've been seriously on edge, tense, and nervous in between some pretty bad lows.  \nAnyways, my boyfriend would get so frustrated when I couldn't explain to him in a simple and immediate way what was happening since he's never dealt with this before and didn't understand (he is a super logical person).  His impatience when times get tough had caused little problems in the past and so it made it that much harder for me to want to open up.\n\nLast night though, he came to my house (he knew I was feeling pretty bad all day and left work early), and he marched right to me and wrapped his arms around me and said \"I'm so so so sorry.\" over and over.  He explained he has been reading about anxiety and he's been doing everything wrong - he'd been trying to fix everything, telling me to just stop, getting frustrated... He told me he'd be there for me for whatever I need, whether it's a silent cuddle, a walk in the park, or an ear to listen, and at **my** pace. He'd be there for me as a support until I'm okay.\nIt meant everything to me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My boyfriend is finally starting to get it :')",
            "url": "http://www.reddit.com/r/Anxiety/comments/2abszj/my_boyfriend_is_finally_starting_to_get_it/"
        },
        {
            "author": "VIthar7",
            "author_created_utc": 1401822512,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gtzx8",
            "created_utc": 1405103372,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ag3sv/a_little_trick_i_found_to_help_with_panic_attacks/",
            "gilded": 0,
            "id": "2ag3sv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ag3sv/a_little_trick_i_found_to_help_with_panic_attacks/",
            "retrieved_on": 1441272751,
            "score": 158,
            "secure_media_embed": {},
            "selftext": "A while back I was searching for some self help tips on dealing with panic attacks, and I came across a forum post with a great tip on what to do when a panic attack happens.\n\nIdentify 5 things you can see, 4 things you can hear, 3 things you can feel, 2 things you can smell and 1 thing you can taste.\n\nFor me it is often enough let my brain take a step back and snap me out of a downward spiral of negative thoughts.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A little trick I found to help with panic attacks",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ag3sv/a_little_trick_i_found_to_help_with_panic_attacks/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1405171419,
            "domain": "self.Anxiety",
            "edited": 1405186453,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2aib0z/does_anyone_else_get_triggered_when_drinking_high/",
            "gilded": 0,
            "id": "2aib0z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2aib0z/does_anyone_else_get_triggered_when_drinking_high/",
            "retrieved_on": 1441271664,
            "score": 103,
            "secure_media_embed": {},
            "selftext": "Edit: Ah phew, good to see others get triggers from caffeine too. Today I (stupidly) drank two glasses of coke and had the worst anxiety/panic attack yet, I literally felt I was going to have a heart attack. All good now. Oh and remember guys, eventually whatever hardships you face, they will eventually be in your past :) Best of luck to you all.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else get triggered when drinking high caffeinated drinks? Like Coke or coffee?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2aib0z/does_anyone_else_get_triggered_when_drinking_high/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1405353241,
            "domain": "self.Anxiety",
            "edited": 1405403217,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2aobfp/honestly_is_it_ok_to_call_in_sick_at_work_due_to/",
            "gilded": 0,
            "id": "2aobfp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 62,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2aobfp/honestly_is_it_ok_to_call_in_sick_at_work_due_to/",
            "retrieved_on": 1441268799,
            "score": 100,
            "secure_media_embed": {},
            "selftext": "I'm wondering because I don't know if I can take feeling like this at work tomorrow (I'm doing a project in a research lab at university this summer). Today's been pretty much one long anxiety attack and I can't handle the stress and the crippling fear of failure. I just got home and I feel like crying. I normally go to university/work even though I feel horrible but today's been *really* bad and I don't want to feel like this tomorrow.\n\nBackground: I suffer from depression, social anxiety disorder, generalised anxiety disorder and OCD (though it's not sure whether I've got OCD or if that could be included in my potential diagnosis of Asperger's Syndrome, which I'm getting assessed for at the moment). So yeah, there's a lot going on and no one at work knows about it.\n\nI don't want to call in sick though. Not really. I don't want to seem ungrateful or lazy etc. I really like working there but work plus everything going on inside my head is too much to handle sometimes.\n\nI hate that I'm so weak.\n\n**UPDATE:** Ok, I'm not going to call in sick but I still don't know how to handle everything. I've been feeling very low lately and I'm so anxious about what other people think and about making mistakes that I even hate myself every time I have to ask my supervisor a question (but I have to ask to make sure I don't do anything wrong).\n\n**UPDATE 2:** What do you do when you feel absolutely horrible at work? What do you do when the stress and fear of failure is so bad you panic?\n\n**UPDATE 3:** Well, I'm off to bed (it's 10pm over here). I'll try to get 8 hours of sleep before getting up for another day of work. We'll see how it goes (didn't go that well at all last night). Anyway, thank you for all the replies. Please keep writing if you want to. It helps and it makes me feel like I'm not completely alone. Thank you.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Honestly, is it OK to call in sick at work due to anxiety/depression?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2aobfp/honestly_is_it_ok_to_call_in_sick_at_work_due_to/"
        },
        {
            "author": "Bel7861",
            "author_created_utc": 1338074002,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7thq4",
            "created_utc": 1405161141,
            "domain": "huffingtonpost.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ai32a/8_things_only_people_with_anxiety_understand/",
            "gilded": 0,
            "id": "2ai32a",
            "is_self": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ai32a/8_things_only_people_with_anxiety_understand/",
            "retrieved_on": 1441271767,
            "score": 97,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/wxmD1BzuLazAfgZF.jpg",
            "title": "8 things only people with anxiety understand",
            "url": "http://www.huffingtonpost.com/2014/05/05/truths-about-anxiety_n_5240381.html"
        },
        {
            "author": "hitachi_wand_",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404952263,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2aafbv/anyone_suffer_from_binge_eating_as_a_symptom_of/",
            "gilded": 0,
            "id": "2aafbv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2aafbv/anyone_suffer_from_binge_eating_as_a_symptom_of/",
            "retrieved_on": 1441275400,
            "score": 82,
            "secure_media_embed": {},
            "selftext": "And how were you able to manage this? My binge eating is getting out of control and i can't exercise enough to burn all the excess calories. I've tried tracking macros all year on MyFitnessPal, but i'd get frustrated and ruin my diet. Halp meeee :(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone suffer from binge eating as a symptom of anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2aafbv/anyone_suffer_from_binge_eating_as_a_symptom_of/"
        },
        {
            "author": "Logust11470",
            "author_created_utc": 1296372211,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4s685",
            "created_utc": 1404869493,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a77ej/to_the_person_who_posted_about_having_thoughts_of/",
            "gilded": 0,
            "id": "2a77ej",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a77ej/to_the_person_who_posted_about_having_thoughts_of/",
            "retrieved_on": 1441276963,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "A few minutes ago, someone posted saying that they were being troubled by thoughts of death and dying. \n\nUnfortunately, they deleted their post before I could reply. \n\nI'm hoping that they will see this and find some comfort. I have posted my reply below. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "To the person who posted about having thoughts of death and dying....",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a77ej/to_the_person_who_posted_about_having_thoughts_of/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404929560,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a9c17/goodbye_friends_i_am_gone/",
            "gilded": 0,
            "id": "2a9c17",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a9c17/goodbye_friends_i_am_gone/",
            "retrieved_on": 1441275909,
            "score": 61,
            "secure_media_embed": {},
            "selftext": "After an extremely turbulent family vacation it has come to a head that I will be hospitalized instead of returning home.\n\nIn the past two weeks I have had numerous panic attacks during which I:\n\n-Made graphic violent threats to my family members.\n\n-Carved into my arm with a dirty piece of glass.\n\n-Accused my parents of trying to drive me insane or to suicide.\n\n-Been left sobbing or unresponsive in major metropolitan areas.\n\nThese events have led those around me to believe my problem is much more serious than an anxiety disorder. I do not fully remember all of these events or the circumstances leading up to them. I hope that this will lead to a better future for myself, but I don't really know what to expect. I have never been more terrified in my entire life.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Goodbye friends, I am gone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a9c17/goodbye_friends_i_am_gone/"
        },
        {
            "author": "nellaselendil",
            "author_created_utc": 1289411610,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4idc4",
            "created_utc": 1404915038,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a8mx2/either_im_sleepy_or_im_anxious_no_middle_ground/",
            "gilded": 0,
            "id": "2a8mx2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a8mx2/either_im_sleepy_or_im_anxious_no_middle_ground/",
            "retrieved_on": 1441276295,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "It all started when I took a Claritin allergy tablet. It made me feel slightly stoned. Then I took one a few days later, and I had a near full blown panic attack (throat swelling, hard time breathing, thoughts flooding, heart pounding). I've had 2 panic attacks before, but over a year ago. I had nothing to panic about. No reason to be anxious. I was just going on a hiking trip to camp out with my husband. It was the worst camping trip of my life to say the least. Since then, I've had trouble every time I eat, sometimes when I wake up in the morning, and I absolutely can't sleep at night without a few drinks. \n\nSo, I began trying to meditate and relax myself with breathing exercises. It helps. It helps so much...except... once I relax, I become overwhelmingly sleepy. There's nothing I can do to fight it. Hanging out with friends and don't want to be anxious? ... I just deal with the tiredness. It's either be wound up tight and ready to explode out of my head or take a nap. Naps have saved my mental health, but I fear sleeping so much is depleting my ability to function properly around the house. It makes me look like a lazy asshole. I get things done, but not at half the rate I used to. I'm so confused as to why I've become so sleepy. It's dragging me into a state of depression. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Either I'm sleepy or I'm anxious. No middle ground.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a8mx2/either_im_sleepy_or_im_anxious_no_middle_ground/"
        },
        {
            "author": "pseudobrittany",
            "author_created_utc": 1339676758,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7zrz1",
            "created_utc": 1404798061,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a4cxd/i_get_it_now/",
            "gilded": 0,
            "id": "2a4cxd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a4cxd/i_get_it_now/",
            "retrieved_on": 1441278290,
            "score": 55,
            "secure_media_embed": {},
            "selftext": "I really can't tell you how ill anxiety has made me.\n\nI like to think of myself as the anxiety queen. My symptoms have been extreme, from my heart rate being totally out of control, to complete sporadic nausea and pain on a daily basis, to the point I can't actually control my body to get up to go to the bathroom. It has consumed me.\n\nI was given words by people for years. Words that never meant much to me, because I was too busy being scared. They were saying \"You need to stop checking your heart rate so often. It's making it worse.\" but I never could stop myself. My argument was that \"I check it because I'm afraid it's out of control if I don't.\". I tried to take control of my own body. I have checked my heart rate 125,000 times in the last year and a half, by my averaging prediction. My brain has been reprogrammed. Completely and totally.\n\nI haven't turned my brain off in 5 years. And it has destroyed me. Because this whole time I've been telling myself the same thing.\n\nThat it's not going to be okay. I saw this anxiety disorder as circular. That I was trapped inside of it. But I was trapping myself. By telling myself it wasn't going to be okay, I allowed myself to be out of control, of something I never had any control of in the first place. \n\nIt's not just with health anxiety though. It manifests itself in everything. When I need to go to bed, I sit here on the computer, watching the hours tick past telling myself \"I can't do anything about this.\" whilst scolding myself. I do the same with my studies.\n\nI have wasted 5 years of my life being in artificial pain. For the first time, I have a feeling in my brain of complete, and total control over my reaction to having no control.\n\nI didn't need to stop worrying. I needed to stop worrying about worrying. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I get it now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a4cxd/i_get_it_now/"
        },
        {
            "author": "Companion355",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404837620,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a5me6/driving_anxiety_is_messing_up_my_life_help/",
            "gilded": 0,
            "id": "2a5me6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a5me6/driving_anxiety_is_messing_up_my_life_help/",
            "retrieved_on": 1441277701,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "I've always been afraid of driving. I finished a learner's class when I was a senior in high school, but I never felt like I learned anything like how to parallel park or get onto a high way. I can't get into the driver's seat without worrying that I'm going to damage the car or kill somebody. And if I make mistakes, I worry about freezing up. My parents have been putting a lot of pressure on me to take the test, so I finally scheduled it for August 2nd. I also signed up for some extra lessons in the weeks leading up to the date. But I really, Really don't want to get into a car. I know I'm psyching myself out, but I can't seem to Stop. If I don't get my licence Now, then I'll be screwed when I graduate college next May and need to travel for work.\n\nDoes anyone have any advice? Anything would be appreciated. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Driving Anxiety is messing up my life. Help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a5me6/driving_anxiety_is_messing_up_my_life_help/"
        },
        {
            "author": "Royboy87",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1405272219,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2algzf/my_weight_has_been_lifted/",
            "gilded": 0,
            "id": "2algzf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2algzf/my_weight_has_been_lifted/",
            "retrieved_on": 1441270187,
            "score": 49,
            "secure_media_embed": {},
            "selftext": "Been working at a new job for a month now, knew I shouldn't have taken it from the get go but went ahead with it anyways cause the money was great. Month later and I had my first panic attack yesterday, in front of my kids too. Realized money isn't everything so we're moving back to my home town and I got a job that pays way less but hopefully won't be as stressful. For the first time in a month I actually felt hungry and ate something!!!!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My weight has been lifted!!!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2algzf/my_weight_has_been_lifted/"
        },
        {
            "author": "literaryyours",
            "author_created_utc": 1384521751,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dxd8a",
            "created_utc": 1405331835,
            "domain": "reclusivefox.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2anllr/have_you_heard_of_vitamin_b_being_used_for/",
            "gilded": 0,
            "id": "2anllr",
            "is_self": false,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2anllr/have_you_heard_of_vitamin_b_being_used_for/",
            "retrieved_on": 1441269194,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/JepDnx0SSOrK9ZJJ.jpg",
            "title": "Have you heard of vitamin B being used for depression and anxiety? I tried it for a month and it helped I think.",
            "url": "http://reclusivefox.com/experience-vitamin-b-anxiety/"
        },
        {
            "author": "Wicked_Wire",
            "author_created_utc": 1403483897,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h3aoi",
            "created_utc": 1405282864,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2alw29/yay_a_kitten_in_the_house_has_done_wonders/",
            "gilded": 0,
            "id": "2alw29",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2alw29/yay_a_kitten_in_the_house_has_done_wonders/",
            "retrieved_on": 1441269994,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "I suffer from anxiety and depression. Today, I realized my boyfriend is a textbook narcissist. Oh, I knew his actions/words were \"off\" but I never knew the name for it. His disposition and my illness make for some rocky times. I lost my insurance coverage at the end of April. Working on getting it back. I had been on paxil and xanax (as-needed, which wasn't often after paxil kicked in) since only February.\r\rAnyways, the past couple months have been rough. I'd had fucking amazing results with meds. For it to be ripped away...loosing who I was becoming, having a hard time once again dealing with people, driving, kids, boyfriend, demands of raising animals, everyday tasks...\r\rIm a mess. Crying, emotional outbursts. Trying to hide it from my kids (11 and 12). Avoiding neighbors. Trying to remember that boyfriend and I work really well together when we're in sync...\r\rWe live in the country. Someone threw kittens out their car, we figure. It happens. We only caught one and she is so damned affectionate. I'd been previously told, that there was NEVER going to be a cat in the house. He actually let me keep her.\r\rShe cuddles and purrs. She lays on my chest and sleeps for hours at a time. She plays with the kids, but is just as happy letting them pet her. And she is a little fuzzball that lets me pick her up and hug her, pet her, talk to her.\r\rIt seems silly in a way, when writing it out for strangers. But, I feel relief. A week ago i was wondering...all sorts of things. Could i go on without meds (uh, no, not if i can help it), could i start making enough money online to leave my boyfriend (sure, after meds kicked in again, but then his ways won't upset me), am i hurting my kids by being distant (yes, but not as much as if i were not protecting them).\r\rThe kitten has been like a reset button. I still feel anxiety, I still get upset quite easily, but i have her as an escape. Hopefully it helps for as long as it takes for me to be able to buy my meds again. \r\rI really did get lucky with this kitten. So docile and sweet. Poor thing has a bit of road rash on her face, but it seems to be healing nicely.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Yay! A kitten in the house has done wonders",
            "url": "http://www.reddit.com/r/Anxiety/comments/2alw29/yay_a_kitten_in_the_house_has_done_wonders/"
        },
        {
            "author": "the_vent",
            "author_created_utc": 1361132999,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_amtzn",
            "created_utc": 1405233506,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2akhiv/the_best_way_i_can_describe_this_feeling/",
            "gilded": 0,
            "id": "2akhiv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2akhiv/the_best_way_i_can_describe_this_feeling/",
            "retrieved_on": 1441270647,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "It feels like my parents just yelled at me. It's like there is something I did that I should be ashamed of. Like, there is something I should be doing or should be aware of that is of life or death. \n\nI'm interested in how feeling can be made into words Maybe these are just the worst experience I have t compare it to. It isn't much, but it does say a lot about me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The best way I can describe this feeling.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2akhiv/the_best_way_i_can_describe_this_feeling/"
        },
        {
            "author": "Throwawayjjjjjjjjj1",
            "author_created_utc": 1402971101,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h0cpx",
            "created_utc": 1405282402,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2alvdi/stomach_problems_bowel_problems_problems_on/",
            "gilded": 0,
            "id": "2alvdi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2alvdi/stomach_problems_bowel_problems_problems_on/",
            "retrieved_on": 1441270003,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "Lately my physical symptoms have been of a digestive nature. A pretty fun and exciting mix of both stomach, and bowel symptoms! I was joking about the fun and exciting part, they are neither. I'm going to list my symptoms and I want to see if anyone has similar symptoms that they can attribute to IBS and GERD/Acid reflux. \n\n\n**Stomach Symptoms**\n\n*Burping,\n*Regurgitation,\n*Acid coming into mouth sometimes\n*Getting full easily\n*Lack of appetite, hunger doesn't feel the same.\n*Sometimes nausea\n*Tickle in throat/coughing which I think may be due to acid.\n*No heartburn...\n\n**Bowel Symptoms**\n\n*Constipation,\n*Sticky stool - this is gross but lots of wiping, takes FOREVER to get clean,\n*Small bowel movements, \n*Flat stools,\n*Skinny stools,\n*Straining,\n*Feeling of fullness and discomfort.\n\n\nThese are pretty much what i've been dealing with on a daily basis, I unfortunately am a slave to the wait times of the Canadian health care system, so I can't see a GI for another month or two, I'm on a waiting list. I'm worried there is either something fatally wrong with me, or something incurable, like Gastroparesis. \n\nOr this is all just another way of my anxiety issues expressing themselves. Everyday is a struggle with these symptoms, I'm losing weight cause I'm not eating right and that scares me. I'm already a pretty skinny guy, so I need the weight i have. Just wondering if anyone can relate.\n\nThanks for reading all this at least, hope there is someone out there that can relate.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Stomach problems, Bowel problems, Problems on Problems. TMI probably, Can anyone relate?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2alvdi/stomach_problems_bowel_problems_problems_on/"
        },
        {
            "author": "loliwarmech",
            "author_created_utc": 1403005547,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h0iz3",
            "created_utc": 1405080587,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2af3yz/help_sudden_anger/",
            "gilded": 0,
            "id": "2af3yz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2af3yz/help_sudden_anger/",
            "retrieved_on": 1441273214,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I tend to be on the edge a lot. Usually I just act frightened and withdrawn, but now and then I just have this sudden internal explosion of anger that happens for no particular reason. DAE experience anything similar, or know what might cause these?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Sudden anger",
            "url": "http://www.reddit.com/r/Anxiety/comments/2af3yz/help_sudden_anger/"
        },
        {
            "author": "Pancocks",
            "author_created_utc": 1318257152,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_60jdc",
            "created_utc": 1405284684,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2alyhz/dae_feel_like_their_anxiety_flares_up_when_theyre/",
            "gilded": 0,
            "id": "2alyhz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2alyhz/dae_feel_like_their_anxiety_flares_up_when_theyre/",
            "retrieved_on": 1441269962,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I have the flu right now and my mind is making me think I'm going to die, even though I know that's not true.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel like their anxiety flares up when they're sick?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2alyhz/dae_feel_like_their_anxiety_flares_up_when_theyre/"
        },
        {
            "author": "Akomplice88",
            "author_created_utc": 1390583164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_eykdv",
            "created_utc": 1404766228,
            "domain": "self.Anxiety",
            "edited": 1404770358,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a2ydz/what_has_helped_me_with_anxiety/",
            "gilded": 0,
            "id": "2a2ydz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a2ydz/what_has_helped_me_with_anxiety/",
            "retrieved_on": 1441278945,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I just want to give some of my strategies/tips/techniques that have helped me in this journey. About me: Im 26. Ive had GAD/SAD/Mild Sadness (not depression) for about 7 years now. These past years i hid from the world and anxiety had a hold of me. Im much better now. Not 100 percent but better than before. Anyway heres what i do/did. \n\n1. Read \"at last a life\" by paul david and \"pass through panic\" by claire weekes they both helped tremendously \n\n2. Practicing mindfulness. Its still new to me and very hard but i can see the benefits of using it \n\n3. Exercise. Do what you love. I tried running but it wasnt my thing. I like hiking, cycling, and soccer. \n\n4. GET OUT OF YOUR HOUSE. I know its fucking hard sometimes but you have to do it. Even if its just in front of your house. \n\n5. No more spending all day in front of my computer or video games. I read, draw, sit in my stairs outside, go for walks etc. \n\n6. most importantly to me is adopting an IDGAF attitude towards anxiety. That means not giving AF about panic attacks, twitching, heart racing, palpitations, pain here, pain there etc. Just accept everything and anything (the books i recommend explain it all) \n\n7. Just talk to someone. Im a broke ass so i cant afford a therapist but i talk to my mom who understands me. Just talk to anyone you trust. Let it out and cry if you have to. It helps.\n\nI hope this helps you guys in some way. Like i said i still get bad anxiety but im working on it. I still have to work on my sleep. I slee like 3-4 hours a day. I eat crap food all the time. Im lazy lol. i create unnecessary stress for myself.\nI appreciate any feedback or tips from anyone. Thanks :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "what has helped me with anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a2ydz/what_has_helped_me_with_anxiety/"
        },
        {
            "author": "jeffrofals",
            "author_created_utc": 1337745964,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7scjp",
            "created_utc": 1405102736,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ag2o3/relaxing_i_think_ive_found_my_release/",
            "gilded": 0,
            "id": "2ag2o3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ag2o3/relaxing_i_think_ive_found_my_release/",
            "retrieved_on": 1441272766,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I have lived my life in constant fear and stress.  It feels like my mind has to be worrying about something of I feel like something is wrong.  As soon as I take care of one fear another steps in and takes its place.\n\nOver the past few months I have been wanting to make a life change and start living my life on my own terms.  I want to overcome the obstacles that are holding me back and be who I truly want to be.\n\nI have found **blogging/writing**.  When I sit down on my computer I am able to write down exactly what I am thinking and feeling.  I am able to reflect on past situations and see where I went wrong or what I could have done differently.\n\nI am able to **acknowledge** my fears.  It has allowed me to be true to myself and realize that I do have a problem, but it is something that can be worked on.\n\nWhile writing I can sit back and **analyze** the situations.  What I was fearful of, why it makes me nervous, what's the worst that can happen.  All these questions are hard to think about let alone answer when you are having a panic attack or just trembling with fear.\n\nIt allows me to **reflect**.  I can try to figure out where I went wrong, or whether the fear was warranted or not.  It allows me to learn from these situations and think of ways I could react differently next time.\n\nI can **share** my feelings a lot easier.  Being a man with anxiety, I often feel embarrassed and ashamed about how I react to certain things and what makes me nervous.  For me it's hard to share with spoken words, but it's so much easier when I write it down.  For some reason I feel less-judged and I'm a lot more comfortable.\n\nMy blog provides me with **accountability**.  Before I was not sharing or confiding in anyone, so when I set goals for myself no one was there to hold me accountable.  I would give in when it was hard and then think of myself as a failure.  This would repeat into a vicious cycle and I got to the point where I just gave up.\n\nI can give and receive **inspiration**.  With open comments on my blog and through email I am receiving and I think I'm also giving inspiration.  It makes me feel good when I can help someone who is going through the same things that I go through.\n\n**Motivation** and **Encouragement**.  The internet can be a cruel place, but I have received all positive feedback.  People encourage me to keep going, people motivate me to chase the goal that I am after.\n\nI would highly encourage you to start a blog, or at least write a journal.  Your blog does not have to be public.  It can only be for you to see if that's what you want.\n\nIt has helped me a great deal and I think it can help you as well.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] I think I've found my release :)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ag2o3/relaxing_i_think_ive_found_my_release/"
        },
        {
            "author": "malrats",
            "author_created_utc": 1292027955,
            "author_flair_css_class": "",
            "author_flair_text": "PD/Agoraphobia",
            "author_fullname": "t2_4lwi9",
            "created_utc": 1405212896,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ajuae/im_missing_out_on_so_much_of_life_and_theres/",
            "gilded": 0,
            "id": "2ajuae",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ajuae/im_missing_out_on_so_much_of_life_and_theres/",
            "retrieved_on": 1441270948,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I haven't been beyond MAYBE 15 miles away from my house in 4 1/2 years now. 95% of the time I'm just home alone, though. I see everyone online posting pictures and videos of all the fun they're having and amazing places they're visiting and I'm just so envious.\n\nMy life used to be a grand adventure before everything went so horribly wrong. And now, especially during the summer, I can't help but feel so insanely depressed over how much life I've missed and will miss. I got sick at 23 and I'll be 28 in October. I will never have this time back, no do overs. \n\nNothing I've ever tried has ever made me any better and I just don't know what to do. I'm entirely alone, I have no support, I have nobody to hang out with, and I just feel miserable all the time. I would be entirely okay with being alone as long as I could at least otherwise live a normal life.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm missing out on so much of life and there's nothing I can do about it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ajuae/im_missing_out_on_so_much_of_life_and_theres/"
        },
        {
            "author": "xcannedx",
            "author_created_utc": 1377063302,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cu68g",
            "created_utc": 1405297778,
            "domain": "subduedeuphoria.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ami55/i_started_a_blog_about_my_experiences_with_panic/",
            "gilded": 0,
            "id": "2ami55",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ami55/i_started_a_blog_about_my_experiences_with_panic/",
            "retrieved_on": 1441269708,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/gUvv-eb-E87Zz3xb.jpg",
            "title": "I started a blog about my experiences with panic disorder in order to help others feel not alone.",
            "url": "https://subduedeuphoria.wordpress.com"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1405313094,
            "domain": "self.Anxiety",
            "edited": 1405356341,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2an3sk/i_19_m_make_myself_feel_guilty_over_things_i_know/",
            "gilded": 0,
            "id": "2an3sk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2an3sk/i_19_m_make_myself_feel_guilty_over_things_i_know/",
            "retrieved_on": 1441269425,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I always end up feeling guilty about things that happened either a year ago or longer and it kills me. I know that I feel guilt over silly, stupid things that nobody else would feel guilty about. I just finished crying because I just want to 'be' once again. I can't take it anymore. \n\nI'll give a few examples. The current thing that I have convinced myself to feel guilty about is from a year ago. I was chatting online with some people that I had known for about a week. We were having a deep conversation about the afterlife, as far as I can remember. They were talking about Heaven, Hell, etc. I said that I did not fear death (aka the afterlife) because I feel that there is nothing to fear about life after death (again my memory of this conversation is a bit cloudy, so I'm not sure how I worded it). The conversation carried on and later in the conversation 2 of the people in the conversation revealed that they were once suicidal, which made me uncomfortable. My memory is not very clear, but I believe I may have told them that \"life is precious\" in an effort to allow them to turn around their views on life. But, a year later this weird memory randomly pops into my head and I have convinced myself that saying \"I don't fear death\" has influenced them to be suicidal. I am well aware that I cannot control somebody's past. I think something one of the them said that stands out which disturbs me to no end was when she said \"I will probably over dose on pills when I'm 40 or something\".\n\nAnother example of something that caused guilt, was this EXTREMELY random event that happened when I was 12. My female friend and I exchanged AIM passwords. I got on her's because I was bored and her bf/my friend was online too, he started chatting with me and I got nervous because my 12 year old mind thought he would think I'm 'gay' to be on his gf's profile. So... out of the blue I just said \"Bye i luv u\" and he said \"luv u 2\". Then I logged off. That was it. AND I FELT GUILTY AT THE AGE OF 19 BECAUSE OF IT. It's funny though, it's an awkward adolescence story. I'm over it now, but why did it bother me so much?\n\nReddit, I just want this to stop. I'm so sick and tired of fooling myself into thinking that I am an antagonist when I'm really just trying to live my life.\n\nEDIT: Thank you all so much, I knew that I was being stupid the entire time.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I [19 M] make myself feel guilty over things I know are stupid.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2an3sk/i_19_m_make_myself_feel_guilty_over_things_i_know/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1404795496,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a49rw/anxiety_is_making_my_life_absolutely_worthless/",
            "gilded": 0,
            "id": "2a49rw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a49rw/anxiety_is_making_my_life_absolutely_worthless/",
            "retrieved_on": 1441278331,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I never used to have problems with anxiety.  Once I hit my 20's, I started getting bouts of mild anxiety that only lasted an hour or so and would go away.  In the past 2 years, I've developed increasingly worse anxiety, coupled with panic attacks.  Now, I'm a full blown agoraphobic and hypochondriac.  \n\nI went to my GP, who immediately prescribed an SSRI.  I tried it, got sick, and discontinued it (it was Zoloft).  I HATE taking pills or medication, and I've read that SSRI's can fuck you up pretty badly, so that plays right into my hypochondria.  I can't get the feeling out of my head that SOMETHING is wrong with me, and brain chemistry doesn't just \"change\" unless your body is not working right. \n\nI'm having my doctor check for everything.  I feel guilty and ashamed and embarrassed to have to keep going in and demanding tests.  I know they hate to see me back at the office, because I sound like a crazy person.  I've had a full blood panel done, TSH test for my thyroid, electrolytes checked, and my kidneys are liver are fine.  My hemoglobin and hemocrit blood count came back high, so of course I'm still freaking out.\n\nI even had my copper IUD taken out today, because I read that copper toxicity (which I'm not even sure is real) or copper allergies can cause your hormones to run wild.  I loved the freedom of having an IUD and I'm so upset to have it taken out, but I don't want to risk anything possibly contributing to this.  I'm having a blood panel done for hashimoto's, copper/zinc levels, and my hormones checked.  I'm worried it could also be Wilson's.\n\nI'm so obsessed over this, and so worried that something is wrong and they won't find out what it is.  I go from feeling like I'm absolutely insane and I should just take the SSRIs to being angry that I have to demand these tests and my doctors brush me off.  It's completely ruining my life.  Even tonight, I convinced myself that I need a CT on my lungs (I smoke), and lymph nodes, because my neck hurts, and maybe it's throat or neck cancer, and it's causing paraneoplastic syndrome and Cushing's.\n\nI can't live like this.  It's not a life.  I have an appointment with a therapist on Wednesday, but it's so hard to hold onto hope that this will get better.  I'm putting my family through complete hell right now and it's impossible to be a good mom.\n\nIf anyone has had similar instances, I'd love to talk.  I feel so alone in all of this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety is making my life absolutely worthless",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a49rw/anxiety_is_making_my_life_absolutely_worthless/"
        },
        {
            "author": "PenneVodka",
            "author_created_utc": 1345780937,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8rq7m",
            "created_utc": 1404813024,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2a4qp1/anyone_else_wproblems_sleeping/",
            "gilded": 0,
            "id": "2a4qp1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2a4qp1/anyone_else_wproblems_sleeping/",
            "retrieved_on": 1441278113,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I just want to know im not alone. I dont want to go to r/insomnia bc reading other stories triggers me. But sometimes i fee like im the only one whi cant sleep.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else w/problems sleeping?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2a4qp1/anyone_else_wproblems_sleeping/"
        }
    ]
}