{
    "data": [
        {
            "author": "Saaedra",
            "author_created_utc": 1374910306,
            "author_flair_css_class": "",
            "author_flair_text": "Social anxiety, panic attacks and depression",
            "author_fullname": "t2_cj2il",
            "created_utc": 1403198581,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28kfln/great_read_for_those_who_know_someone_with/",
            "gilded": 0,
            "id": "28kfln",
            "is_self": true,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28kfln/great_read_for_those_who_know_someone_with/",
            "retrieved_on": 1441304686,
            "score": 234,
            "secure_media_embed": {},
            "selftext": "How to Decode a Person With an Anxiety Disorder   \n  \nThings we are trying to do all the time:  \n- be safe    \n  \nThings we can’t help but do all the time:  \n- second-guess ourselves  \n- behave impulsively and reactively  \n- take everything personally  \n- worry  \n- have difficulty accepting compliments  \n- have difficulty reciprocating friendly gestures  \n- worry  \n- have difficulty finding the courage to respond  \n- have difficulty not being suspicious of others’ intentions  \n- worry  \n- make a huge deal out of the smallest thing  \n- think we're bothering you  \n  \nThings you should keep in mind:  \n- we’re scared of everything  \n- pretty much all of the time  \n- it’s an actual disorder  \n- it manifests as impulsive behavior  \n- you can’t fix us with words  \n- telling us “worrying is silly” won’t make us stop worrying  \n- it’ll only make us feel silly  \n- and then we’ll worry even more  \n- “oh god, am i worrying too much? what if they call me silly again?”  \n- like that  \n- also, we wear a lot of armor  \n- cold, heavy, affection-proof armor with spikes  \n- we constructed this armor as children  \n- we’re fairly certain you will never be able to pry it apart  \n- but there is a nice person under there, we promise  \n  \nThings you can do for a friend with an anxiety disorder:  \n- stick around  \n- ask them if they’re comfortable in a place or situation  \n- be willing to change the place or situation if not  \n- activities that help them take their mind off of things are good!  \n- talk to them even when they might not talk back (they’re probably too afraid to say the wrong thing)  \n- try not to take their reactions (or lack thereof) personally (the way they expresses themself is distorted and bent because of their constant fear) (and they know this)  \n- give them time to respond to you  \n- they will obsess over how they are being interpreted  \n- they will anticipate being judged  \n- it took me four hours just to type this much  \n- even though i sound casual  \n- that’s because i have an anxiety disorder  \n  \nThings you shouldn’t do:  \n- tell us not to worry  \n- tell us we’ll be fine  \n- mistake praise for comfort  \n- ask us if we are “getting help”  \n- force us to be social  \n- force us to do things that trigger us  \n- “face your fears” doesn’t always work  \n- because—remember—scared of everything  \n- in fact, it would be more accurate to say we are scared of the fear itself  \n  \nEmergency action procedure for panic attacks:  \n- be calm  \n- be patient  \n- don’t be condescending  \n- remind us that we’re not “crazy”  \n- sit with us  \n- ask us to tighten and relax our muscles one by one  \n- remind us that we are breathing  \n- engage us in a discussion (if we can talk, then we can breathe)  \n- if we are having trouble breathing, try getting us to exhale slowly  \n- (it will be harder for us to exhale than inhale)  \n- (sometimes all it takes is our body to realize it can push the air back out)  \n- or breathe through our nose  \n- or have us put our hands on our stomach to feel each breath  \n- or have us put a hand on your chest and breath with you  \n- ask us what needs to change in our environment in order for us to feel safe  \n- help us change it  \n- usually, just knowing that we have someone on our side willing to fight our scary monsters with us is enough to calm us down  \n  \nIf you have an anxiety disorder:  \n- it’s okay.  \n- even if you worry that it’s not okay.  \n- it’s still okay. it’s okay to be scared. it’s okay to be scared of being scared.  \n- you are not crazy. you are not a freak.  \n- I know there’s a person under all that armor.  \n- and i know you feel isolated because of it.  \n- I won’t make you take it off.  \n- but know that you are not alone.  \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Great read for those who know someone with anxiety and those with anxiety. Found it somewhere a long time ago(Can't remember) and it helped me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/28kfln/great_read_for_those_who_know_someone_with/"
        },
        {
            "author": "LeChuck999",
            "author_created_utc": 1322596414,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6c5uo",
            "created_utc": 1403126338,
            "domain": "self.Anxiety",
            "edited": 1403189253,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28htvb/the_three_ms_of_anxiety_an_original_essay_i_wrote/",
            "gilded": 0,
            "id": "28htvb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28htvb/the_three_ms_of_anxiety_an_original_essay_i_wrote/",
            "retrieved_on": 1441305960,
            "score": 141,
            "secure_media_embed": {},
            "selftext": "If I was asked to define my own anxiety and how it affects my life. I would put it under 3 seperate headings.\n\n**The Maneuver**\n\n**The Movie Theatre**\n\n**The Maggots**\n\nThe three M's of Anxiety. To me anxiety doesn't simply translate to worrying about something. If there is something worth worrying about then it is normal to worry about it. To me anxiety is fretting about things that are not worth worrying about. It is also translated from our minds to our actions.\n\n These three M's are products of my anxiety. And I will explain them each now.\n\n**The Maneuver.**\n\nThe maneuver is the name I have given to the minor actions I sub conciously commit in my day to day life as a result of my anxiety. \n\nThey are as simple as crossing the road to avoid talking to someone, or ducking into the bathroom the avoid passing a co worker. small acts resulted form an irrational fear of human contact.\n \nBut the Maneuver can also mean a lack of action. Refusing to speak up for fear your words will not be heard. Afraid to make eye contact because of a past acts you're afraid will haunt you today. The maneuver is a momentary decision you make that steams from an irrational voice that makes your bodies actions faster then its reasoning. \n\nIf you have a legitimate reason to avoid someone or something, that is not the maneuver. That is logic and reason. The maneuver results from a lack of reason, instead it is an instinct, a split second reaction you make in the moment. One that leaves you feeling stupid and ashamed afterwards, because you realise, just how illogical it is. But you can't help it.\n\nWhile the Maneuver is featured in the present. What about the past and future? \n\n**The Movie Theatre.**\n\nThe movie theatre is featured in the grand screen of the mind. There are many different features in the movie theatre.\n\nThere is the Classic flick. A memory from the past you repeat over and over again in your mind. A conversation you just walked away from, yet you replay it again and again. That one joke you said that got a laugh, or the joke you made that was met with silence. Either way you repeat it in your mind again and agan and again, analyzing every minor syllable and reaction from everyone there, even though they have already probably forgotten the conversation even existed.\n\nThen there is the Fantasy, imagining what has yet to come. This can be a product of the classic clip. Replaying a conversation, thinking about how it COULD have went. Kicking yourself for not being the witty, charming individual you could have been. Or fantasising about the future. A telephone conversation you are practicing in your head, the one you've been meaning to make for hours but have been putting off, mentally preparing yourself for.\n\nOr the horror movie. The worrying about something that is coming up. Playing the worst case scenario out in your head, until you believe it is real, that it is going to happen. Or the other way around. Remembering an incident of shame or humiliation, over analyzing and distorting the memory until it is no longer the same memory, but a exaggerated farce you force yourself to believe.  The horror movie is the worst one to watch, because you start to doubt if it is real or not. \n\nThe Maneuver and the Movie Theater can be products of stable, or unstable minds. Even people who don't  suffer from chronic anxiety can suffer from these. But the difference between someone with and without anxiety comes next.\n\n**The Maggots**\n\nThis is the worst product of anxiety. When there is an issue that consumes your mind to the point you cannot escape it. It has become an impossible prison that it eating at you from the inside out.\n\nIt doesn't matter if it is a huge problem or an insignificant one. In your eyes, they are equally terrifying. You can feel a pain in your head from the stress, as though there a physical maggots devouring your brain. They are devouring confidence, devouring logic, devouring reason. You cannot function, you cannot concentrate. The world is collapsing around you. You want to bash your own head open and pull the maggots straight out of your brain just to stop the pain. \n\nThe maggots will cost you your sleep, your friends, your job, your self-respect, your sanity, your life. They leave scars on your mind that cannot be healed. They can hit when you least expect it and there is nothing you can do to stop them once they attack. \n\nYou can call this an anxiety attack, a panic attack, depression, stress, insomnia or any number of terms. They can last for minutes, hours or days. They can drive you to tears, a bed ridden numbness, mental break downs and even suicide. The maggots are one of the most dangerous, self destructive weapons your mind will ever manufacture.\n____________________________________________________________________________________\nI know alot of people will not agree with these analogies, as they are all personal to me. I also know there is more to anxiety then I have mentioned above, but to me, these are the three biggest hurdles I must over come in my quest to conquer my own anxiety. \nI apologize if anyone thinks I am over simplfying a complex issue and for my terrible spelling and grammer. These are my own ideas I have concocted in an attempt to understand my own mind. Let me know if you feel the same, or have anything to add.\n\nThanks for reading. I wish you all good mental health.\n\n**EDIT**\n\nHi guys, I'm glad to see alot of you can empathise with the aspects I've listed above. The only advice I can currently give, is being able to recognise when you are feeling one of these emotions. You need to be self aware when you are pulling a maneuver or watching the Movie Theater. Once you realise what you are feeling is a product of anxiety and not reason, you can actively prevent it. Do the opposite of what your instinct tells you, weather it works out well or not, it doesn't matter. What matters is you are not letting your anxiety control you.\n\nThis advice bodes for the Maneuver and the Movie Theater. The Maggots are much different, if not nearly impossible to deal with. The only way I can think of to stop the maggots is proventing them from starting. You need to recognise the signs, avoid stress and seek professional help. I wish I could give a quick fix for them, but if I could, I probably wouldn't even be on this subreddit myself.\n\nThanks again guys. Good luck.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The three M's of anxiety. (An original essay I wrote in an attempt to understand my own anxiety).",
            "url": "http://www.reddit.com/r/Anxiety/comments/28htvb/the_three_ms_of_anxiety_an_original_essay_i_wrote/"
        },
        {
            "author": "toterra",
            "author_created_utc": 1292271822,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4m7kt",
            "created_utc": 1403279865,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28nehe/i_know_why_therapists_do_this_but_it_makes_it/",
            "gilded": 0,
            "id": "28nehe",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28nehe/i_know_why_therapists_do_this_but_it_makes_it/",
            "retrieved_on": 1441303301,
            "score": 92,
            "secure_media_embed": {},
            "selftext": "Everytime I go to a therapist they have the talk about what they can and can't keep confidential. Apparently, any talk of suicide, and that they have to disclose. Fuck that. I am not particularly suicidal.... but I do get intrusive thoughts, sometimes more than other times. I have nobody I can talk to about those... it is frustrating. I just like and say.. nope .. never thought about suicide. When two minutes ago I imagined taking a pen and bashing it into my brain through my eye.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I know why therapists do this... but it makes it useless sometime",
            "url": "http://www.reddit.com/r/Anxiety/comments/28nehe/i_know_why_therapists_do_this_but_it_makes_it/"
        },
        {
            "author": "plzihaveca",
            "author_created_utc": 1402861736,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gzq72",
            "created_utc": 1402861865,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28811u/so_i_just_climbed_out_of_the_2nd_floors_window_to/",
            "gilded": 0,
            "id": "28811u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28811u/so_i_just_climbed_out_of_the_2nd_floors_window_to/",
            "retrieved_on": 1441310593,
            "score": 89,
            "secure_media_embed": {},
            "selftext": "Why do I have this anxiety?  Is it crazy what I did?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So I just climbed out of the 2nd floor's window, to climb back in my room's window downstairs, JUST TO AVOID seeing the guests.",
            "url": "http://www.reddit.com/r/Anxiety/comments/28811u/so_i_just_climbed_out_of_the_2nd_floors_window_to/"
        },
        {
            "author": "MyKindOfLullaby",
            "author_created_utc": 1372997361,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c9nzg",
            "created_utc": 1402948716,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28b20k/do_you_guys_sometimes_get_anxiety_from_reading/",
            "gilded": 0,
            "id": "28b20k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28b20k/do_you_guys_sometimes_get_anxiety_from_reading/",
            "retrieved_on": 1441309181,
            "score": 88,
            "secure_media_embed": {},
            "selftext": "I like this sub a lot, everyone is so supportive. Sometimes I get anxiety from being on here, though. I don't really know why, there aren't any of my triggers on here or anything. I think i'm just anxious about getting anxious :p",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you guys sometimes get anxiety from reading posts on this sub?",
            "url": "http://www.reddit.com/r/Anxiety/comments/28b20k/do_you_guys_sometimes_get_anxiety_from_reading/"
        },
        {
            "author": "lurkernomore99",
            "author_created_utc": 1331872022,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_76mv1",
            "created_utc": 1403020637,
            "domain": "7cupsoftea.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28dla9/need_to_speak_with_a_peer_about_your_anxiety_dont/",
            "gilded": 0,
            "id": "28dla9",
            "is_self": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28dla9/need_to_speak_with_a_peer_about_your_anxiety_dont/",
            "retrieved_on": 1441307939,
            "score": 83,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Need to speak with a peer about your anxiety? Don't want to pay for it or be judged? Come talk at 7cupsoftea.com",
            "url": "http://www.7cupsoftea.com/1266149"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1403005516,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28d0ql/complete_meltdown_last_night/",
            "gilded": 0,
            "id": "28d0ql",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28d0ql/complete_meltdown_last_night/",
            "retrieved_on": 1441308205,
            "score": 62,
            "secure_media_embed": {},
            "selftext": "I have Crohn's Disease and neuropathy in my feet. Both are aggravated by stress and anxiety.\n\nWe are leaving for a cruise on Friday. My boss demanded contact information and wants me to check in once a day. This cruise was to get away from work. Work is backed up. \n\nI come back for four days, and then I have a week with my daughter.\n\nLast night, I got three hours of sleep, and not three hours in a row. My feet felt like I had them in a fire. Intrusive thoughts spiraled out of control. I felt nauseous all night, and had to use the bathroom seven times.\n\nI can't take much more of this. I am seeing my therapist tonight. I am talking to her about permanent disability. \n\nLast night, I had suicidal thoughts all night. Planning thoughts. And then I'd think, \"I can't mention this to my wife. She is looking forward to the cruise.\"\n\nI feel pressure on all sides, and it is awful. I feel pressure to produce at work, pressure to let my wife have fun, pressure to pay my huge alimony commitment, pressure to manage my Crohn's (which interferes with my work) and pressure to survive.\n\nI have lost my last two jobs because of Crohn's and panic attacks. I am 51, and I am thinking about throwing in the towel.\n\nI fucking hate life so much. But I have a mentally retarded daughter, and the thought of her calling for me, and me not being there actually makes me cry.\n\nI am so fucked up, if I was a project at work, I'd say, \"tear it down and start over. You aren't going anywhere with what you got.\"",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Complete meltdown last night",
            "url": "http://www.reddit.com/r/Anxiety/comments/28d0ql/complete_meltdown_last_night/"
        },
        {
            "author": "sicituradastra",
            "author_created_utc": 1313910038,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pcrm",
            "created_utc": 1402837847,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2876lh/i_have_ptsd_with_bad_anxiety_but_i_dont_let_it/",
            "gilded": 0,
            "id": "2876lh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2876lh/i_have_ptsd_with_bad_anxiety_but_i_dont_let_it/",
            "retrieved_on": 1441310987,
            "score": 47,
            "secure_media_embed": {},
            "selftext": "I was having a terrible morning yesterday, dizzy and extremely nervous. Even feeling like my surroundings were surreal. My ego was at it again. It was my boyfriend's birthday barbecue and I was scared of all the people, though I used to be a social butterfly. Anxiety changes things as we know. So I texted my counsellor hoping for words of advice and she simply told me it was my ego and if I don't fight against it, nothing will change. So I did. I got showered, dressed, did my make up, went downstairs, socialized, met new people, talked about life, had cake. And I had a good fucking time. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have PTSD with bad anxiety but I don't let it define me",
            "url": "http://www.reddit.com/r/Anxiety/comments/2876lh/i_have_ptsd_with_bad_anxiety_but_i_dont_let_it/"
        },
        {
            "author": "Kel-Uncaged",
            "author_created_utc": 1397650925,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g5m0l",
            "created_utc": 1403362938,
            "domain": "anxietybitch.wordpress.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28q3q3/using_photography_to_express_social_anxiety/",
            "gilded": 0,
            "id": "28q3q3",
            "is_self": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28q3q3/using_photography_to_express_social_anxiety/",
            "retrieved_on": 1441302041,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/syCWbFVwxJOzBjW9.jpg",
            "title": "Using photography to express Social Anxiety",
            "url": "http://anxietybitch.wordpress.com/2014/06/21/social-anxiety-photography/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1403283632,
            "domain": "self.Anxiety",
            "edited": 1403521561,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28nkkf/how_do_you_conquer_intrusive_embarrassing_memories/",
            "gilded": 0,
            "id": "28nkkf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28nkkf/how_do_you_conquer_intrusive_embarrassing_memories/",
            "retrieved_on": 1441303222,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I have social anxiety, and it seems that I often have moments where I'm feeling more confident than usual, but then suddenly I'll remember an embarrassing moment (that are usually centered around other people) and my anxiety will come back at full force again, and it completely ruins my confidence.\n\nDoes anyone else have problems with this? Does anyone know how it could be helped?\n\n**Thank you so much to everyone for your replies, they're all helpful and it's good to see that I'm not the only one that has problems with this!**",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How do you conquer intrusive embarrassing memories?",
            "url": "http://www.reddit.com/r/Anxiety/comments/28nkkf/how_do_you_conquer_intrusive_embarrassing_memories/"
        },
        {
            "author": "Biohye",
            "author_created_utc": 1344863857,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8nkvs",
            "created_utc": 1403155349,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28j0mc/i_finally_did_it/",
            "gilded": 0,
            "id": "28j0mc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28j0mc/i_finally_did_it/",
            "retrieved_on": 1441305407,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "Today after canceling 2 times I finally went to the water park! I know it's not much but it felt so great. I almost cancelled but I thought, I why not? I went and had a amazing time and were going to the movies next weekend! I couldn't have done it without you guy! Thanks!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I finally did it!",
            "url": "http://www.reddit.com/r/Anxiety/comments/28j0mc/i_finally_did_it/"
        },
        {
            "author": "tbird_17",
            "author_created_utc": 1392959260,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_fdl6h",
            "created_utc": 1403012340,
            "domain": "self.Anxiety",
            "edited": 1403103067,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28d8k1/my_worst_fear_is_here_my_birthday/",
            "gilded": 0,
            "id": "28d8k1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28d8k1/my_worst_fear_is_here_my_birthday/",
            "retrieved_on": 1441308102,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "I hate my birthday. So much. Especially how everyone forgets about it. It's just a reminder of how little people care. It's not like I'm asking for a huge gift or anything, but one simple \"Happy Birthday!\" would be nice.\n\nEdit: you guys rock :) thanks for making my birthday so much better. It means a lot!! And thank you everyone for the birthday wishes! \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My worst fear is here. My birthday.",
            "url": "http://www.reddit.com/r/Anxiety/comments/28d8k1/my_worst_fear_is_here_my_birthday/"
        },
        {
            "author": "_Idontknow_",
            "author_created_utc": 1369046666,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bqqiy",
            "created_utc": 1403089946,
            "domain": "self.Anxiety",
            "edited": 1403137886,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28g8uj/has_anyone_experienced_binge_eating_as_a_result/",
            "gilded": 0,
            "id": "28g8uj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 53,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28g8uj/has_anyone_experienced_binge_eating_as_a_result/",
            "retrieved_on": 1441306699,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "I am currently on Lexapro for the first time and it has done wonders for my general mood, my ability to handle stress and for reducing my anxiety levels. \n\nFor context, I have been on the drug for about one month now and I am also on the pill. I am approximately 130lbs at about 5'6 and I have previously lost about 60 pounds, so I am well aware of dieting, being strong with cravings and sticking to healthy eating plans. \n\nHOWEVER, I have found my appetite to be out of control and my ability to self-control my binging completely non existent. For example, tonight I ate a double portion of stir fry, half a family block of chocolate, a quarter of a jar of Nutella, half a carton of ice-cream, a quarter of a jar of peanut butter, nuts, dates, yoghurt, granola, chips and more chocolate. I have literally eaten to the point of nearly throwing up and this has happened a few times since starting on the drug (about three of four times).\n\nIt's as if my brain doesn't listen to me anymore. I keep on telling myself to stop but I just can't. I just feel permanently unsatisfied. Not necessarily hungry, mostly unsatisfied. It is even to the point where I will go through an entire packet of gum each day because I can't control my need to chew or eat something. \n\nHas anyone else had a similar experience? I am wanting to contact my doctor about this as it concerns me to be so erratic with my nutrition, especially as I have a propensity to put on weight due to my PCOS. The results of my binging also means that I have diarrhoea the following day, nausea and depression. \n\nEdit: I forgot to mention that I have also been waking up at 2am, starving to the point of feeling nauseated and having to eat lots just to go back to sleep. This concerns me the most as even sleep seems to cower down to my appetite at the moment! \n\nFURTHER EDIT: SO I talked to my doctor this morning and while she acknowledged that binge eating/weight gain is uncommon on Lexapro, she was more than happy to have a chat to me and to try some other medications. She's reduced me to half a pill until Monday morning, so that I can slightly wean myself off the drug prior to seeing her. What's concerning (and I didn't tell her this as I don't want to seem like a hypochondriac) is that I've woken up with a large lump on my neck. It feels like one swollen gland but its large enough to be quite visible. Let's hope this bump goes down aye?!\n\nExtreme edit: dammit guys! It's not even 10:30 and I've already had two biscuits and a slice of cake &gt;.&lt;",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone experienced binge eating as a result of taking SSRI's?",
            "url": "http://www.reddit.com/r/Anxiety/comments/28g8uj/has_anyone_experienced_binge_eating_as_a_result/"
        },
        {
            "author": "jessikaye",
            "author_created_utc": 1316576133,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wbf8",
            "created_utc": 1402824457,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/286xcz/i_was_having_a_horrible_week/",
            "gilded": 0,
            "id": "286xcz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/286xcz/i_was_having_a_horrible_week/",
            "retrieved_on": 1441311108,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I was having a horrible week. My anxiety was through the roof. Haven't slept in 30 hours and couldn't stop shaking, had to work a 10 hour shift on no sleep and was feeling like complete shit. Friends were having a party and I really didn't want to interact with anyone from how shitty I was feeling. BUT, I decided after my long day I work I would stop be the party to say hi then go home and wallow in self pity. I ended up staying until the party ended and get drunk with my friends. I had a wonderful time and had tons of laughs. I got to the party in a horrible mood and not wanting to hug anyone. Got some liquid confidence in me and was ecstatic. While I don't drink often I'm so glad I stayed. My week just got so much better. Started my day with no sleep and emptiness in my heart, ended it with a smile and laughs. Sometimes you just gotta sit down and drink with your friends. \n\nSorry for the random post I'm just so happy and proud of myself for going to the party. Thank you my dear friends. &lt;3",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I was having a horrible week",
            "url": "http://www.reddit.com/r/Anxiety/comments/286xcz/i_was_having_a_horrible_week/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1402907553,
            "domain": "self.Anxiety",
            "edited": 1402907768,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/289l62/i_found_a_poem_i_wrote_when_i_was_about_16_before/",
            "gilded": 0,
            "id": "289l62",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/289l62/i_found_a_poem_i_wrote_when_i_was_about_16_before/",
            "retrieved_on": 1441309865,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "The Zoo. \n\nInside Nowhere\n\nThere's a place. \n\nOutside time and \n\nOutside space \n\nI drown it out with sight and sound \n\nBut when Somewhere's quiet, Nowhere gets loud. \n\nAnd I walk around and see my cages\n\nContained inside my empty spaces. \n\nEmpty- all but for what gets pulled in \n\nBy the vacuum, an absence of nicer things. \n\n\nAnd they're stuck here in this Nowhere place. \n\nThey're mine and only mine to face. \n\nAnd the signs stuck to the cages say \n\n\"Please don't feed us\" \n\nBut I do anyway \n\nAnd what lives in the cages can't- \n\nEat meat or oats or seeds or plants. \n\nThe very thing they need to thrive \n\nIs all that's keeping me alive. \n\nThey eat my smiles, my easy sleep. \n\nThey crave the sweet things I want to keep \n\nAnd I keep finding myself \n\nIn this Nowhere place\n\nLosing time and wasting space \n\nI've peered through the gaps in these bars so long\n \nI've forgotten which side I was on \n\nNow I think I might be stuck here \n\nFeeding all my doubts and fears. \n\n\nI know it's flowery and teenage angst and purple and cringey. But those were from the heart when I was a confused teenager worried about what was wrong with me. It makes me glad that I got help but sad I didn't do it sooner. I hope somebody out there can relate \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I found a poem I wrote when I was about 16, before being diagnosed. It's terrible, but it's a pretty accurate depiction of how I felt then, and sometimes now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/289l62/i_found_a_poem_i_wrote_when_i_was_about_16_before/"
        },
        {
            "author": "ClassicalGuitar",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1402927952,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28a40x/how_do_you_all_handle_derealization/",
            "gilded": 0,
            "id": "28a40x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28a40x/how_do_you_all_handle_derealization/",
            "retrieved_on": 1441309621,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "Recently it's been pretty bad for me. I just feel weird, and I really feel like I am unable to focus, in addition to just feeling out of it most of the time. There will be brief moments of clarity but then my mind goes back to thinking about derealization. I just keep thinking of the worst-case scenario over and over (what if this is like some kind of brain tumor and I'm dying) and it all sucks. :/ I feel like at any moment I'm just going to die. :(\n\nDo you have any tips on how to deal with this sort of thing? Is this derealization? I'm scared it could be something bad. :(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you all handle derealization?",
            "url": "http://www.reddit.com/r/Anxiety/comments/28a40x/how_do_you_all_handle_derealization/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1403322368,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28p53n/rant_trigger_warning_a_story_about_my_experience/",
            "gilded": 0,
            "id": "28p53n",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28p53n/rant_trigger_warning_a_story_about_my_experience/",
            "retrieved_on": 1441302490,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "This is long, apologies in advance. But I really needed to get it off my chest, especially after seeing the earlier post about this stuff. This is a throwaway, by the way.\n\n\n\nIt was the third phone I’d called. I waited for a ring, but I didn’t get even that, the phone was off and it went straight to voicemail. The tears streaming down my cheeks came more quickly now, the harsh red lines on my legs made by a Sharpie marker hadn’t helped as they usually did. No one was answering the phone. It was 2:30 AM, and I didn’t know what else to do. My fingers shook as I dialed the number for the local crisis line. It rang a few times before a woman answered, sounding bored, and tired. \n\n\n\nI just needed someone to talk to, and in the state of mind I was in, it needed to be a voice. I explained that I had just had a bit of a spat with my boyfriend, and that we had worked it out, but I was still very upset with myself, and there were a lot of other things going on with school and my health that had me completely overwhelmed. I cried a bit, and she told me to go to the ER, as there is always a counselor on call, and that would give me someone to talk to.  I had never done that before, and I was nervous, but it was 2:45 AM and I needed someone to help me calm down instead of keep getting worked up. So I walked to my car and drove to the hospital.\n\n\n\nAt first, it was okay. The nurses all talked to me, asked what was going on, and I finally felt okay. They called in the counselor, and I talked to him, and said I was feeling okay, and if I could go home.\nHe smiled and walked back to the nurse’s station, where he picked up the phone and talked for awhile before coming back. He sat down and looked at me, asked me if I had ever had any suicidal thoughts. Well, every person alive has at one point or another, so I answered truthfully, that yes, but that I didn’t feel that way now.  Even if I had notions of self-harm, there was no intent. I told him this and made it very clear that I had just needed someone to talk to and that the crisis line had sent me there.\n\n\n\nHe nodded and said that everything would be fine, he just needed to fill out some paperwork and talk to the doctor. He was gone for maybe twenty minutes before he returned and told me that the plan was to send me to the hospital in the city near where I live, because the doctor there wanted to check me out and make sure I was good to go. He explained that the hospital where I was didn’t have the right facilities to release me, because he knew I was okay, but if for some reason, something were to happen, the hospital would be held liable, and he couldn’t live with that on his conscience.  I was transported by ambulance to the city hospital and escorted to the 7th floor, where I was handed a set of blues and a paper bag and told to change. \n\n\n\nAt this point, it was 5:45 AM and I hadn’t slept since the night before, having gotten up at 8:30 AM as was usual, and I had no idea what was going on. I was calm, because I was completely normal, although very tired, and I had been told that it was going to be a quick process, I just needed to see the doctor and I would be home by that afternoon at the latest. This was a complete lie.\n\n\n\nI had been sent to the psychiatric unit with a pink slip. This means that the counselor had, for some reason, deemed me a risk to myself and/or others, and I was to be locked up there, against my will, for a minimum of 72 hours. I did not know this. I was never told what was going on, and it was never determined if I actually needed to be there before they admitted me.\n\n\n\nIn a Psych Unit, you are assigned a doctor and a social worker, and there are maybe 20 nurses who are there with you constantly, though they change based upon shift. I saw a nurse first, and a million other people, who I explained my story to, saying that I had been overwhelmed and that I had just needed someone to talk to. My social worker was a god-send. I talked to him, calmly, just as I had with all the other people who had met with me, and he told me that I shouldn’t be there, and that he was going to do everything he could to get me out, but that it was up to the doctor. This was about 6:45 AM. He said the doctor wouldn’t be in until around noon. I was a bit shaken by this, as I had expected to be able to talk to someone, get calmed down and then be able to go home. So I went to my room, and slept for maybe 15 minutes  before they called me out to breakfast and my day began. I talked to the other people there, learned their stories, learned where I was. They were the only ones that were honest with me. One of the women told me to expect 5 to 7 days, and if I got out before then, to count my lucky stars. \n\n\n\nAnd even though I stayed as collected and calm as I could manage (they had told me to be as normal as I could manage or the staff would use it against me to keep me longer), I lost my shit and started to panic. The minimum stay was 72 hours, they told me, and a few people had been there multiple times, and told me that no one had ever seen anyone get out that fast. I had been told a couple hours at most, and now I was looking at three full days. No one knew I was there, they had taken my phone and no one needs to memorize phone numbers anymore. There was a contact list, but it had been crossed out and put back into the file.\n\n\n\nI knew my Mom’s phone number, so I called her, but no one else knew. I was trapped and though I know it is a bit of a hyperbole, I felt as if I had been kidnapped by the healthcare system, and I was stuck in a ward against my will with absolutely no valid reason. They had pink slipped me when I had been calm for at least a couple hours, was talking and conversing normally, had said multiple times that I was okay and had clearly sought help when I felt that I needed it, which apparently counts against you when it should probably count for you. \n\n\n\nI understand that there are things in place designed to protect you and your life, and the lives of others, but clearly, the evaluation system is extremely flawed. What right does one person who has talked to me for fifteen minutes have to determine if I am a danger to myself or others? And the doctor, when she finally came in, talked to me for ten minutes, maybe, and decided I needed to stay the night and would be reevaluated the next day.\n\n\n\nMy boyfriend is 7000 miles away, and they last time we had spoken, I was a bit upset, and we usually talk twice a day, so upon hearing this news, I lost my shit for the second time. It took a good deal of begging, pleading and tears to talk the nurses into breaking protocol and allowing me to send him an email. \n\n\n\nUpon asking the first time, the nurse looked at me like an idiot, and asked me why I couldn’t just call him, or call someone to tell him. I asked her if the hospital could make international calls, knowing that the answer was no, and then explaining that there was no one whose number I knew who would know how to get a hold of him. No one wants a Facebook message from their girlfriend’s family telling them that she is in a pysch ward and not being able to provide any information.  After a while, a nurse finally walked out and called me over, something I had experienced quite a few times already, telling the same story over and over again, having my vitals checked, filling out paperwork.\n\n\n\nI walked over, expecting more of the same, but she led me back to the art room, where there were computers, and told me I could use the internet to email my boyfriend. I burst into tears as she set up the computer, and I sobbed as I typed, trying not to sound as freaked out as I was. She offered to let me use the computer for ten to fifteen minutes, to take my time, just relax and write as much as I felt I needed to, and she offered suggestions for what sort of things to say about where I was and that everything was going to be alright, and she even said that she could try to get the computer for me to use during the normal periods of time when he and I would usually talk, but I was cautious of that, and as much as I wanted it, I thought it might make things even harder to have someone have to supervise a conversation via email that I would have to lie to the other patients about. (It was impressed upon me that I could not tell them about the break from the normal rules, as they might react badly to it.)\n\n\n\nI spent the day coloring, talking to the other people there with me and generally being bored out of my mind while feeling like an insect trapped between two panes of glass.  The nurses watched, the other patients told me horror stories,  the social worker came in and out, nurses talked to me, notes and lists and forms were all filled out and I told the same story about a hundred times. I was told by multiple nurses and the social worker that I didn’t need to be there, and the social worker ended up calling my mother and talking to her, getting a sort of character reference. The next morning, the doctor again talked to me for another five to ten minutes before telling me the words I had been praying to hear, that I was allowed to go home.\n\n\n\nI had been told at the ER that I would go home within a few hours, after I had been misled into thinking that I had to go to the ER to talk to someone after calling the Crisis Line. I was very lucky, I got out of the unit after a little over 30 hours. But the thing that everyone had kept telling me was that I shouldn’t have been there, or that I didn’t need to be. So why was I? How was putting me through such a traumatic experience for no valid reason the “right” thing to do? I was lied to, taken to a pysch unit and essentially coerced into violating my own rights of habeas corpus.  I know that my trust has been violated, and that I will never return to the ER or the local crisis hotline for help. What sort of system are they attempting to create by lying to people to get them into what is essentially a money pen where they are held for days with little helpful intervention, almost nonexistent contact with the doctor, who has the overall voice in deciding when a patient is ready to go home? A system that has, at least for me, bred a streak of distrust and anger, and that will ensure that I will not ever seek help from them again. \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] (Trigger Warning) A story about my experience in a ward",
            "url": "http://www.reddit.com/r/Anxiety/comments/28p53n/rant_trigger_warning_a_story_about_my_experience/"
        },
        {
            "author": "thepotagold",
            "author_created_utc": 1387466064,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_efgkw",
            "created_utc": 1402917948,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/289t27/relaxing_music_megathread/",
            "gilded": 0,
            "id": "289t27",
            "is_self": true,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/289t27/relaxing_music_megathread/",
            "retrieved_on": 1441309764,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "so on front page of this subreddit there is image megathread. this is like it but with music.\n\ncomment songs or music videos that are relaxing or help you relax and might help someone else. \n(not made by mods, but would be awesome if this became official)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[RELAXING] Music megathread",
            "url": "http://www.reddit.com/r/Anxiety/comments/289t27/relaxing_music_megathread/"
        },
        {
            "author": "THEDAWNISYOURENEMY",
            "author_created_utc": 1315233823,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_5snsf",
            "created_utc": 1403123103,
            "domain": "blogs.villagevoice.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28ho7r/andrew_wk_advice_on_stress_and_anxiety/",
            "gilded": 0,
            "id": "28ho7r",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28ho7r/andrew_wk_advice_on_stress_and_anxiety/",
            "retrieved_on": 1441306034,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/g3dnT0qmNluNgxgF.jpg",
            "title": "Andrew W.K. Advice on Stress and Anxiety.",
            "url": "http://blogs.villagevoice.com/music/2014/06/ask_andrew_wk_letting_stress_go.php"
        },
        {
            "author": "Vipassana1",
            "author_created_utc": 1384124219,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_duw31",
            "created_utc": 1403197738,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28kdvy/success_i_confronted_a_panic_attack_for_the_first/",
            "gilded": 0,
            "id": "28kdvy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28kdvy/success_i_confronted_a_panic_attack_for_the_first/",
            "retrieved_on": 1441304708,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "A lot of my panic attacks paralyze me with fear.  I wind up curled in bed, crying, wishing the world would go away.  It's gotten worse lately as I just restarted therapy and we're in the \"Gets worse before it gets better\" stage.\n\nSo this morning, for no reason I can figure out, my brain started telling me what a shitty older sister I am.  When we were growing up, I protected my little brother and helped him not grow up like our shitty father (Family issues, amiright?).  We're in our 20's now, and have separate lives but stay in touch.  I started feeling like I'm not there anymore and that he secretly resents me for not being there since I went to college / embarked on my career(s).  Basic \"i'm a shitty person\" kinda stuff.\n\nSo today I saw 3 options:  I can call into work and stay cocooned in my bedroom, I can go to work and hope it subsides, or I can text him and ask him.\n\nFor the first time ever, I was brave enough to choose option 3.  I started it by telling him that I know it might come off as stupid or selfish and I\"m sorry if it does, but it's just me panicking about the uncertainty.  I told him I felt shitty about not being there for him after leaving home and wanted to know if we were still ok.  I was crying as I texted him, but I didn't tell him that.\n\nHe told me he wants to do more with me, but he's just broke and trying to figure out his own post-college life.  He said that, no matter what, we will always be good and that our relationship is nothing I should ever need to worry about.  He was reassuring, in his own quiet way.\n\nImmediately, my panic attack subsided.  I was relieved, and a little tired - it was like a gigantic weight off me.  I'm so happy I did that and that he doesn't hate me.  It's been a recurring thing for months for me.  And I'm glad I did it by text, as if the thoughts reoccur I can go back and re-read that message.\n\nI just wanted to share here because you guys have always been wonderful when I need support for my panic attacks.  \n\nAlso, for those too poor for a therapist, if you're in a college area new graduate therapists provide 6 months of therapy for free as interns.  I just learned this, and the woman that was recommended to me has been phenomenal so far.  If you're in a similar position, this may be a great resource to take advantage of.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Success] I confronted a panic attack for the first time!",
            "url": "http://www.reddit.com/r/Anxiety/comments/28kdvy/success_i_confronted_a_panic_attack_for_the_first/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1403102285,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28go05/fear_of_being_alone_and_reaching_out/",
            "gilded": 0,
            "id": "28go05",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28go05/fear_of_being_alone_and_reaching_out/",
            "retrieved_on": 1441306504,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I had a really bad anxiety and depression relapse over the weekend.  I rely heavily on my parents for support.  They are very understanding and caring.  However, this time I all of a sudden had the thought that some day they will die.  What will I do if I have anxiety/depression when they are gone, who will help me.  I will be all alone.  I've been afraid to reach out to anyone else because I don't want to be a burden.  \n  \nAnd then something clicked in my brain and I started to think of all the people I love and who love me.  Friends and family, many who I don't contact a lot.  I think about people often, but I almost never reach out to them because I never know what to say.  I started to just write very small emails and texts to  people just saying I was thinking about them, and that I loved them.  Before I even got any responses back, just doing so broke me down, but in a good way.  I was sobbing, and shaking, and felt an emotional release.  Just wanted to share my experience",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Fear of being alone and reaching out.",
            "url": "http://www.reddit.com/r/Anxiety/comments/28go05/fear_of_being_alone_and_reaching_out/"
        },
        {
            "author": "Syntaximus",
            "author_created_utc": 1288196311,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4gu3j",
            "created_utc": 1403193769,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28k6t9/just_quit_a_job_and_i_feel_worthless/",
            "gilded": 0,
            "id": "28k6t9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28k6t9/just_quit_a_job_and_i_feel_worthless/",
            "retrieved_on": 1441304800,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I applied at the local grocery store and for some ungodly reason they assigned me to work at the Starbucks kiosk as a barista.  I made it 3 shifts in and then this morning I felt like the world was coming to an end so I called them up and explained that I wasn't cut out for the position.  I asked the grocery manager if there was something more task-oriented(as opposed to customer service) available and that obviously didn't go over well.\n\nThe Starbucks manager seemed understanding (she had thought it was her who was making me nervous) but there's no way my family is going to think I'm anything other than \"sensitive\" and/or \"lazy\", so I'm just telling everyone I got fired.\n\nI feel like shit.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just quit a job and I feel worthless.",
            "url": "http://www.reddit.com/r/Anxiety/comments/28k6t9/just_quit_a_job_and_i_feel_worthless/"
        },
        {
            "author": "sadgrrrl",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1403301514,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28odv3/overwhelmed_with_little_tasks_leads_to_thinking/",
            "gilded": 0,
            "id": "28odv3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28odv3/overwhelmed_with_little_tasks_leads_to_thinking/",
            "retrieved_on": 1441302843,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I got back on anti-depressants last week (after a few years of being off) because I was having a really bad depression/anxiety episode for months. I had a good day two days ago, but my anxiety is still looming over me.\n\nI work from home (I'm a crafter/artist) and am finding it incredibly difficult to stay on task because of little things that pop up; having to re-order work supplies, dog has fleas, laundry, cooking, etc.\n\nMy mind keeps adding up all the small things I have to do and I feel very overwhelmed. Then I start thinking of the future and things I hope to accomplish down the line (more successful career/great mother/wife/etc.) and I can't imagine ever being able to accomplish these things if I can't even do the laundry.\n\nI'm taking it slow and completing small tasks, but as soon as I finish one thing I immediately start thinking of the things I haven't finished yet. I have an amazing husband who is willing to do anything and everything to help, but I feel bad when he comes home from working all day to even more work, when I could have easily taken care of it myself if I wasn't such a mess.\n\nI keep putting off making an appointment with a psychologist because I have no insurance (but I do have savings to use), and having to get back into therapy makes my heart hurt.\n\nTL;DR: Everyday tasks seem overwhelming which leads to stressing out about the future and I'm avoiding making an appointment with a psychologist because I'm an idiot.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "overwhelmed with little tasks leads to thinking I'll never be able to accomplish anything big in life [rant]",
            "url": "http://www.reddit.com/r/Anxiety/comments/28odv3/overwhelmed_with_little_tasks_leads_to_thinking/"
        },
        {
            "author": "caviabella",
            "author_created_utc": 1347642000,
            "author_flair_css_class": "",
            "author_flair_text": "",
            "author_fullname": "t2_90bmq",
            "created_utc": 1403299922,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28obf7/my_mom_got_me_a_car_update_this_is_actually_a/",
            "gilded": 0,
            "id": "28obf7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28obf7/my_mom_got_me_a_car_update_this_is_actually_a/",
            "retrieved_on": 1441302874,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Hey guys. This might be my first positive post on this subreddit! \n\nI know someone asked for an update and pictures of my car. Sorry it took so long to deliver! Turns out the tree I park next to grows bird berries and my car is always covered in them. I just got back from taking it to the car wash. (The car was was a little hard for me because I was scared to \"mess up\" and not get in or out at the right time or ask for the wrong package. But I had my sister with me.) So here is a picture: http://i.imgur.com/nKhmPj6.jpg (Sorry about the white bars. I uploaded it to Instagram too!) \n\nAs far as how I'm feeling about driving goes, I'm a little better. The feeling of \"Oh. My. Gosh. I did something wrong!\" when I get home from driving is almost 100% gone. I only sort of 2nd guess everything I did once. Like, instead of being terrified for hours I reply the drive once in my head and make sure I didn't do anything wrong. Still not perfect, but it's better. I'm a bit more comfortable on the road too. I've driven by myself a few more times. I'm still a little too scared to go to new or very busy places alone. I'm going to try to pick my boyfriend up from work tonight. I drove it a few night ago with my sister. I can picture the drive perfectly in my head. This will be the first time going alone. I drove to two out of the tree busiest \"hang out places\" in our area. I was scared. I could tell some people thought I couldn't drive. But I did okay. \n\nI'm still scared of the police but I'm starting to think things related to my PTSD will just never go away. I was actually watching the show Cops on TV the other night. Some guy got pulled over and he was super nervous. The officer said the guy was \"scaring him\" (the guy really wasn't doing anything wrong!) and he ended up arresting him. So now I'm scared if I get pulled over the cop will see how freaked out I am and arrest me. I should stay away from TV. \n\nThank you to everyone who commented last time. You all really helped a lot. I think if it weren't for you guys I probably would have just given my mom the keys back. THANK YOU! THANK YOU! THANK YOU! Internet hugs to all of you!\n\nEdit: My car's name is Oliver. I've been calling him \"Poison Berry\" on account of all the berries that end up all over it. It sounds so badass for my Santa Fe. Haha. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My mom got me a car UPDATE! (This is actually a pretty positive post!)",
            "url": "http://www.reddit.com/r/Anxiety/comments/28obf7/my_mom_got_me_a_car_update_this_is_actually_a/"
        },
        {
            "author": "norcalcooter",
            "author_created_utc": 1394847283,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fp9kd",
            "created_utc": 1403053609,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/28f5i2/anxiety_as_i_knew_it_ended/",
            "gilded": 0,
            "id": "28f5i2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/28f5i2/anxiety_as_i_knew_it_ended/",
            "retrieved_on": 1441307209,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "Anxiety was my constant companion from a toddler. I was terrified all the time. I had insomnia at 5 years old in 1985. I started medication and therapy at age 19. Anxiety probably reached critical mass in 2011 but reached a new type of peak in February 2014. I had great doctors. I was doing therapy. I had a medication regime and still I felt awful. Physically and emotionally.  I checked myself into a three day inpatient program. My meds were tapered off. I started sleeping through the night without medication. Four months later I'm off all meds. For the first time in memory,  I'm not anxious. I'm content.  What changed?  Years and years and years of hard work, medication change ups, therapy, groups,  family support and lifestyle changes healed my brain. My life is calmer than it was.  I'm making better decisions. I stopped drinking.  I'm more mature. I exercise now. I'm mindful. I stay off caffine and sugar. The anxiety medication I was on when I was admitted wasn't helping anything because I had hypertension which wasn't treated properly.  Within two weeks I was off Klonopin.  Within two months I was off prozac. I didn't think I'd ever be off meds. But the dream came true at 33. Hard won fight but I thought it was worth sharing. It's rambles I know. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety as I knew it ended",
            "url": "http://www.reddit.com/r/Anxiety/comments/28f5i2/anxiety_as_i_knew_it_ended/"
        }
    ]
}