{
    "data": [
        {
            "author": "Seeker_Of_Wisdom",
            "author_created_utc": 1363660676,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_azyio",
            "created_utc": 1401153851,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26kh3a/how_anxiety_feels_to_me/",
            "gilded": 0,
            "id": "26kh3a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26kh3a/how_anxiety_feels_to_me/",
            "retrieved_on": 1441338856,
            "score": 211,
            "secure_media_embed": {},
            "selftext": "Anxiety is - constantly questioning yourself.\n\nAnxiety is - thinking, no, knowing that there is something fundamentally wrong with you. \n\nAnxiety is - knowing that somewhere along the line, your mind had been corrupted and sent into an unrecoverable spiral that has led you into this unique headspace in which you now reside. \n\nAnxiety is - knowing that there is no return from your current circumstance.\n\nAnxiety is - wondering how it all seems to come so easily to some people; how the words that escape their lips were summoned so easily from their minds. Anxiety is remembering a time when words seemed to flow from you in this way.\n\nAnxiety is - feeling that each day, you are more awkward and clumsy than the last. That the cleverness and profundity of days past are now but fleeting memories.\n\nAnxiety is - thinking that you are a walking fraud - that nothing you do is as original or as essentially real as what anyone else is doing.\n\nAnxiety is - giving into all of these feelings, trying to forget them, and then worry whether you are doing the right thing.\n\nAnxiety is - realizing the absurdity of all of these self reflective thoughts, feeling helpless, and not knowing what to do with yourself and your mind.\n\n\n\nAnxiety is - creating a maze within your own mind and then forgetting the way out.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How anxiety feels to me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/26kh3a/how_anxiety_feels_to_me/"
        },
        {
            "author": "SwordsToPlowshares",
            "author_created_utc": 1338274991,
            "author_flair_css_class": "",
            "author_flair_text": "Mild depression/Social anxiety/AvPD",
            "author_fullname": "t2_7u5a2",
            "created_utc": 1400933676,
            "domain": "theonion.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26ddi4/satire_study_anxiety_resolved_by_thinking_about/",
            "gilded": 0,
            "id": "26ddi4",
            "is_self": false,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26ddi4/satire_study_anxiety_resolved_by_thinking_about/",
            "retrieved_on": 1441342232,
            "score": 137,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://c.thumbs.redditmedia.com/ZKXufsagph0tq1IJ.jpg",
            "title": "[Satire] Study: Anxiety resolved by thinking about it real hard",
            "url": "http://www.theonion.com/articles/study-anxiety-resolved-by-thinking-about-it-real-h,32555/"
        },
        {
            "author": "poweredbyanxiety",
            "author_created_utc": 1393413787,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fgjjx",
            "created_utc": 1400783224,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/268awn/do_you_ever_feel_like_youre_going_to_have_a_heart/",
            "gilded": 0,
            "id": "268awn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 56,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/268awn/do_you_ever_feel_like_youre_going_to_have_a_heart/",
            "retrieved_on": 1441344656,
            "score": 101,
            "secure_media_embed": {},
            "selftext": "Does anyone ever feel like one day you're going to have a heart attack and everyone will just be standing around you saying \"It's only a panic attack, you know this!\"? Because I really feel like that's going to happen one day.\n\nI know thats probably my anxiety talking but I just have this gut feeling one day I'm going to have an actual heart attack and everyone is going to slowly watch me die.\n\nLike, 100% positive about it. \n\nSo, just wondering if anyone else freaks out about this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you ever feel like you're going to have a heart attack?",
            "url": "http://www.reddit.com/r/Anxiety/comments/268awn/do_you_ever_feel_like_youre_going_to_have_a_heart/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1401220452,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26msj0/does_anybody_have_depression_because_of_their/",
            "gilded": 0,
            "id": "26msj0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26msj0/does_anybody_have_depression_because_of_their/",
            "retrieved_on": 1441337775,
            "score": 89,
            "secure_media_embed": {},
            "selftext": "I've had anxiety all my life, but something I noticed was that my depression, which I previously thought had to do with other stuff, seems to be a reaction to my anxiety. Whenever I'd get anxious, I'd get depressed to a point in which I didn't care about anything, which helped with the anxiety. Anyone else have this problem? It seems that my depression is a direct reaction to my anxiety. In order to not care anymore, I succumb to my thoughts of uselessness and get depressed as a result.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anybody have depression because of their anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/26msj0/does_anybody_have_depression_because_of_their/"
        },
        {
            "author": "yeahkeogh",
            "author_flair_css_class": "",
            "author_flair_text": "return to the breath",
            "created_utc": 1401147308,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26k7kx/relaxing_imagine_your_feelings_as_weather_patterns/",
            "gilded": 0,
            "id": "26k7kx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26k7kx/relaxing_imagine_your_feelings_as_weather_patterns/",
            "retrieved_on": 1441338980,
            "score": 80,
            "secure_media_embed": {},
            "selftext": "Whenever I am feeling rather unstable upstairs, it helps me to imagine what I am feeling as different patterns of weather. Ranging from clouds, to full blown hurricanes, to gentle sunlight. \n\nFor instance, a lot of the times when I'm feeling anxious in particular, I imagine my mind as a rain cloud. The rain cloud gets heavier and thicker, the winds pick up and there are a few bolts of lightning. Eventually (3 seconds in reality) the rain storm turns into a thunderstorm. Here we see heavy rain, strong winds, and frequent bolts of lightning appear as anxious thoughts stack exponentially. Things are getting kind of intense, my own thoughts have blasted me out the top of my head in a triangular spiral. That's when I remember a little tool I learned while meditating. \n\nAll storms have to end sooner or later. By imagining the storm dissolving away right before my eyes, the rain stopping, winds coming to a dead halt, and clouds vanishing into nothing, I can finally imagine the sunlight. \n\nBy imagining our feelings as weather patterns, we can correlate happiness to sunlight, anxiety to intense thunderstorms, and depression to dark gloomy overcast. By doing so we can begin to imagine the clouds, which are obscuring our view of happiness, vanish into thin air - thus allowing a clear view of the sun, or happiness in this matter.\n\nJust remember guys and gals: behind the darkest of clouds, the sun still shines. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Relaxing] Imagine your feelings as weather patterns.",
            "url": "http://www.reddit.com/r/Anxiety/comments/26k7kx/relaxing_imagine_your_feelings_as_weather_patterns/"
        },
        {
            "author": "newsdaylaura18",
            "author_created_utc": 1305823838,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_59al9",
            "created_utc": 1400896878,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26cibd/this_anxious_bitch_is_running_the_nyc_marathon/",
            "gilded": 0,
            "id": "26cibd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26cibd/this_anxious_bitch_is_running_the_nyc_marathon/",
            "retrieved_on": 1441342635,
            "score": 79,
            "secure_media_embed": {},
            "selftext": "I have suffered with our affliction for 14 years. It has held me back from a lot of things... But I have felt much better since I started exercising.  What started as a walk to the end of the street turned into a 5k run, then a 10k and lastly a half marathon in March. I won the lottery for the NYC marathon this year and you better believe I will run that fucker and I will finish (anxiety and all!)\n\nI still have panic attacks. They are a weekly occurrence. But what I am learning is that I can have a panic attack and that they don't have to destroy my day or wreck my goals for the future. Life seems very scary sometimes, because it can be. Life is strange. I am learning to cope with that through talk therapy and exercise and it is helping. The idea of running a marathon is ultra scary to me, but I'm running one. This is real. I am running the New York City Marathon this year.  It won't be easy but it can't be harder than living with an anxiety disorder.  We are much stronger than we give ourselves credit for.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This anxious bitch is running the NYC marathon this year",
            "url": "http://www.reddit.com/r/Anxiety/comments/26cibd/this_anxious_bitch_is_running_the_nyc_marathon/"
        },
        {
            "author": "rustybricks",
            "author_created_utc": 1366715150,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bfd7v",
            "created_utc": 1400988494,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26f7ec/dae_drink_and_regret_drinking_because_their/",
            "gilded": 0,
            "id": "26f7ec",
            "is_self": true,
            "media_embed": {},
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26f7ec/dae_drink_and_regret_drinking_because_their/",
            "retrieved_on": 1441341377,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "It's a stupid fucking cycle. Being young I never learn my lesson, I hate myself for a day or two and then do it all again.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE drink and regret drinking because their anxiety goes crazy and then drink again?",
            "url": "http://www.reddit.com/r/Anxiety/comments/26f7ec/dae_drink_and_regret_drinking_because_their/"
        },
        {
            "author": "ShitHeadPete",
            "author_created_utc": 1370073069,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bvwk4",
            "created_utc": 1401067337,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26hj8j/thank_you_ranxiety/",
            "gilded": 0,
            "id": "26hj8j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26hj8j/thank_you_ranxiety/",
            "retrieved_on": 1441340291,
            "score": 69,
            "secure_media_embed": {},
            "selftext": "ive been posting on this sub-reddit for a few months now and everytime i get a lot of supportive comments and helpful advice. this weekend i took a true test of my anxiety and went on a trip to las vegas and went to a bunch of shows and out to eat, all these things would normally give me terrible anxiety but thanks to posting on here (and therapy of course lol) i was able to keep it all under control, so thank you everyone in the sub-reddit",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thank you /r/anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/26hj8j/thank_you_ranxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1401224339,
            "domain": "self.Anxiety",
            "edited": 1401229728,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26mzae/rant_my_roommate_deliberately_triggered_an/",
            "gilded": 0,
            "id": "26mzae",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26mzae/rant_my_roommate_deliberately_triggered_an/",
            "retrieved_on": 1441337687,
            "score": 69,
            "secure_media_embed": {},
            "selftext": "**The Facts**\n\n* Until last night, my boyfriend and I shared an apartment with two roommates, all in our 20s. We lived there for about a year. I'll write in present tense for convenience.\n* One of said roommates (call her A) has two cats, which keep me up all night scratching and howling at my boyfriend's and my door. Just ours - no one else's. (The previous occupant of that room kept a pet bird, so my theory is the cats still think it lives there.)\n* I've broken a couple of A's kitchen items - a glass and a baking dish. I also lost a pair of scissors. I replaced the dish and the scissors right away, and she said not to worry about the glass. That was six months ago, and we've had a friendly relationship ever since.\n* A has occasionally thrown out my food, but I've written that off. I like to choose my battles, and that particular one never seemed worth it. Which brings me to...\n* I have PTSD and anxiety disorders. Angry yelling will send me into an anxiety attack. I was upfront about this upon moving in. If you have a problem with me, you cool down until you can address it civilly. I am otherwise very functional and manage my disorders well, but \"no screaming\" is the one accommodation I really need. Both roommates (and my boyfriend, of course) started out being very understanding of this. When A broke the rule a couple months ago, she even bought me apology chocolate.\n* Our other roommate, B, is like a friendly ghost. Always pleasant, but rarely around. My boyfriend (C) and I have never had any kind of problem with him.\n\n**What Happened**\n\nI was cooking late on Sunday night, after everyone else was in bed. I ducked into the bathroom and returned to find the pot boiling over. I also noticed that the small saucer we keep on the stove (for spoons, etc.) was cracked in half, but in the rush of trying not to ruin my food, it slipped my mind. Once in bed, I made a note to bring it up with my roommates in the morning.\n\nAt 8:30 the next morning, I was awakened by A screaming profanities out in the kitchen. My heart immediately started to race, and I woke up my boyfriend. He went out to see what was going on while I took some tranquilizers and put a pillow over my ears to stave off an anxiety attack. I could hear her screaming even though the pillow - all about how I've been ruining her life ever since I moved in. She dredged up the baking pan and the scissors, even though we'd long since settled those things. The catalyst this time was the broken dish on the stove, which apparently was automatically my fault. I heard a series of thumps, which my boyfriend told me later was her throwing food.\n\nB emerged from his room then and told A she was being psychotic. He got her to promise to talk it out with me later without raising her voice. She did so begrudgingly and went off to her room, where I heard her starting to smash her own belongings. My boyfriend gave me more tranqs, dressed me, and took me out of the house. He calmed me down, and we got breakfast and tried to parse what had happened. A then texted us to set up a discussion at 6 that evening. We agreed.\n\nNow, the last time A went off (which wasn't anywhere near this intense), she'd come in that evening apologizing all over the place. I was expecting something like that last night, but she came in still yelling - all the while denying that she was. B and my boyfriend were trying to tell her she needed to dial it back, which just made her angrier. \"I'm not yelling! How is this yelling?! I'm not fucking yelling!\" I got up and went to my room for more tranqs (way more than I should take in one day, but what the hell), and she kept yelling at my back down the hall.\n\nI came out and spoke for myself this time. I told her she was really triggering me, that she *knew* she was triggering me, and asked her to stop. Her reply? \"I'm sorry you're set off so fucking easily, then. I think I should be allowed to yell in my own home.\" That's what hurt the most. My mental health is not a game, and my triggers are not negotiable. If you want to yell, go outside. We agreed on this, I'm here having a panic attack right before your eyes, and you still don't have the courtesy to fucking lower your voice? Not to mention that she throws out my food and her cats keep me up every night, and I have never stooped to this level. Fuck this \"in my own home\" noise - that doesn't give anyone the right to be abusive. \n\nMy boyfriend said that he refused to live in a place where his girlfriend's mental health wasn't respected. He informed A that we were going to leave as soon as possible. We talked to B and assured him he wouldn't be left high and dry with the rent, then got the fuck out and went to a friend's. I'm writing this now from my parents' house an hour away. I do not intend to sleep in that apartment again as long as A is there. It was hard enough coming back to pack an overnight bag.\n\nOh yeah, and the glass? The one that broke months ago and she said not to worry about? We just got slammed with a bill for $75. Six months after the fact. I think my boyfriend's talked her out of it, but ain't that just the icing on the shit cake? \n\n**Edit:** This coming weekend was supposed to be my 22nd birthday party, which I've been planning for two months. I never have birthday parties, so I wanted to make this one special. A had planned to be out of town that weekend, partially to visit family and partially to give my guests space. She just texted my boyfriend and me with the news that she's decided to stay home instead. This is a fucking punishment. This is her giving me one last \"fuck you\". Because I broke (and replaced) a couple of dishes and asked her not to scream at me. If a boyfriend treated me like this, I'd have left him long ago. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] My roommate deliberately triggered an anxiety attack and then yelled at me for having one.",
            "url": "http://www.reddit.com/r/Anxiety/comments/26mzae/rant_my_roommate_deliberately_triggered_an/"
        },
        {
            "author": "Kadavercat",
            "author_created_utc": 1380579435,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dc843",
            "created_utc": 1400729543,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/266hjy/is_anyone_else_here_constantly_sick_due_to_their/",
            "gilded": 0,
            "id": "266hjy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 69,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/266hjy/is_anyone_else_here_constantly_sick_due_to_their/",
            "retrieved_on": 1441345504,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "I'm anxious all the time, and treatment aside, I was wondering if anyone else gets/feels sick a lot. It seems to be one thing after another. Digestive problems, oral thrush (triggered by stress), constant heart burn, dizziness, nausea, hot and cold flashes, worse allergies, general feeling of malaise, headaches, joint/bone aches, etc. Anyone else experience health issues directly related to your anxiety?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is anyone else here constantly sick due to their anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/266hjy/is_anyone_else_here_constantly_sick_due_to_their/"
        },
        {
            "author": "ratikete",
            "author_created_utc": 1401279816,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gqybp",
            "created_utc": 1401280067,
            "domain": "self.Anxiety",
            "edited": 1401322007,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26ouis/just_had_a_terrible_job_interview_how_can_i_stop/",
            "gilded": 0,
            "id": "26ouis",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26ouis/just_had_a_terrible_job_interview_how_can_i_stop/",
            "retrieved_on": 1441336816,
            "score": 55,
            "secure_media_embed": {},
            "selftext": "I'm pretty sure I haven't got the job (although I suppose stranger things have happened!).  Most of the answers I'd prepared and practised ended up being useless, and I found myself stumped by a lot of the questions they did ask. I'm back at work now cringing so hard at myself- I cannot relax or focus on anything. I feel sick and my heart rate is so fast. They are going to call later on to let me know the outcome, I just need to stop freaking out here...I have OCD too and have been doing so many rituals to try and get rid of these thoughts, but can't :(\n\nEDIT: Thank you for all your kind words and advice- I have been taking them all, and it really helped me relax and forget about things until the phone call came. But guess what... I actually got the job! :O :O :O \n\nI suppose this just goes to show that our own perceptions of our performance can be completely warped when we are so wrapped up with anxiety. They actually laughed when I told them how shocked I was! So if anyone else is having problems with always thinking you have done badly, or that people notice your little failures, just remember that the only person really focused on that is you!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just had a terrible job interview... How can I stop reliving it and panicking?",
            "url": "http://www.reddit.com/r/Anxiety/comments/26ouis/just_had_a_terrible_job_interview_how_can_i_stop/"
        },
        {
            "author": "logic_card",
            "author_created_utc": 1371596250,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c30fn",
            "created_utc": 1401300289,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26pq6d/has_anyone_experienced_brain_zaps_usually_a/",
            "gilded": 0,
            "id": "26pq6d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 96,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26pq6d/has_anyone_experienced_brain_zaps_usually_a/",
            "retrieved_on": 1441336406,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "I do not have depression or anxiety, I have never taken any medication other than antibiotics though I may have some of the symptoms of ADHD. I realize this is only marginally related to anxiety but any information might help me get to the bottom of this.\n\nFrom an early age I have been able to voluntarily cause an electrical shock sensation in my head, I told my parents but they didn't believe me and it turned into something I just kept to myself and didn't talk about. Though recently I heard that some people on anti-depressant medication experience a similar symptom.\n\nhttp://en.wikipedia.org/wiki/SSRI_discontinuation_syndrome#Neurological\n\n&gt; Symptoms described as \"brain zaps,\" \"brain shocks,\" \"brain shivers,\" \"brain pulse-waves,\" \"head shocks,\" \"pulses,\" \"flickers,\" or \"cranial zings\" are common withdrawal symptoms\n\n&gt; Electric shock sensations have also been reported[24][25] with many patients describing the symptoms as \"brain zaps\". It has been suggested the sensations may represent an alteration of neuronal activity in the central nervous system.\n\nThis is roughly where I experience the electrical sensation.\n\nhttp://i.imgur.com/SrfmQ2G.png\n\nIt is underneath the skull and I can make it last a second, it wears down after a few shocks, I very rarely bother doing this, though I did it just now in order to make that picture. Very occasionally I can feel a shock coming on its own and it is stronger than the others, I can suppress it at will as well.\n\nHas anyone ever had a similar experience? I am by no means an expert so I'm not jumping to conclusions, I think it may be related to a low amount of serotonin receptors which may also be related to ADHD.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone experienced? \"brain zaps\"? Usually a symptom of SSRI (drugs like prozac) discontinuation. I have this unusual symptom without drugs and it is voluntary.",
            "url": "http://www.reddit.com/r/Anxiety/comments/26pq6d/has_anyone_experienced_brain_zaps_usually_a/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1400862746,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26b4n7/i_skipped_my_doctors_appointment_today_because_of/",
            "gilded": 0,
            "id": "26b4n7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26b4n7/i_skipped_my_doctors_appointment_today_because_of/",
            "retrieved_on": 1441343339,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "I'm so mad at myself. I got up early and walked all the way to the doctor's, only to stand outside trying not to have a panic attack and ultimately not even going inside. I turned around and walked back home and cried. I haven't been to a doctor in 3 years now. When I got back home, I called and said I overslept and now they can't even reschedule me until August. \n\nI feel like shit. I can't believe I did that.\n\nA big part of my anxiety is my hypochondria, so even though I wanted to go in and make sure I'm all okay, I was afraid to because I don't know what they'll say, and what if it's something bad?\n\nI don't know what to do now. I fucking hate myself.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I skipped my doctor's appointment today because of my anxiety [rant]",
            "url": "http://www.reddit.com/r/Anxiety/comments/26b4n7/i_skipped_my_doctors_appointment_today_because_of/"
        },
        {
            "author": "misanthropik1",
            "author_created_utc": 1374493560,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cgx8g",
            "created_utc": 1401029678,
            "domain": "self.Anxiety",
            "edited": 1401063288,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26g4vw/just_called_911_thinking_i_had_a_heart/",
            "gilded": 0,
            "id": "26g4vw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26g4vw/just_called_911_thinking_i_had_a_heart/",
            "retrieved_on": 1441340943,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "Hiyo reddit,\n\nI am a significantly overweight 23 year old (about 100 lb) and I have been hardcore dieting (&lt;1500 calorie diet daily) and walking 4+miles a day for a while now to get in shape and be healthy.\n\nThis morning I woke up with a minor pain in my back and numbness in my arm (thinking now I probably slept on it wrong). Knowing the symptoms of a heart attack I googled other known signs and instantly my body started to recreate those signs. As such I immediately called 911 who came out in about 10 mins with a blood oxygen test and a heart rate monitor.\n\nBlood oxygen fine\n\nBlood pressure 190/101\n\nThe blood pressure was likely caused by my stress/panicing so they said I was largely fine, as such they left without taking me to the hospital (thought they said I could if I really wanted to but it was probably unneeded).\n\nThis scared the crap out of me, I know losing weight is key but is there anything else that can be done to lower stress? I have always been a nervous wreck and I am in a high stress field (engineering school) so stress is part of life.\n\n*Update*\n\nHi everybody, thanks for the kind words. Im not usually very emotional (save for anxiety related nerves) but you guys really touched me. I haven't bawled my eyes out to my mother like that in years and it just felt good to know that I am not an oddity. \n\nMy life has been pretty weird, I'm more or less 1 year off being addicted to the internet and online gaming (or as I like to think I was too childish to grow up) In the past year I have moved from CT to WV to attend College at West Virginia University and get my life on track. Im an engineering student who is trying to make dean's list every semester and its put a ton of pressure on me to succeed to show my parents that I am worth a damn. Stress and anxiety have been building up on me for a while now and this maybe was just that reaching a head. \n\nI will take the advice that several of you have given and try out a yoga studio or just some counseling with a psychologist. Im not against medication for it, but I generally try to use that as a last restort.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just called 911 thinking I had a heart attack...anxiety why you so bad?",
            "url": "http://www.reddit.com/r/Anxiety/comments/26g4vw/just_called_911_thinking_i_had_a_heart/"
        },
        {
            "author": "Dawnkeeper",
            "author_created_utc": 1366194055,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bcknh",
            "created_utc": 1400864961,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26b84z/love_note_to_you_all/",
            "gilded": 0,
            "id": "26b84z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26b84z/love_note_to_you_all/",
            "retrieved_on": 1441343293,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "Dearest r/anxiety-redditors,\n\nI want to thank you guys for somehow making me feel loved and heard. I feel like this is the only place I can truly vent everything without being shushed, thank you! This place feels like home, since you guys understand me.\n\nI posted (a few) other posts here, and if you wondered why I did not answer... I am fucking afraid to say something stupid ( I'm having a bold moment here), but thank you for all your awesome and kind and helpful words!\n\nlove,\n\nDawn\n\nTL;DR thanks guys! I love you!\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "love note to you all",
            "url": "http://www.reddit.com/r/Anxiety/comments/26b84z/love_note_to_you_all/"
        },
        {
            "author": "Tinesife",
            "author_created_utc": 1388416935,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ekpus",
            "created_utc": 1401214680,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26mih6/has_anyone_else_panicked_in_a_dream_and_woken_up/",
            "gilded": 0,
            "id": "26mih6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26mih6/has_anyone_else_panicked_in_a_dream_and_woken_up/",
            "retrieved_on": 1441337905,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I used to suffer from near-daily anxiety attacks. Somehow everything calmed down a few years ago; had a long bout of depression, then things were fine for a while.\n\nA few months ago I started suffering from depression again. Then a couple weeks ago, things got so bad I nearly made a suicide attempt. I started feeling a fair bit better, but I'm a lot more on-edge and jittery now.\n\nI can't remember what I dreamt about last night, but I woke up hyperventilating and cradling myself.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Has anyone else panicked in a dream and woken up hyperventilating?",
            "url": "http://www.reddit.com/r/Anxiety/comments/26mih6/has_anyone_else_panicked_in_a_dream_and_woken_up/"
        },
        {
            "author": "Erkkiks",
            "author_created_utc": 1360689346,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ako8e",
            "created_utc": 1401227838,
            "domain": "self.Anxiety",
            "edited": 1401231358,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26n596/im_having_an_anxiety_attack/",
            "gilded": 0,
            "id": "26n596",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26n596/im_having_an_anxiety_attack/",
            "retrieved_on": 1441337610,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I have no idea why, or what caused it. It's 0:50 and I should've gone to sleep two hours ago. Even though tomorrow is the last day of school, I'm still worried because of my failed classes I can't improve the numbers of because I study here and live 50 kilometres away. I also have a summer job so I wouldn't have time to study even if I had a place to stay at the city where I study.\n\nI need to vent because I don't know what to do, cutting is no longer an option because I promised my SO and I never got any relief from it anyway.\n\nI talked to the school psychologist yesterday and lied that everything is going alright.\n\nI just want to go to sleep and actually wake up and be able to get out of bed in time to be able to make it in to school, I've overslept too many times and that stresses me out too.\n\nMy mind is overthinking pretty much everything and I can't relax enough to go to sleep because I keep thinking of *everything*.\n\nPlease help me because I have no idea what to do. ;_;\n\nEdit: Also I'm really hungry and I have nothing to eat since it's the last day before moving back home so the fridge is practically empty, only a block of cheese and a tub of butter. I think I would eat some cheese if I wasn't afraid of waking up my roommate who isn't the nicest guy around, he's caused a few panic attacks to me at school/here by insulting me/telling me to kill myself.\n\nI just want something to help me or ease my current condition. Even a single reply would help. :s\n\nEdit2: Alright everyone, I ate some cheese and feel a little better now, thanks to all you guys for being here for me. I'll update in the morning and see if I'm better by then.\n\nGoodnight everyone!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm having an anxiety attack",
            "url": "http://www.reddit.com/r/Anxiety/comments/26n596/im_having_an_anxiety_attack/"
        },
        {
            "author": "AngryWizard",
            "author_created_utc": 1331514843,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_75c43",
            "created_utc": 1400866947,
            "domain": "d3gqasl9vmjfd8.cloudfront.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26bb9o/rough_few_weeks_this_shirt_is_my_snarky_reward/",
            "gilded": 0,
            "id": "26bb9o",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26bb9o/rough_few_weeks_this_shirt_is_my_snarky_reward/",
            "retrieved_on": 1441343253,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/7tph9G4Z3Tg2Ag9N.jpg",
            "title": "Rough few weeks, this shirt is my snarky reward",
            "url": "http://d3gqasl9vmjfd8.cloudfront.net/ed80acdc-a10b-4fa3-ab43-eb599803772b.png"
        },
        {
            "author": "energybalancing",
            "author_created_utc": 1396985869,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g1gr0",
            "created_utc": 1401040204,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26giv0/there_is_hope_i_got_stuck_in_an_elevator_today/",
            "gilded": 0,
            "id": "26giv0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26giv0/there_is_hope_i_got_stuck_in_an_elevator_today/",
            "retrieved_on": 1441340761,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I am new to this subreddit, but have been dealing with anxiety off and on most of my life. Honestly, up until last fall, I kinda thought I was \"over it\"... but since that time, I have had several bouts of, for lack of a better term, I'll just call them \"breathing challenges\".\n\nThese last few weeks have been fine. Almost forgot again that I even have any challenges in this area.\n\nI was seeing a client today in an old building where I have an office space. The building is closed and empty on Sundays, doors locked, etc... My client left. I closed up, and was heading out from the 4th floor. Should have taken the stairs, but out of habit, I stepped into the elevator and pressed the old \"1\" button. The door closed, and then... nothing.\n\nI waited a moment, and still nothing. I pressed a few other buttons, including the \"Open Door\" button. Still nothing. \n\nThere was an alarm button, but I really, really did NOT want to press it. I had images of a loud blaring alarm going off, rattling me even more, and still no one hearing. There was no phone in the elevator... but thankfully, I had my cell phone *and* had a connection. I tried the \"non-emergency\" number for the town I live in, all offices closed. The message said to call 911 \"in an emergency\". I dreaded it, but called.\n\nSo this is two first for one day. Never had to call 911 before, nor have I ever been stuck in an elevator. That call went OK - they said they would contact the fire department, which as fate would have it, I knew was just a few blocks away.\n\nAwesome. OK. So \"I'll be out of here in no time\", I thought.\n\nAnd then it dawned on me. That which I suspect this subreddit will \"get\". I realized that I was living one of my own personal nightmares and *NOT* having an anxiety attack!\n\nWow. Of course, this very thought did start to make my chest tight, and all of a sudden, I realized - no windows, no air flow... and started to feel rather claustrophobic, but I just put my hands gently on my chest and tried to stay in my body, and focus as much as possible on other things, like what I wanted to do today after I get out, etc... and it all went well.\n\nAt some point, the elevator started to move, the door opened, and I felt like I was walking into heaven. It was still the 4th floor, and I was never happier to see the stairs. I walked down to find a building maintenance guy talking with the fire department - they asked if I was OK. I wanted to tell them my story, but knew they didn't really care about all that... so yeah, I said, I am great.\n\nThis feels like an accomplishment of sorts. I always told myself I could handle such an event, but was also holding onto some level of fear, I suppose. I wanted to share this, because I want others to know that this is possible.\n\nI had the briefest of moments where I could envision myself having a full on panic attack, and having paramedics pull me out, with me clenching at my chest, and them giving me oxygen or something crazy like that. I was able to let that vision go and give it none of my power. I am very grateful for that.\n\nAs cliche as it may sound, I hope this helps someone else know that with time and work, things can get better.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "There is hope. I got stuck in an elevator today, and everything ended up just fine.",
            "url": "http://www.reddit.com/r/Anxiety/comments/26giv0/there_is_hope_i_got_stuck_in_an_elevator_today/"
        },
        {
            "author": "andlife",
            "author_created_utc": 1313008287,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5nd5v",
            "created_utc": 1400856806,
            "domain": "self.Anxiety",
            "edited": 1400942730,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26avej/my_therapist_said_were_going_to_do_exposure/",
            "gilded": 0,
            "id": "26avej",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26avej/my_therapist_said_were_going_to_do_exposure/",
            "retrieved_on": 1441343458,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "To me, living through every day is exposure therapy. Anyone else feel like this?\n\n**Edit:** Wow, It's my first time posting in r/anxiety and I was not expecting the outpouring of support and you-can-do-it's. Thanks guys! That really means a lot to me",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My therapist said we're going to do exposure therapy....",
            "url": "http://www.reddit.com/r/Anxiety/comments/26avej/my_therapist_said_were_going_to_do_exposure/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1401291059,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26paie/ive_had_almost_nonstop_nausea_for_10_days_because/",
            "gilded": 0,
            "id": "26paie",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26paie/ive_had_almost_nonstop_nausea_for_10_days_because/",
            "retrieved_on": 1441336612,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I am 24 years old with a fulltime desk job. In anticipation of a couple fun things- a convention and concert-and work stress, I have been feeling nauseous every day. Have not puked. Stayed home from work a couple days cause of the stress but nothing has stopped it from returning. I am losing my mind and jeopardizing my job. Can anyone help?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I've had almost nonstop nausea for 10 days because of anxiety in anticipation of upcoming events. Can anyone recommend help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/26paie/ive_had_almost_nonstop_nausea_for_10_days_because/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1401132157,
            "domain": "self.Anxiety",
            "edited": 1401132545,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26jk4z/i_want_to_go_back_in_time_and_beat_myself_up/",
            "gilded": 0,
            "id": "26jk4z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26jk4z/i_want_to_go_back_in_time_and_beat_myself_up/",
            "retrieved_on": 1441339283,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "41 days ago exactly I bought some hash and smoked it with some friends, ever since then I've had extreme derealization and panic attacks, I feel like I've ruined my life, like ill always be like this. This doesn't seem like real life, I feel like this is a dream like why am I even posting here, this is just a dream. I also developed severe health anxiety after an event which caused me to think I was having a heart attack and actually went to the ER 7 hours before my final exam at 3 AM. My parents have been supportive as my dad has panic disorder as well and completely understands where I'm coming from. I've developed a fear of death and am always anxious that I will have Sudden Cardiac Arrest and die. I've always been scared of death but I was able to get rid of those thoughts when I had them earlier, however ever since I developed health anxiety I've literally been expecting death. Like I would stand infront of my parents room while they slept so incase I had Sudden Cardiac Arrest they would hear me and would be able to take me to the hospital.(I know these thoughts and my actions are ridiculous , however I cant help myself). I'm scared I might have a heart disorder which will kill me, the only time I ever feel normal is when I play video games. I've always played video games, specifically Dota2, however as soon as I leave my PC , I feel dethatched, scared, and just really anxious. I haven't had a panic attack in over 20 days but I'm sure they will return with a vengeance as I have never been this anxious since the day of the Hash. \n\nI also have the flu at the moment, and I'm actually scared to take my medicine as I'm scared I will have some allergic reaction or whatever. Its really crazy however sometimes I think to myself \"Why am I even stressing? I'm normal , everything is normal, just calm down.\" but mere seconds later I'm trembling with anxiety, I'm scared to sleep and die in my sleep, its literally getting this bad, I don't know what to do, I'm not excited for things I would normally be really excited for such as summer vacation, which I have started 3 days ago. I'm just lying in bed all day or playing computer games, I want to feel normal, I want to enjoy life like I did before, I don't want this to get worse , I really don't. Lastly every time I read about someone's else's anxiety I start to develop their symptoms which further affects my de-realization.  \n\nSorry for the long post, I'm just trying to get this off my chest. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I want to go back in time and beat myself up.",
            "url": "http://www.reddit.com/r/Anxiety/comments/26jk4z/i_want_to_go_back_in_time_and_beat_myself_up/"
        },
        {
            "author": "fyourdownvote",
            "author_created_utc": 1371410270,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c24n8",
            "created_utc": 1400782530,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2689os/dae_have_extreme_jobrelated_anxiety_pretty_much/",
            "gilded": 0,
            "id": "2689os",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2689os/dae_have_extreme_jobrelated_anxiety_pretty_much/",
            "retrieved_on": 1441344672,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I have anxiety over a fair amount of things, but the worst is when I have to job-hunt. I'm in law school and I have a job lined up (it's a summer internship for now, but it may turn into a full-time offer), but it's not in the same state as my (pretty serious) boyfriend. \n\nJob hunting the first time around was ridiculously anxiety-inducing, and I was crying and depressed basically every single day. \n\nNow I have to do it again, and I can feel it starting in my chest and stomach in particular. It's like acid is seeping into my stomach. I need to be focusing on job stuff but it feels so damn pointless because ultimately I will be a professional failure. \n\nI feel like the anxiety is really preventing me from being fully confident and productive, which are, of course, the things required for me to get a job. \n\nBut there's this huge fear that even if I am confident and productive, the failure will just be too much to handle. At least now I can blame it on anxiety, but if I somehow combat that, and try to my fullest, how can I handle the failure? \n\nDoes anyone else feel this way? Any advice? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE have extreme job-related anxiety? [pretty much just a rant]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2689os/dae_have_extreme_jobrelated_anxiety_pretty_much/"
        },
        {
            "author": "KoreRekon",
            "author_created_utc": 1320186787,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_65rpx",
            "created_utc": 1400891902,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26ccdx/freestyle_walking/",
            "gilded": 0,
            "id": "26ccdx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26ccdx/freestyle_walking/",
            "retrieved_on": 1441342711,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "How awesome would it be if freestyle walking was actually a thing.\n\nIn public I'm so conscious of how I move.  Is my posture right?  Am I swaying my hips too much?  What are my hands doing?\n\nHow I'd love to just show my bad posture by hunching over and swinging my arms as if I were a beast.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Freestyle Walking",
            "url": "http://www.reddit.com/r/Anxiety/comments/26ccdx/freestyle_walking/"
        },
        {
            "author": "brotatojones",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1400903803,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/26cqch/i_think_i_am_actually_scared_to_relax/",
            "gilded": 0,
            "id": "26cqch",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/26cqch/i_think_i_am_actually_scared_to_relax/",
            "retrieved_on": 1441342530,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "I don't really know how to explain it ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I think I am actually scared to relax",
            "url": "http://www.reddit.com/r/Anxiety/comments/26cqch/i_think_i_am_actually_scared_to_relax/"
        }
    ]
}