{
    "data": [
        {
            "author": "Waldoz53",
            "author_created_utc": 1367006972,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bgy8n",
            "created_utc": 1399807877,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/259veg/does_anyone_else_turn_into_a_self_destructive/",
            "gilded": 0,
            "id": "259veg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/259veg/does_anyone_else_turn_into_a_self_destructive/",
            "retrieved_on": 1441542023,
            "score": 148,
            "secure_media_embed": {},
            "selftext": "Let me take my most recent example. (It's not that recent but I'm afraid it'll happen again soon).\n\nLast year in college, I was extremely depressed. I was extremely lonely. I was so depressed that I couldn't attend most classes. I would wake up really, really late. I woke up at 4 PM once. Yeah, not my best days. Anyways, final exams were coming up in the next few weeks, and I barely knew any of the material. I downloaded all the powerpoints and did everything I could to study for each and every exam.\n\nAnd by the time the exams came around. I just didn't go. I skipped the exams. I just gave up. I threw out all my powerpoints, notes, lab papers the night before each exam, and I didn't go to the exams. Apparently I'd rather get a 0 and no worries about exams than work that hard and get a bad grade. That probably isn't the first time that happened to me. I just don't remember whether it happened before.\n\nI'm going back to college this fall. A 20 year old in dorms. I'm afraid this'll all happen again. And I mean starting with the loneliness, into the severe depression, into my self destructive behaviour. Yay...I can't wait...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else turn into a self destructive mess when they're extremely anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/259veg/does_anyone_else_turn_into_a_self_destructive/"
        },
        {
            "author": "Antisym",
            "author_created_utc": 1342221058,
            "author_flair_css_class": "",
            "author_flair_text": "Panic Disorder",
            "author_fullname": "t2_8bown",
            "created_utc": 1399853252,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25bh1q/does_anyone_else_only_find_their_motivation_to_do/",
            "gilded": 0,
            "id": "25bh1q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25bh1q/does_anyone_else_only_find_their_motivation_to_do/",
            "retrieved_on": 1441541276,
            "score": 137,
            "secure_media_embed": {},
            "selftext": "I always wake up at 7am, and I spend all day trying to think of things to do, but I never feel like doing any of them. It always gets to evening time and I think to myself 'well thats another day wasted!'\n\nAll of a sudden around about 1 or 2am, when I cannot sleep I find myself going 'I could be doing this, come on, lets do this! or lets do that!'\n\nIt's more annoying in itself, because then I get frustrated and cannot sleep. It makes me mad most nights, but the fact I can get slightly motivated keeps me sane.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else only find their motivation to do anything at stupid o'clock and realise will have to wait until the next day?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25bh1q/does_anyone_else_only_find_their_motivation_to_do/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1399862888,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25bumv/procrastination_is_ruining_my_life_but_my_anxiety/",
            "gilded": 0,
            "id": "25bumv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25bumv/procrastination_is_ruining_my_life_but_my_anxiety/",
            "retrieved_on": 1441541100,
            "score": 91,
            "secure_media_embed": {},
            "selftext": "I'm sitting at home, not working on some stuff that was due last week. It's for work (kinda). \n\nWhenever I have a daunting task, I delay it as much as possible. I think about nonstop, but can't will myself to get up and do it. I think it's my fear of failure. I end up napping for hours and hours in order to avoid my tasks. \n\nAlso, working on the weekends from home makes me really anxious. Like it's MY time and I don't want to give it up for work.  \n\nI don't know how to break this cycle.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Procrastination is ruining my life, but my anxiety keeps me in an endless loop.",
            "url": "http://www.reddit.com/r/Anxiety/comments/25bumv/procrastination_is_ruining_my_life_but_my_anxiety/"
        },
        {
            "author": "fdfhjdjh",
            "author_created_utc": 1399766885,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gih9n",
            "created_utc": 1399767583,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/258usy/my_anxiety_causes_me_to_not_get_help_for_my/",
            "gilded": 0,
            "id": "258usy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/258usy/my_anxiety_causes_me_to_not_get_help_for_my/",
            "retrieved_on": 1441542498,
            "score": 90,
            "secure_media_embed": {},
            "selftext": "I have various types of anxiety, one of them being REALLY bad social anxiety. I need help, but it's so bad I cannot even go to an appointment let alone call to make an appointment. I also have Seasonal anxiety, I can only seem to do things at night when it's not hot outside, because it makes me \"feel\" like I can't breath and I go into panic mode and face gets numb. \n\nI'm 21 and spent several years in inpatient treatment facilities, and been in counseling since I was 6. I was doing better then gotten so much worse a 3 year relationship with an abusive husband made me take 100 steps back. I know all the techniques like self-talk, coping skills, etc. I've been on medicine in the past. I just feel hopeless even if I were able to get 'help' again, I don't think it would help.\n\nMy anxiety caused me to not have friends, not being able to work, and caused me to cut my parents out of my life. I'm not suicidal but I do feel like I'm taking up space and that I'm pretty much useless since I can't do 'normal' things. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My anxiety causes me to not get help for my anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/258usy/my_anxiety_causes_me_to_not_get_help_for_my/"
        },
        {
            "author": "Zillibean",
            "author_created_utc": 1337640682,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7rxil",
            "created_utc": 1399566442,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/251vvz/the_little_things/",
            "gilded": 0,
            "id": "251vvz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/251vvz/the_little_things/",
            "retrieved_on": 1441545810,
            "score": 84,
            "secure_media_embed": {},
            "selftext": "I feel great today for what I have done. It's not much but I am very proud of myself. I walked to the lab where I had to get blood work done and I even had a conversation with a stranger on half the walk. I even called my doctors office today. This is a big step for me and I just want to remind everyone to really appreciate the little accomplishments. Does wonders for the self esteem. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The Little Things",
            "url": "http://www.reddit.com/r/Anxiety/comments/251vvz/the_little_things/"
        },
        {
            "author": "two_nude_dudes",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1399654780,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2553bf/i_developed_a_panic_disorder_after_a_drug_trip/",
            "gilded": 0,
            "id": "2553bf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 49,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2553bf/i_developed_a_panic_disorder_after_a_drug_trip/",
            "retrieved_on": 1441544314,
            "score": 80,
            "secure_media_embed": {},
            "selftext": "Pretext: I apologize for the length of this post. It is my story as I am finally able to tell it, and my hope is that it may contain some insights for those in similar situations. As an aside, I do mention my experiences with recreational drugs, but I am certainly not advocating them as a way of treating mental health issues. If you're trying to self medicate, stop first and get professional help, even if you think you're above it. It may not be the answer, but it should be your first stop. Moving on!\n\nI have never been formally diagnosed with anxiety, yet I can remember the first day it gripped me twenty years ago. I was in first grade, and my teacher had given us a writing assignment. Rather than turn it in to be graded once complete, she instead instructed the whole class to line up at her desk and take turns being graded on the spot--and in front of everyone. If you did well, you'd even get an animal cracker as a reward. Nice!\n\nNow, up until then I'd lived a pretty carefree existence on my family's farm. I had some friends, I was curious and intelligent, and I was sensitive... very sensitive. I was so senitive that I could not even fathom the level of shame I would feel when I finally reached my teacher's desk and watched her mark up my assignment with a red pen. Misspellings, improper punctuation, a run on, and more. \"No cracker,\" she loudly proclaimed. Whether or not I was the only one who noticed, everyone got a cracker but me. I had never felt so terrible in my life. I had never known such humiliation. All I can remember was going back to my desk to put my head down and never wanting to lift it again.\n\nThe incident was soon forgotten about and stored in the back of my mind, but it was the beginning of my troubles. From that point on, despite a loving family and supportive friends, I did my best to hide a number of worsening issues that I felt I would not be able to overcome.  I had body image problems, I wasn't good at anything, and I didn't feel like I belonged anywhere. \n\nMy self esteem dropped along with my grades. I was reprimanded for my poor performance in school, which only worsened my mental state. But, because I found so much joy and solace in my hobbies (mostly gaming), no one stopped to consider that I might be seriously depressed or anxious. Instead, I was told that I was undisciplined and lazy and wasting my potential. It was a speech I grew so frustrated with that, as I grew into a teenager, it fueled a rebellious streak that landed me in detention a lot and caused my grades sink to failing levels.\n\nI never knew that the way I felt wasn't normal. I had no way of knowing. To me, it was my bitter reality that I had to overcome by sheer force of will. I was simply lazy, and my problems were all clearly within my control according to every adult in my life.\nSo, with a lot of last minute tutoring, I BARELY graduated from high school and took a year to work full time before pursuing college. The anxiety go better, but my insecurity grew worse. Shortly after being accepted to Rutgers, my girlfriend left me for someone else. Now more than ever, I felt worthless. I faired alright in college, but again, was seen as an underperformer and a waste of potential. The pattern continued to repeat itself. I recognized it, and vowed to change my ways.\n\nI became, at this time, obsessed with self improvement. I began working out, eating better, buying nicer clothes, and doing everything I could to feel attractive. But I still couldn't shake this feeling of being inferior to everyone around me. I tried more and more to be someone, and changed a lot as a result. I'm ashamed to admit that I became very douchie around this time. I often overcompensated at the expense of others, and I broke some hearts.\n\nThough I hadn't lost my innate sensitivity, I was now suppressing my emotions because I had FUCKING HAD ENOUGH already and didn't want to feel this way anymore. I became very judgmental, and feigned a sense of elitism to compensate for how I really felt at the time. Bear in mind, these were not conscious decisions... they were simply my reactions to how I felt at the time. \n\nNow, is where things really start moving to my nervous breakdown. Toward the end of college, I decided to try smoking weed for the first time. I hiked a mountain with my friends, set up camp, and eagerly sucked on a joint and waited to see what it would feel like. But it didn't feel good. I felt distant, inconsequential, and the world felt unreal. I told my friends that I felt as though I was looking at reality through a window I couldn't open. I didn't know it at the time, but I was derealizing and depersonalizing without panicking. They thought I was being funny. They laughed. I got real quiet.\n\nMonths passed, and I smoked on occassion. Around the time I graduated, still unaware that there was something BEYOND my control that was causing my unhappiness, I decided to try eating some mushrooms with a friend. The experience was magical. I felt a sense of euphoria and oneness I'd never known. It opened up ways of thinking I'd never even considered and gave me a beautiful sense of perspective about the universe and life.\n\nOver the next two years, I tripped multiple times on acid and mushrooms, each trip helping me reconnect with the emotions I had chained up around the time I got to college. But every answer I found in my mental adventuring brought up new questions, and I was desperate to find something definitive and true about existence that would help me feel like I belonged on this planet. In otherwords, I sought a sense of kindredship and community I had never known. So I made the reckless decision one day to take six hits of acid, twice what I had ever experienced, and travel down the rabbit hole to look for answers.\n\nI don't need to tell you that this was a terrible idea. I could write books on that acid trip. It was so beyond comprehension, reality was so bent, synesthesia was so eminent, and my ability to comprehend even my own thoughts was destroyed. While reality melted and reconfigured around me and every understanding of what I was doing vanished, I experienced my first full blown panic attack. I completely lost control, derealized, and for the first time in my life, felt sheer terror. It's not a good thing when you feel terror on a drug that can make anything seem real. I only wish that it had left me merely terrified. \n\nBefore I knew it, I felt that I had made a terrible mistake and succumbed to a crippling sense of shame that brought me to my knees. The same kind of shame I felt when I didn't turn in homework, got detention, was rejected by a girl I liked (it had happened a lot), and was refused an animal cracker for my shitty spelling when I was seven. Only, it was amplified to such cosmic levels of shame that must be reserved for the likes of Judas. The experience left me in tatters. I still (STILL!) didn't understand what had happened even after I came down a couple hours later. I thought, \"so that's what a bad trip is like. I'll do less next time.\" Sigh.\n\nI spoke to many people about the experience. No one could help. No one had insight. No one understood just how traumatic the numbness of a true panic attack feels when it grips you by the spine with its icy fingers. I couldn't stop thinking about it, almost masochistic in my attempts to reconstruct what happened on that trip and make sense of it, determiend never to feel that way I did when I first felt the cortisol and adrenaline dump into my bloodstream all at once. But for the time being, I felt safe as long as I wasn't on any sort of drug.\nI wrote down what insights I could glean from the experience and tried to move on. But less than a year later, I was hired at a job that proved to be incredibly toxic. A friend of a friend needed someone with marketing experience to help their car dealership move into the 21st century, and I needed the money, so I took it. \n\nEverything you think is true about car dealerships most likely is. I was dropped into a shark tank of coked up used car dealers and a boss who thought he was John Gotti. He actually got off to making grown men cry in his office and preferred to rule by fear. He would at one point cut salaries and fire a few employees so he could purchase a $300,000 Bentley, by the way. I've worked many jobs in my life and enjoyed most of them. I cannot overstate how terrible this place was.\n\nAnyway, they tend to hire people with similar skillsets so they always have an option to cut dead weight. This creates an environment of extreme distrust as everyone always feels like their job is constantly on the line. My stress grew so bad, that I was pushed to the brink. One day, during a fiery company meeting where the boss was shouting in people's faces, I went over the edge. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I developed a panic disorder after a drug trip gone wrong. Over a year later, I think I am fully healed. Here is my story.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2553bf/i_developed_a_panic_disorder_after_a_drug_trip/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1399732238,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/257irc/my_7_year_old_young_son_just_described_feelings/",
            "gilded": 0,
            "id": "257irc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/257irc/my_7_year_old_young_son_just_described_feelings/",
            "retrieved_on": 1441543120,
            "score": 70,
            "secure_media_embed": {},
            "selftext": "My 7 year old said to me this evening, \"Mummy, are you a robot?\" I said \"No honey, what do you mean? Do you feel like I'm a robot?\" \"Yes mum, sometimes I think this whole house [our family] is just robots, and you're not real.\" I asked him how he felt when he was thinking these things, and he said it feels scary...I tried to sound very warm and reassuring, saying that we are very much real, and I understand that it would feel strange to have those thoughts. I gave him a nice hug, but also tried not place a huge emphasis on talking about it, because I thought it might serve to somehow 'escalate it' in his mind (I'm not sure if I'm explaining myself very well, it's late here)\n\nI've tried so hard to keep my anxious behaviours concealed from my children, but I think I have possibly failed :( My son in particular seems overly concerned about death and the loss of loved ones, he brings these topics up with reasonable frequency. Should I still take a 'wait and see' approach, and try to teach him skills to deal with these feelings in a casual way? Am I overreacting, and seeing the worst because I expect to? Should I seek professional help for him, before these patterns of thought become a part of who he is (he is so young now, and professional intervention could be more effective at an earlier stage). I am also concerned about talking to professionals, because I don't want to 'pathologise' a tender young child without reason :( Please, any advice would be great. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My 7 year old young son just described feelings of derealisation to me, I'm worried he will be really anxious for life like me :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/257irc/my_7_year_old_young_son_just_described_feelings/"
        },
        {
            "author": "sam-i-am1111",
            "author_created_utc": 1333912143,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7e7au",
            "created_utc": 1399616289,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/253ybx/i_did_it/",
            "gilded": 0,
            "id": "253ybx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/253ybx/i_did_it/",
            "retrieved_on": 1441544846,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "After talking and getting support from you guys, today I finally worked up the courage to go running outside! I'm so excited and proud of myself! I've been trying to train for a 5k and running outside is a pretty essential part of the training, but I've been putting it off all week and only doing strength training because I was afraid to run outside due to my anxiety. But today I finally did it :) and I ran almost 3 miles! (Not straight. Could you imagine? I wouldn't even need to train)\n\nThank you guys so much for your support and advice :) it's really helped me",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I did it! :)",
            "url": "http://www.reddit.com/r/Anxiety/comments/253ybx/i_did_it/"
        },
        {
            "author": "Kristinl1281",
            "author_created_utc": 1399060887,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_geh8l",
            "created_utc": 1400024325,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25hriv/i_did_it_i_got_through_it/",
            "gilded": 0,
            "id": "25hriv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25hriv/i_did_it_i_got_through_it/",
            "retrieved_on": 1441538280,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "I know we always get through panic attacks, but I've had to go to the hospital 2x in the last 2 months, I've had to have my husband come home. But not this time! I did it! Alone! And it was a pretty vicious one, lasted almost 2 hours. My main physical symptom is shortness of breath, so I convince myself I'm suffocating. But I didn't, obviously. I GOT THROUGH IT! More importantly I don't feel down on myself or \"crazy\" right now like I usually do afterwards, I feel stronger. I know this isn't a question I just wanted to put this out there into the world of people who understand me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I did it! I got through it!",
            "url": "http://www.reddit.com/r/Anxiety/comments/25hriv/i_did_it_i_got_through_it/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1400088044,
            "domain": "self.Anxiety",
            "edited": 1400125725,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25jwan/anyone_else_dealing_with_panicanxiety_without/",
            "gilded": 0,
            "id": "25jwan",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25jwan/anyone_else_dealing_with_panicanxiety_without/",
            "retrieved_on": 1441537285,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "Hi everyone I’m new to this subreddit as lately I have been having some panic and anxiety issues.  I’ve had panic attacks in the past and lots of anxiety.  Panic attacks saved my life in a way because I started getting them when I was on the verge of falling into some serious drug and alcohol addiction, the panic forced me to get treatment and get sober.  Been clean for 2 years now with a few relapses on the way but nothing serious.\n\nLately my anxiety and panic have been acting up, I have a substance use therapist that helps a lot and am in the process of getting a dedicated anxiety therapist but I don’t want to go on medication.  I don’t feel like I am in bad enough of a place to be medicated and I don’t want to deal with side effects and things.  As well, with my history of drug use the idea of drugging myself is off putting.\n\nI’m just looking for others that have gone the med free route like me and share struggles and tips.  Personally I am working on not letting the fear control me, not fighting it, but inviting it in and going about my day.  As well I am trying to change my negative thinking, I tend to focus on the negatives with everything and I feel this is the source of my anxiety.  Add in the fact that I’m moving in with my girlfriend at the end of the month, I failed getting my dream job, my books not selling, and regular money worries and job worries and I have the recipe for a delicious anxiety soup.\n\nSo yeah, positive thinking, stop trying to control the anxiety and started working out again, cut caffeine and eating right.  It all helps but it’s been a slow process.\n\nLet me know what you do to deal with anxiety and panic med free \n\nThanks everyone.\n\nEDIT: Thank you all so much.  You are an amazing community and wonderful beautiful people.  You have all helped immensely.  Thank you :)\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anyone else dealing with panic/anxiety without medication?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25jwan/anyone_else_dealing_with_panicanxiety_without/"
        },
        {
            "author": "rustybricks",
            "author_created_utc": 1366715150,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bfd7v",
            "created_utc": 1400058094,
            "domain": "soundcloud.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25iw4j/i_suffer_from_crippling_anxiety_and_im_a_musician/",
            "gilded": 0,
            "id": "25iw4j",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "CHESTERAU",
                    "author_url": "http://soundcloud.com/chesterau",
                    "description": "Listen to CHESTERAU | Explore the largest community of artists, bands, podcasters and creators of music &amp; audio.",
                    "height": 500,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F24449553%26show_artwork%3Dtrue&amp;url=http%3A%2F%2Fsoundcloud.com%2Fchesterau&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000071507934-1fhc2m-t500x500.jpg%3F30a2558&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "SoundCloud",
                    "provider_url": "http://soundcloud.com",
                    "thumbnail_height": 500,
                    "thumbnail_url": "http://i1.sndcdn.com/avatars-000071507934-1fhc2m-t500x500.jpg?30a2558",
                    "thumbnail_width": 500,
                    "title": "CHESTERAU",
                    "type": "rich",
                    "version": "1.0",
                    "width": 500
                },
                "type": "soundcloud.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F24449553%26show_artwork%3Dtrue&amp;url=http%3A%2F%2Fsoundcloud.com%2Fchesterau&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000071507934-1fhc2m-t500x500.jpg%3F30a2558&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 500,
                "scrolling": false,
                "width": 500
            },
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25iw4j/i_suffer_from_crippling_anxiety_and_im_a_musician/",
            "retrieved_on": 1441537754,
            "score": 59,
            "secure_media": {
                "oembed": {
                    "author_name": "CHESTERAU",
                    "author_url": "http://soundcloud.com/chesterau",
                    "description": "Listen to CHESTERAU | Explore the largest community of artists, bands, podcasters and creators of music &amp; audio.",
                    "height": 500,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F24449553%26show_artwork%3Dtrue&amp;url=http%3A%2F%2Fsoundcloud.com%2Fchesterau&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000071507934-1fhc2m-t500x500.jpg%3F30a2558&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "SoundCloud",
                    "provider_url": "http://soundcloud.com",
                    "thumbnail_height": 500,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000071507934-1fhc2m-t500x500.jpg%3F30a2558&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 500,
                    "title": "CHESTERAU",
                    "type": "rich",
                    "version": "1.0",
                    "width": 500
                },
                "type": "soundcloud.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F24449553%26show_artwork%3Dtrue&amp;url=http%3A%2F%2Fsoundcloud.com%2Fchesterau&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000071507934-1fhc2m-t500x500.jpg%3F30a2558&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 500,
                "scrolling": false,
                "width": 500
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/2_h9Qs4K4YxyrSLZ.jpg",
            "title": "I suffer from crippling anxiety and I'm a musician, bad mix. I'd love it if you guys could listen to a few of my songs and hopefully take something from it.",
            "url": "https://soundcloud.com/chesterau"
        },
        {
            "author": "inquisitive872",
            "author_created_utc": 1325406767,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6k1mp",
            "created_utc": 1399836436,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25aswm/anybody_find_the_sight_of_clear_water_therapeutic/",
            "gilded": 0,
            "id": "25aswm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25aswm/anybody_find_the_sight_of_clear_water_therapeutic/",
            "retrieved_on": 1441541590,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anybody find the sight of clear water therapeutic?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25aswm/anybody_find_the_sight_of_clear_water_therapeutic/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1400037376,
            "domain": "self.Anxiety",
            "edited": 1400084729,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25ib93/friend_trying_to_convince_me_that_mental_illness/",
            "gilded": 0,
            "id": "25ib93",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25ib93/friend_trying_to_convince_me_that_mental_illness/",
            "retrieved_on": 1441538025,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I'm so fucking pissed off right now and I need to just tell you guys what I just experienced.\n\nI was talking to my friend and somehow the topic of mental illness got brought up. He starts telling me that I *don't* have an illness, that I'm perfectly fine, and that the doctor just fed me a lie. He said, and I quote, \"You were told by a doctor that you have a psychological problem and you believed him, and now it's stuck in your mind that you have a problem\"\n\nHe also said these other things:\n\n\"Everyone has problems and issues brudduh(guess he's trying to make it seem like this is one big joke), it's almost a little selfish to think you're something special\"\n\nThat last one hit me like a fucking ton of bricks. This guy is one of my closest friends and I just went off on him and told him don't talk to me. I feel like crying right now; my anxiety is through the roof and my best friend can't believe me that I have mental illness. I don't know what else to say, I just needed to vent. I hope someone sees this.\n\nEDIT: His username is /u/bfunk15 if you would like to inform him on how mental illness really is.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Friend trying to convince me that mental illness is fake and that the doctor actually is the one who administered me the disorder(yes, he said the disorder, not the diagnosis).",
            "url": "http://www.reddit.com/r/Anxiety/comments/25ib93/friend_trying_to_convince_me_that_mental_illness/"
        },
        {
            "author": "Freittrain86",
            "author_created_utc": 1381198332,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dfdih",
            "created_utc": 1400076877,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25jehi/is_anxiety_causing_me_to_lose_brain_power/",
            "gilded": 0,
            "id": "25jehi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25jehi/is_anxiety_causing_me_to_lose_brain_power/",
            "retrieved_on": 1441537516,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I have been battling with Anxiety and Depression for a few years and i've noticed that with my lack of drive in life I also have a lack of brain power or \"IQ\" it seems.  I can't make coherent sentences when speaking some times.  I don't grasp concepts as easily as i used to. \n\nHas anyone else gone through this? Are there ways i can restore my brain power (i've tried luminosity but it didn't work).\n\nI just feel like i'm getting dumber by the day. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is Anxiety Causing Me To Lose Brain Power?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25jehi/is_anxiety_causing_me_to_lose_brain_power/"
        },
        {
            "author": "MedarReDozan",
            "author_created_utc": 1399510869,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gh2ds",
            "created_utc": 1399511327,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2503ww/weed_triggered_a_downward_spiral_of_anxiety/",
            "gilded": 0,
            "id": "2503ww",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2503ww/weed_triggered_a_downward_spiral_of_anxiety/",
            "retrieved_on": 1441546640,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "Last december I had a particular bad night with weed. I smoked weed for the second time with some friends but ended up having a bad trip, where I threw up twice and felt like utter shit the whole night. Since then, I have been having what feels like non-stop anxiety. I'm not able to relax and I feel like I am always out of breathe. Before then, I felt confident, I could speak loud and clear and was I seeked out eye contact and held it.\n\nHas anybody else experienced this? Does it go away? Thanks.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Weed Triggered a Downward Spiral of Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2503ww/weed_triggered_a_downward_spiral_of_anxiety/"
        },
        {
            "author": "Heterodyne25",
            "author_created_utc": 1393907703,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fjk6z",
            "created_utc": 1399947013,
            "domain": "self.Anxiety",
            "edited": 1399948898,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25exsz/if_benzodiazepines_target_the_same_receptors_as/",
            "gilded": 0,
            "id": "25exsz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25exsz/if_benzodiazepines_target_the_same_receptors_as/",
            "retrieved_on": 1441539599,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "I understand the addiction part, but is there more to this equation?\n\nEDIT: As a follow-up, most information I read suggest that alcohol has a tendency to make anxiety worse.  Based on that idea, wouldn't that mean benzos do similar?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If benzodiazepines target the same receptors as alcohol, why is alcohol frowned upon as a temporary treatment for anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25exsz/if_benzodiazepines_target_the_same_receptors_as/"
        },
        {
            "author": "Freeloaderp",
            "author_created_utc": 1358208949,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a891d",
            "created_utc": 1399923503,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25duwc/sex_overload_with_ssri_im_freaking_out/",
            "gilded": 0,
            "id": "25duwc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25duwc/sex_overload_with_ssri_im_freaking_out/",
            "retrieved_on": 1441540164,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "29/M here. I'm currently on my third day of taking Celexa (citalopram) at 5mg and so far it hasn't been too bad. This is my second SSRI after taking Zoloft (couldn't handle the side-effects after the second day).\n\nFor both of these SSRI's, getting an erection was a little bit longer, but nothing out of the ordinary.\n\nAnyways, Celexa adjusting to my system hasn't been too painful compared to the Zoloft. I feel as if I'm already used to it after just three days... Which is why I was surprised at what happened during sex.\n\nOnce I got fully turned-on/excited, my chest and back of the head starts feeling VERY cold... Almost like a tingly/electric. It's so overwhelming I feel like I'm going into shock. The same thing happened while I was taking Zoloft as well.\n\nIt's sort of like this: the Celexa/Zoloft was trying to prevent me from getting horny (like a shield), but once I got fully aroused, I \"broke\" the shield (with my dopamine levels?) and the cold feeling in my chest and head started overflowing.\n\n(Edit): Now that I think about it, it might have been a panic attack. \n\nWhat's going on? This never happened when I was not on SSRI's. Many SSRI users complain about arousal issues, but my problem is that I can't continue because I feel like I'm about to die of a heart attack.\n\nI can't blame Celexa because this happened with Zoloft too. It's as if I'm unable to become excited or horny unless I want another panic attack. I also have a strong feeling that if I were to have working out at the gym (in lieu of having sexy time), I would have had the same symptoms! \n\nThoughts?\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sex overload with SSRI. I'm freaking out.",
            "url": "http://www.reddit.com/r/Anxiety/comments/25duwc/sex_overload_with_ssri_im_freaking_out/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1399495141,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/24zdl7/horrible_reaction_to_ssricitalopram_doc_wants_me/",
            "gilded": 0,
            "id": "24zdl7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/24zdl7/horrible_reaction_to_ssricitalopram_doc_wants_me/",
            "retrieved_on": 1441547043,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I just recently saw a psychiatrist for long-term anxiety and depression(I believe caused by the anxiety) which has turned into panic attacks lately. He said if he had to give me an initial diagnosis it would probably be generalized anxiety disorder, mild social anxiety and depression which he also believes is caused by the anxiety. He put me on a starter dose of 10mg/day of citalopram/celexa for 10 days and then bumping up to 20mg after that. I've never taken any psychiatric drugs before(other than to calm me down before surgeries) and have only taken one half dose of the citalopram. I also got a referral to a therapist that specializes in CBT at my request, I really want to finally address my problems and do everything I can to fix them.\n\nI was prescribed this because it's supposed to be a well-tolerated drug, and was instructed to take it before bed due to it's sedative properties and I experienced the exact opposite. I got the prescription after work and took it when I got home and tried to get to sleep. I work nights, and saw the doctor in the day and then went to work a few hours later on about four hours of sleep. I did my 12 hours and tried to sleep after taking the medication and I wasn't able to get to sleep for several hours. When I did I had a nightmare maybe a half hour later and woke up feeling absolutely terrible, I've never felt anything close to this ever before. I was extremely angry(almost feeling violent, very uncharacteristic of me), feeling very confused, dizzy, grinding my teeth, sweating, nauseous(I threw up later), I wasn't cold but I was shaking like I was shivering, had some muscle twitches, dilated pupils, headache, and sweating that came and went.\n\nI called the doctor's office to explain my symptoms, and a nurse called me back telling me to just take it in the daytime. I told her I really didn't even want to take it again, and I would have to call in sick for work because I didn't feel safe driving or operating machinery(I work in heavy industry around molten metal) and would be unable to function at all. She said she'd talk to the doctor, I didn't hear back the rest of the day.\n\nThis morning I got a call back and was again told to take it in the daytime, I explained there was no way I would take it again after such a bad reaction. She asked if I would be willing to try another medication, I told her possibly, but I was very leery after what had happened.\n\nShe called back after talking to the doctor, and I got an extremely patronizing attitude. She told me how proud the doctor was of me to be willing to consider trying another medication and how happy they were for me for seeking treatment. I was still very irrationally angry and it took a lot not to just berate her, I hate being talked down to. She said he wants me to try another SSRI, this time peroxetine/paxil again at a half dose so I don't have another bad reaction. I voiced my concerns that this was another SSRI, and I already had a bad reaction to a half dose. She asked if I wanted them to fax it into the pharmacy and I told her to go ahead but that I wasn't sure if I would get it filled.\n\nI really don't want to have another bad reaction and am very reluctant to try another SSRI. I've never felt so horrible in my entire life and the anger I felt honestly scared the shit out of me. I'm genuinely worried I might blow up if somebody even looks at me the wrong way. I'm still feeling the side effects from the citalopram which I took yesterday morning, I'm starting to calm down a little finally. I just want to be able to sleep and feel normal again. I seriously considered going to the ER to get some emergency anxiety medication so I can calm down and sleep. I've had valium and xanax once each before for some minor surgeries and they calmed me right down. \n\nSince I've been unable to sleep I've been looking into reactions like I've had that others have had with SSRIs. I've read in more than a few places that when people have reactions like this to more than one SSRI they often assume you have bipolar disorder and treat you accordingly. I've seen bipolar disorder before and know for a fact I don't have it, and don't want to be given even more medication that will fuck me up even worse. \n\nAnyway, I'm not sure what to do now and am just looking for some input. I'm sure a lot of you have tried multiple drugs and wanted to get some opinions on it. This medication and treatment thing is all very new to me. Sorry if this is long, disjointed or rambling, I'm still not feeling very well. Thanks in advance for anything you can say either way. I'll also be posting this in the depression sub, I think this could fit in both and I'd like to get as many opinions as I can.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Horrible reaction to SSRI(citalopram), doc wants me to take another.",
            "url": "http://www.reddit.com/r/Anxiety/comments/24zdl7/horrible_reaction_to_ssricitalopram_doc_wants_me/"
        },
        {
            "author": "chili_cheese_dogg",
            "author_created_utc": 1392067313,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f7p2q",
            "created_utc": 1400089425,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25jynd/sweating_heavy_armpit_sweaters_how_do_you/",
            "gilded": 0,
            "id": "25jynd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25jynd/sweating_heavy_armpit_sweaters_how_do_you/",
            "retrieved_on": 1441537255,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "It gets so bad fo rme that I can sweat through 2 shirts and jacket.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sweating? Heavy armpit sweaters, how do you control/handle it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25jynd/sweating_heavy_armpit_sweaters_how_do_you/"
        },
        {
            "author": "katierpillars",
            "author_created_utc": 1394794861,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_foy7g",
            "created_utc": 1399818915,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25a4y6/i_went_to_a_concert/",
            "gilded": 0,
            "id": "25a4y6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25a4y6/i_went_to_a_concert/",
            "retrieved_on": 1441541900,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I'm so proud of myself :D 18 months ago I could never have dreamed of being able to handle it. I was having too much fun to even care about anxiety! You guys CAN do it. Whenever I read other people saying that I always thought 'yeah right, not me!'. It's been a long road of recovery but I'm really getting there and you can too!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I went to a concert!",
            "url": "http://www.reddit.com/r/Anxiety/comments/25a4y6/i_went_to_a_concert/"
        },
        {
            "author": "Slapthewall",
            "author_created_utc": 1377989497,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cyqvy",
            "created_utc": 1399560332,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/251lxo/found_out_my_source_of_anxiety/",
            "gilded": 0,
            "id": "251lxo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/251lxo/found_out_my_source_of_anxiety/",
            "retrieved_on": 1441545938,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "Hello everyone, \n\nI found out my source of anxiety this morning. This may or may not help you but I really hope it does. Anyway so my problem comes from trying to control, and the idea of losing control or not being in control causes me a ton of anxiety. I have to learn to simply surrender and not be in control. This article is very helpful right here and I urge you to read it if you feel you have problems with control. \n\nhttp://tinybuddha.com/blog/let-go-of-control-how-to-learn-the-art-of-surrender/\n\nNow, for me specifically I have quite a problem. I just have the idea that I am inferior to everyone. I've worked on this with my psychologist and he taught me otherwise. Now what I had to do is sort of practice replacing the old idea that I was inferior that I've had for like most of my life with the new idea that I'm average. The thing is though this has caused me unbearable amounts of anxiety. Why? Because I tried to control my feelings. I tried to make sure I wouldn't be depressed again by continuously repeating that new idea in my head. It was very stressful and I've always been like this. I've always tried to hide the insecurity in me of being inferior by using things like: beating friends in video games, doing very well in school, etc. But none of it actually worked and just caused me so much anxiety. I know now what I have to do but it feels like trying to control how I feel causes me so much anxiety that I just want to surrender to the feeling of inferiority. (Which by the way, came from the idea that people with Learning Disabilities are inferior, therefore I am inferior because I have one. He corrected it by telling me people with LDs are average like everyone else they are just characterized by having a high strength in one area and low one in another and they're not to be confused with developmental disabilities.) \n\nSo my question to everyone is: How can I sort of just let go and stop trying to control my feelings? It feels like trying to change my automatic thoughts was an even bigger push to trying to control my feelings. How can I just accept it that I feel inferior and not try so hard to control it but instead work on it progressively? \n\nThanks! \n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Found out my source of anxiety!",
            "url": "http://www.reddit.com/r/Anxiety/comments/251lxo/found_out_my_source_of_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1399493669,
            "domain": "self.Anxiety",
            "edited": 1399528718,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/24zaz0/to_the_people_who_stare/",
            "gilded": 0,
            "id": "24zaz0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/24zaz0/to_the_people_who_stare/",
            "retrieved_on": 1441547077,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "This is an open letter to all the people who stare at me when I'm having a panic attack, or tease me, mock me, tell me to stop faking, etc.\n\nTo the people who stare.\nFirst off, screw you. \nSecond, this isn't fun. It's painful.\nThird, call me an attention whore one more time, I dare you. You say you know I'm faking? I say you must have a PhD, would you like to show me credentials from your alma mater? \nFourth, it is \"that bad.\" The tears streaming from my eyes and shrieking hyperventilation are not my decision, nor is it yours as to whether or not this hurts.\nFifth, I know it's loud. I'm trying to stop it, and telling me to shut up does not help.\nSixth, I offend you with my panic? I'm sorry, I didn't realize I was shutting down all of YOUR rational brain function, turning YOUR stomach inside out, rolling YOUR eyes back in your head, stabbing YOUR head with sharp, sudden pains, tensing every muscle in YOUR body, stopping YOU from breathing, or pulling tears from from your eyes with the tiny anchors of my own malevolence towards your comfort. If it offends you that much, walk away. I don't need you.\nSeventh, I am not pathetic. You are. My brain may have a few short circuits, but at least it's not so impaired as to think I'm important enough to judge someone else's issues, and tell them how to fix it.\nEighth, I'm not perfect. I don't need you to tell me that. I'm doing the best I can.\nNinth, I will go farther than you. Panic disorder is a living hell, and it has forged me in fire day in, and day out. I've had this since I was two, honey boo, you are nothing new.\nTenth, next time you get hurt or scared, maybe you'll understand. This is how my brain is wired, and I know it's strange.\nEleventh, learn from me instead of judging. If you can learn to see the person I am through my panic, you can do a lot of things. I know it's tough to look past sometimes, maybe even a lot of times, but please, take me as an opportunity to see that there is always far more than meets the eye.\nTwelfth, thank you for reading. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "To The People Who Stare",
            "url": "http://www.reddit.com/r/Anxiety/comments/24zaz0/to_the_people_who_stare/"
        },
        {
            "author": "heynikki",
            "author_created_utc": 1373789468,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cdest",
            "created_utc": 1400089426,
            "domain": "self.Anxiety",
            "edited": 1400115804,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25jynh/redditors_who_have_been_on_sertraline_how_was_it/",
            "gilded": 0,
            "id": "25jynh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 57,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25jynh/redditors_who_have_been_on_sertraline_how_was_it/",
            "retrieved_on": 1441537255,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Just got prescribed to sertraline today. Tell me about your experience.\nEDIT: just took my first pill. No bad side effects yet! Thanks to everyone who shared! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Redditors who have been on sertraline, how was it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/25jynh/redditors_who_have_been_on_sertraline_how_was_it/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1399999463,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25glju/the_difference_between_the_people_who_think_that/",
            "gilded": 0,
            "id": "25glju",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25glju/the_difference_between_the_people_who_think_that/",
            "retrieved_on": 1441538824,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I am a sixteen year old female struggling with panic disorder and chronic anxiety. I managed in silence for my whole life with these attacks, and until two months ago, I never told anyone. Not my friends, nor my parents and family. The only person who knew was my SO; let's call him \"G.\"\n  G was the most supportive understanding person that I had had the pleasure to know. He got it, he understood what I was going through and helped through multiple attacks.\n  One night, about 3 or so months ago, I was on the phone with G and I had a severe panic attack that I probably should have gotten brought to the hospital, G ended up with him telling his mom about everything, and I was okay with that. Soon after, I was urged to get therapy. That was a problem. That meant I had to tell my parents.\n  Now, I love my parents, but they are very different from me; in the way they think, their values, and opinions. Quite frankly, I find them to be extremely hypocritical people, as my mother detests her mom for the exact same thing. \n  So one night, I approach them, and I tell them everything. I would have expected them to be understanding and supportive, but that's not exactly what happened. They didn't want to take me to therapy or the doctor. It took a lot of talking and stress before they finally agreed, and I got an appointment. I am now in therapy and taking a daily SSRI.\n  Now skip forward to this past weekend. I had the worst panic attack I had ever experienced, I accidentally woke up my parents and my mom came in to find me cover in tear and my knee covered in my own blood from me gouging out the skin with my fingernails. I initially thought that she would try to comfort me or something, but no. She stood in my room, with her arms crossed, starring me down. She told me to calm down, but in such away that it just made me panic more. After eventually I calmed down, she looked at me and the gist of what she told me was that I was selfish and not thinking of anyone bit myself during these attacks. I was and still am shocked. She told me that she had always had panic attacks and that I Had no reason to be upset. I know that she has never had a panic attack, even if she thinks that she had. I know because if she had had one, she would have known that she was only making the attack worse. I hate her for this. I know that it is a terrible thing to say, but unfortunately it's true. She has this delusion that she gets it, but she doesn't. She is just switching around the situation to make herself the victim, like she always does.\n  Now I bring you to yesterday. G does martial arts, and it helped him enormously when he was going through a hard time, so I went to his class. I had been anxious from the moment that I decided to do it. He comforted me and promised me that everything would be fine, and that it would help.\n  We get to the studio and I am shaking uncontrollably and hyperventilating. We walk inside, and though I had been to the studio to watch a class before, it was everything was surreal; nothing looked right to me and I was dizzy. I turned and started to walk back outside, it was too much. G stopped me and held my hand as and I slowly turned and walk back into the waiting area of the studio. I was greeted by a female instructor who worked at the studio who I had met once before, we'll call her S. S could immediately tell that I wasn't doing well. I was now really beginning to have a full on attack, but she came right up next to me and told me that everything would be fine and smiled. She told me that she would get me a gi so that I would feel less out of place and more comfortable. I remember that I just kept apologizing, but she told that it was completely okay and to not be sorry; that that was what she was there for. She had at this point calmed me down significantly, and we entered the class together and she taught me the respect traditions (eg. Bowing) and S, G, and I were in a line in the back of the studio. \n  I eventually did calm down almost completely and was beginning to really enjoy the class. By the end, I was positive that I wanted to come back. \n  On the way home with G, one realization hit me: and almost complete stranger to me was able to calm me down and prevent a panic attack, when my own mother only made it worse and told me that I was selfish and that it was my own fault. \n  I supposed that that is the real difference between someone who thinks that they understand someone with anxiety or panic, and someone who actually does.\n\n\nTL; DR:\n \n Nearly stranger martial arts instructor calms panic stricken teen, when her own mother couldn't and simply guilted the teen.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The difference between the people who think that they get it, and the ones who actually do. [Long, but my first post and a huge step for me]",
            "url": "http://www.reddit.com/r/Anxiety/comments/25glju/the_difference_between_the_people_who_think_that/"
        },
        {
            "author": "TheTriangleMan",
            "author_created_utc": 1349393572,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_97mh3",
            "created_utc": 1399936755,
            "domain": "rain.nxe7.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/25ehv1/relaxing_just_put_this_on_and_close_your_eyes/",
            "gilded": 0,
            "id": "25ehv1",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/25ehv1/relaxing_just_put_this_on_and_close_your_eyes/",
            "retrieved_on": 1441539867,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/DlF95eQEfrAmlVt7.jpg",
            "title": "[Relaxing] Just put this on and close your eyes, everything is going to be ok.",
            "url": "http://rain.nxe7.com/"
        }
    ]
}