{
    "data": [
        {
            "author": "IanGecko",
            "author_created_utc": 1409154857,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety+Depression",
            "author_fullname": "t2_i2rjj",
            "created_utc": 1415659489,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lwlv1/im_in_the_hospital_for_wanting_to_die_please_wish/",
            "gilded": 0,
            "id": "2lwlv1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lwlv1/im_in_the_hospital_for_wanting_to_die_please_wish/",
            "retrieved_on": 1441077517,
            "score": 132,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm in the hospital for wanting to die. Please wish me well.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lwlv1/im_in_the_hospital_for_wanting_to_die_please_wish/"
        },
        {
            "author": "TheWhiteNoise1",
            "author_created_utc": 1306261472,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5a4ct",
            "created_utc": 1415574888,
            "domain": "self.Anxiety",
            "edited": 1415655434,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lszyb/well_i_just_broke_down_in_a_walmart/",
            "gilded": 0,
            "id": "2lszyb",
            "is_self": true,
            "media_embed": {},
            "num_comments": 35,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lszyb/well_i_just_broke_down_in_a_walmart/",
            "retrieved_on": 1441079261,
            "score": 123,
            "secure_media_embed": {},
            "selftext": "The amount of people there was overwhelming. My debit card has been lost and I've been waiting to get it back so until then I've been using checks. But this time my check wouldn't go for some reason and I couldn't get any cash back. So I ask my mom to do a moneygram and I'll pay her back.\n\nI was getting more and more agitated as I waited, eagerly avoiding any eye contact from strangers. Than I see a sign that says no money orders and I freak out thinking this means I can't get my money. I'm about to cry\n\nThen I get up and am told that doesn't apply to moneygrams so I say thank you I almost just had the worst day. And then she informs me it still might be bad because my mom or the clerk didn't type in my name right. the state abbrev was put before my name and the clerk on my side told me she couldn't give me the money.\n\nI desperately pleaded \"but you know it's meant for me\" and then I stepped away, fell down against a wall, grabbed my knees and began crying.\n\nI've never done that in public before. I was all alone. I hated it.... :( I'm crying now just typing this.\n\nEventually the woman told me to pull my self together and went to her boss and I got the money. But even after I cried to release stress.\n\nUsually I smoke weed after this thing but I quit so I figure the healthy thing to do is come here and vent... I need a hug.\n\n\nEDIT: Thank you for the hugs and comments and in general a reminder why I come here. Thank you for the support. It means more than I can possibly say. You're good people and I hope to be there for you on here should you ever need it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Well I just broke down in a Walmart",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lszyb/well_i_just_broke_down_in_a_walmart/"
        },
        {
            "author": "ieatcupcake",
            "author_created_utc": 1302108768,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_52f2h",
            "created_utc": 1415637662,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lvdqw/my_journey_through_anxiety_and_how_futurama/",
            "gilded": 0,
            "id": "2lvdqw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lvdqw/my_journey_through_anxiety_and_how_futurama/",
            "retrieved_on": 1441078088,
            "score": 116,
            "secure_media_embed": {},
            "selftext": "Last year I went through some major life changes and was dealing with incredible amounts of stress.\n\nI suffered from severe anxiety most nights. I’d wake up in the middle of the night and be up the rest of the evening vomiting, shaking, and full of adrenaline. The harder I tried to fall asleep the more anxious I felt. I started to just accept that I would not be able to sleep anymore that night and stay up.\n\nI couldn’t think of the stresses in my life because it would encourage the anxiety. I needed to find ways to keep my thoughts busy and hope to finally fall back asleep.\n\nThat’s when I started marathoning Futurama at night. I had always loved the series, but now it brought positivity and comedy into my bed when I had been surrounded by crushing stress. I would fall asleep to Futurama every time I had an attack. I’ve probably seen every episode on average, 6 or more times.\n\nI have since gone to therapy, found ways to manage my stress, and have a better hold on my life. I went from anxiety 3-4 times a week, to an attack once every few months. And when those feelings creep up on me, I turn on Netflix and start streaming my Futurama. It’s my comfort blanket. \n\nSo this is a big thank you to the makers for creating a series full of lovable characters, hilarious plots, and a beautiful ending, all of which have brought me peace of mind when I needed it most.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My journey through anxiety and how Futurama helped me cope.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lvdqw/my_journey_through_anxiety_and_how_futurama/"
        },
        {
            "author": "itsalmostoverr",
            "author_created_utc": 1403339205,
            "author_flair_css_class": "",
            "author_flair_text": "22/M [college student]",
            "author_fullname": "t2_h2j7h",
            "created_utc": 1415497586,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lq55v/i_like_to_be_alone_i_like_to_eat_alone_study/",
            "gilded": 0,
            "id": "2lq55v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 68,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lq55v/i_like_to_be_alone_i_like_to_eat_alone_study/",
            "retrieved_on": 1441080593,
            "score": 97,
            "secure_media_embed": {},
            "selftext": "I dont even mind it. My parents act sad for me, but I dont even mind being alone at all. Everything is much more enjoyable for me when I am by myself. In fact, I don't even want to get married. Not only because I am sure my anxiety will drive her nuts, but also because I would much rather spend my life doing things I like alone. \n\nAnyone else feel the same way?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I like to be alone. I like to eat alone, study alone, go on drives alone, spend any free time alone. Are there others?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lq55v/i_like_to_be_alone_i_like_to_eat_alone_study/"
        },
        {
            "author": "Sheehan7",
            "author_created_utc": 1363139318,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_axa07",
            "created_utc": 1415901562,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m777z/i_was_terrified_of_driving_but_its_the_most_fun/",
            "gilded": 0,
            "id": "2m777z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m777z/i_was_terrified_of_driving_but_its_the_most_fun/",
            "retrieved_on": 1441072573,
            "score": 88,
            "secure_media_embed": {},
            "selftext": "My anxiety toward driving was terrible. What if I have a panic attack? What if I get to close to the other side of the traffic or the parked cars and knock my mirror off? (That was my biggest fear) What if blah blah blah all these what if scenarios kept me from driving for 2 years (got my permit when I was 16 now 18). I have been doing things to improve my overall well being lately and I knew one of them was I need to drive especially because it is so convenient. So I did my dad took me right on the road, not even a driving instructor first. It was a little scary for like 30 seconds and then it was fun! I have only driven a handful of times in all conditions like dark and on the highway and I really wasn't nervous at all. I quote enjoy driving and I find actually most of my stress and anxiety goes out the window. \n\nThe point is I know what it feels like to be anxious against driving, I was for years but it will be ok. No one says you have to get your license right at the legal age, sometimes you arent ready like I was but the time shall come amd you will be fine!\n\nI hope this helps someone because these types of posts always help me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I was terrified of driving, but its the most fun and relaxing thing I have ever done!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m777z/i_was_terrified_of_driving_but_its_the_most_fun/"
        },
        {
            "author": "jd22200",
            "author_created_utc": 1343088785,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8fgz9",
            "created_utc": 1415721607,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lz3l2/my_mom_passed_away_friday_im_having_trouble/",
            "gilded": 0,
            "id": "2lz3l2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lz3l2/my_mom_passed_away_friday_im_having_trouble/",
            "retrieved_on": 1441076354,
            "score": 75,
            "secure_media_embed": {},
            "selftext": "Quick background, I have had issues with depression and anxiety my whole life. Recently I had been having some trouble getting my prescriptions right and in typical fashion for me I (slowly) took myself off of Lexipro without going to the doctor to get something else. The reasons behind this have more to do with avoiding what I need to do and not because I think I'll be fine without it. I still take a very small dose of Klonopin in the morning and at night. \n\nSo anyway, I got a call Friday morning that ended in me running to my Mom's and finding her dead on the floor next to her bed. They believe she had been gone since the night before. This is obviously traumatic regardless but I am also uncomfortable with death and dead people in general to the point of it being a lot like a phobia. I very nearly had to be sedated that day but wasn't. Btw, I am 46(F) and my mother was 68 and not in great physical condition but I wasn't expecting this. I called my best friend first and was immediately surrounded by wonderful, supportive people without having to do anything else that day.\n\nHere's my question, I understand that I am likely still in shock and it's very early for me to try to fix my mental state but the weird part is I don't understand what it is. I am so hyper and all over the place emotionally. It isn't just general sadness or anxiety. I can't sleep, not because I'm sad or worried but I just feel wide awake. I can't help but feel like I'm always talking really loud and fast. I am in overdrive as far as getting things done but I always feel confused. I have the shakes in a way that I don't usually, it feels like my insides are vibrating.\n\nI'm sorry this is long but I'm looking for some kind of word to explain what this is. It isn't anything I've experienced before. This rambling crazy post is a good example of what's going on in my head. If anyone can offer an explanation that is something I can tell my doctor  even that would be really helpful.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My Mom passed away Friday, I'm having trouble figuring out my state of mind. Sorry it's long.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lz3l2/my_mom_passed_away_friday_im_having_trouble/"
        },
        {
            "author": "AutopsiedDream",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415615107,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lujsm/ive_stopped_going_to_classes_or_caring_about_my/",
            "gilded": 0,
            "id": "2lujsm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lujsm/ive_stopped_going_to_classes_or_caring_about_my/",
            "retrieved_on": 1441078477,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "19/Female/Spain here, and this is the last chance I have to complete this year of my studies (2nd of Bach). I can't repeat it anymore, I need to do everything NOW. It is making me insane... and sick.\n\nTwo weeks ago I started feeling way too overwhelmed. I studied and worked as much as I could, and I was doing fine... but I don't even know what I want to do after this and I felt like shit after finishing homework because I don't have anything. No friends, no love, no interests because of depression... so I just ended up there, crying, thinking: \"why do I even do this\".\n\nAs time passed, I started to feel worse and worse. I couldn't stand going to classes, hearing about all the work we would have to do and about that future that seemed incredibly... cruel to me. I just wanted to stay home and do nothing... it hurt too much.\n\nSo, after having some breakdowns in the middle of classes and having to go to the bathroom for the whole hour so I could cry... I stopped going. \n\n2 weeks without going to classes by now. I don't know if I missed something important because I don't have contact with anyone (they all think I am retarded, so they wouldn't give me their numbers to call them in case I missed classes). I may have missed exams... important proyects... everything. I feel like shit.\n\nBut I also... don't feel that badly now.\n\nI do nothing, I feel nothing. I am avoiding reallity and it doesn't hurt that much when I do. I cry sometimes because I feel regret, though... I can't stop repeating to myself that I will destroy everything I fought for if I continue like this...\n\n...but I am ok. \n\nNo, I am not ok. I am wasting my life. I don't know how to live with this anxiety, but if I start not caring... I end up without a life. \n\nWhat am I supposed to do. I don't have strenght. I don't want to start crying in classes... because I can't go to the bathroom in all of them... they're going to see me cry... I don't want to... I am so scared.... ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've stopped going to classes or caring about my studies because of anxiety and it's going to cost me my future.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lujsm/ive_stopped_going_to_classes_or_caring_about_my/"
        },
        {
            "author": "RaghibAhmed",
            "author_created_utc": 1356345259,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9zlwk",
            "created_utc": 1415478293,
            "domain": "spring.org.uk",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lp9uf/advice_reminding_yourself_of_being_loved_and/",
            "gilded": 0,
            "id": "2lp9uf",
            "is_self": false,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lp9uf/advice_reminding_yourself_of_being_loved_and/",
            "retrieved_on": 1441080999,
            "score": 60,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/SLxordt0tvkjd-6r9K1OAYhY9Keyc5j3xhE0tkluUcE.jpg",
            "title": "[Advice] Reminding yourself of being loved and cared for can quickly reduce anxiety when you feel threatened.",
            "url": "http://www.spring.org.uk/2014/11/how-to-quickly-reduce-anxiety-created-by-threatening-situations.php?utm_source=PsyBlog&amp;utm_medium=email&amp;utm_campaign=704e4b74d0-RSS_EMAIL_CAMPAIGN_MAILCHIMP&amp;utm_term=0_10ef814328-704e4b74d0-213826253&amp;omhide=true"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415800952,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m2mbw/so_long_dont_ever_feed_the_anxiety_troll_in_your/",
            "gilded": 0,
            "id": "2m2mbw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m2mbw/so_long_dont_ever_feed_the_anxiety_troll_in_your/",
            "retrieved_on": 1441074710,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "I'll be leaving Reddit now, as I feel it's not a healthy thing for me to spend hours a day talking about anxiety. I joined for a brief time just to share what has worked for me all these years. My ultimate message is to take charge of your life, and don't let anxiety do it. Do everything you possibly can to put your mind on creative and intellectual pursuits that challenge and fulfill you and that take up a lot of your free time. Remember that anxiety is just a sensation and that it has no power. Remember that the past has no power over the present. Remember that your thoughts aren't real, \"what is\" or \"the present reality\" that you you see is. Know the difference. Don't ever feed your anxiety, which means don't make it your focus, ever. Make other things your focus. Good luck, you all can make progress, if my brain could rewire itself (neuroplasticity), yours can as well. It just needs new challenges to do so. Thanks for the opportunity to share. Love y'all.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So Long, Don't Ever Feed The Anxiety Troll In Your Head",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m2mbw/so_long_dont_ever_feed_the_anxiety_troll_in_your/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415715832,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lyton/the_practice_of_staying_with_current_reality/",
            "gilded": 0,
            "id": "2lyton",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lyton/the_practice_of_staying_with_current_reality/",
            "retrieved_on": 1441076482,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "One of the best things I've learned that has contributed to creating an anxiety free state or as a tool for working through a temporary bout of panic is the practice of staying with current reality, a.k.a the present, or \"what-is.\" There is \"what-is\" and then there are the movies and perceptions that play in your mind. Those of us experiencing anxiety are usually immersed in some form of thinking (past, future) or have a certain perception that kicks in that triggers the flight-fight part of the brain, that then gets the adrenals pumping, which causes the feeling of anxiety. Along with involving my mind with creative pursuits that fully interest and challenge my mind for many hours a day, I practice stopping for a few minutes to an hour and describing what is actually happening in my world. I look at the colors, hear the sounds, taste the tastes, etc. Look at faces, what people are wearing. Whatever I can observe. If the perception kicked in where I would start to panic, I immediately would start to observe current reality and describe it to myself. The perception can't maintain itself when I focus in the present. The adrenaline passes within 10-20 seconds, and then I'm fully relaxed. Mindfulness meditation is another way to practice this daily. It's the process of focusing on something like a mantra, breath, music, etc.---and when you find that you are thinking, return to the focus. It's a way to retrain the brain to be focused on actual reality, and not in the movies in your mind. Try practicing refocusing in the present. It can't hurt, and at the very least you'll be living Ferris Bueller's maxim \"Life moves pretty fast. If you don't stop and look around once in a while, you could miss it.\" Many of us are missing it. We're off in the la-la land of our movies. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The practice of staying with current reality",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lyton/the_practice_of_staying_with_current_reality/"
        },
        {
            "author": "SpecialU",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415872813,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m63jy/ive_liked_a_girl_for_5_years_she_is_single_after/",
            "gilded": 0,
            "id": "2m63jy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m63jy/ive_liked_a_girl_for_5_years_she_is_single_after/",
            "retrieved_on": 1441073088,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've liked a girl for 5 years. She is single after a rocky relationship I helped her with. I think another one of her Ex's is trying to get her back and I can't breathe or sleep at night.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m63jy/ive_liked_a_girl_for_5_years_she_is_single_after/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415520407,
            "domain": "self.Anxiety",
            "edited": 1415535632,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lqxfy/another_person_i_love_gone_too_early_vent/",
            "gilded": 0,
            "id": "2lqxfy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lqxfy/another_person_i_love_gone_too_early_vent/",
            "retrieved_on": 1441080227,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "Today I got to work (overnight) and had some spare time. I got on Facebook and saw a bunch of \"RIP\" posts, and no one mentioning names. Finally I spotted one with a name.\n\nEmily. My girlfriend. \n\nNo one had called me. No one even texted me. Just Facebook posts. \n\nShe died in a car accident. I was just Snapchatting with her the night before. Telling her good night. Telling her I couldn't wait to see her Monday after my work weekend is over. \n\nShe's just gone. \n\nShe won't get her dream job as a chef. Won't finish college. Won't get married, have kids, enjoy what life has to offer.\n\nHer parents won't have a child. Her friends are broken. \n\nI'm numb. \n\nI cried my fucking eyes out and now I'm numb. I still have 8 hours to go out of my 14 hour shift. I'm lost. I can't focus. \n\nEverything was okay, and now it's not. Emily, if you're reading this; I love you. I know you aren't but... I have nowhere else to go. You're not here to let me say it anymore. I miss you like hell. \n\nGod, do I miss her. \n\nEdit: Thank you for the kind comments. I've even had some of you message me personally reaching out. I appreciate it. As I said in one of my replies, I've dealt with a best friend's suicide and another's death (in yet another car accident), and I can do it again. It doesn't get any easier with each passing, but it becomes your new life. I just have to go through the process of coping like I did but a year ago. \n\nThank you again.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Another person I love, gone too early (vent)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lqxfy/another_person_i_love_gone_too_early_vent/"
        },
        {
            "author": "rubyyouwho",
            "author_created_utc": 1371696763,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c3jg3",
            "created_utc": 1415447559,
            "domain": "self.Anxiety",
            "edited": 1415550831,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lo26k/my_11_year_old_daughter_has_anxiety_i_need_help/",
            "gilded": 0,
            "id": "2lo26k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lo26k/my_11_year_old_daughter_has_anxiety_i_need_help/",
            "retrieved_on": 1441081565,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I have a daughter who has anxiety. She recently suffer a concussion which has heightened her anxiety. She has also recently started Cognitive Behavior Therapy, which is slowly working. We are 4 sessions in and I am starting to see an improvement.\n\nI need advice on issues with her father.  Her father and I divorced 4 years ago and she spends 3 nights a week at his apartment. Fortunately he lives less than a mile away and on school days would drop her off at my house on the way to work and I would take her to school.\n\nThis May she refused to sleep at her father's house and he honored her request. In the last six months she has spent a total of 4 nights there.  He asked me to find out why. I did and told him. One of the reasons is he picks out her clothes and makes her change in his bedroom. Well, that set off a big huge red flag in my mind and asked him about it. He told me he isn't in there with her and her younger sister, there is just more room in his bedroom (huh?). He confronted her and demanded she explain herself to him. Never again will I share information with him regarding her feelings.\n\nSo, she suffered a concussion which has added onto her anxiety.  I put her in therapy and it comes to light that her father's actions cause a lot of her anxiety. He behavior in public humiliates her. Since he lives less than a mile away he goes to her activities. While at the activities he causes her stress. For example: He does this elaborate hand signal to show he loves her. He insists she does it back, in public, while playing in a basketball game. If she ignores him he confronts her. He corrects coaches and stands and watches every practice. Calls her friends \"honey\" and \"sweetie\",and\"baby\". He has been told by others to stop.  I have spoken with him umpteen times to please stop this behavior. He flat out refuses and says our daughter needs to tell him stop. When she does he talks over her and doesn't listen. He refuses to admit she is anxious and openly criticizes the therapist.\n\nHe spends time with the girls two days a week for 3 hours and every other weekend for about 12 hours. \n\nAt her last therapy session(she goes weekly) the therapist asked if her dad if she ,the therapist could speak with him. He said no. When I spoke with the therapist she said her father is a narcissist.  I  am not sure how to help my daughter. She feels so much pressure to please her dad. It is eating her alive. She has started sleepwalking, biting her nails, unable to sleep, and she is losing her friends due to her fears and anxiety.\n\nI am so grateful for her younger sister who is 7 years old. They share a special bond and my youngest can soothe my daughter. I know it is an unfair burden to my youngest. \n\nI just don't know what to. I can't save her from her father. He refuses to listen to me or the therapist.\n\nI just want her to be able to cope. Any advice would help.\n\ntl;dr High anxiety daughter has a narcissistic farther\n\nEdit: I can't spell",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My 11 year old daughter has anxiety. I need help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lo26k/my_11_year_old_daughter_has_anxiety_i_need_help/"
        },
        {
            "author": "__kaisersalad",
            "author_created_utc": 1373283734,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cawli",
            "created_utc": 1415789987,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m2afj/i_posted_a_little_while_ago_about_a/",
            "gilded": 0,
            "id": "2m2afj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m2afj/i_posted_a_little_while_ago_about_a/",
            "retrieved_on": 1441074864,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "Hi everyone. r/acceptyourself is kicking off. I would love to see some of you there! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I posted a little while ago about a self-acceptance subreddit. The subreddit is ready to go!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m2afj/i_posted_a_little_while_ago_about_a/"
        },
        {
            "author": "YadMot",
            "author_created_utc": 1325891979,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ln7f",
            "created_utc": 1415811152,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m349u/relaxing_this_person_has_a_load_of_qi_episodes_up/",
            "gilded": 0,
            "id": "2m349u",
            "is_self": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m349u/relaxing_this_person_has_a_load_of_qi_episodes_up/",
            "retrieved_on": 1441074478,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/cYFibq2hAtpQsjVRGgC6V5pggi9XHxDsig356m_a7k0.jpg",
            "title": "[Relaxing] This person has a load of QI episodes up on their YouTube. I don't know if it'll help anyone else but Stephen Fry's voice really helps calm me down, as well as the light-hearted and interesting nature of the show.",
            "url": "https://www.youtube.com/channel/UC_tLKCMX0zw3kwfgqZki5rg"
        },
        {
            "author": "jessikaye",
            "author_created_utc": 1316576133,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wbf8",
            "created_utc": 1415984075,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2maqcw/i_hate_that_they_dont_believe_me_when_i_call_in/",
            "gilded": 0,
            "id": "2maqcw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2maqcw/i_hate_that_they_dont_believe_me_when_i_call_in/",
            "retrieved_on": 1441070925,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "I have chronic migraines, I still go to work when I'm in extreme pain because I know I'll never hear the end of it. Today I woke up and the pain was so bad that I've been vomiting and can barely walk. I'm waiting to get a hold of someone at the store to inform the other shift lead I can't make it in.  I'm so fucking anxious because I know I won't hear the end of it. How they will say I'm probably faking it to get out of work. I can barely live on working 30 hours a week, do you really think I'll risk losing a 6 hour shift for the hell of it? Hell no, I never call out of work. Just wish they wouldn't give me shit for quite literally not being able to work.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate that they don't believe me when I call in",
            "url": "http://www.reddit.com/r/Anxiety/comments/2maqcw/i_hate_that_they_dont_believe_me_when_i_call_in/"
        },
        {
            "author": "Turtle_Crunch",
            "author_created_utc": 1368657780,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bowub",
            "created_utc": 1415738946,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m02jz/anyone_scared_of_sex/",
            "gilded": 0,
            "id": "2m02jz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m02jz/anyone_scared_of_sex/",
            "retrieved_on": 1441075901,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "STDs, pregnancy, it all seems so worrysome for 20 minutes of pleasure.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone scared of sex?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m02jz/anyone_scared_of_sex/"
        },
        {
            "author": "sweetsorrowsinging",
            "author_created_utc": 1397626805,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g5hwi",
            "created_utc": 1415768170,
            "domain": "self.Anxiety",
            "edited": 1415837468,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m1mdq/im_scared_and_i_dont_know_why/",
            "gilded": 0,
            "id": "2m1mdq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m1mdq/im_scared_and_i_dont_know_why/",
            "retrieved_on": 1441075177,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "I don't know why Im so sscared. It's night time and i need to sleep. But... Im afraid to. Im just afraid. I don't know what to do...\n\nEdit: why would someone downvote me..? I only want help\n\nEdit2: thank you guys for all the support. I really appreciate it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm scared... And I don't know why...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m1mdq/im_scared_and_i_dont_know_why/"
        },
        {
            "author": "spot9901",
            "author_created_utc": 1372468060,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c78p5",
            "created_utc": 1415844929,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m51zk/rant_had_a_panic_attack_in_class_today/",
            "gilded": 0,
            "id": "2m51zk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m51zk/rant_had_a_panic_attack_in_class_today/",
            "retrieved_on": 1441073574,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "Today I had a big test in Math class. As soon as I entered school I could feel something was off but when the test started I just lost it. My head and hands became extremely tingly and I began to shake. I got a dizzy and it became really hard for me to talk and at a certain point I almost started to cry and my eyes became really watery. I guess the mix of working every morning then rushing to get to school and having something almost every night of the week along with trying to keep good grades stress caught up with me. I just don't get why this happened to me. I'm a healthy 16 year old with no other problems other than some mild anxiety. It was really embarrassing to do that in the middle of class. I only finished like half of the test and I know I should ask my teacher if I can redo it but I don't want to be annoying to him or anything. I guess I just wanted to let that out of my system. I just hope this was a once-off experience. I don't think I could handle much more of that. I'm sure it'll get better and this sub is really a great place to be with other similar people.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] Had a panic attack in class today.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m51zk/rant_had_a_panic_attack_in_class_today/"
        },
        {
            "author": "_Diren_",
            "author_created_utc": 1387646938,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_eghfm",
            "created_utc": 1415562462,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lsd8g/uplifting_to_counter_the_loneliness_of_moving/",
            "gilded": 0,
            "id": "2lsd8g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lsd8g/uplifting_to_counter_the_loneliness_of_moving/",
            "retrieved_on": 1441079556,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "i kinda want to do something good this year. i kinda want to use the time and money i have to brighten peoples christmas. i can safely say i have never received a random xmas card, and very rarely do them. but this year i want to spread some joy, to make some people know that out there someone is thinking about them and wants them to enjoy this time of year. i feel truly lucky to feel so good this year at this time, and have spent many Christmases feeling terrible. so now that i dont, i want to spread joy and help others like so many have helped. me.\n\nFestivities, ho!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[uplifting] To counter the loneliness of moving home post uni, i am creating a personalised christmas card to get print to send to them all over the world. this will be the first christmas i have ever felt good enough to do Xmas cards. anyone want one/know someone who wouldbenefit from a xmas card?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lsd8g/uplifting_to_counter_the_loneliness_of_moving/"
        },
        {
            "author": "killertofuuuuu",
            "author_created_utc": 1265231103,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3v4n0",
            "created_utc": 1415836065,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m4ke8/i_get_easily_stressed_out_and_over_whelmed_with/",
            "gilded": 0,
            "id": "2m4ke8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m4ke8/i_get_easily_stressed_out_and_over_whelmed_with/",
            "retrieved_on": 1441073802,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I want to do lots of things at once like the people around me but I just get stressed out and over whelmed and then I can't focus or take action.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I get easily stressed out and over whelmed with too much on my plate - how do you remedy this? I feel like I have a low threshold for 'having too much on my plate' and it's frustrating.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m4ke8/i_get_easily_stressed_out_and_over_whelmed_with/"
        },
        {
            "author": "tjeposomsalt",
            "author_created_utc": 1386390093,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_e8m3q",
            "created_utc": 1415944840,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m9epu/help_does_anyone_know_of_any_online_therapist/",
            "gilded": 0,
            "id": "2m9epu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m9epu/help_does_anyone_know_of_any_online_therapist/",
            "retrieved_on": 1441071543,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "i know it might sound kind of like a stretch, but i am really in need of this. i've read a few articles in the past referring to online therapy through Skype though i don't remember any leads. it would be best if it were something free, though i dont know how far i can get with that.. \n\nany ideas?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Does anyone know of any \"online therapist\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m9epu/help_does_anyone_know_of_any_online_therapist/"
        },
        {
            "author": "swishyhair",
            "author_created_utc": 1344915685,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8nupm",
            "created_utc": 1415683015,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lxs0x/tomorrow_is_my_first_day_of_work_in_more_than_two/",
            "gilded": 0,
            "id": "2lxs0x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lxs0x/tomorrow_is_my_first_day_of_work_in_more_than_two/",
            "retrieved_on": 1441076970,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I just want to air this out, if you all will indulge me.\n\nI recently got hired for an assistant manager gig at a retail store in my local mall. I've been out of the workforce since April of 2012, and that was because I was seriously scared of putting myself out there again. I thought I did awful in my interview for this latest gig, but the manager was impressed enough to offer me a management position. \n\nNow, i'm practically shaking over my new job. From what I gather, my role will primarily be pushing sales associates to make more sales. After only one night of work, i'm scheduled to be the closing manager and have no clue how I'll be learning the procedure to close. My mind is racing, i'm freaking out. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Tomorrow is my first day of work in more than two years.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lxs0x/tomorrow_is_my_first_day_of_work_in_more_than_two/"
        },
        {
            "author": "Kass1207",
            "author_created_utc": 1334631223,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7h568",
            "created_utc": 1415586191,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ltj8d/i_played_paintball_today_with_the_people_i_work/",
            "gilded": 0,
            "id": "2ltj8d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ltj8d/i_played_paintball_today_with_the_people_i_work/",
            "retrieved_on": 1441079011,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I work at a craft store with awesome and kind people that I absolutely love like another family. I've worked there for about 8 months now, and most people my age (16) either get fired or quit by the 4th month, so I've been doing well. I don't talk much except for the usual customer service thing we have to dk. (i.e. how are you? Find everthing ok? Etc.)\nA few weeks ago one of the other employees invited me to go to are haunted house with them. I said yes but got really nervous the day of and didn't show up. Everyone kept on asking me why and said they wished I would have gone. So, when they invited me to paintball I finally went- I had a blast. I talked more and laughed and made friends with some awesome people that are older than me. One even said I'm their favorite cashier (which, according to others, is hard to be a favorite of that person because she's not much of a people person. But she's actually really cool and nice as long as you are on her good side haha)\nI was first afraid of how I looked. I didn't know what to wear, I thought I looked ricidulous in my sweats and hoodie, but it worked out fine. Then I was afraid of having to ask for a ride because I don't drive, but one of them told me to hop in her car and we went. I was also afraid of being weird because I have bad allergies this time of year, I was afraid I'd cough or sniffle and everyone would think I was gross. It turned out fine though, I had fun and have a new group of friends, they all said they enjoyed me being there. I was so happy. I thanked everyone and now I'm home.\nI still hate that my anxiety prevents me from doing things like this, I miss out on oppurtunities and sometimes get too anxious I don't get to enjoy the time. I work with some amazing people.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I played paintball today with the people I work with. I almost didn't want to go, but I'm so glad I did",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ltj8d/i_played_paintball_today_with_the_people_i_work/"
        },
        {
            "author": "BiteSizedBoss",
            "author_created_utc": 1387782184,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_eh8zm",
            "created_utc": 1415891889,
            "domain": "self.Anxiety",
            "edited": 1422894276,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2m6pd3/everyone_thinks_i_am_lazy/",
            "gilded": 0,
            "id": "2m6pd3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2m6pd3/everyone_thinks_i_am_lazy/",
            "retrieved_on": 1441072805,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "Every morning I wake up and have a panic attack. I deal with depression and anxiety. I hate school. My mom doesn't understand the whole anxiety thing. She understands that I have it, but not how it effects different people. I have taken medicine but nobody ever sees a difference because it is all internal.\n\n So every morning she will bang as loud as she can on my bedroom door to wake me up. So I act like I am not awake so I can miss the bus. My mom works from home so she leeps bangin on my door as loud as she can every half hour trying to get me up for school. That is the routine. \n\nToday was different. I told her that I was having a panic attack and she told me to stop with the bullshit and go to school like everyone else. I am tired of nobody understanding. \n\nMy grandparents are giving me their old car so now I can actually drive on my own. But she is threatening to call them and tell them I am skipping and acting out or whatever. My grandparents are close but not exactly understanding. \n\nHaving to write is one of the worst triggers and nothing I write or type out ever makes grammatical sense so thank you for reading. I just need someone to talk to about it.\n\nEdit: Life is good. Everything is looking up, hopefully it stays this way.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Everyone thinks I am lazy",
            "url": "http://www.reddit.com/r/Anxiety/comments/2m6pd3/everyone_thinks_i_am_lazy/"
        }
    ]
}