{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1417023472,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nhtie/showerthought_living_with_anxiety_is_like_playing/",
            "gilded": 0,
            "id": "2nhtie",
            "is_self": true,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nhtie/showerthought_living_with_anxiety_is_like_playing/",
            "retrieved_on": 1441050581,
            "score": 343,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Showerthought: Living with Anxiety is like playing life on hard mode",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nhtie/showerthought_living_with_anxiety_is_like_playing/"
        },
        {
            "author": "Robo94",
            "author_created_utc": 1334006380,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7emrw",
            "created_utc": 1416954775,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nf2ui/got_an_antianxiety_prescription_a_few_weeks_ago/",
            "gilded": 0,
            "id": "2nf2ui",
            "is_self": true,
            "media_embed": {},
            "num_comments": 53,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nf2ui/got_an_antianxiety_prescription_a_few_weeks_ago/",
            "retrieved_on": 1441051860,
            "score": 144,
            "secure_media_embed": {},
            "selftext": "that is all.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Got an anti-anxiety prescription a few weeks ago. For the first time in years, I actually have fingernails. Feels good man.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nf2ui/got_an_antianxiety_prescription_a_few_weeks_ago/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416728445,
            "domain": "self.Anxiety",
            "edited": 1416769966,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n5gse/does_anyone_ever_feel_like_they_are_really/",
            "gilded": 0,
            "id": "2n5gse",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n5gse/does_anyone_ever_feel_like_they_are_really/",
            "retrieved_on": 1441056406,
            "score": 139,
            "secure_media_embed": {},
            "selftext": "Okay so I've never posted to Reddit before, so this is sort of scary, but here goes... \n\nI'm generally a pretty confident, talkative person, but lately I've noticed that a few friends have been acting weirdly towards me. Small stuff like ignoring my contributions to a conversation, talking over me or not listening, not asking me any questions or taking interest when I talk, closed body language, etc. I feel like I'm just annoying people simply by being myself and that there must be something about my personality that they're just sick of. I've had similar experiences before when I was at high school. I end up getting really angry and upset at myself for being 'wrong' and I just wish I could be normal.\n\nI would ask them if there's an issue but in the past I've been called dramatic and too sensitive so I'm afraid to ask them in case it makes them hate me more. I don't know if I am just being paranoid or whether my intuition is right. I do have anxiety and have had cognitive behavioral therapy for it in the past, which helped for a while.\n\nCan anyone else relate to this and if so how do you deal with it? Thanks!\n\nEdit: Such great responses, thank you all so much! It definitely does mostly come from insecurity and a lack of self-love/confidence, so I can now at least focus on that. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone ever feel like they are really annoying everyone around them?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n5gse/does_anyone_ever_feel_like_they_are_really/"
        },
        {
            "author": "aschesklave",
            "author_created_utc": 1314629981,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5qz9p",
            "created_utc": 1416757685,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n67n8/people_tell_me_just_dont_care_what_other_people/",
            "gilded": 0,
            "id": "2n67n8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n67n8/people_tell_me_just_dont_care_what_other_people/",
            "retrieved_on": 1441056058,
            "score": 99,
            "secure_media_embed": {},
            "selftext": "I can't simply change the way I view myself and others overnight.  Why do my friends expect that from me?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "People tell me \"Just don't care what other people think about you\" like it's as simple as flicking a light switch.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n67n8/people_tell_me_just_dont_care_what_other_people/"
        },
        {
            "author": "callme_al",
            "author_created_utc": 1368940634,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bq9t6",
            "created_utc": 1416896852,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ncj79/everything_is_going_to_be_okay/",
            "gilded": 0,
            "id": "2ncj79",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ncj79/everything_is_going_to_be_okay/",
            "retrieved_on": 1441053048,
            "score": 94,
            "secure_media_embed": {},
            "selftext": "You've never been braver. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Everything is going to be okay.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ncj79/everything_is_going_to_be_okay/"
        },
        {
            "author": "grincie",
            "author_created_utc": 1416223321,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jefq7",
            "created_utc": 1416836888,
            "domain": "self.Anxiety",
            "edited": 1416837230,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n9gan/finally_asked_for_help/",
            "gilded": 0,
            "id": "2n9gan",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n9gan/finally_asked_for_help/",
            "retrieved_on": 1441054546,
            "score": 79,
            "secure_media_embed": {},
            "selftext": "I am a 23 year old guy who has been suffering from anxiety ever since my early teens. I have only once or twice mentioned my anxiety to my parents, but they never believed me and thought I was just over exaggerating. I never mentioned it to anyone else and I just kept it bottled up inside me.\n\nThe thing is, my anxiety has been a huge rollercoaster in my life. I could go for months of feeling great, with no anxiety at all. Then other times I could take a nosedive and feel miserable for months. There were points in my life where I thought I had finally conquered my anxiety, only for it to resurface again.\n\nLast night I was rolling around in my bed, unable to sleep due to worrying about upcoming things, past memories, things that don't even make sense to dread about, etc. I suddenly realized that I had not felt good for nearly a half a year. I literally started to panic and this is the first time in my anxiety that I felt like I was trapped with no escape. After hours of rolling around, I finally managed to get a 2-3 hour sleep before my alarm clock rang.\n\nImmediately at work I looked up a phone number for my local psychiatrist. I made the call. I was getting ready for someone to pick up the phone who is completely uninterested and would basically think \"great, another weirdo\". How wrong I was. The lady who answered was instantly calming and telling me that I did the right thing to reach out. She started asking me questions about my anxiety, asking about medical history, etc. She told me that they would evaluate my case and would contact later this week for a visit at the clinic. She told me I could call the same number if I started to feel really bad and needed help immediately.\n\nFor the first time in my life, I felt like someone finally understood. It felt like someone reached out for me in the darkness and finally grabbed my hand.\n\nI'm done with my anxiety. It's time to get rid of this thing. Wish me luck guys.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Finally asked for help",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n9gan/finally_asked_for_help/"
        },
        {
            "author": "ColonelButtsworth",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1417081812,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nkf36/i_started_therapy_yesterday_things_are_looking_up/",
            "gilded": 0,
            "id": "2nkf36",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nkf36/i_started_therapy_yesterday_things_are_looking_up/",
            "retrieved_on": 1441049328,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "I spent several years putting off the idea of going into therapy, telling myself that my problems are too trivial and not worth bothering someone else over, or fearing that I'd be dismissed or that I'd sound stupid talking about my piled up issues and anxiety.\n\nAfter going in for my 2nd refill of Mirtazapine my doctor gave me a referral to a therapist. I delayed booking my appointment for a full month. Yesterday I finally had my first visit and all my dread and hesitation has been shed off. I lucked out and got a shrink whom I was immediately comfortable with, who empathized with my life experiences, took them seriously and validated them as genuinely traumatic experiences and acknowledged my anxiety as real and serious. I learned the right way to do mindfulness breathing exercises and understood the importance of deep, slow breathing.\n\nAfter all that dread and hesitation and self-defeating rumination I'm now looking forward to my next session in a few weeks and feeling the most optimistic in years. If you're sitting there contemplating whether you should book a therapist, do it. Please do it. Even if you are like me and tell yourself that your problems aren't worth troubling anyone else over, do it. There's a way out of this for you.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I started therapy yesterday. Things are looking up.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nkf36/i_started_therapy_yesterday_things_are_looking_up/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416804074,
            "domain": "self.Anxiety",
            "edited": 1416808977,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n8fnp/i_always_think_people_are_judging_me/",
            "gilded": 0,
            "id": "2n8fnp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 79,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n8fnp/i_always_think_people_are_judging_me/",
            "retrieved_on": 1441055021,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "I've suffered from terrible social anxiety all my life.  I'm 21 years old, male, and it's definitely gotten better.  Thing is, as I get older, my ability to self-analyze better just shoots my self-esteem to the ground.  I begin to understand more and more of what kind of person I am, and I hate it.\n\nI tend to walk into social situations with a shitty attitude, already with the presumption that people think lowly of me.  I can't go to my stupid retail job without thinking that my co-workers are constantly judging me.  All that goes through my head at work is: \"They probably think i'm so stupid and boring\", \"they probably wish I didn't work with them\", just negative thoughts in general.  \n\nFor anyone who experienced this type of social anxiety, how did you overcome this? I suppose its because i'm not too confident in general.  I've never had a real girlfriend, my grades have recently turned to shit, and I wake up feeling depressed every morning usually.  I just want to walk around with my head high, feeling confident and happy, and be able to portray how intelligent I actually am.  I feel like my anxiety has precluded me from socializing to my fullest potential, and everyone is always under the impression that I'm weird, dumb, and insecure. \n\nI don't want to get my feelings hurt whenever anybody says something mean to me.  I HATE how sensitive I am.  I almost have to establish an asshole facade of myself when I go out so I can socialize effectively.  For some reason, when I meet new people, I ALWAYS feel like they don't like me for some reason, even if I haven't talked to them yet.  Actually, I feel the same way about EVERYONE for the most part, aside from the people I am close to and get along with well (family and close friends).  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I always think people are judging me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n8fnp/i_always_think_people_are_judging_me/"
        },
        {
            "author": "KittyMulcher",
            "author_created_utc": 1318224934,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_60gxs",
            "created_utc": 1416606904,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n0xya/i_have_to_get_a_job/",
            "gilded": 0,
            "id": "2n0xya",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n0xya/i_have_to_get_a_job/",
            "retrieved_on": 1441058575,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "I need a job but I get so anxious searching. Like I get stomach cramps and feel like shit constantly, and I get very irritated, upset. I go on a jobsearch page or think about my resume and it's overwhelming. The few times I even had an interview I bombed so hard, but it's been 3 years since I left school and I don't want to be kicked out or commit suicide.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have to get a job",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n0xya/i_have_to_get_a_job/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416690419,
            "domain": "self.Anxiety",
            "edited": 1416715127,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n3yc4/he_told_me_he_hated_me_because_of_my_anxiety/",
            "gilded": 0,
            "id": "2n3yc4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n3yc4/he_told_me_he_hated_me_because_of_my_anxiety/",
            "retrieved_on": 1441057171,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "We were \"together\" for 1.5 years. Our relationship was on peculiar terms--it was long distance and \"unofficial\". We exchanged \"I love you\"s; despite the odd terms of our relationship, he was my white buffalo. He is depressed with paranoid personality disorder, I have anxiety. Most times if we fight, it is related to his depression/paranoid delusions, and I am able to recognize that his irritation/hostility is due to his paranoia/depression.\n\nThe other day, I sent him a video wishing him a good day, and mentioned how cold it was and that I missed my old car's heated seats. He was a bit put-off by the comment, though he tried to play it off like he wasn't bothered. I later found out he felt I was \"privileged\" and \"spoiled\" for missing my heated seats, and that the comment made him feel worthless (as he comes from a low-middle class family). Knowing he was upset heightened my anxiety. I tried talking about the situation, which irritated him, which heightened my anxiety further. He later said that he hated me and no longer loves me. When I asked why, he explained it was due to the behaviours I exhibit when I'm anxious.  And then he left. \n\nEdit: To clarify, the \"behaviours\" in question include me pressing conversation to try to figure out what's wrong so I can resolve the issue. In doing so I can ask a lot of questions to try to ascertain how he's feeling. It is an annoying idiosyncrasy, and I'm working on changing it. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "He told me he hated me because of my anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n3yc4/he_told_me_he_hated_me_because_of_my_anxiety/"
        },
        {
            "author": "mbnnsnmspch",
            "author_created_utc": 1405806939,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hhaan",
            "created_utc": 1417123341,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nm02p/obsessive_thoughts_about_being_annoying/",
            "gilded": 0,
            "id": "2nm02p",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nm02p/obsessive_thoughts_about_being_annoying/",
            "retrieved_on": 1441048589,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "I'm sorry if made some grammar mistakes, English is not my first language.\n\nI am very insecure, and also very self-aware. It can be very tiring to talk to other people, because I'm constantly thinking about the way I talk and if I' contributing enough to the conversation. And if I listen enough and if the other person isn't annoyed by what I'm saying. \n\nI know it's impossible for everyone to like me, and I guess I'm fine with that. It's just that people used to tell that I could be very negative and that I should \"nag\" less. The stupid thing is that I was not aware about being to negative and nagging too much. I just expressed myself and I tried to be social. I also didn't have very much to tell because I was feeling depressed at that time.\n\nI'm doing way better now, and I'm feeling very happy most of the time. My social skills are better now that I'm feeling happier. (I have friends now, hurray!)\n\nBut sometimes I just get very worried. Like I just can't decide on what to do, and my insecurities aren't helping me making a decision either. Because I am very scared about making the wrong decision and messing everything up.\nI try to keep those feelings to myself, I often talk about it with my mother but I guess I'm starting to annoy her. (Because we talked about it hundreds of times and I still haven't made a decision yet.) She told me that I should stop nagging about it, and just do what feels best. (How do I do that with my anxiety right?) \n\nAnd just now my mother told me that I'm still nagging too much sometimes, and that she worries that I will scare my friends away with this behavior.\n\nI know feel that I'm bothering her AND my friends. Because sometimes the conversation comes up when I'm with a friend and I just get into this obsessed like mental state where I could talk about my problem for hours. I always feel guilty about it, and I want to stop obsessing over my problems, I want to make a decision and just let it go. \n\nI can get very obsessed about \"being bothersome\" again. I have to hold myself back from asking over and over again about how annoying I am, and if I don't nag too much.\nI'm very sad to hear that I still whine too much, even though I'm trying very hard not to do that. I want to become a positive and confident adult, but now I feel like I am more of a whiny, negative and selfish person.\n\nDoes anyone else have problems like this? And how do you deal with that?\n\nTL:DR: I worry and whine about things too much and I don't want to bother anyone.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Obsessive thoughts about \"being annoying\".",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nm02p/obsessive_thoughts_about_being_annoying/"
        },
        {
            "author": "roxtafari",
            "author_created_utc": 1220988770,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_38m9e",
            "created_utc": 1416869521,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nb767/girlfriend_is_applying_for_disability_due_to/",
            "gilded": 0,
            "id": "2nb767",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nb767/girlfriend_is_applying_for_disability_due_to/",
            "retrieved_on": 1441053731,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "She has GAD, hasn't worked in about five years. Has panic attacks weekly, shuts down completely when she gets stressed.  Prescribed xanax and hydroxizine for 10 years or so.\n\nSo has anyone completed the disability process?  What can we expect?  How long did it take?  What kind of benefits did you end up with?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Girlfriend is applying for disability due to anxiety, any advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nb767/girlfriend_is_applying_for_disability_due_to/"
        },
        {
            "author": "JeffR47",
            "author_created_utc": 1249685016,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3kutd",
            "created_utc": 1416845423,
            "domain": "psmag.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n9twf/sufferers_of_social_anxiety_disorder_your_friends/",
            "gilded": 0,
            "id": "2n9twf",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n9twf/sufferers_of_social_anxiety_disorder_your_friends/",
            "retrieved_on": 1441054370,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/9IGP8izFxZlsZzysiK5fEkt8AGTqFq0CGA5Crg6KT20.jpg",
            "title": "Sufferers of Social Anxiety Disorder, Your Friends Like You",
            "url": "http://www.psmag.com/navigation/health-and-behavior/sufferers-social-anxiety-disorder-friends-like-sad-95001/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416678241,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n3ede/just_try_meditation/",
            "gilded": 0,
            "id": "2n3ede",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n3ede/just_try_meditation/",
            "retrieved_on": 1441057430,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "I have started meditating lately and its the best thing i have done. I know how it feels to overthink and to be restless all the time. But when i meditate its like a calm river. Its like the clear blue sky. Its like everything you would want it to be. So i just ask from you to atleast try meditating for a week and you will see how effective it is. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just try meditation",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n3ede/just_try_meditation/"
        },
        {
            "author": "BowtieSam",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1417114181,
            "domain": "self.Anxiety",
            "edited": 1417148924,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nlkyp/just_subscribed_heres_why/",
            "gilded": 0,
            "id": "2nlkyp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nlkyp/just_subscribed_heres_why/",
            "retrieved_on": 1441048785,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "So I'm new here. I can just speak my mind and say what I have to right? I really need to talk to someone,anyone. Even if only 1 person reads this, I will feel better.\n\nSo I've had huge problems with anxiety in the past. I got over it for the last half of high school and never had issues. But here I am, on vacation in Florida visiting my grand for Thanksgiving and all I am looking forward to is night time so I can cry alone in my room without being seen or disturbed. I'm sorry I'll just get to what's bothering me now:\n\nThere's a girl. This girl and I have a real connection, we've kissed and people on the outside would assume that she's my girlfriend and that I'm her boyfriend. That is what I want. However for personal reasons, she is hesitant about committing fully to a relationship. I was fine with waiting for things to happen naturally cause I don't want to rush anything. But we hangout and cuddle and kiss. It's just all without the commitment and the label of relationship. Why am I anxious then?\n\nI have had a few bad, horrible experiences with girls in the past. I always end up being hurt and I always get dealt the bad hand when it's all over. So when this girl can't commit, I feel like she's kinda leaving me on hold. You know like I'm just a side that she enjoys and can easily be dropped should something better come along. She's the sweetest girl and I don't think she would do that but of course my anxiety makes me think like this. So while I'm away on vacation I won't be seeing her for a while, whatever. But when I hear she's hanging out with her ex boyfriend (one of her best friends) I'm sure you can imagine the anxiety I have. I don't want to be hurt again, I don't want to be just a thrill on the side. I'm so terrified that at this moment she is off with somebody else. I don't know what to do. Happy Thanksgiving everybody. \n\nEDIT (should people see this): can I just say that this has been the most positive and helpful feedback I have ever received on the Internet. I have and am considering each and ever suggestion and piece of advice. Thank you so much everyone.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just subscribed, here's why.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nlkyp/just_subscribed_heres_why/"
        },
        {
            "author": "shiroh7",
            "author_created_utc": 1328285393,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tvzd",
            "created_utc": 1416784299,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n7hq4/anxiety_and_cannabis/",
            "gilded": 0,
            "id": "2n7hq4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n7hq4/anxiety_and_cannabis/",
            "retrieved_on": 1441055461,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I've recently come out of a bad depression due to family and work problems all hitting at once. Long story but I'm all better now after months of anti-depressants.\n\nOver the last few monthes ive been smoking cannabis over weekends (never on a work day) and I seem to be benefitting from it. Im sleeping better/deeper and just generally more easy going. I've also been more assertive at work ehich has helped too as ive had more time to think when calm.\n\nSo far ive been pretty careful with how much I take, but few friends have expressed concern that it may be bad smoking as it could bring my anxiety back, or start giving me paranoia. \n\nIm not trying to promote toking if you have problems, but just want to see if anyone else has done this as well long term, and how it has affected them.\n\nThanks!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety and Cannabis?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n7hq4/anxiety_and_cannabis/"
        },
        {
            "author": "banabis",
            "author_created_utc": 1351799873,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9h5bv",
            "created_utc": 1417195022,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2noi42/how_do_you_deal_with_anxiety_when_you_have/",
            "gilded": 0,
            "id": "2noi42",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2noi42/how_do_you_deal_with_anxiety_when_you_have/",
            "retrieved_on": 1441047421,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I honestly feel like I am going to fall apart. I have debt and school shit to deal with and avoidance issues that make it worse. But I feel like my life is wasted to these constant obsessive worrying thoughts, and I can't make them go away because they are real situations! I am so exhausted and broken and these feelings are worse then anything that can actually happen. It wont let me fix these situations because I am so terrified of them. I think I am going to break. Sorry for the rant...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do you deal with anxiety when you have legitmate reasons to be anxious??",
            "url": "http://www.reddit.com/r/Anxiety/comments/2noi42/how_do_you_deal_with_anxiety_when_you_have/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416902964,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ncqo5/im_sure_i_might_not_be_alone_with_this_or_maybe_i/",
            "gilded": 0,
            "id": "2ncqo5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ncqo5/im_sure_i_might_not_be_alone_with_this_or_maybe_i/",
            "retrieved_on": 1441052951,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "As in, when I feel like I get anxiety I just say it's all in my head and that it's stupid to even feel anxious in the first place. Though, when this happens I still feel anxious and when it gets the best of me I feel like I'm being selfish and self centered thinking about myself too much or becoming too introspective and worried over my affairs and disregarding others.\n\nThen I become critical of myself for even letting this chain of events happen even if it is just a conflict going on inside of me where I don't tell anyone and bottle it up because I feel taking others time to talk about my anxiety is selfish as well.\n\nIt's a vicious cycle for me.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm sure I might not be alone with this, or maybe I am, but does anyone else dismiss the feeling of anxiety as just being \"selfish\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ncqo5/im_sure_i_might_not_be_alone_with_this_or_maybe_i/"
        },
        {
            "author": "Republicrats",
            "author_created_utc": 1345923398,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8sa08",
            "created_utc": 1416625714,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n1sia/follow_up_video_of_reporter_dan_harris_who_got_a/",
            "gilded": 0,
            "id": "2n1sia",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "Big Think",
                    "author_url": "http://www.youtube.com/user/bigthink",
                    "description": "ABC News anchor Dan Harris recounts having a panic attack live on Good Morning America. Harris went on to encounter a number of snake-oil-selling self-help gurus before he finally discovered the effectiveness of traditional Buddhist meditation. Harris is the author of 10% Happier. Don't miss new Big Think videos!",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2Fywp4vaFJASE%3Ffeature%3Doembed%26start%3D86&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dywp4vaFJASE&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fywp4vaFJASE%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i.ytimg.com/vi/ywp4vaFJASE/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Dan Harris' Panic Attack (and Discovery of Meditation)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=ywp4vaFJASE",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2Fywp4vaFJASE%3Ffeature%3Doembed%26start%3D86&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dywp4vaFJASE&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fywp4vaFJASE%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n1sia/follow_up_video_of_reporter_dan_harris_who_got_a/",
            "retrieved_on": 1441058179,
            "score": 25,
            "secure_media": {
                "oembed": {
                    "author_name": "Big Think",
                    "author_url": "http://www.youtube.com/user/bigthink",
                    "description": "ABC News anchor Dan Harris recounts having a panic attack live on Good Morning America. Harris went on to encounter a number of snake-oil-selling self-help gurus before he finally discovered the effectiveness of traditional Buddhist meditation. Harris is the author of 10% Happier. Don't miss new Big Think videos!",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fywp4vaFJASE%3Ffeature%3Doembed%26start%3D86&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dywp4vaFJASE&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fywp4vaFJASE%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fywp4vaFJASE%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "Dan Harris' Panic Attack (and Discovery of Meditation)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=ywp4vaFJASE",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fywp4vaFJASE%3Ffeature%3Doembed%26start%3D86&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dywp4vaFJASE&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2Fywp4vaFJASE%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/Bpjto05zEwjZKY12TxvNn6mWyEyocBUJ9snLnAkm1BE.jpg",
            "title": "Follow up video of reporter (Dan Harris) who got a panic attack live on TV",
            "url": "https://www.youtube.com/watch?v=ywp4vaFJASE#t=86"
        },
        {
            "author": "Doctor_Mod",
            "author_created_utc": 1383622224,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_ds2sd",
            "created_utc": 1417181057,
            "domain": "self.Anxiety",
            "edited": 1417240598,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nnyqw/get_anxious_feelings_over_playing_video_games/",
            "gilded": 0,
            "id": "2nnyqw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nnyqw/get_anxious_feelings_over_playing_video_games/",
            "retrieved_on": 1441047672,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "often when I think of playing a game. I'll feel a feeling in the back of my head similar to my anxiety and than end up not playing it at all...I'm just not sure at all what I'm actually nervous of...I just know it is not simple boredom or disinterest. \n\nEDIT: Honestly was not expecting so many to have similar issues. I thought I was alone in this. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Get anxious feelings over playing video games.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nnyqw/get_anxious_feelings_over_playing_video_games/"
        },
        {
            "author": "Flutterchu",
            "author_created_utc": 1415766112,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jbhtb",
            "created_utc": 1416651405,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n2kih/im_so_scared/",
            "gilded": 0,
            "id": "2n2kih",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n2kih/im_so_scared/",
            "retrieved_on": 1441057817,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I'm 16 and Long story short, recently I was in an abusive relationship with a batterer. This is difficult to explain, but he gas lighted me into believing my family is awful so I would be more dependent on him. The abuse got so bad that the police got involved. (He came to my house and tried to kidnap me, and stalked me.) due to the gas lighting, I had said some pretty nasty things about my family. The police have assured me it's fine, but I am having nightmares about CPS taking me away. I'm so frightened. I truly love my family and we are fine, they've supported me so much through this. Please help..\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm so scared...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n2kih/im_so_scared/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416777875,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n76hh/not_sure_what_to_title_this_looking_for_friends/",
            "gilded": 0,
            "id": "2n76hh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n76hh/not_sure_what_to_title_this_looking_for_friends/",
            "retrieved_on": 1441055607,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "snapchat / facebook / steam / skype\n\nI'm 19male, norway, social anxiety + depression.\n\nI'm pretty functioning for the most part but If I'm left alone with my thoughts for long periods of time my depression shadows over my mind so looking for a distraction. \n\nNot really sure what I'm doing with my life yet, I'm doing last year high school and just getting through one day at a time.\n\nI like literature, video games, music, animals, movies etc etc.\n\nSend me a pm or comment here.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Not sure what to title this... Looking for friends ?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n76hh/not_sure_what_to_title_this_looking_for_friends/"
        },
        {
            "author": "minifail",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1416787592,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2n7no7/i_want_to_live_someday/",
            "gilded": 0,
            "id": "2n7no7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2n7no7/i_want_to_live_someday/",
            "retrieved_on": 1441055384,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "31 and I want to die, but I'm not going to kill myself. Not a chance. I realize that I don't really want to die. I want the feelings that keep me from happiness to die. Also, when I really want to die, I have maybe one or two memories I focus on and hang on to that for a while.\n\nEvery aspect of my personality confuses me. Who am I? I hate that question. I am all things. I am nothing. I have no core. I am fluid. I am contradiction. Human behavior and emotion confuses me. Clearly I'm overthinking. But if overthinking is my natural state, how do I learn to use it to power happiness.\n\nToo many thoughts. Where is the peace?\n\nWhen I was younger, I could talk. I could joke. If people disagreed, I didn't care so much. I had a point of view. I can't communicate anymore. All my life, I thought I'd end up being a writer. I wrote a short story in third grade before stupid soccer practice. Ever since, I tell myself \"go be a writer.\" What a fucking curse.\n\nI write nearly every day, but am unable to communicate to human beings when they are near me. Or so it feels that way. I never finish things. I get bored easily and new ideas comes along. My mind is a crowded place, mostly full of regret, shame and self-loathing. It's like a train car on a morning commute, full and fast. It's like an unruly classroom with a substitute teacher, no control.\n\nI think there aren't enough people in my life. I have no friends. I have no lovers. Lovers are wonderful complications I can take or leave. But no friends? Jeez, they are so good at distracting me from my bullshit. I miss having friends.\n\nI have a few family members 2,200 miles away. I have a girlfriend 2,200 miles away as well. We barely speak. And when we do, it's not fulfilling. She's no girlfriend I want. I want to break up with her. I've never treated her very well, before or after I moved across the country a few months ago. She's too stupid to break up with me. \n\nI've broken up with her a few times over the past few years. I can't do it now because I don't want to cause her pain. Would it cause her pain? Yes, in the short term. Maybe very short term. Maybe no pain at all. No, it will cause pain. If breaking up with her would cause her no pain, she would have already broken up with me because I am mean. I don't have the balls to officially end it. And she still has my couch and some other things of mine. It's a nice couch. Would she burn the couch and my other things? Who needs to be in a relationship with someone who thinks you are stupid? I've told her I think she's an idiot. She still doesn't break up with me. She visits me for a week. How nice. We don't even kiss or hold hands. Why? I'll tell you why. Because I don't make the move to kiss or hold hands. Because I don't want to. She still doesn't break up with me. I guess she's just as fucking stupid and broken as I am. I hate her for not knowing what's best for her. She should break up with me and find someone who wants to get married and have children. I don't want those things and I've told her multiple times.\n\nI have major amounts of stress and anxiety. I feel clumsy. I feel like I can't speak, like I don't have access to my intelligence anymore. Does this lead to depression? To me, depression is not the issue. I have fleeting moments of joy (a book or hike or TV show or video game or meal or podcast, see there are plenty things I like). \n\nEvery now and then I drink alcohol to experience relief. I don't know when to stop drinking, so I don't do it as much as I used to. And the tiny amount of control over my thoughts is wiped out the next day, so it's my plan to not drink at all anymore. I'd say I drink about once a week, when I know I don't have to work the next day so I can be hungover and isolate myself from the world.\n\nDon't have money or time to find a decent therapist. Have tried multiple times, but they all say go somewhere else, even the ones with sliding scale or college clinics are full, wtf? Feels like Universe is telling me to fix myself. I'd rather do it myself anyway.\n\nI eat healthier now. I gave up caffeine. I drink caffeine-free hot tea. Passionflower. I take L-theanine. I hike. I joined a gym. It keeps getting worse. It is a storm of the mind. Is it a cycle? That would be the worst. To be on a constant cycle of barely getting better, but always regressing to the bad place. I want to be getting stronger. But that isn't life is it? We suffer. We deteriorate. We break apart. Entropy.\n\nI have no religion. I don't believe in fate or that things happen for a reason. I believe all is chaos. We define our own meaning and order. I have no self-created system of order. It's my hope that all this is making me stronger. But I keep emerging from each chrysalis and still I'm a god damn caterpillar. I feel worse everyday. \n\nThe more unhealthy things I eliminate from my life, the less I have to blame for this unhappiness. I am uncomfortable with all things physical, mental and spiritual. I have no peace. I have a little hope. I hope one day I am happy. I hope one day it clicks and I \"get it.\" Get what? I have no clue. I have irrational fears that everyone knows something I don't know. A secret to life. \n\nI did a lot of drugs one year in high school. Ecstasy and LSD and I think it fucked my brain. Every experience was awful and traumatic but I kept doing it because every one around me was doing it. I blame the paranoia and mood swings and obsessive circular thinking and disconnectedness on that. I also blame my parents. Mother is full of anxiety and mood swings and drinks too much, but she's highly functioning, and as far as I can tell the alcohol is her one indulgence/vice. Father is an addict of pain meds, already had open heart surgery, can't eat healthy, probably bipolar. I stopped talking to Father this year, such is his madness. He's never lived close. Somewhere in boonies deep South currently. He left me a voicemail the other day. He said because I have crazy genes from Mother and Father it's only going to get worse as I age. I know he's crazy. I know he's wrong. However, with the state I'm in, I can't rule such a statement out completely.\n\nI don't understand why I have no friends. I had many friends in the past. Why do friends lose touch? Long live transience, I say, but it's hard to live by. I want people to like me and  I want to not give a fuck when they don't like me.\n\nI have a sneaking suspicion I'm a bit co-dependent. I've had a couple long-term shitty relationships that have band-aided true self growth. But I don't think I'll ever find myself. I don't even understand what that means. I don't understand much. I thought I was smart. Now I'm older, I know nothing. \n\nI try to project love. Except to bad girlfriend. I'm mean to her. But she persistently clings onto the nothingness I offer. \n\nI feel no love in return. I feel no one is interested in me. I don't blame them. I'm not interesting right now. \n\nI'm not able to speak or make jokes or relate. I just want to be agreeable. I want to make and have good company. \n\nEven if I have to work a minimum wage job for the rest of my life, I want to feel content. What is the path? How do I eliminate desire and expectation without releasing ambition?\n\nIs there a purpose to my suffering? Are some people meant to be alone? Good god I see plenty of people who are \nalone. Are some of you loners happy? I'm sure not. \n\nIt's a privileged sort of suffering if you put it in perspective to the suffering of millions of others around the world. But for me I'm at my lowest or near lowest. I've been thrown up and down. I've been set on fire and I've been nearly drowned. I've felt plenty of pain, but none like the kind that nests deep inside my mind. I'm not sure if I'm falling deeper into suffering or climbing out of some pit. I don't know up from down. I have nothing to offer the world. No advice. I wish I did. I am Salieri from another Universe and this Universe is Mozart.\n\nI had a decent job that was going nowhere. It was killing my soul. It was in marketing. I wanted to be an artist, a writer, so I moved to Hollywood. I thought I could work in TV. Why? TV raised me. I wanted to participate. Now, I'm here and I don't care about writing as much. But I keep writing. I knew it wouldn't be easy. But I'm not living life. I'm not happy. I can't be passionate about writing until I'm happy.\n\nI want to live someday.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I want to live someday.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2n7no7/i_want_to_live_someday/"
        },
        {
            "author": "WeArePirates",
            "author_created_utc": 1353333989,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9ndot",
            "created_utc": 1416995314,
            "domain": "self.Anxiety",
            "edited": 1417038211,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ngrra/meds_xanax_solves_all_of_my_problems_but_ive/",
            "gilded": 0,
            "id": "2ngrra",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ngrra/meds_xanax_solves_all_of_my_problems_but_ive/",
            "retrieved_on": 1441051071,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I've used xanax before but I've never had a prescription. It takes away all of my anxiety and the shitty personality traits of mine that come with it (mostly irritability.) I feel like I can be a whole person when I take it. I've only ever taken .5mg doses, which isn't much at all - and I don't need it every day, I would only take it on an as-needed basis, or to help me sleep at night.\n\nBut if I wanted to be prescribed alprazolam specifically - is there any way to request that from my doctor that doesn't make it sound super shady? Like, I talk to them, tell them \"I have anxiety, it keeps me up at night\" they could prescribe me anything; is there any way for me to nudge them to prescribe what I already know works well for me? Can I just be honest with them? Should I?\n\n**edit** thank you for the help, and all of the warnings! I'm not planning on getting addicted to benzos, like I said, I just need a low dose every so often (2 - 3x a week maximum) and I guess it won't be that weird to tell the doctor something like \"I know this works for me, I just don't have a prescription for it.\" Or, \"I don't have a prescription for it... anymore.\"\n\nand apologies for not being more specific about my usage needs - my anxiety is fairly manageable, but when I am very anxious I'm just awful to be around. I \"feel like a whole person\" most of the time, just not when my anxiety is very bad (2 - 3x a week.) I'm also working on it as a problem, I have been for a long time. I think medication will help make it more manageable in addition to CBT.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[meds] Xanax solves all of my problems but I've never been prescribed it. Can I ask my doctor for it specifically?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ngrra/meds_xanax_solves_all_of_my_problems_but_ive/"
        },
        {
            "author": "anxiousjoejoe",
            "author_created_utc": 1416857327,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jktdj",
            "created_utc": 1416858722,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2nakmd/guys_what_the_heck_is_this/",
            "gilded": 0,
            "id": "2nakmd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2nakmd/guys_what_the_heck_is_this/",
            "retrieved_on": 1441054024,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "Am I having anxiety attacks? Is this what anxiety is?\nI cant go into too much detail because I'm at work, but I just really want to talk about it.\n\nI'm a male, 21, about to be 22, and otherwise very healthy.\nLast thursday, on my way to work, I was feeling a little uneasy in the car, like anxious. Thursdays are my favorite day because I have class the next day and I don't have to be at work again till monday, so I tend to get a bit excited that my weekend is starting. Anyway, in the car I felt my heart racing a little more than usual, slightly harder to breathe but really nothing to unusual. I'm at work and everything seems fine. about an hour after I get to work I am reading something on the computer and I suddenly feel like I am just going to faint right there, I get really dizzy and feel out of control. My heart starts racing and my chest feels tight. My heart rate is really high. I get really scared, so I go outside to walk and breathe, but it's just not going away! Within the hour about 2 more times I feel like I'm losing consciousness. I get really frightened and I think I'm having a heart attack, so I google the symptoms and as I'm reading these symptoms I just get more and more scared. Making it worse. I sent my mom a message on skype saying I thought I was having a heart attack. She heard my symptoms and told me it's probably just an anxiety attack.\n\nAnywho, the dizzyness goes away after about an hour, and I start to calm down, but my heart rate stays up. And this very uneasy feeling in me.\n(I should also say, I had a couple of very slight sips of pre-workout in the morning. Very small sips. I am used to taking caffeine and energy drinks. I dont know if maybe this set it off? But what is funny is this last week and a half maybe? I have been consuming less caffeine than I have in a long time). \n\nWell, since Thursday I have had this constant, uneasy feeling in my chest, like scared and stressed that I am going to have an anxiety attack. It mostly starts about an hour after I wake up. And goes throughout the day till I am exercising or something. \n\nLately I have noticed I have been obsessing like crazy over stuff. Like having to have everything around me perfectly clean. I want to time myself for everything I do. I want to plan everything I am going to do. I want to know how long I am taking for everything I am doing. Like I need a constant flow of information.  I don't know, Its fucking weird. I cant describe it.\n\nI go to the gym every single day. I run a lot. I play adult league soccer. I go rock climbing. I have hobbies. \n\nI have been trying to breathe deep, but it seems like the shortness of breath doesnt go away.\nI checked my pulse right now. I am at about 80bpm but I still have this feeling of an anxious, fast beating heart.\n\nI also sometimes get realllllly depressed. Like just wanting to go to sleep and never wake up. Which for the past couple months I haven't noticed very much , but since thursday i've started to feel like shit again.\n\nAnyway, wish I could give you more detail. Sorry I'm kind of all over the place. Just needed to vent.\n\nIs this anxiety? Or asthma or something else?\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Guys what the heck is this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2nakmd/guys_what_the_heck_is_this/"
        }
    ]
}