{
    "data": [
        {
            "author": "prolific13",
            "author_created_utc": 1359910585,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_agm47",
            "created_utc": 1415318658,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lj1cs/does_anybody_else_here_tear_up_the_skin_on_their/",
            "gilded": 0,
            "id": "2lj1cs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 74,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lj1cs/does_anybody_else_here_tear_up_the_skin_on_their/",
            "retrieved_on": 1441083969,
            "score": 188,
            "secure_media_embed": {},
            "selftext": "Seriously I really can't stop.. The skin on the side of my fingers is just absolutely destroyed and my lips are starting to get pretty bad too. I find I do it mostly when I start to feel anxious and for some reason it's gratifying and it helps curb the panicky anxious feeling. Does anyone else do this too? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else here tear up the skin on their fingers and lips as a weird, but satisfying coping mechanism?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lj1cs/does_anybody_else_here_tear_up_the_skin_on_their/"
        },
        {
            "author": "meowmixiddymix",
            "author_created_utc": 1377498554,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cwb6x",
            "created_utc": 1415140222,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lb1ii/does_anyone_have_anger_bursts_as_part_of_anxiety/",
            "gilded": 0,
            "id": "2lb1ii",
            "is_self": true,
            "media_embed": {},
            "num_comments": 56,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lb1ii/does_anyone_have_anger_bursts_as_part_of_anxiety/",
            "retrieved_on": 1441087759,
            "score": 104,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone have anger bursts as part of anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lb1ii/does_anyone_have_anger_bursts_as_part_of_anxiety/"
        },
        {
            "author": "maybe_sparrow",
            "author_created_utc": 1314086752,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pre1",
            "created_utc": 1415117983,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l9svj/my_coworker_openly_ranted_about_me_to_our_entire/",
            "gilded": 0,
            "id": "2l9svj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l9svj/my_coworker_openly_ranted_about_me_to_our_entire/",
            "retrieved_on": 1441088338,
            "score": 95,
            "secure_media_embed": {},
            "selftext": "I had the door to my office closed yesterday morning to focus on my work, because one of my coworkers was carrying on in the main office space like usual. He generally has some complaint that sets him off and he rants at anyone who will listen, and I've been trying very hard to tune him out. It kept on for a while this time though. I work with my SO so I texted him and asked what coworker was on about. \n\nApparently he was ranting about me. \n\nI just started this job 2 months ago and the creation of my position and a couple others brought a slew of changes to this place, and whilst most people have seemed to adjust, this one particular coworker has not. He takes out his frustration on me by purposely not providing info I need, by expecting me to drop everything and handle his requests ASAP, requiring perfection on my part while not providing the tools for success. He has yelled at me in front of a client, he has also belittled me on the phone to another client. This is a daily occurrence.\n\nYesterday, in front of all of our coworkers, he let it all out to our office manager. About how I'm not like the previous person who was in my chair, in fact I'm the exact opposite. That I am horrible at budgeting my time. That none of his clients are ever happy with my work. And that I personally have cost him nearly $10,000 worth of sales this year.  \n\nI called my boss (who works in the next town over) and told her about it, then packed up my work and had my SO take me home. Everyone just assumed I was sick, how could they not know after witnessing that garbage though?\n\nI don't want to face *anybody* today. I've been at work since 5:45a just to get everything done so I can peace out again this morning as soon as I'm able to. I'm not sure how to go forward from here. \n\nThe worst part is that I'm actually pretty good at my job, and I *do* keep his clients happy whilst somehow putting up with all of his requests. I have no idea what to do. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My coworker openly ranted about me to our entire office while my door was closed. I am dreading everything about work now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l9svj/my_coworker_openly_ranted_about_me_to_our_entire/"
        },
        {
            "author": "IFrieza",
            "author_created_utc": 1410052623,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ia2j5",
            "created_utc": 1414802400,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kxtc0/im_handing_out_candy_despite_having_social/",
            "gilded": 0,
            "id": "2kxtc0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kxtc0/im_handing_out_candy_despite_having_social/",
            "retrieved_on": 1441094049,
            "score": 90,
            "secure_media_embed": {},
            "selftext": "Hurray progress?!?!\n\nEdit: I also have a look of deep resignation in my face.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm handing out candy despite having social anxiety. Not making eye contact though. Too dangerous.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kxtc0/im_handing_out_candy_despite_having_social/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415368152,
            "domain": "self.Anxiety",
            "edited": 1415370188,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lktxc/my_dog_just_died_its_messed_me_up_real_bad_tldr/",
            "gilded": 0,
            "id": "2lktxc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lktxc/my_dog_just_died_its_messed_me_up_real_bad_tldr/",
            "retrieved_on": 1441083132,
            "score": 73,
            "secure_media_embed": {},
            "selftext": "[Quick backstory with pictures](http://imgur.com/a/OCc1q) because I don't feel like repeating the story anymore.\n\nSo if you went through that, the story ends with this, they cut him open and then had an \"Oh shit\" moment when they realized it was far worse than the ultrasound showed. That morning we never thought it would be anything worse than a two night stay at the hospital. We ended up with a dead dog. The infection had returned but this time was much closer to his bloodstream, and they couldn't remove it like before without taking out 80% of his colon. No dog can survive that. He was already half of what he should of weighed. \n\nWe couldn't even let him wake up to pay our last goodbyes. They said it would have been far more merciful to euthanize him while he was still under anesthesia otherwise he'd wake up in a lot of pain from the surgery. Worst phone call ever. \n\n---\n\nIt's been almost two days. He died around 3 PM on the fifth. You know, the thing about this dog is, he loved being around everyone. Giant Schnauzers are reserved by nature, but he was definitely less so than most and after he'd made sure you weren't a \"threat\" which consisted of just a second of barking and then a liiiittle bit of sniffing, he would stick to you like wet cement and follow you around everywhere. It was adorable and maybe a bit annoying at times but in the best way possible. He also loved to please people and give them so much love. \n\nI'm an introvert probably part by nature and part due to my condition. So I preferred a tight circle of small but well-bonded friends, although at times it did get lonely and I was still prone to many moments of severe hopelessness and feeling worthless (still get those, all the goddamn time). He knew, and was always there to be by my side and comfort me. I've long since recanted my faith but at the time I said he was a true gift from God. That he changed my life. He was my best friend and the best dog my family ever had and we've had eight dogs over a period of maybe 25 years. \n\nHe always wanted to be pet. Always made you feel loved and worth something. He was the sweetest boy. And not even three years old when he died. His (very rare variation, I might add) condition was so severe by the time it was finally diagnosed and the full severity of it realized, literally on his deathbed, there would have been no point in trying to keep him alive even if the infection site had been somewhere far less dangerous. He would just have gotten it again and again and again and died to it anyway even if we followed his every single movement and diet intake like an eternal hawk.\n\n---\n\nSince then, I've plunged and hit the grieving process perhaps harder than normal people (however they can actually be referred to...). I didn't cry after the first day, but yesterday I did have a moment where my eyes momentarily filled up in tears during a Skype session with my SO. But... I've all but shut down inside. I don't sleep... I had to take 5mg of melatonin to go with my night pills plus the Xanax I'm weaning off of to even sleep, and then I overslept because of the melatonin and woke up feeling numb and shitty after a dream of my dog being alive and well in the garden. \n\nI don't talk to anyone. Even conversations with my own two parents tend to be short lived. I comfort my mom and she's been crying far more and harder than everyone else which is distressing... she wants him to be alive so badly as we all do. I've stopped being as open with my (LDR) SO of over 5 months, and we had very open communication before my dog died. I think he thinks he's partially to blame because I don't talk much to him anymore and my replies are often distanced and short. I wish I could work up the energy to write long and heartfelt messages about how that's not true as I usually do, and I didn't mind one bit because I knew it was the right thing to do and I liked doing that, but now... I just feel so dead inside that no emotions are ever truly evoked anymore for maybe more than a moment or two. If he reads this: It's not your fault. At all. I promise you this, always and forever.\n\n---\n \nI feel like an even emptier husk of my former self. I stopped eating as much and I already ate little before. I feel anxiety creep up on me now more than ever before, and then that crushing and sinking feeling of utter, muted grief and misery non-stop. I keep remembering my mom getting that phone call about him dying and her bursting in tears, red-faced and saying, \"They say Thor isn't going to live!\" like a horrific scene out of a Sarah McLachlan ad, on an endless and nightmarish loop. Again and again. \n\nI've been up for almost 20 hours and I don't feel tired at all. Bits of my mind would rather I kill myself than let this go on. But the truth is, I never, ever go through with suicide. In fact, I might toy with the thought sometimes but I don't ever plan it out, not one bit. Because... I always want to know whether it'll get better. It got better, when I first got properly diagnosed by a then-new doctor and put on appropriate medication. Then it took another nose dive. Again and again with me failing college and coming home. Then I met my SO. Cue getting better. Then Thor died. Nose dive basically the distance of the summit of Mt Everest to the ground.\n\nI don't know if it'll ever get better, but I'm far too indecisive and inquisitive to let that doubt stop me, oddly enough I let every fucking thing else in my life stop me. I give up a lot and have zero self worth. But I'm still fighting and that's not going to end. \n\nBut it'd sure be a huge help if Thor was healthy and alive. RIP....\n\n---\n\nP.S.\n\nThe old vet sent us flowers at the door saying nothing more than \"[Vet's office] sends our deepest sympathies,\" on the receipt. I hope those heartless POS's get sued one day and have to work at a landfill after having to pay a huge settlement, with flimsy retirement checks later on.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My dog just died. It's messed me up real bad. (tl;dr, sorry)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lktxc/my_dog_just_died_its_messed_me_up_real_bad_tldr/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414996538,
            "domain": "self.Anxiety",
            "edited": 1415076593,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l4z1b/i_havent_left_my_house_in_over_a_month/",
            "gilded": 0,
            "id": "2l4z1b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l4z1b/i_havent_left_my_house_in_over_a_month/",
            "retrieved_on": 1441090651,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "To make a long story short, I haven't left my house since the end of September and at this point I don't know how to get myself to even step out onto my porch.\n\nI've dug myself in a hole here. I don't know what to do. Just the thought of leaving starts to give me anxiety. What do I do?\n\nEdit: Thanks so much for all of you who responded! You've really been so nice. I actually was able to leave my house for just a little while today to go for a walk. I was only gone for about half an hour, but still better than staying inside.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I haven't left my house in over a month...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l4z1b/i_havent_left_my_house_in_over_a_month/"
        },
        {
            "author": "casiokitten",
            "author_created_utc": 1336466295,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7nzjf",
            "created_utc": 1415202465,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ldi6x/im_22_and_still_dont_have_a_drivers_license_help/",
            "gilded": 0,
            "id": "2ldi6x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 70,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ldi6x/im_22_and_still_dont_have_a_drivers_license_help/",
            "retrieved_on": 1441086610,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "I have had anxiety over getting one for as long as I can remember. The classes, the test, the paperwork... it all gets to me. I'm afraid that someone will make fun of me for being so old and not having one. I'm afraid that I will get too nervous during the test. Does anyone else have the same problem? Can anyone help me?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm 22 and still don't have a drivers license. [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ldi6x/im_22_and_still_dont_have_a_drivers_license_help/"
        },
        {
            "author": "Eclectix",
            "author_created_utc": 1381348821,
            "author_flair_css_class": "",
            "author_flair_text": "Did you forget to breathe again?",
            "author_fullname": "t2_dg5y8",
            "created_utc": 1415286008,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lh7kp/bad_news_mass_in_wifes_chest_i_cant_sleep_cant/",
            "gilded": 0,
            "id": "2lh7kp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lh7kp/bad_news_mass_in_wifes_chest_i_cant_sleep_cant/",
            "retrieved_on": 1441084821,
            "score": 62,
            "secure_media_embed": {},
            "selftext": "Like the title said, I'm a mess due to anxiety about a mass that is rapidly growing in my wife's chest. The doctors don't know what it is yet but they think two things are most likely; either it's an extremely rare genetic connective tissue disorder, or it's an aggressive sarcoma. Both of these are bad news, but obviously sarcoma is truly terrible. Since learning this I've been unable to eat more than a few bites, sleep more than a few minutes at a time, or even think about anything else. My stomach hurts all the time and my guts are constantly purging themselves any way they can. All of my usual techniques for dealing with anxiety are proving completely useless. I need to keep it together because she needs me to help her out more than ever. I worry about the kids, I worry about how their lives will be impacted by this. Even if it's the best possible news and it's the genetic disorder, it's still very bad news because it means she will have these large masses growing and causing her more pain all her life, basically making her a complete invalid. But I can't seem to even hope that this is what it is. My brain keeps saying, \"You know it's cancer.\" It's times like this when I really wish I could believe in a higher power and that I could just pray the problem away.\n\nI have been through death before. I've been through life changes before. But she is truly the love of my life and so much more. If she were to die, my stepson would go to live with his dad who barely knows him. So not only would I lose my wife, but my son, too. And my stepson would lose the only family he really knows (myself, his mom, and two sisters) and have it replaced by an absent biological father who doesn't even love him and a new stepmother who already resents him. And legally there is nothing I could do to stop this.\n\nI'm too tired to think straight and my mind just keeps going back to the worst case scenario because that's the only one that's plausible. It's like my brain literally will not allow me to accept the possibility that this might turn out okay somehow. I think I need to find a decent counselor to help me deal with this, but our doctor bills are already too high as it is. FML.\n\nMy wife, by comparison, is obviously worried, but she is still able to smile, and laugh, and so forth. I just don't know how people deal with this sort of thing. What is their secret? I wish I could just turn off the mental anguish.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Bad news, mass in wife's chest. I can't sleep, can't eat, can't think. She's dealing better than me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lh7kp/bad_news_mass_in_wifes_chest_i_cant_sleep_cant/"
        },
        {
            "author": "nhieblogged",
            "author_created_utc": 1415241349,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j82pn",
            "created_utc": 1415242191,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lfoqy/watching_tv_shows_to_deal_with_anxiety/",
            "gilded": 0,
            "id": "2lfoqy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 49,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lfoqy/watching_tv_shows_to_deal_with_anxiety/",
            "retrieved_on": 1441085532,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "If you are struggling with anxiety my advice to you is to watch some comedy tv shows. I find with my own personal anxiety that watching these can take your mind off whatever you are thinking about. It is a good way to relax. \n\nIf you are feeling anxious now hwy not give it try? Check out this two minute saturday night live clip and let your mind feel free on anxiety.\n\nhttps://www.youtube.com/watch?v=Qxtf4kFd2rg\n\nsubscribe to me on twitter @nhieblogged",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Watching TV Shows to Deal with Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lfoqy/watching_tv_shows_to_deal_with_anxiety/"
        },
        {
            "author": "alexallen96",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415032836,
            "domain": "self.Anxiety",
            "edited": 1415065352,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l63mi/my_fear_of_outer_space_is_ruining_my_life/",
            "gilded": 0,
            "id": "2l63mi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l63mi/my_fear_of_outer_space_is_ruining_my_life/",
            "retrieved_on": 1441090124,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "I've always had anxiety issues, and OCD. However my fear of outer space didn't start until I was about 13. I am almost 19 now, and all it has done is got worse.\n\nI can't watch the news because I am afraid something about space will come on the TV and I will become paralyzed with fear. I am not scared of things like human space travel, moon missions, or anything innocent about it. I am obsessed with the unknown, morbid side of space. I can not be unoccupied for long because I feel like vomiting. I missed an entire unit of science in the 9th grade because it was about space, and I would leave class to vomit. I am scared of seeing space stuff on reddit, but the OCD part of me makes myself visit the front page and subject myself to news about space. Then I drive myself crazy. I am at the point now where it is ruining my life. I don't know what to do anymore.\n\nEdit: I am really thankful for all the nice comments, but please do not talk about the fear in detail, because it usually triggers OCD.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My fear of outer space is ruining my life.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l63mi/my_fear_of_outer_space_is_ruining_my_life/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415128252,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ladx4/does_anyone_else_absolutely_hate_going_to_get/",
            "gilded": 0,
            "id": "2ladx4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ladx4/does_anyone_else_absolutely_hate_going_to_get/",
            "retrieved_on": 1441088065,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "I need a haircut pretty badly but I'm absolutely dreading going. I go to the same place every time and it only takes about 5 to 10 minutes. It depends on the girl I get but some will try to chitchat and others don't. I hate going though. My anxiety goes through the roof.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else absolutely HATE going to get haircuts because of social anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ladx4/does_anyone_else_absolutely_hate_going_to_get/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414945180,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l2mor/rant_alone_broke_and_at_the_end_of_my_rope/",
            "gilded": 0,
            "id": "2l2mor",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l2mor/rant_alone_broke_and_at_the_end_of_my_rope/",
            "retrieved_on": 1441091744,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "\nTL;DR My life sucks. I’m lonely, broke and boring. I can’t even kill myself.\n\nUntil a few months ago I didn’t even know what I was experiencing was anxiety. That was a crushing blow, but not as bad as the bipolar II diagnosis a few weeks later. I knew I was different and fearful—extreme and rapid mood swings—but anxiety is the constant in my life. \n\nAlmost a decade after my last girlfriend I've lost all ability to date or relate to people romantically.  I’m attractive, but emotionally unavailable, meek, short and still a virgin. Women intimidate me and I don't know how to touch someone with desire. Hell, I can't even kiss. Being this age and not having any experience feeds into my anxiety and prevents me from going out and meeting people for fear of ridicule. Thus, the cycle continues. Let me point out that I don’t feel entitled to be with anyone; quite the contrary, I would never inflict myself on someone else.\n\nMy terrible loneliness forces me deep inside myself, and I get really cerebral. Over the years I’ve become increasingly disconnected from people. They’re just objects to me—completely theoretical. I try to analyze how they work and emulate that, but I just can’t quite get it. Reading people and feeling empathy is hard. It's too stressful and I'm far too shy to strike up a conversation with a stranger. I convince myself into thinking that the reason I'm single is because I need to \"work on myself,” but, in truth, I have lost all social skills and I'm destined to be alone.\n\nOn top of all this I’m broke:  maxed out my credit card and underneath a mountain of student loan debt (on which my parents cosigned). I’ve had to go crawling to my mother at the end of the month for money to pay for bills and top ramen several times. Pro tip: not eating for a week saves money and keeps you trim. \n\nAs a result of my social and sexual anxiety, I spend most of my time locked in my room and never go out. I’m super boring because a) I don’t go out and be social and b) I can’t afford to do things even if I wanted to. I’ve lost all interest in my field of study and most everything else in my life. I’ve tried hanging myself in my closet a few times, but the financial and emotional burden on my family keeps me from going through with it. Plus, life insurance doesn’t pay for suicide. My financial responsibility keeps me alive, imprisoned in my mind. Oddly enough, my attempts do offer some solace from the torture. I just wish I could be free enough to kill myself.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] Alone, broke and at the end of my rope (literally)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l2mor/rant_alone_broke_and_at_the_end_of_my_rope/"
        },
        {
            "author": "codlink",
            "author_created_utc": 1415045651,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j6nfm",
            "created_utc": 1415046597,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l6v4q/my_generalized_anxiety_follows_me_everywhere/",
            "gilded": 0,
            "id": "2l6v4q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 45,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l6v4q/my_generalized_anxiety_follows_me_everywhere/",
            "retrieved_on": 1441089768,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "I really don't know what posting about this on here is going to do, but I'm trying anyway.\n\nI've had Generalized Anxiety for as long as I can remember. I'm 21 (M) now, but as a child, all the way through school, and presently, my anxiety is and has been so bad that I've found it nearly impossible to function as a normal person. The worst part about it is that my anxiety and stress does not and has not ever gone away, even for a split second. I'm completely and totally exhausted because I honestly do not know what it feels like to be relaxed. I want, more than anything in the entire world, to simply be able to be comfortable. Even when I'm alone in my bed, I'm just stressed out of my mind.\n\nI don't have panic attacks or have my anxiety triggered by anything because it's already there in the first place. It never goes away. I can't even seem to understand what it is that I'm stressed or anxious about. I'm not particularly worried about anything, I don't have an irrational fear of people or going outside or anything like that, I'm simply tremendously uncomfortable at all times.\n\nI've gone to various doctors and gone through numerous medications to no avail. I've also gone to a therapist, and that had no outcome other than strengthening my preconception that talking to a random person that happens to have a degree in the same way that I've talked to dozens of others in the past wouldn't do anything for me.\n\nI really don't know what to do anymore. I'm totally exhausted as a result of my discomfort, and I'm fairly certain that there's nothing that can help me other than finding a way to overcome it in my own mind which, as I'm sure most of you in this subreddit know, can be nearly impossible for someone in this situation.\n\nThank you for your time and for any information you may give.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My Generalized Anxiety follows me everywhere",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l6v4q/my_generalized_anxiety_follows_me_everywhere/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414884343,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l0ozo/a_success_for_me/",
            "gilded": 0,
            "id": "2l0ozo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l0ozo/a_success_for_me/",
            "retrieved_on": 1441092647,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "I just wanted to share this with some people who would understand.  I've had major anxiety about driving and highway driving in particular since totaling my car on the highway in college.  I recently moved to a city where highway driving is unavoidable if you want to have a life, and today I drove on the main highway for half an hour!\n\ntldr: If I can do it, anybody can!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "A success for me!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l0ozo/a_success_for_me/"
        },
        {
            "author": "spectralconfetti",
            "author_created_utc": 1384809491,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dz210",
            "created_utc": 1414919806,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l1wwg/rant_the_root_of_my_insecurity_is_an_aversion_to/",
            "gilded": 0,
            "id": "2l1wwg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l1wwg/rant_the_root_of_my_insecurity_is_an_aversion_to/",
            "retrieved_on": 1441092078,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "I feel like out of anybody in my family, I'm the most acutely aware of the passive aggressive ways that my dad displays his perfectionism. On a surface level he's kind and generous, but behind it I can always tell when things aren't going the way he thinks they \"should\" be going. At the same time, he pours undue praise on me on an almost consistent basis. I think in a sense he means to be compassionate, but in my head it just means he sees me in a way that is disconnected from reality.\n\n\nI can't live up to the perfect version of me that he sees, so I disconnect myself from reality toward a feeling of self hatred. I never let myself fully live in the moment, and I avoid high risk situations while letting my life degrade because my stress problems were never really noticed by my dad. Some of my worst memories, and really the reason I try not to remember my childhood is the way he behaved when teaching me to ride my bike. I was a bit slow to learn it and when I failed he berated me until I cried. So yeah, I really try to distance myself from family because of that. I have a serious trust problem with the closest people in my life because I fear that type of treatment.\n\n\nI feel like my life is constantly spiralling down, and I'm completely alone because nobody picks up on it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] The root of my insecurity is an aversion to being seen as a failure by my perfectionist father.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l1wwg/rant_the_root_of_my_insecurity_is_an_aversion_to/"
        },
        {
            "author": "JustMandie",
            "author_created_utc": 1413224146,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iu8pb",
            "created_utc": 1414780830,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kwqn8/3_immediate_ways_to_reduce_anxiety_that_work_for/",
            "gilded": 0,
            "id": "2kwqn8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kwqn8/3_immediate_ways_to_reduce_anxiety_that_work_for/",
            "retrieved_on": 1441094551,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "1. Go to the nearest bathroom and take a few deep breathes \n2. Right after shrink all of my body muscles for 20-30 seconds and let go all at once\n3. When I face stressful situations like social gatherings I think of a funny character (usually from the daily show, it makes me laugh) and I think about the stressful situation from the character perspective - the same voice, the same gestures. It take a few seconds and suddenly the stressful event seem to be very funny.\n\nWhat are your ways?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "3 immediate ways to reduce anxiety that work for me",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kwqn8/3_immediate_ways_to_reduce_anxiety_that_work_for/"
        },
        {
            "author": "Boobipede",
            "author_created_utc": 1374624637,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_chlsi",
            "created_utc": 1414967821,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l3q74/feeling_extremely_lonely_but_unable_to_meet_new/",
            "gilded": 0,
            "id": "2l3q74",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l3q74/feeling_extremely_lonely_but_unable_to_meet_new/",
            "retrieved_on": 1441091231,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "Hey, first time posting so sorry if my thoughts are a bit jumbled.\n\nI'm currently going through one of the most lonely periods I've ever experienced in my life. I'm currently studying at university, 20 years old, male, and when I started university I had a fair few friends who I could mutually rely on for fun, support and general happiness. Over the last couple of years we've all kind of separated, they've all gone their own way, they've jumped into relationships or made friends with different groups of people.\n\nI've always found it extremely tough to talk to new people. I don't know what to talk about with them. I've never fully grasped the idea of bonding with someone when you have NO idea what they're into, what they're like, how they are as a person... normally I get a few minutes into the conversation, start panicking that I'm making a poor first impression, and high-tail it out of there before I fuck up. I used to be able to talk to people quite freely at parties (alcohol enabling me to become more confident/re-assured) but for the last half a year I've spent most parties lingering in the corner quietly drinking while everyone else does their own thing. It doesn't help that my crippling self confidence with my body leaves me feeling horribly aware of how unattractive I must seem to other people while talking to them.\n\nAt the moment I have one friend. And he's dealing with diagnosed depression, so he has his own issues to deal with; it wouldn't be fair for me to force him into hanging out with me 24 hours a day.\n\nI was just wondering if you guys have any advice on just... diving into things and meeting people? Making friends? I'm not even interested in meeting someone who could be more than a friend; I'm just wanting people who I can talk to. People who I can feel comfortable around. People who don't make me feel like I have a lead weight in my stomach while I'm talking to them.\n\nSorry again if any of this seems inappropriate for the subreddit, I'm just trying to find advice where I can get it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feeling extremely lonely, but unable to meet new people.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l3q74/feeling_extremely_lonely_but_unable_to_meet_new/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1415100710,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l942f/help_fear_of_phone_calls_and_text_messages/",
            "gilded": 0,
            "id": "2l942f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l942f/help_fear_of_phone_calls_and_text_messages/",
            "retrieved_on": 1441088659,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "I don't know if this is the right subreddit, but I saw a couple of people asking for advice on their anxiety-related fears so I though I might give it a try. \n\nI am terrified of receiving phone calls and texts. I'm not afraid of the content of those(since it's friendly most of the time), but rather of the phone ringing in the first place. I already know the reasons why this happens to me: it all begun two years ago, when I received a call in the middle of the night by my uncle's wife who told me his husband had an accident with his motorcycle and died on the spot. That call was so messed up (people crying in the background, a child - I presume his daughter - screaming, and my uncle's wife had such an unsettling tone to her voice) and I felt like crap. Then I started receiving phone calls from my parents who wanted to either get it off their chest with me (I was very close with them, I used to call them every day) or to simply say 'sorry for your loss'. Since then, I associate phone calls with death. Every time I hear the phone ringing while I'm having a shower, I must shut the water off and listen to my mother answering the phone to make sure no one died. I know, it's messed up.\n\nThis is getting worse every day, and now I have a new reason to be afraid of phone calls. I have a very small legal problem opened up (my post office didn't send my money to a business I bought something from, so now they want my money + taxes even though I already payed), and I'm trying to solve it. However, me being relatively young (19) and ignorant about this subject, every time I get called by the credit recovery agency I feel like shit. My father is a complete ignorant, even more than me, and my mother doesn't really want to be bothered by it, so I'm left dealing with them on my own. They are rude and they call every night, so much that I basicly keep the phone on my hand waiting for them to call and I spend hours thinking about the best way to phrase my response. \n\nThis is getting overwhelming. I can barely sleep if my phone is anywhere inside my room, and I don't know how to help it. Has anyone experienced the same?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] Fear of phone calls and text messages.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l942f/help_fear_of_phone_calls_and_text_messages/"
        },
        {
            "author": "__kaisersalad",
            "author_created_utc": 1373283734,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cawli",
            "created_utc": 1414794554,
            "domain": "self.Anxiety",
            "edited": 1414840965,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kxgsr/idea_selfacceptance_subreddit/",
            "gilded": 0,
            "id": "2kxgsr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kxgsr/idea_selfacceptance_subreddit/",
            "retrieved_on": 1441094212,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "Hi guys. I notice a lot of people here seeking to change or trying to suppress or remove what they're going through. I know for me and a lot of others anxiety comes from a constant feeling of inadequacy compared to other people, which external factors do very little to shift. \n\nI want to start a subreddit based on self-acceptance, discussing resources and ways in which people are learning to be okay with themselves. I know there are a lot of mental health and improvement subreddits, but many of them focus changing oneself or learning to stop embracing who you are. The closest I think of would be r/meditation, but that already has a very specific focus. \n\nI would love to hear what people think. I'll probably xpost this to other related subreddits. \n\nEDIT: r/acceptyourself has been created. I'm pretty busy with work right now but I'll get on making it a bit more substantial. If anyone's keen on modding, message me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "idea: self-acceptance subreddit",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kxgsr/idea_selfacceptance_subreddit/"
        },
        {
            "author": "theduggs",
            "author_created_utc": 1266477015,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3w5x3",
            "created_utc": 1415215927,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2le96a/does_anyone_else_deal_with_anxiety_when_it_comes/",
            "gilded": 0,
            "id": "2le96a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2le96a/does_anyone_else_deal_with_anxiety_when_it_comes/",
            "retrieved_on": 1441086260,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I have a general anxiety disorder, but a lot of my fear lies in the fact of certain events. I have passed out a few times in my life during blood work (yes I as lying down) but the way my mind works, I just build it up so much. Anyone have similar situations or have any tips with dealing with it? \n\nThanks. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else deal with anxiety when it comes to needles and blood tests?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2le96a/does_anyone_else_deal_with_anxiety_when_it_comes/"
        },
        {
            "author": "alreadyreddit1",
            "author_created_utc": 1386625616,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_e9xu9",
            "created_utc": 1415240490,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2lflt6/i_need_a_job_but_i_get_anxiety_whenever_i_even/",
            "gilded": 0,
            "id": "2lflt6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2lflt6/i_need_a_job_but_i_get_anxiety_whenever_i_even/",
            "retrieved_on": 1441085570,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I'm 17, still in college, and i need a job, the problem is i have severe anxiety when ever i even think about a job, i just can't bring my self to apply for one. I mean it's not like i don't want a job, i really do, but whenever i think about working with new people doing things that i'm likely going to fuck up, i feel so stressed and anxious about it. Has anybody else felt like this before and overcome it ?, because i could really use some help right now.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need a job, but i get anxiety whenever i even think about it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2lflt6/i_need_a_job_but_i_get_anxiety_whenever_i_even/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414857430,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kzfiu/i_tried_to_open_up_to_a_friend_once_except_they/",
            "gilded": 0,
            "id": "2kzfiu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kzfiu/i_tried_to_open_up_to_a_friend_once_except_they/",
            "retrieved_on": 1441093235,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I tried to open up to a friend once, except they kinda ignored the issue and did not take me seriously. I ended up feeling a whole lot worse and alone. How do you approach people about this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kzfiu/i_tried_to_open_up_to_a_friend_once_except_they/"
        },
        {
            "author": "Titostakedowns",
            "author_created_utc": 1409371490,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i47f2",
            "created_utc": 1415036108,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l69y0/interview_tomorrow_at_walmart_first_job_in_6years/",
            "gilded": 0,
            "id": "2l69y0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l69y0/interview_tomorrow_at_walmart_first_job_in_6years/",
            "retrieved_on": 1441090042,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Finally got brave enough to put in an application for a job, any job. I'm scared to death. What should i wear? just slacks and a long sleeve shirt? Its just regular job, not a manager position or anything special. help :( What type of stuff are they going to ask and how should i answer about my lack of work in the last 6 years ?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Interview tomorrow at Walmart, first job in 6years, what to wear?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l69y0/interview_tomorrow_at_walmart_first_job_in_6years/"
        },
        {
            "author": "fighter4u",
            "author_created_utc": 1296284033,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4s29y",
            "created_utc": 1414881141,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l0jwf/so_anyone_ever_end_up_in_a_situation_where/",
            "gilded": 0,
            "id": "2l0jwf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l0jwf/so_anyone_ever_end_up_in_a_situation_where/",
            "retrieved_on": 1441092712,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "Because that pretty much my situation at the moment, I'm fine around everyone but this one person, who I like, she likes me, but anxiety doesn't have to make sense. So it ends up being hard for me to say more than hi, noting comes to me. \n\nI basically end up acting exactly as someone would if they were mad at someone, and wanted to ignore them. \n\nHow do people cope with the anxiety? I find if I smoke weed, I am out of my head and fine with talking and doing whatever. But that it. \n\nHas anyone ever phase a statement in such a way to clear up confusion, without revealing they have anxiety?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So anyone ever end up in a situation where someone thinks you are mad at them, when really it just your anxiety kicking in when you are around them? If so, what did you do about it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l0jwf/so_anyone_ever_end_up_in_a_situation_where/"
        },
        {
            "author": "my_anonymous_reddit",
            "author_created_utc": 1415066464,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j6uhd",
            "created_utc": 1415068719,
            "domain": "self.Anxiety",
            "edited": 1415103412,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2l81e0/this_is_a_new_username_specifically_created_for/",
            "gilded": 0,
            "id": "2l81e0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2l81e0/this_is_a_new_username_specifically_created_for/",
            "retrieved_on": 1441089160,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I didn't know I had GAD when I started going to therapy - I always just identified myself as \"an over thinker.\" And I wasn't always that way. I used to be outgoing and comfortable in my own skin. Maybe someday I'll get into where I think my anxiety started.\n\nBut I DID go to therapy for what I thought was Seasonal Affective Disorder (which it turns out I do experience), and through many conversations with my therapist have also realized that I also experience GAD.\n\nIn the past three years, I have:\n\n* Started dating a girl out of college\n* Got a job at what I thought was my dream company in a field that I love\n* Bought a house\n* Moved in with my girlfriend\n* Adopted two dogs while living with my girlfriend\n* Been cheated on by my (ex) girlfriend\n* Become fixated on my manager as a source of my problems\n* Become fixated on budget tweaking\n* Become fixated on eliminating debt\n* Become fixated on selling my home\n* Listed my home for sale\n* Surrendered my two dogs (Couldn't afford any rental that would allow two APBTs)\n* Started interviewing for new jobs\n\nThose last three bullet points - selling my home, surrendering my dogs (or at least coming to terms with the fact that I would need to surrender them) and interviewing for jobs I decided to take on simultaneously. That was a poor decision for an over thinker (or as I now know, for someone that experiences GAD) and almost led to a complete breakdown. \n\nIt DID lead me to potentially ruin a relationship that was in it's early stages with a fantastic woman that I still can't stop thinking about (side note - read receipts on text messages are the fucking worst when other people have the AUDACITY to respond in their time rather than mine. I feel like many here will know what I'm talking about.)\n\nI don't know exactly what my point is other than the worst of my depression and anxiety have been experienced over the last couple years, and the decision to go to therapy has been one of the best things I've ever done.\n\nI've been AMAZED at how freeing it was for me to simply have a doctor say \"Yep, you have generalized anxiety, and that's OK.\" I still struggle with it ALL THE TIME, every day, but being aware of it, allowing myself to feel anxious, joking about it, all of these things have made such a difference beyond just calling myself \"an over thinker.\"\n\nTherapy is the best thing I've ever done for myself.\n\nAnd I still am terrified to talk to my family about it.\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This is a new username specifically created for this sub. I've still written, deleted, and rewritten this post 4 times.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2l81e0/this_is_a_new_username_specifically_created_for/"
        }
    ]
}