{
    "data": [
        {
            "author": "307148",
            "author_created_utc": 1380225776,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_danjb",
            "created_utc": 1414433155,
            "domain": "self.Anxiety",
            "edited": 1414470051,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2khgly/i_know_its_irrational_and_not_true_but_i_cant/",
            "gilded": 0,
            "id": "2khgly",
            "is_self": true,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2khgly/i_know_its_irrational_and_not_true_but_i_cant/",
            "retrieved_on": 1441101827,
            "score": 183,
            "secure_media_embed": {},
            "selftext": "I have a huge fear of criticism and rejection. I have a small group of friends and we do things together on a regular basis, but I'm constantly afraid of losing them or being rejected by them. I keep these feeling inside because I don't want to be seen as clingy or creepy, but when we're in a group of more than 3 people it's hard for me to bring myself to speak and contribute to the group conversation, because I don't feel like what I have to say is important. And when I do feel the courage to add to the conversation, they just keep talking amongst themselves as if they didn't hear me, which makes me feel even worse about myself.\n\nI also have some depression-related issues and there are lots of times I just want someone I can talk to, but I can't because I don't want to impose my problems on them. I'm afraid that I will bother them if I tried to talk to them about my condition. But at the same time, it would be nice to have someone in my life that I knew supported me.\n\nI know my thoughts are irrational and that my friends probably do like me and care about my problems, but I have a hard time seeing myself as someone worth loving and being around. People compliment me sometimes, but I can't truly accept it because I don't see myself as good. And right now this is really affecting my ability to study and do well in school, as well as my overall confidence in myself.\n\nI want to change, but I don't know how. I'm currently in group therapy at my university, but I don't feel like it's helping me any because other people in the group dominate the conversation and I am too shy to talk about my personal problems with people I barely know, as I feel my problems are stupid and will make me look bad. I want to start individual therapy again, but my university's mental health center is currently backlogged and has a waiting list of 40+ people waiting to see therapists, so I think that treatment is out of the question. Is there anything else I can do to learn how to accept myself? I feel stupid talking about this, but I'm sick of all this self-loathing and inner turmoil. I just want to feel like I'm a normal person.\n\nEDIT: My roommate just called me and asked me if I wanted to meet him at a bar and hang out with him and his friends. I want to, but meeting people I don't know in an atmosphere like that of a bar really triggers my anxiety. I hate being so afraid of stupid crap like this.\n\nEDIT 2: Thanks for all responses. I will try to read through them all in the morning.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I know it's irrational and not true, but I can't shake the feeling that I'm a horrible person and everyone secretly dislikes me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2khgly/i_know_its_irrational_and_not_true_but_i_cant/"
        },
        {
            "author": "giant_enemy_spycrab",
            "author_created_utc": 1323396375,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ehlz",
            "created_utc": 1414096818,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k4prd/anybody_get_into_a_procrastination_feedback_loop/",
            "gilded": 0,
            "id": "2k4prd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 80,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k4prd/anybody_get_into_a_procrastination_feedback_loop/",
            "retrieved_on": 1441107774,
            "score": 178,
            "secure_media_embed": {},
            "selftext": "What ends up happening is:\n\n1. I have work to do.\n\n2. I get anxious about said work.\n\n3. The anxiety makes me lose focus on the work.\n\n4. I get anxious about the fact that I'm not doing the work.\n\n5. Repeat 2-4.\n\n6. Give up on work because I can't focus.\n\n7. Become more anxious because now I'm not even trying.\n\nThis is a huge problem I've been having lately. Has anyone else had the same problem? Do they know what to do about it?\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anybody get into a procrastination \"feedback loop\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k4prd/anybody_get_into_a_procrastination_feedback_loop/"
        },
        {
            "author": "BGoldringer",
            "author_created_utc": 1387058890,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ecttl",
            "created_utc": 1414170775,
            "domain": "self.Anxiety",
            "edited": 1414195938,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k7nh1/successful_grocery_trip/",
            "gilded": 0,
            "id": "2k7nh1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k7nh1/successful_grocery_trip/",
            "retrieved_on": 1441106404,
            "score": 98,
            "secure_media_embed": {},
            "selftext": "Today was the first time in a couple of years where I went grocery shopping and didn't have a single episode! I bought all my food effortlessly. It feels amazing. My food even tastes better! \n\nEdit:\nYOU GUYS! This was my FIRST post on here and I get all this feedback?! This is wonderful :) Tonight I was also faced with a situation and I'm still surprised how well I handled myself. The little things do make a difference in this sub it seems. What a wonderful community I plan to look forward to checking to each time I log on :)\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Successful Grocery Trip!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k7nh1/successful_grocery_trip/"
        },
        {
            "author": "SSRIGuy",
            "author_created_utc": 1410777721,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ieq5w",
            "created_utc": 1414021972,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k1nvm/drugs_are_great_mkay/",
            "gilded": 0,
            "id": "2k1nvm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 54,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k1nvm/drugs_are_great_mkay/",
            "retrieved_on": 1441109259,
            "score": 90,
            "secure_media_embed": {},
            "selftext": "I used to search Reddit for anxiety/depression success stories, so I thought now that I'm on the uphill slope I should share mine.\n\nI also want to share my story because there is a bit of an 'anti-SSRI' bias on Reddit which I know stopped me from taking medication when It shouldn't have.\n\nI started getting really bad bouts of depression/anxiety over two years ago, sparked by the death of a friend. Looking back, I had always been a bit 'up and down' with my moods for no reason, but it was following this period of grief that I started to really go down hill.\n\nI had the usual symptoms: thinking about death a lot, constant generalised anxiety, constant rumination of bad things that were to happen. I also had some unique concerns: I was overly preoccupied with my relationship. I would obsess for days about whether I loved my boyfriend, whether I was attracted to him and whether or not I should break up with him. I essentially fit that 'Relationship-OCD' pattern to a tee.\n\nHaving read about all the studies indicating that for 'mild' depression/anxiety SSRIs are no better than a placebo, and reading a lot of horror stories online, I decided that CBT and meditation would be how I would beat this thing. \n\nI saw two therapist for about 8 months. They were nice, but beyond the typical CBT technique I don't think I gained much insight from the process. I was able to recognise bad thought patterns, 'let them happen' but for some reason that didn't help ease the anxiety nor make the anxiety more tolerable. Meditation was also nice, in those moments of meditative trance I was calm, but as soon as meditation ended so did the calm.\n\nThis went on for two years, and to great detriment to my relationship and my personal view of life. It hit a critical point where I had to do something drastic, so I went to my doctor  and was prescribed 20mg Citalopram (Celexa).\n\nThe first three weeks on it were pretty shit: tired all the time, feeling drugged out and not really feeling much of a benefit.  However, the side effects went away. It was really only after I was on it for 2 months or so that I started to notice a benefit.. very gradually though.\n\nBecause the change was so gradual, I actually had to stop and take notice before I realised how much of a benefit it has been. I no longer needlessly worry about my relationship, I no longer lie awake obsessing about death, I no longer feel ridiculously worried about every little thing. It has completely transformed me! I can honestly say this is the best I've felt in over 2 years, and I owe it all to these drugs! \n\nHonestly, the ongoing side-effects have been pretty minimal. It will effect your sex life, but I imagine not in the drastic way that most people on Reddit suggest. Really all it has meant for me is that I need a little longer (say 5 minutes longer) of 'warm up' before anything. \n\nSo here is my advice: if therapy isn't working or you have a family history of the illness (which I did) give medication a shot! \n\nHopefully this story will help someone. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Drugs Are Great, M'kay!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k1nvm/drugs_are_great_mkay/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414350726,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ke3x3/so_this_is_what_its_like_to_not_have_anxiety/",
            "gilded": 0,
            "id": "2ke3x3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ke3x3/so_this_is_what_its_like_to_not_have_anxiety/",
            "retrieved_on": 1441103390,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "I've had anxiety problems my whole life. I always felt like I had too much adrenaline in my body. Thrillers and jumpscares always scared the shit out of me. My brain was constantly racing with thoughts and ideas. I had a low tolerance for conflict and I had a hard time making eye contact and/or getting my thoughts out under pressure. \n\nBut, I was a creative person. I could write, play music and have some quasi original thoughts. I was also funny, because having an always on mind helped me come up with humorous and novel insights that my peers enjoyed. I felt a need to make jokes all the time because social anxiety was another gift I had. To get over being nervous or anxious I would put on a show for my friends. I was great at trivia and other games that require a quick response. My brain was an efficient machine, and it enjoyed being distracted as an escape from anxiety. Constant movement (mental and physical) was one of my best coping mechanisms.\n\nDid you notice I'm speaking in the past tense? I've been on zoloft and buspar for 4 months along and it has worked. I can no longer access the anxious part of my brain. It is behind a locked door. \n\nWhat a relief it is not to be worried all the time. But I've also lost that mental drive I used to have. I can still get things done, but I find myself lacking motivation to do the things I used to feel I had to do. I had to play music because it was such a great escape for me, but I don't get the same feeling now when I perform. I used to practice 4-5 days a week, I picked up my guitar for the first time in a month today. I used to write and blog about ideas I was passionate about. But now I feel a greater degree of \"meh\", or indifference. I used to go on hikes and felt great afterwards, but I feel pretty ok all the time and can't find the motivation to get out anymore.\n\nIn short, I am cured, it worked, anxiety conquered. I hope you will all find an effective treatment someday, but none of them are without cost. Part of your personality, maybe parts you enjoy, will be affected. Messing with brain chemistry isn't a subtle approach to solving any problem.\n\nI will say that this experience has shaken my belief in free will. I can make choices now that I couldn't make when I had anxiety. I can engage in really long social gathering and meetings without feeling the need to leave or get up all the time. I have more of an attention span to get through projects and boring detail work. Where before I was more of a creative force for new ideas, and left the details up to others. I can handle conflict better than before. Getting yelled at used to make my heart race, but now I just stare at the person and think about my response. \n\nIs it worth it? I think so. Not having that feeling of unease and anxiety in my back and shoulder and legs is wonderful. But I wonder if I will be passionate about the things I used to enjoy, or if I will find a new way in life. Thanks for listening.\n\nTLDR- Anxiety cured for now, but I am a different person.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "So this is what it's like to not have anxiety. Zoloft, lethargy and trading creativity for indifference.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ke3x3/so_this_is_what_its_like_to_not_have_anxiety/"
        },
        {
            "author": "Leivroo",
            "author_created_utc": 1414240873,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j1g12",
            "created_utc": 1414243199,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ka823/my_sister_is_sucking_the_life_out_of_our_whole/",
            "gilded": 0,
            "id": "2ka823",
            "is_self": true,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ka823/my_sister_is_sucking_the_life_out_of_our_whole/",
            "retrieved_on": 1441105204,
            "score": 68,
            "secure_media_embed": {},
            "selftext": "Hi, I apologize for the rant and hope that it does not upset anyone. My adult sister has had so many problems her whole life and I am just flat out sick of it and have no idea how to approach her anymore.\n\nShe has had and still has an eating disorder. It seems to swing from anorexia to bulimia.  She has attempted suicide several times and been sectioned for it. Every time she has taken a lot of pills then immediately told someone and been taken to hospital. \nShe has anxiety attacks and general anxiety. She can't start or hold a conversation with anyone other than her friends. I have been married for ten years and she has never, ever even said hello to my husband. \n\nShe mooches off everybody because she is too anxious to get a job. Currently she lives with our very ill, elderly father and has him driving her about all over and buying her things. If she does not get her own way over anything then she threatens to kill herself. When she does speak to me she is passive aggressive, if I call her on anything she becomes openly aggressive. Due to her 'illness' she believes that the whole family should accommodate her over every little thing. \n\nMy dad is a shell of a man because he is constantly frightened of what she will do. She is vile to him (somehow her anxiety disappears and she can be a bitch to him). She goes out drinking with her friends (she has two odd friends that also have eating disorders) then calls my dad at 2am to come and get then from the club. How come she is not anxious in a night club or bar?\n\nShe is seeing a dietitian once a week, a psychologist once a week and a councilor once a week. Every week. Up till now she has had everyone's sympathy and support. She has no idea how I am beginning to feel. \n\n   I think that she is an attention seeker. I think that the anxiety thing is a cop out to avoid working. She makes a huge big deal about 'her pills' and leaves them lying around so people can see them. She announces  new illnesses all the time and is always harping on about 'triggers'. She is 'wiser' than everyone else because of her 'terrible life'.\n\nI love her but how much can we take? Why is her health more important than everyone else's? She is literally killing my father (our mother died a long time ago), my youngest sister moved out at age 17 because she could not take it anymore, my brother never visits and I feel unwelcome in my family home (which i part own).\n\n I am so frustrated.  I just don't see her ever getting better and I'm struggling to differentiate between somebody who has a mental illness and somebody who is acting like an asshole. How do you call somebody like this on their behavior? Her illness has become a get out of jail free card and I'm sick of it.  How do I approach her with out becoming the bad guy?\nSorry for the huge rant :-(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My sister is sucking the life out of our whole family and I don't know how to talk to her about it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ka823/my_sister_is_sucking_the_life_out_of_our_whole/"
        },
        {
            "author": "DrizzlyEarth175",
            "author_created_utc": 1363884443,
            "author_flair_css_class": "",
            "author_flair_text": "Phobic Anxiety + Panic Disorder",
            "author_fullname": "t2_b1140",
            "created_utc": 1414387166,
            "domain": "self.Anxiety",
            "edited": 1414419175,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kft4v/a_thing_i_wrote_a_long_while_ago_during_an/",
            "gilded": 0,
            "id": "2kft4v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kft4v/a_thing_i_wrote_a_long_while_ago_during_an/",
            "retrieved_on": 1441102598,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "It's going to be okay, love. \n\nI promise you that.\n\nLet your breaths go, slowly now. \n\nFeel the air travel in\n\nand out \n\nand in\n\nand out\n\nTake your own advice and don't die\n\nOr at least try to convince yourself you're going to live for another 60 or 70 years. \n\nCan you do that for me, love? \n\nYour own thoughts are not your enemies. \n\nThey're gifts given to you by your brain so take them into your heart as if they were blood\n\nLet them fuel you\n\nNot control you\n\nYour life is going to exist for longer than this phase goes on\n\nYou're gonna see the next few weeks after this \n\nYou always do \n\nRemember?\n\nJust please feel safe inside yourself, will you, love?\n\nFeel comfortable in your own skin because yours is particularly soft\n\nDon't worry about the petty intrusive thoughts that cripple you day and night\n\nLet your mind free itself\n\nThey can't control you\n\nThey Can't Control You\n\nThey CAN'T control you\n\nThey CAN'T CONTROL you\n\nthey CAN'T CONTROL you\n\nthe- CAN'T CONTROL yo-\n\nt CAN'T CONTROL y\n\nCAN'T CONTROL\n\nCAN'T CONTROL\n\nCAN'T CONTROL\n\nDEAR GOD SOMEBODY PLEASE HELP ME \n\nTHEY CAN'T CONTROL ME\n\nI CAN'T CONTROL THEM\n\nDEAR GOD PLEASE \n\n\n\nThey can't control you, love. \n\nIt will be okay. \n\n\nI promise. \n\nPlease. \n\nJust believe me. \n\nYou're just a touch of crazy. \n\nThat's all. \n\nIt's okay. \n\nIt's okay. \n\nIt's okay. \n\n\n\nNO\n\nI'M DEAD\n\nI AM GOING TO DIE\n\nI WILL NOT LIVE TO SEE TOMORROW\n\nDEAR GOD SOMETHING MUST HAVE GONE WRONG\n\nHELP ME\n\n\n\nIt's okay, old friend. \n\nDon't sob. \n\nYou're gonna be okay, my love. \n\nI promise. \n\nI promise.\n\nI fucking promise. \n\nLet each breath go, slowly now. \n\nIn \n\nAnd out\n\nin\n\nout\n\nin\n\nout\n\nin\n\nout\n\n\nin\n\n\n\nout\n\n**Edit:** Formatting.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A thing I wrote a long while ago during an episode of severe anxiety. I believe I wrote this while having a severe panic attack.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kft4v/a_thing_i_wrote_a_long_while_ago_during_an/"
        },
        {
            "author": "eglisedematisse",
            "author_created_utc": 1378929939,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_d42ps",
            "created_utc": 1414500790,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kkb6d/run_down_of_day_surgery_and_general_anaesthetic/",
            "gilded": 0,
            "id": "2kkb6d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kkb6d/run_down_of_day_surgery_and_general_anaesthetic/",
            "retrieved_on": 1441100412,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "I wanted to write down my experience of my operation yesterday for anyone who might have something similar coming up and searched this subreddit for reassurance. I couldn't find many posts from British hospital experiences so just wanted to put this here in case it helps anyone!\n\nYesterday I had a General Anaesthetic to remove a cyst in day surgery and I have to say, I was absolutely taken aback by how easy and non terrifying the process was. I had been suffering really awful anxiety in the run up to it, and the fact that the NHS don't tend to give you a lot of information beforehand meant I had googled away and focussed on all kinds of complications and side effects. \n\nIt went like this: I went in at 7.30am and sat on a little ward with around 8 other women. A nurse came around and ran through some basic questions and did my general obs. Then the anaesthetist came around to see me. He was great, immediately reassuring me as I explained my many fears. As it wasn't going to be a long operation I only had to have a soft little tube just at the opening of my throat - no tube into my lungs. He also said that he would give me an anti sickness medication before I came round, and that it wouldn't make me feel woozy or sleepy. \n\nThen the surgeon came around and explained exactly what she would be doing and answered a few of my questions. \n\nAt about 10am I changed into a gown and got on the bed to be wheeled over for surgery. I panicked a tiny bit at this point and cried a little, but the nurses were fantastic, chatting away and distracting me. In a side room I had a canula inserted by a student doctor. She got it first try and I felt next to nothing. The anaesthetist let me know that he was first giving me a little something to make me relaxed. I told him I was terrified of sedation but he reassured me it was very gentle - more like a large glass of wine, and he was right. I had been worried about the proposition of a pre-med (lots of people in the US mentioned this) I'm not a massive fan of sedatives, and envisioned sitting on a ward freaking out on ativan. But this was 30 seconds of very slight relaxation right before I was put under. The lovely nurse held my hand and I have no memory of the actual anaesthetic going in. \n\nThe next thing I remember is waking up in recovery. This was the part that I'd lost the most sleep over beforehand. But I was really pleasantly surprised. I have a vague memory of the soft airway tube coming out and then I was completely awake. No disorientation, no grogginess, no sickness. I was immediately aware of where I was and what had happened. I wasn't in any pain and didn't feel strange at all. \n\nThe nurse wheeled me back and I hung out on the ward and drank tea and ate biscuits for an hour or two. The surgeon came back around and explained what she'd found and what to expect from the healing process. After another set of obs from the nurse I went on my way around 2pm and my mum drove me home. I felt completely normal and relieved.\n\nPain has been very minimal and controllable with paracetamol and ibuprofen. This morning I woke up with a slight headache but nothing worse. \n\nSorry for the incredibly long post. I know this is a slightly niche area, but I just wanted to post because if I'd have known more what to expect beforehand I would have been able to deal with the horrible anticipation anxiety so much better. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Run down of day surgery and General Anaesthetic at an NHS (UK) hospital for anyone anxious about it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kkb6d/run_down_of_day_surgery_and_general_anaesthetic/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1413946146,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2jyfsc/does_anyone_else_feel_like_their_life_isnt_bad/",
            "gilded": 0,
            "id": "2jyfsc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 59,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2jyfsc/does_anyone_else_feel_like_their_life_isnt_bad/",
            "retrieved_on": 1441110764,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "This question is kind of based on very brief previous experience I've had with counseling. \n\nI basically feel like I don't suffer enough to go to therapy. I'm pretty sure I have some kind of anxiety issue that's gotten worse, but I still feel as though a therapist wouldn't take me seriously. \n\nThe last time I went to a free counseling session at my school, I started crying before we even got into the room. The next time, a week later, I felt okay and seemed normal, so the counselor told me I was fine and I didn't need to go back. She also told me shit about how the lunar cycle affects my mood and I really just felt uncomfortable sharing things with her. \n\nMy boyfriend recently suggested that I seek therapy because I have a lot of trouble expressing myself and I've gone through phases of self-harming, but I feel stressed out and doubtful knowing: A) What if I really don't need therapy and I just look like I'm seeking attention? B) I have too much trouble explaining my feelings or their reasoning. \n\nDoes anyone else feel this way?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone else feel like their life isn't bad enough to go to therapy?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2jyfsc/does_anyone_else_feel_like_their_life_isnt_bad/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414216878,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k9mho/anxiety_from_getting_ready_for_thingsapproaching/",
            "gilded": 0,
            "id": "2k9mho",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k9mho/anxiety_from_getting_ready_for_thingsapproaching/",
            "retrieved_on": 1441105484,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "Normally my anxiety stems from \"getting ready\" for things for example when I have to catch a train or bus, the waiting period before tends to give me anxiety with physical symptoms. Or like before going to a class/lecture, walking to uni will give me similar anxiety. \n\nI also find this is the case before meeting someone/going out with friends/seeing family at weekends if I do muster the courage to catch the train back home. I can feel all my friendships and relationships vanishing. I'm a flake now. \n\nSorry if this is confusing but I can't bring myself to get out of bed on time mosts days, some I won't leave my bed/room at all. I have depression too, so this combination of not wanting to leave my room/bed and the anxiety of approaching things in time is really hitting me hard.\n\nWas just wondering if anyone else had any tips/similar experiences with this. If not I guess this is just a rant. Thanks for reading anyway.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anxiety from getting ready for things/approaching events/places?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k9mho/anxiety_from_getting_ready_for_thingsapproaching/"
        },
        {
            "author": "Anxietydespondant",
            "author_created_utc": 1414499816,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j350j",
            "created_utc": 1414500175,
            "domain": "self.Anxiety",
            "edited": 1414532153,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kkacy/anxiety_has_caused_my_friends_to_drift_my_grades/",
            "gilded": 0,
            "id": "2kkacy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kkacy/anxiety_has_caused_my_friends_to_drift_my_grades/",
            "retrieved_on": 1441100423,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I don't know if its seasonal, as its been a year since I had another major attack. I just haven't been doing all that well this holiday season. Stress really has mounted up against me, causing a lot of outbursts of crying. I don't really have any friends, nobody really talks to me outside of needing anything. \n\nI do worry a lot, and feel horrible about the events that occur around me. Family knows about it, my mom voluntarily comes over to check on me once a week and helps with housework when things get to be too much. I feel horrible that its came down to that. She even brought groceries today, and a subway gift card... I am thankful, don't get me wrong, I just... I feel incapable and that I need help. I already am on antidepressants... I just don't know what to do at this point.\n\nEDIT: girlfriend just broke up with me today. Wish i was making this up. I feel like just crying and hiding in a closet from the world...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety has caused my friends to drift, my grades to drop, and insomnia.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kkacy/anxiety_has_caused_my_friends_to_drift_my_grades/"
        },
        {
            "author": "IanGecko",
            "author_created_utc": 1409154857,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety+Depression",
            "author_fullname": "t2_i2rjj",
            "created_utc": 1414312223,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kcuih/if_robin_williams_couldnt_keep_it_together_what/",
            "gilded": 0,
            "id": "2kcuih",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kcuih/if_robin_williams_couldnt_keep_it_together_what/",
            "retrieved_on": 1441103979,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If Robin Williams couldn't keep it together what hope is there for me? :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kcuih/if_robin_williams_couldnt_keep_it_together_what/"
        },
        {
            "author": "myepicdemise",
            "author_created_utc": 1364022383,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b1o0u",
            "created_utc": 1414364255,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2keslr/stay_away_from_caffeine/",
            "gilded": 0,
            "id": "2keslr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2keslr/stay_away_from_caffeine/",
            "retrieved_on": 1441103071,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Stress + ADHD med + caffeine gave me mild panic attacks, lasting for hours. Without caffeine, there wasn't just improvement to my anxiety problem, but the ADHD med also worked better. I've quit caffeine for only 48 hours and the difference is immense. Holy shit. It's tough since I've been addicted tea for 8 years, but hopefully I can pull through. I've tried quitting and I lasted only a few weeks. Hopefully this time it would be is permanent. I hope those with anxiety disorders and are drinking tea or coffee would consider quitting.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Stay away from caffeine",
            "url": "http://www.reddit.com/r/Anxiety/comments/2keslr/stay_away_from_caffeine/"
        },
        {
            "author": "kh85",
            "author_created_utc": 1377228002,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cv1qw",
            "created_utc": 1414177590,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k80bp/caffeine_messes_me_upbig_time_anyone_else/",
            "gilded": 0,
            "id": "2k80bp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k80bp/caffeine_messes_me_upbig_time_anyone_else/",
            "retrieved_on": 1441106241,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "So for the past probably 7-8 months I've suffered from pretty bad anxiety. When I first realized it was an issue, pretty much everything triggered the attacks and it was just a constant hell. Mild depression eventually accompanied the problem so that just all made me super anxious over everything. Lately, maybe the past month or so, I've learned to just accept it's what I have and to deal a little better. But I've noticed recently that caffeine- primarily coffee- REALLY sets it off. I mean it only takes maybe 3 or 4 sips and I get palpitations shortness of breath and de-realization, which are all common symptoms for me. Is this normal? Thanks in advance guys. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Caffeine messes me up...big time. Anyone else?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k80bp/caffeine_messes_me_upbig_time_anyone_else/"
        },
        {
            "author": "hitsukima",
            "author_created_utc": 1338802202,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7w729",
            "created_utc": 1414190492,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k8njx/my_fiancée_just_started_a_new_blog_to_help_deal/",
            "gilded": 0,
            "id": "2k8njx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k8njx/my_fiancée_just_started_a_new_blog_to_help_deal/",
            "retrieved_on": 1441105936,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I've been lurking on this subreddit ever since I found out my fiancée suffered from severe anxiety and depression a couple years ago to try and get some sense of what she was going through and what I could do to help. It hasn't been easy and still isn't but I love her to bits and would do it all over again in an instant. \n\nRecently she decided that she wanted to write a blog for a couple of reasons. \n\nThe first is that she felt that there wasn't much out there talking about mental health issues from the perspective of a young person who has dealt and is dealing with them, and would have dearly loved to have found something like that when she was first struggling to come to terms with it.\n\nThe second is that she wanted something that she could be accountable to and also provide her with a way to talk about and cope with her own ongoing struggles with mental health.\n\nI decided to post it here in the hopes that maybe it can reach someone that is looking for something like this. After all the main aim for my fiancée is just to help one person, even if she never finds out about it.\n\nLink:  http://www.cheerful-chelsea.blogspot.com ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My fiancée just started a new blog to help deal with her anxiety and depression",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k8njx/my_fiancée_just_started_a_new_blog_to_help_deal/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414012265,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k15i2/weak_hands_wrists_and_feet_when_i_feel_anxious/",
            "gilded": 0,
            "id": "2k15i2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k15i2/weak_hands_wrists_and_feet_when_i_feel_anxious/",
            "retrieved_on": 1441109497,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I have health anxiety and I've been wondering if this is a common thing. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Weak hands, wrists and feet when I feel anxious. Anyone else get this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k15i2/weak_hands_wrists_and_feet_when_i_feel_anxious/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414335345,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kdf0z/how_to_explain_mild_anxiety/",
            "gilded": 0,
            "id": "2kdf0z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kdf0z/how_to_explain_mild_anxiety/",
            "retrieved_on": 1441103713,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "Most posts on this subreddit focus on severe anxiety and panic disorders. Don't get me wrong- I find everything to be very helpful, regardless. My anxiety is not to the point where I feel that I need to see a therapist or take meds. I mostly internalize it all (I'm sure that sounds familiar). Mostly, I keep myself up late overanalyzing every single conversation that I had that day. I re-read and delete and re-word every e-mail I send to a colleague or parent (I'm a teacher). Even my closest friends don't know about it. They simply see the results of my anxiety and laugh it off as one of my quirks. For example, I overanalyze every text I ever read or send, and if one of my friends is sending a text on behalf of myself and the rest of our group, I will make her reword it in the slightest way because I fear it will be misinterpreted or misconstrued. They all make jokes about it when I do things like this but don't realize it actually causes me physical stress. In my head, I feel like admitting that this is a result of my anxiety would just rationalize it and put it out in the open. I fear that justifying my anxiety as a real problem will make it become a more life-interfering problem. \n\nMy boyfriend sees that effects of it more often, since we are always together, and he knows I \"get anxious\" but I don't think he understands the extent of it, either. I rarely have anxiety attacks but when I do, it's over something ridiculous like him trying to get me to decide where we're going to go out to dinner. He doesn't understand what decision making actually does to me, and he gets angry with me. Sometimes I think he thinks I'm nutzo and I can't explain the way I act (ex. having a panic attack over my room being a mess). Yet I feel like trying to explain the extent of it to him will solidify my anxiety and make it an actual \"thing,\" rather than just something that I can keep inside my head and not let out. I also fear that people will think I'm making it up and that I'm just trying to get attention for it. At this point, my anxiety affects my mental state, but does not have much of an effect on my outside life. I fear that labeling it to others will cause it to affect my life. But I also fear that not explaining it will also start to cause problems because these rare panic attacks will be written off as me being a whacko. Does this make sense?  \n\nCan anyone else relate to this, and do you have any coping mechanisms or suggestions?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "How to explain mild anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kdf0z/how_to_explain_mild_anxiety/"
        },
        {
            "author": "PM_YOUR_SIDEBOOB",
            "author_created_utc": 1404718925,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hab4p",
            "created_utc": 1414398952,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kg4sf/ive_accepted_that_im_going_to_die_one_day_i_just/",
            "gilded": 0,
            "id": "2kg4sf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kg4sf/ive_accepted_that_im_going_to_die_one_day_i_just/",
            "retrieved_on": 1441102446,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "It's like. Okay. Yes. I'm going to die one day. But most likely in anywhere from 50-70 years. I used to worry about it for a few minutes but EASILY wave it off with the simple thought to the tune of: \"between now, and the day you die, there will be a huge amount of times where you forget about the worry, and just enjoy life.\"\n\nI can't do this anymore, though. I worry about death constantly. Even knowing it might not be for decades doesn't make it better. The simple thought that one day, INEVITABLY, I will simply just cease to exist... Well.. There's no easy way to explain how much it scares me. The worst part is that there's literally nothing I can do about it. No matter what happens, no matter what I do, I will die eventually.\n\nIt's ruining my life. And the sad part is, that's only one tiny part of the giant anchor that is my anxiety.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've accepted that I'm going to die one day. I just want to be able to live the rest of my life without worrying about it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kg4sf/ive_accepted_that_im_going_to_die_one_day_i_just/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414512519,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kkvjl/22_f_obsessed_with_getting_rid_of_things_serious/",
            "gilded": 0,
            "id": "2kkvjl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kkvjl/22_f_obsessed_with_getting_rid_of_things_serious/",
            "retrieved_on": 1441100148,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "Hi! Have been browsing this sub for a while and thought maybe someone would relate and share some things. Since I have lived in my own apartment, I have formed an obsession with throwing away material objects and cleaning. My S/O can't help but get agitated with my desire to sort through and organize the same room or drawer every other day. The things I throw away or donate are usually things i've recently purchased. It affects my productivity with everything else b/c I feel the need to get rid of things to feel comfortable. If I just wait and put off organizing for later, I cant focus on whatever else I do. Obviously I am wasting a ton of time and money. At what point does obsessing over it end? How do I stop myself from this?! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "22 F, obsessed with getting rid of things. Serious anxiety over clutter and being disorganized. Any stories with this or suggestions to help before everything ends up thrown away?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kkvjl/22_f_obsessed_with_getting_rid_of_things_serious/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414012474,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k15xm/who_here_has_given_up_alcohol_completely_because/",
            "gilded": 0,
            "id": "2k15xm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k15xm/who_here_has_given_up_alcohol_completely_because/",
            "retrieved_on": 1441109492,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I used to be a moderate drinker. I enjoyed 1-2 glasses of wine about three nights a week, and would drink more heavily once a week (typically a Friday or Saturday night). A week and a half ago I attended a wedding and basically ended up drinking for three days straight. I wasn't plastered but I maintained a steady buzz for a lot of the weekend, partly because I was socially anxious. I drank on the plane on Thursday (fear of flying), at the rehearsal dinner on Friday, and at brunch and the ceremony/reception on Saturday. On Sunday I woke up hung over and with some of the worst anxiety I've ever experienced. I felt like I needed to drink more to cope with the anxiety and it really scared me. It was like a taste of what true addiction feels like. The panic attacks would not stop coming. This went on for a couple of days -- couldn't eat, couldn't sleep, totally wound up -- so I decided to take a break from alcohol, including giving up my more responsible non-wedding level of intake at home. I haven't had anything to drink in ten days and I'm still anxious BUT I honestly feel like some kind of cloud has lifted and I wonder if the 1-2 glasses of wine every other day were actually messing with my brain chemistry a lot more than I realized. \n\nAnyone else? I feel like I'd really been lulled into the \"wine is good for you in moderation\" mentality but now I'm not so sure...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Who here has given up alcohol completely because it makes your anxiety worse?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k15xm/who_here_has_given_up_alcohol_completely_because/"
        },
        {
            "author": "IanGecko",
            "author_created_utc": 1409154857,
            "author_flair_css_class": "",
            "author_flair_text": "Anxiety+Depression",
            "author_fullname": "t2_i2rjj",
            "created_utc": 1414507436,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kkm10/whats_the_difference_between_an_anxiety_attack/",
            "gilded": 0,
            "id": "2kkm10",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kkm10/whats_the_difference_between_an_anxiety_attack/",
            "retrieved_on": 1441100271,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What's the difference between an anxiety attack and a panic attack, if there is one?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kkm10/whats_the_difference_between_an_anxiety_attack/"
        },
        {
            "author": "PoppaDR3W",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1413999933,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k0gn8/feelings_of_detachment_spacey_dizzy/",
            "gilded": 0,
            "id": "2k0gn8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k0gn8/feelings_of_detachment_spacey_dizzy/",
            "retrieved_on": 1441109819,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I know I'm not a Looney Toon, but I feel like I am going crazy at times. I've had many tests done over the past couple of years, but anxiety is the only thing that medical professionals can come up with.\n\nEven when I don't feel anxious,  I have this feeling of detadetachments  from reality, in a sense. I feel spacey,  sometimes slightly dizzy. I have a thick fog in my mind and concentrating  like I used to back before all of this is difficult. \n\nI'm pretty healthy  overall. I workout  5 or 6 days a week, I take Fish Oil and Vitamin D supplements (as well as Citrulline and BetaAlinine preworkout in orange juice). I eat healthy, I only drink water and protein shakes, except for my preworkout mix.\n\nIt also seems worse when driving. I assume it is due to all of the extra stimulation of seeing everything  so fast and maintaining control. I feel like I am on autopilot. I always get to my destination fine.\n\nI believe I posted something similar to this before, but I really want to focus on the spacey feeling. If anyone has any tricks, I am all ears.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feelings of detachment, spacey, dizzy.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k0gn8/feelings_of_detachment_spacey_dizzy/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1414040503,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2k2j5z/agoraphobic_went_from_scared_to_leave_bed_to/",
            "gilded": 0,
            "id": "2k2j5z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2k2j5z/agoraphobic_went_from_scared_to_leave_bed_to/",
            "retrieved_on": 1441108793,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I just want to share a victory I had for myself a few weeks ago. I was extremely agoraphobic for a about 6 months. So much so that I was placed in a mental health care facility for full time treatment. I was on SSRI's, Benzos, beta blockers, and thought I was hearing voices. I was released and things got worse, I didn't leave my room for months it seemed. I thought for sure I was going crazy, and thought I was going to have a major medical event like a aneurysm or seizure at any moment(used to work in an E.R. so I saw all sorts crazy things). I finally decided to one day to be brave and try- slowly, but make tiny progress every day. I started with walking to my mailbox and back, then down the street a little bit, even got in my car and just backed down the driveway. I had several setbacks and panic attacks but just kept being persistent and never gave up. Started going to local places with some safe people I had. I just kept on grinding and no matter what happened I just told myself I had to keep moving forward. Eventually I worked up enough courage to drive around locally, go alone to all my appointments, and even land a really easy job. It took me a long time but that slow consistency adds up and before you know it you'll wonder why you worried about some things in the first place. It sounds insane but I learned to love to overcome my fears- it almost became fun for me. I took a job as an EMT again, even treating people with panic attacks!(which was tough at first). I did the same thing with my diet, just started cutting out the bad very slowly and I felt better all the time. After about a year of slow grinding progress I decided I wanted the ultimate challenge, to overcome my worst fear. I called up my craziest friend and told him to book a skydiving trip. I didn't even think about it and just did it. I was nervous and panicky as I ever have been but I just went for it and it was the best experience of my life. It was weirdly enough one of the most surreal relaxing things for me- probably because I was kicking my fears in the ass. Just wanted to get this out there for anyone who likes to hear about someone overcoming fears, I know I did. I still have anxiety but I know what to do and I still do something little every day to keep moving forward. \n\nIf your going through hell, keep going. \n-Winston Churchill ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Agoraphobic, went from scared to leave bed to jumping out of a plane.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2k2j5z/agoraphobic_went_from_scared_to_leave_bed_to/"
        },
        {
            "author": "justfakingasmile",
            "author_created_utc": 1379871682,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_d8yq7",
            "created_utc": 1414467363,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kja9y/anxiety_has_ruined_everything/",
            "gilded": 0,
            "id": "2kja9y",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kja9y/anxiety_has_ruined_everything/",
            "retrieved_on": 1441100950,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "I'm 19. Anxiety has ruined so many opportunities for me. Getting a job, going to college, hanging with friends (if I had any). We need to take my cat to the vet because she hasn't used her litter box in over a month. Of course my mom refuses to take her because she's like \"who's gonna pay for it.\" This is really getting me anxious. For all I know she might be dying. Note we do take care of her very well, we just don't know why she's doing her business outside the box. I just don't know what to do. If this cat dies I die and I'll just say \"don't pay for my funeral\" on the suicide note. Ugh I wish I could just go out and get a job... But it's not that easy. I applied everywhere (online) and no one wants to hire me. Well that's my little rant...  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety has ruined everything.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2kja9y/anxiety_has_ruined_everything/"
        },
        {
            "author": "tumblingturtle",
            "author_created_utc": 1412111922,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_in9cu",
            "created_utc": 1414517159,
            "domain": "huffingtonpost.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2kl4w8/this_is_what_a_panic_attack_physically_feels_like/",
            "gilded": 0,
            "id": "2kl4w8",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2kl4w8/this_is_what_a_panic_attack_physically_feels_like/",
            "retrieved_on": 1441100027,
            "score": 16,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ZDPGIIqBa-F3rSXp0N_EET8bB3ksAL6OlThGWeRbAHo.jpg",
            "title": "This Is What A Panic Attack Physically Feels Like",
            "url": "http://www.huffingtonpost.com/2014/10/21/panic-attack-feeling_n_5977998.html?ncid=fcbklnkushpmg00000046&amp;ir=Women"
        }
    ]
}