{
    "data": [
        {
            "author": "MrGCar",
            "author_created_utc": 1352811179,
            "author_flair_css_class": "",
            "author_flair_text": "sorry",
            "author_fullname": "t2_9l9zz",
            "created_utc": 1412170406,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hzluo/do_you_cringe_while_watching_others_in_situations/",
            "gilded": 0,
            "id": "2hzluo",
            "is_self": true,
            "media_embed": {},
            "num_comments": 59,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hzluo/do_you_cringe_while_watching_others_in_situations/",
            "retrieved_on": 1441144187,
            "score": 221,
            "secure_media_embed": {},
            "selftext": "Not exactly the same thing, but sometimes when I see a person eating alone at a restaurant I start crying because I think about how he must feel, and his insecurities. \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you cringe while watching others in situations that would give you anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hzluo/do_you_cringe_while_watching_others_in_situations/"
        },
        {
            "author": "mary_widdow",
            "author_created_utc": 1310105861,
            "author_flair_css_class": "",
            "author_flair_text": "General Anxiety Disorder",
            "author_fullname": "t2_5hh5v",
            "created_utc": 1412349873,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i70tw/a_month_of_perfect_attendance_at_work/",
            "gilded": 0,
            "id": "2i70tw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i70tw/a_month_of_perfect_attendance_at_work/",
            "retrieved_on": 1441140725,
            "score": 167,
            "secure_media_embed": {},
            "selftext": "I think you guys might be the only ones that get how much of an accomplishment this is. I've had crippling anxiety all year and have missed time every month this year except two. I've been stressed to the max. \n\nEvery day was a struggle just to go to work. \n\nIn late August things got better.  I started taking better care of myself. I started sleeping better thanks to Advil PM.   I felt my body relax.  I went to work and felt like my old self.  I started being that high performer I had been last year.  When September started I started X-ing the days off the calendar.   I made it the whole month and I'm still going!\n\nIt's hard to stop thinking about the other shoe dropping but I'm treasuring this time and making the most of it. \n\nLove. \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A month of perfect attendance at work!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i70tw/a_month_of_perfect_attendance_at_work/"
        },
        {
            "author": "cocoalrose",
            "author_created_utc": 1371439457,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c29jf",
            "created_utc": 1412616681,
            "domain": "self.Anxiety",
            "edited": 1412624179,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2igrz8/no_one_gets_that_anxiety_makes_socialising/",
            "gilded": 0,
            "id": "2igrz8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 61,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2igrz8/no_one_gets_that_anxiety_makes_socialising/",
            "retrieved_on": 1441136173,
            "score": 126,
            "secure_media_embed": {},
            "selftext": "The other day I posted here seeking help with a really long backstory on my current situation (basically history of anxiety and depression, haven't been able to make friends or socialise at uni), but I ended up deleting it because no one replied.  I came here as I've really got no one to talk to about it - no real friends, don't want to be ~that girlfriend~, and my parents only say things like, \"You'll find your group eventually.\"\n\nBut given my circumstances, I really don't see how that would happen.  I can physically feel it, the fact that I have little personality among people who have bubbling social lives.  Like my flatmates, for instance.  They're friendly to me, and I engage them in conversations, but I can sense that conversation with me is polite when they walk away to go gossip and relay inside jokes with one another like close friends usually do.  \n\nI feel like my history, on top of depression and anxiety, has fundamentally changed me to the point that I do not comprehend normal socialisation.  And it really feels like people can sense that and that it plays a major part in why I don't make friends like everyone else does.\n\nLike, my parents don't get that it's not a matter of time.  It's a matter of tools, and I've lost mine.\n\nEdit: to say that I realise that I kind of seem to reject peoples' advice but I honestly don't mean to and it doesn't mean I don't greatly appreciate it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "No one gets that anxiety makes socialising fundamentally different.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2igrz8/no_one_gets_that_anxiety_makes_socialising/"
        },
        {
            "author": "organazized",
            "author_created_utc": 1399407011,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ggfny",
            "created_utc": 1412253797,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i32v1/do_you_wake_up_feeling_overwhelmed/",
            "gilded": 0,
            "id": "2i32v1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i32v1/do_you_wake_up_feeling_overwhelmed/",
            "retrieved_on": 1441142565,
            "score": 112,
            "secure_media_embed": {},
            "selftext": "My first thought or feeling when I wake up every day is I can't deal with it. I lie in bed thinking about what I need to do that day until I feel completely overwhelmed and helpless. Then I just go back to sleep or even grab my ipad so I don't have to get up. I don't start my job until 5pm so have the whole day to myself. This generally means a whole day of getting more and more anxious.\n\nIt's like that every single day at the moment. There is so much that I want to do with my life but it's passing me by because I can't even get out of bed in the morning.\n\nI tried meditation but the problem is that I want to **do** things, which is the opposite of meditating. I tried reading books about productivity but the more information I have the worse my feeling overwhelmed becomes. I have a stack of books about \"getting it done\" that are a major contributor to my anxiety now.\n\nI have so much I want to achieve, but when I try to think about it my brain just shuts down. There are too many things to do, too many factors to consider, too much information, not enough time. My brain just goes into meltdown at this point.\n\nIt's like they pre-installed software in my brain that causes it to crash every time I try and run any programs. How do I uninstall?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you wake up feeling overwhelmed?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i32v1/do_you_wake_up_feeling_overwhelmed/"
        },
        {
            "author": "NormallyCrazy",
            "author_created_utc": 1412296477,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ioi86",
            "created_utc": 1412297139,
            "domain": "self.Anxiety",
            "edited": 1412297442,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i58hn/do_you_ever_feel_like_you_are_too_crazy_and/",
            "gilded": 0,
            "id": "2i58hn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i58hn/do_you_ever_feel_like_you_are_too_crazy_and/",
            "retrieved_on": 1441141559,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "I do. I made this throwaway account just because of it.  I have a doctors appointment on tuesday about my anxiety. And I am not really sure what to say with out sounding bat shit crazy. I carry a lot of scares, and they have really wore me down.  I am only 21 but I've already: been in jail, been in behavioral health center, been 7k in debt, faced felony chargesr, been abandoned by all friends, wet the bed til middle school, rejected by everyone and felt alone my whole life.  I am really good at lying though.  I can put up a good mask and \"fit in\" but its all a facade.  My only problem right now is that I cant focus on school work, I have so many other problems that I am fine with but they just seem to make their way back into my head.  I have a girlfriend that is oblivious to this all and thats part of the problem.  I was never shown love as a child, my parents neglected me, and it reflects back on how i treat others.  I am good making people seem like I give a shit, but in realty I don't, well sometimes I do but some days I don't.  Like one day I'll be fine and want to help people and talk to them and then the next day my problems come back and I just cant seem to think of something else and i am unconditionally pissed off at everyone.  I want to tell my doctor all this but I don't know if he'll understand, I have a hard time focusing and my grades are starting to reflect that, I just get caught up on a different tangent and can't stay on one topic, i just go back to hating life. \n\nEDIT:  I just don't want him to ask me about my old problems, I am over them, but they do come back.  I am afraid that if i start to talk about my past then something bad will happen. I feel fine most of the days, I just rather not be in school because I cant do the work, it's stupid but it drives me crazy.  Calculus is hard and my engineering teacher hates me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you ever feel like you are too crazy and afraid to be honest because you might be locked up?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i58hn/do_you_ever_feel_like_you_are_too_crazy_and/"
        },
        {
            "author": "Dopeyhopey",
            "author_created_utc": 1395190945,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fr8ds",
            "created_utc": 1412205475,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i1fjs/ordered_pizza_anxiety_commence/",
            "gilded": 0,
            "id": "2i1fjs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i1fjs/ordered_pizza_anxiety_commence/",
            "retrieved_on": 1441143334,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "I have really bad social anxiety and doorbells/knocking makes it 110 times worse. So, I just ordered a pizza and I'm home alone. This is the first time I've done this. :/ I'm so anxious. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Ordered Pizza... anxiety commence!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i1fjs/ordered_pizza_anxiety_commence/"
        },
        {
            "author": "Skakitty",
            "author_created_utc": 1352401811,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9jnlb",
            "created_utc": 1412104764,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hx1ln/bbc_radio_1_has_a_news_piece_on_anxiety_tonight/",
            "gilded": 0,
            "id": "2hx1ln",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hx1ln/bbc_radio_1_has_a_news_piece_on_anxiety_tonight/",
            "retrieved_on": 1441145382,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "Log on at: bbc.co.uk/radio1 \n\nThe description: \n\n\nThe Fear\nDuration: 1 hour\nFirst broadcast: Tuesday 30 September 2014\n\n\nAlmost 1 in 5 people feel anxious a lot or all of the time. Anxiety is one of the most prevalent mental health problems in the UK, yet it is still under-reported, under-diagnosed and under-treated.\n\n\nJameela Jamil has suffered with anxiety and depression since she was a child. With help from a therapist, she is starting to be able to control her condition and its affect on her life is lessening. In 'The Fear', Jameela investigates the causes and cures, and speaks to others whose lives have been affected.\n\n\nJameela has found that having a career in the spotlight has worsened her anxiety. She speaks to X-Factor winner James Arthur and singer Laura Mvula to see how they have juggled their music careers with their own battles with anxiety. She also chats to presenter Anna Williamson, who conquered her fear of swimming pools and went on to appear on ITV's 'Splash'.\n\n\nKeen to get an expert's view on anxiety and depression, Jameela asks The Radio 1 Surgery's Dr Radha and the charity Mind to find out how young people can access help, and learn what can be done to combat anxiety and depression.\n\n\nFinally, Jameela speaks to four young people whose battles with anxiety and depression have already had a significant impact on their lives. She finds out what life has been like living with these conditions at such a young age, and discusses how young people can move forward when battling anxiety and depression.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "BBC radio 1 has a news piece on anxiety tonight and tomorrow. 9pm GMT",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hx1ln/bbc_radio_1_has_a_news_piece_on_anxiety_tonight/"
        },
        {
            "author": "sicituradastra",
            "author_created_utc": 1313910038,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pcrm",
            "created_utc": 1412518429,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2icvt3/want_my_life_back_stuck_in_a_vicious_cycle_of/",
            "gilded": 0,
            "id": "2icvt3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2icvt3/want_my_life_back_stuck_in_a_vicious_cycle_of/",
            "retrieved_on": 1441137990,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "I'm at my wit's end - had to withdraw from uni because of my anxiety and I just don't see a way out my depersonalisation - I feel disconnected from myself - when I try and study my mind is judging me and laughing at me that I am looking for a distraction - a vicious cycle all in all. I am just starting phosphatidylserine to help with my focus maybe and to eliminate these rubbish thoughts - I judge myself when I speak and feel distanced to myself - I want my life back!!!! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "want my life back - stuck in a vicious cycle of overthinking and judging myself",
            "url": "http://www.reddit.com/r/Anxiety/comments/2icvt3/want_my_life_back_stuck_in_a_vicious_cycle_of/"
        },
        {
            "author": "ahryz",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1412550986,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ieb00/october_5th11th_is_mental_illness_awareness_week/",
            "gilded": 0,
            "id": "2ieb00",
            "is_self": true,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ieb00/october_5th11th_is_mental_illness_awareness_week/",
            "retrieved_on": 1441137326,
            "score": 49,
            "secure_media_embed": {},
            "selftext": "I'm going to take advantage of it by talking to people I usually wouldn't about mental illnesses.\n\n[NAMI](http://www.nami.org) &amp; [ADAA](http://www.adaa.org/) are great resources.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "October 5th-11th is Mental Illness Awareness Week (x-posted)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ieb00/october_5th11th_is_mental_illness_awareness_week/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1412499817,
            "domain": "self.Anxiety",
            "edited": 1412509099,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2icggh/my_constant_frustration_of_never_being_good/",
            "gilded": 0,
            "id": "2icggh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2icggh/my_constant_frustration_of_never_being_good/",
            "retrieved_on": 1441138189,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I'm not quite sure this fits in here, but I'll at least give it a try. \n\nStraight out of high school I had a relatively low grade in my language classes, which frustrated me to the point I decided to learn Chinese. One year in China later, my Chinese skills had gotten relatively good, but I was frustrated of the lack of job opportunities to the extent that I started studying computational linguistics. Being quite a broad area, I finished my Bachelor's but was still frustrated that I hadn't learned enough of either linguistics or computer science, so I started my Master's recently from which I have realized that I'm really missing essential math skills, leading for me to take up extra math classes. Also, frustrated with the lack of practical applications in academia, I have been working within my field at a start-up since the second year of the undergrad program. Working while studying does keep me from having to take any loans and learn a lot about entrepreneurship, but it is also frustrating to not be able to focus 100 percent on school, and having to turn down social gatherings and romance because of the never ending stack of deadlines.\n\nI cannot remember once where I actually have felt content about anything I have done. I think what has driven me is not only the constant frustration of not being enough, is also the fact that I thought finishing this and that would make me happy, but I think I recently have realized that I will always find stuff about myself and my skill set to be frustrated over. Despite this realization, I cannot think of another path to take than the one I'm currently on. I think I feel stuck in my own ideas of constant self improvement and the idea of a better tomorrow, which allows me to keep postponing my own happiness. What has changed is that until now I have at least seen the light at the end of the tunnel – now, I'm not so sure anymore, which for the past few days has caused me to experience sever anxiety. I have had troubles leaving my home, or really doing anything at all. While I do want to experience contentedness, I am afraid that by doing so I will lose my the reason for my ambition which has been driving me up until now. \n\nCan anyone else relate to this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My constant frustration of never being good enough used to drive my ambition. Now, I believe it is causing anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2icggh/my_constant_frustration_of_never_being_good/"
        },
        {
            "author": "goneguy2014",
            "author_created_utc": 1412460258,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ipg3e",
            "created_utc": 1412461563,
            "domain": "self.Anxiety",
            "edited": 1412462081,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ib80h/feeling_guilty_for_no_reason/",
            "gilded": 0,
            "id": "2ib80h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ib80h/feeling_guilty_for_no_reason/",
            "retrieved_on": 1441138765,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I'm not entirely sure if /r/Anxiety is the correct subreddit for this, but I think it qualifies. \n\nAnyway, I tend to get intense feelings of guilt for no reason. I take perfectly innocent encounters or situations, and mull them over in my head until I convince myself that I must have done something really wrong. When I've finally convinced myself that I have something to feel guilty about I get an awful feeling in the pit of my stomach, I find it hard to concentrate on anything else, I'll feel flush, and sometimes get a little shaky or have a cold sweat. This tends to happen when I'm alone, normally in the evening, when there's nobody around to focus my attention on, and I'm left to my own thoughts.\n\nI'll list some of the many simple/innocent things that I've ended up with really guilty thoughts on. For example, in my first year of university I opted not to retake a test; a very simple thing, nothing awful, but a couple months later I thought back on it and after an hour had convinced myself that I'd ruined my education and would need to repeat a year (something that did not end up happening). Another is my smoking - I know, a bad habit that I am in the process of quitting, but not the end of the world - and I ended up thinking that my parents were going to absolutely hate me if they found out and may even stop me from seeing my boyfriend, which is completely irrelevant to the smoking matter (my partner doesn't even smoke and I can't imagine why my parents would punish me by not allowing me to see him). And there have been instances where I've taken innocent flirtatious encounters, or teenage games of truth or dare/spin the bottle, and have been convinced that girls have felt harassed by me (despite the fact that nobody has ever told me or expressed that I have made them uncomfortable in that way; when someone isn't interested I take a hint and back off). These aren't the only things I've had feelings of unnecessary guilt over, but they are some that come to mind.\n\nI would love some advice on how to deal with this matter. I know this subreddit does encourage counselling/therapy, but I'd like to be able to try relieving myself of this issue on my own before considering taking things further. Some advice on how to stop these guilty thoughts would be great. And if I'm in the process of having one of these anxiety episodes, how can I calm down and remind myself that I have nothing to feel guilty of?\n\n**edit:** I should probably add that I am not a socially anxious person. I am very approachable, and can speak to people I don't know quite easily. In fact, I work in retail, and I'm fine in that environment. It's just when I'm left alone that I begin to suffer these anxiety attacks.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Feeling guilty for no reason.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ib80h/feeling_guilty_for_no_reason/"
        },
        {
            "author": "T-Stunna",
            "author_created_utc": 1412630487,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iqhhf",
            "created_utc": 1412649575,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2iint6/my_tedx_talk_on_comfort_zone_challenges_and_how_i/",
            "gilded": 0,
            "id": "2iint6",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "TEDx Talks",
                    "author_url": "http://www.youtube.com/user/TEDxTalks",
                    "description": "This talk was given at a local TEDx event, produced independently of the TED Conferences. Till talks about how he overcame many of his own fears and how everybody can step out of their comfort zone. It all started with Till lying down on the floor in a public place.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FHtDkg3Xwn7U%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHtDkg3Xwn7U&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FHtDkg3Xwn7U%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i.ytimg.com/vi/HtDkg3Xwn7U/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "How to crush your comfort zone | Till H. Groß | TEDxDonauinsel",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=HtDkg3Xwn7U",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FHtDkg3Xwn7U%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHtDkg3Xwn7U&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FHtDkg3Xwn7U%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2iint6/my_tedx_talk_on_comfort_zone_challenges_and_how_i/",
            "retrieved_on": 1441135234,
            "score": 39,
            "secure_media": {
                "oembed": {
                    "author_name": "TEDx Talks",
                    "author_url": "http://www.youtube.com/user/TEDxTalks",
                    "description": "This talk was given at a local TEDx event, produced independently of the TED Conferences. Till talks about how he overcame many of his own fears and how everybody can step out of their comfort zone. It all started with Till lying down on the floor in a public place.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FHtDkg3Xwn7U%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHtDkg3Xwn7U&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FHtDkg3Xwn7U%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.ytimg.com%2Fvi%2FHtDkg3Xwn7U%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "How to crush your comfort zone | Till H. Groß | TEDxDonauinsel",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=HtDkg3Xwn7U",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FHtDkg3Xwn7U%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHtDkg3Xwn7U&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FHtDkg3Xwn7U%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/C7Nz47-AwtpK4AfgPwHCPl8fSm_s7a0glreNxkmpilY.jpg",
            "title": "My TEDx Talk On Comfort Zone Challenges And How I Got Over My Social Anxieties! AMA",
            "url": "https://www.youtube.com/watch?v=HtDkg3Xwn7U"
        },
        {
            "author": "pomodori",
            "author_created_utc": 1409617002,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i6bin",
            "created_utc": 1412394583,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i9140/too_affected_by_other_peoples_moods/",
            "gilded": 0,
            "id": "2i9140",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i9140/too_affected_by_other_peoples_moods/",
            "retrieved_on": 1441139788,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "I've never been diagnosed with anxiety (because I've always been too anxious to get professional help when I thought I needed it, haha) but it seems to be a fluctuating thing in my life, thankfully not seriously debilitating me all the time.\n\nOne thing that's pretty consistent is that I'm hyper-sensitive to other people's moods or states of mind... anyone else feel this, or is this just a totally normal thing? A lot of my friends seem to have this ability to cheer someone up or lighten up the room if there's a bad vibe, but I'm unable to do that. Instead, it just affects me a lot and I freeze up. Even coworkers being stressed in the same room just stresses me out a lot - I feel like if I don't take on the same emotions myself, I'll make the situation worse. And if someone else in the room isn't \"respecting\" the bad mood, I get kind of agitated and angry at them for not doing the same. It's a weird reaction and I suspect it has something to do with having a parent who was emotionally manipulative to a pretty thorough extent.\n\nSince I know logically that I don't HAVE to take on the emotional baggage, especially when it's a mundane thing like someone else's workday stress, does anyone have any tips for... not doing so? It's just frustrating how easy it is to go from having a good day to being stressed out and feeling like everything's off not because of someone else's mood, but my own reaction to it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Too affected by other people's moods?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i9140/too_affected_by_other_peoples_moods/"
        },
        {
            "author": "firefly62",
            "author_created_utc": 1358634845,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_aag3z",
            "created_utc": 1412566007,
            "domain": "self.Anxiety",
            "edited": 1412610948,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2iez8h/skype_support_group/",
            "gilded": 0,
            "id": "2iez8h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2iez8h/skype_support_group/",
            "retrieved_on": 1441137012,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "Hey everyone! I thought it would be kinda nice if we could start a skype support group. Just to have people to talk to that understand. I was also thinking we could play games, watch movies and stuff together. Let me know if y'all think this is a good idea, thanks!\n\nEdit: Thanks for the great response everyone! I will be making the group. I think i've messaged everyone back. If I didn't, that was a mistake and message me so I can add you to the group :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Skype support group?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2iez8h/skype_support_group/"
        },
        {
            "author": "rachiedoubt",
            "author_created_utc": 1296204816,
            "author_flair_css_class": "",
            "author_flair_text": "complex PTSD",
            "author_fullname": "t2_4ry3c",
            "created_utc": 1412307874,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i5pm9/does_anyone_else_hate_it_when_someone_says_but/",
            "gilded": 0,
            "id": "2i5pm9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i5pm9/does_anyone_else_hate_it_when_someone_says_but/",
            "retrieved_on": 1441141337,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "Or, \"but you look so good!\" or, \"you look like you're doing so much better!\"... Especially when you're NOT doing well?\n\nIt really bothers me. Anxiety is something that you simply cannot see from the outside, at least, most of the time anyway. For me, when I am at my most anxious without being nonfunctional, I look pretty good, physically. My hair has to be perfect, I have to wear certain clothes, I have to look presentable in a certain way. Probably because I don't *want* people to know there's anything 'wrong' with me, subconsciously. People as in strangers; I want the people I am close to in my life to know what's going on. I try to be honest. It just gets annoying when they base my physical appearance on how I might be doing emotionally. It sometimes makes me want to never wear make-up, wear the same outfit everyday, and not brush my hair or my teeth so that maybe people would look at me and think, \"wow, she must be struggling\". And when I say my hair has to be perfect and I have to look a certain way, it's not by anyone's standards but my own. I wear what I want and what I like, it's just tailored a certain way. I think it's partially ritualistic for me, especially because if I can look the way I want to, it soothes anxiety. Also if I look good enough in my eyes, maybe I can trick myself into thinking that I feel good. I just hate that it has to be this way at all. \n\nI feel like this is harder to explain now that I've started typing. It just bothers me. Today my therapist told me I look like I'm doing a lot better. But I'm really not. The anxiety is still just as strong. And I hate that it's invisible. I hate that unless I am frantic and crying or having a panic attack or not leaving my house for weeks at a time, people don't think I'm anxious. They think it's not a problem anymore.\n\nI don't know if this makes sense, but I needed to get it out. And I hate focusing on the materialistic aspect, but when you have social anxiety sometimes it's hard not to. I don't even know what I'm saying. I just feel frustrated about it right now. Thanks for listening, if you did.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else hate it when someone says \"but you look like you're doing so well!\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i5pm9/does_anyone_else_hate_it_when_someone_says_but/"
        },
        {
            "author": "tequilaandsunshine",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1412520880,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2icyto/i_finally_have_a_name_for_this_feeling/",
            "gilded": 0,
            "id": "2icyto",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2icyto/i_finally_have_a_name_for_this_feeling/",
            "retrieved_on": 1441137950,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "As long as I can remember, I have been very, very hard on myself (or that's the way my mother puts it).  But ever since I started law school, the worry has just taken over.  I feel absolutely frozen sometimes.  I already didn't start this assignment as soon as I should have, so why even try now?  My rent check is already a day late, now I'm too embarrassed to see my landlord and give it to him.  I'm so far in student loan debt, checking my bank account makes me feel absolutely terrible, so I just don't do it.  And all of this makes me feel so terrible about myself, that I just keep failing to do everyday things, and that makes me feel worse and it all just spirals out of control.  \n\nI was actually starting to think I was depressed, because I hate myself *so* much and I am so incapable of doing normal things.  But I have too many *feelings* to be depressed.  So I took an online screener test for anxiety disorders, and it says I might have a generalized anxiety disorder.  I know this is no substitute for an actual diagnosis, and I am going to get help.  But it feels good just to be able to make sense of this feeling instead of beating myself up for simply being incapable of coping with normal, everyday stuff.  I can get help!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I finally have a name for this feeling",
            "url": "http://www.reddit.com/r/Anxiety/comments/2icyto/i_finally_have_a_name_for_this_feeling/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1412426313,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i9t0f/nauseous_every_morning_before_work/",
            "gilded": 0,
            "id": "2i9t0f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i9t0f/nauseous_every_morning_before_work/",
            "retrieved_on": 1441139427,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "Hello again, friends.\n\nI recently started a new job at Starbucks. I am typically an opening person, which involves me getting to work at 4:30am. But ever since I started doing this, I've felt extremely nauseous as soon as I wake up. I can wretch and wretch, but nothing ever comes up. It's an awful feeling, and it's causing me a lot of anxiety (look in my post history; all of my posts are about health anxiety). I've always had a sensitive stomach, but nothing like this has ever happened. It was at its worst this morning, where my body just was not convinced it had nothing to expell, and I could not leave the bathroom. Any thoughts?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Nauseous every morning before work...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i9t0f/nauseous_every_morning_before_work/"
        },
        {
            "author": "bloodrein",
            "author_created_utc": 1411445917,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ij477",
            "created_utc": 1412546365,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ie3ni/coworkers_making_fun_of_me_behind_my_backi_just/",
            "gilded": 0,
            "id": "2ie3ni",
            "is_self": true,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ie3ni/coworkers_making_fun_of_me_behind_my_backi_just/",
            "retrieved_on": 1441137421,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "I was speaking with a fellow co-worker today while bored (work is quite slow), and we admitted a lot of sad stuff to each other about this work place. She told me that there were two staff members (one who is gone due to off-season), who would make fun of me behind my back. One is a 22-year old who I am not surprised about in the slightest, but the other was one I wasn't expecting. I'm 25 years old and suffer from high anxiety. \n\nI've had people make fun of me over the years. I'ma little eccentric but generally a hard worker. But I can see why I'mgood at being made fun of for.  I don't recall ever making fun of this one co-worker ever, or being mean to him. \n\nThe thing is, for whatever reason, hearing this news devasted me. I know that some may argue that she shouldn't have told me, but I honestly appreciate it. \n\nWhen she told me, my stomach dropped. I felt weakened. I recalled all of the incidents where I never seemed to fit in, where people made fun of me being my back or to my face. \n\nI feel like I've never been able to fit in. I do have a wonderful long-term boyfriend and I have close friends. \n\nAnd while I do see some people being made fun of, I just...don't understand why I'm always a target. I try to be nice. I don't participate in rumors. I always try to please. \n\nBut now I'm upset and sore. I know this isn't an isolated thing and it will continue to happen. I have zero confidence. \n\nI've tried figuring out why. I look in the mirror and I see nothing wrong with me. Sometimes, I feel ugly, but when I look at pictures I feel like I'm very cute and normal. But when people treat me badly, I feel like it's because I'm broken in every way. Looks, personality, everything. I just feel broken. \n\nI know I'm not the centre of the universe. But sometimes I feel like I am. This one girl who makes fun of me is (in my opinion), an awful individual, but there's no way she's going to stop. \n\nI just need to know I am not alone in the isolation. That there are other people who try, and fail, and end up being targets.  \n\nI just want to be who I am. Eccentric, happy to sell. I have many reasons to be happy. Some close friends. But I let these bad groups of people get me down. \n\nI'm trying to breathe lol. And work. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Co-Workers making fun of me behind my back...I just don't know how to not be a target.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ie3ni/coworkers_making_fun_of_me_behind_my_backi_just/"
        },
        {
            "author": "deathclawcuddle",
            "author_created_utc": 1390323151,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ewsq2",
            "created_utc": 1412679426,
            "domain": "self.Anxiety",
            "edited": 1412679849,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2ijq1l/i_need_to_know_how_to_help_my_girlfriend/",
            "gilded": 0,
            "id": "2ijq1l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2ijq1l/i_need_to_know_how_to_help_my_girlfriend/",
            "retrieved_on": 1441134738,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "Hi Reddit. A bit of background: I am in a nearly 3 year relationship with my partner. She has always suffered from pretty mild anxiety about basically anything that can take hold: money, friendships etc. Despite this, we still get along fine and I can still see her being \"the one\". I've lived with her nearly one year.\n\nOver the past six months however, she has taken a serious downward spiral with her anxiety and she is now becoming depressed. I am deeply concerned, not only for her but for our relationship in general.\n\nFor a bit more context, her main bouts of anxiety concern a fear of the unknown. The best example is that I'll have to get out of bed a few times before we go to sleep because she wants me to check that all our electrical appliances are switched off, because despite the minimal chance of anything going wrong, our house will blow up and kill us both if anything is left switched on. If the door lock isn't checked, a lunatic might come in and kill us both.\n\nShe is reaching the point where she can't leave the house by herself anymore, because in her mind she does not trust herself/can't cope with the responsibility of being the last person out of the house in case the 0.001% chance of the house blowing up/flooding/being broken into actually came true. \n\nShe has also started struggling immensely with her personal relationships. Whenever she goes out to see her friends she will always have a fun time, but as soon as she gets home she's crippled by thoughts of \"Oh, I hope I didn't say anything to piss anyone off\" or \"I hope I didn't upset anyone\". \n\nShe herself describes it as  \"things being too good to be true, and I'm expecting something to go wrong\".\n\nI'm really at the point where I don't know what to do. The last few nights, she's had to cry uncontrollably to relax herself and relieve the stress that her condition is starting to put on her. The most frustrating thing is that she knows the basis of her fears are completely ridiculous. Leaving a wall outlet switched on overnight is not going to cause an electrical fire that kills us both. Her friends aren't part of some devious scheme to pretend to like her. I'm not going to get run over when I cross the street to get milk. She can't convince herself that a minimal chance of something isn't worth worrying about. In her mind, even a tiny chance of something going wrong means it's going to happen, even if the circumstances are totally out of her control.\n\nI've tried everything I can think of to convince her that she simply doesn't need to feel how she does.\n\nSpeaking selfishly, I don't know where it leaves us if she keeps getting worse. No doubt that I love her, but she's barely coping with everyday life. How will she cope if we move house/have children etc. When she's having a good day, we're great together. We make each other laugh and truly love each other...but these moments are becoming fewer and further between. She has no drive. No get up and go. She lurches from one day to the next, her thoughts cloudy and depressing.\n\nShe has an assessment for Cognitive Behavioural Therapy on the 20th. I'm seriously hope this helps her turn the corner. If not, I seriously fear for her, and us. She's already reliant on me to the point I don't feel like I could ever leave her in case something horrible happened...but at the same time, her condition is now dominating everything about our everyday life. There's no space for me to have any issues or problems, fears or concerns. And as callous as this sounds, it's not fair on me either.\n\nThanks for listening, Reddit. Any advice is welcome.\n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I need to know how to help my girlfriend",
            "url": "http://www.reddit.com/r/Anxiety/comments/2ijq1l/i_need_to_know_how_to_help_my_girlfriend/"
        },
        {
            "author": "everytimeidoug",
            "author_created_utc": 1352254398,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9izs4",
            "created_utc": 1412359960,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i7j7u/anxiety_decreased_by_90_due_to_sobering_up/",
            "gilded": 0,
            "id": "2i7j7u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i7j7u/anxiety_decreased_by_90_due_to_sobering_up/",
            "retrieved_on": 1441140487,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "It may sound weird but I've been an alcoholic for the past 3 years. In those 3 years my anxiety went from minor to severe. It got to the point that if I could leave my bed I still wouldn't leave my bedroom. Today will be 5 days alcohol free for the first time in the 3 years pretty much. And I won't ever go back to it. I haven't felt this good in years. I have been driving, going outside, I'm calmer, more relaxed, and I even sat in traffic trying to get to target to buy Super Smash Brother 3DS. It has only been 5 days and with drinking for the past 3 years I'm sure the withdrawal is gonna be rough when it happens but overall nothing negative came from this so far. I'm here to support anyone that self medicates to relieve anxiety. It may not relieve mental issues completely but it can't be bad for you either way.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety decreased by 90% due to sobering up.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i7j7u/anxiety_decreased_by_90_due_to_sobering_up/"
        },
        {
            "author": "Vaka78",
            "author_created_utc": 1392069821,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f7pty",
            "created_utc": 1412536498,
            "domain": "self.Anxiety",
            "edited": 1412601892,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2idn61/drank_a_lot_last_night_for_the_first_time_in_a/",
            "gilded": 0,
            "id": "2idn61",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2idn61/drank_a_lot_last_night_for_the_first_time_in_a/",
            "retrieved_on": 1441137636,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "Went to best friends birthday house party and ended up having maaaany cocktails.. stupid idea. Feeling super hungover and have been trying not to have a panic attack all day. Can't stop thinking about my heart and convinced it will suddenly stop. Normally I can control these thoughts but today it's very hard :( Will defo not be doing that again anytime soon! Internet hug anyone? \n\nEdit: Thankyou for the lovely replies everyone, you really helped! :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Drank a lot last night for the first time in a while :(",
            "url": "http://www.reddit.com/r/Anxiety/comments/2idn61/drank_a_lot_last_night_for_the_first_time_in_a/"
        },
        {
            "author": "CoffeeChum",
            "author_created_utc": 1412619494,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iqe37",
            "created_utc": 1412619751,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2igygu/celebratory_post_got_a_date_this_upcoming/",
            "gilded": 0,
            "id": "2igygu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2igygu/celebratory_post_got_a_date_this_upcoming/",
            "retrieved_on": 1441136089,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Celebratory post. Got a date this upcoming wednesday with a nice girl! Anxiety has been keeping me back from a lot of stuff, such as this. This is gonna be an exciting one!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2igygu/celebratory_post_got_a_date_this_upcoming/"
        },
        {
            "author": "medusa4",
            "author_created_utc": 1357917520,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a6pyj",
            "created_utc": 1412539155,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2idri2/boyfriend_of_2_years_just_broke_up_with_me/",
            "gilded": 0,
            "id": "2idri2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2idri2/boyfriend_of_2_years_just_broke_up_with_me/",
            "retrieved_on": 1441137579,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "This happened last night and I feel hopeless. He was very upset about it which makes it even harder, but he just hasn't been able to reciprocate the feelings I feel towards him for the past many months. We didn't yell or argue he just said it wasn't working and isn't meant to be. \n\nI keep hoping he will come back but I know that won't happen. I wanted to make things better so badly and was willing to fight for it and he wasn't.. I have no idea how to be on my own again and I feel like I can never be with another person. It doesn't help that my depression and anxiety has been at an all time high lately and this is just going to make me crumble. I have no idea what to do with myself and I don't know how I can go back to functioning, working, sleeping alone and living a normal life. He was my comfort and now it's gone. I've been trying just to sleep but every time I close my eyes I start thinking and crying. Only slept about 2 hours while waking up in the middle and haven't gotten any sleep since. I stayed at my moms house last night and I don't know how I'm going to go home and walk in my apartment with memories of him all over. I just don't know. I can't see a future without him in it.\n\nI know this is something that everyone goes through but it's so fucking hard.. I'm sorry for the rant I suppose I'm just looking to talk to people who can relate and understand. Thank you for reading.\n\nPs- I'm sorry for all of my grammatical errors, can think straight enough to make proper sentences.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Boyfriend of 2 years just broke up with me...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2idri2/boyfriend_of_2_years_just_broke_up_with_me/"
        },
        {
            "author": "xresplendencex",
            "author_created_utc": 1369934323,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bv3mq",
            "created_utc": 1412450211,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2iaqfk/7_weeks_pregnant_and_freaking_out/",
            "gilded": 0,
            "id": "2iaqfk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2iaqfk/7_weeks_pregnant_and_freaking_out/",
            "retrieved_on": 1441138992,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "Since I found out, I quit taking my Prozac  (60mg) for my depression, quit smoking pot for my anxiety, quit drinking coffee, and have started sleeping all the time. I want to do what's best for the baby, always. I know you're not supposed to quit cold turkey but I had to. How am I supposed to deal with the side effects other than being a bitch 24/7?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "7 weeks pregnant and freaking out.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2iaqfk/7_weeks_pregnant_and_freaking_out/"
        },
        {
            "author": "-throwawayfromme-",
            "author_created_utc": 1406955410,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hopwp",
            "created_utc": 1412291327,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2i4z1z/im_freaking_out_about_what_my_so_just_said_i_need/",
            "gilded": 0,
            "id": "2i4z1z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2i4z1z/im_freaking_out_about_what_my_so_just_said_i_need/",
            "retrieved_on": 1441141681,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "So, I was having a prolonged panic attack today, and told my long distance girlfriend about how I was feeling. I really needed some comfort. She said \"I shouldn't talk to you right now, I'd only make things worse\". When I told her she couldn't, I just needed to know everything is alright. She said \"except everything isn't alright.\" And then turned off her phone.. She's at work until 9 tonight.. Am I freaking out over nothing? God, I feel way worse than before and I just need to know I'm overthinking things.. If I am. Thanks for any and all comments, guys. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm freaking out about what my SO just said. I need help ASAP.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2i4z1z/im_freaking_out_about_what_my_so_just_said_i_need/"
        }
    ]
}