{
    "data": [
        {
            "author": "slumberingaardvark",
            "author_created_utc": 1369841886,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bui18",
            "created_utc": 1411413028,
            "domain": "self.Anxiety",
            "edited": 1411503806,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h5jbs/i_completed_my_first_day_in_a_new_job/",
            "gilded": 0,
            "id": "2h5jbs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h5jbs/i_completed_my_first_day_in_a_new_job/",
            "retrieved_on": 1441158459,
            "score": 200,
            "secure_media_embed": {},
            "selftext": "This is a huge deal for me. Last time I tried starting a new job I had a huge anxiety attack and left early. That was 6 months ago.\n\nJust had my first day of a temp job in an Office and I'm so proud of myself for lasting the whole day. I get anxiety so bad I shake, can't eat and think bad thoughts. But I did it! I stuck it and lasted the whole day.\n\nFingers crossed for tomorrow! A tiny but huge step in the right direction for me to having a better life. :) \n\nEDIT:\n\nJust finished my second day! :) \n\nI just want to thank you guys so much, you're all amazing. On the train this morning I was sat reading all the messages and it made me so happy and helped subside some anxiety, you've made me all feel very proud of myself and given me some self belief I was grappling with. All of those messages on here mean so much to me you guys have no idea. So Thankyou. :)\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I completed my first day in a new job :)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h5jbs/i_completed_my_first_day_in_a_new_job/"
        },
        {
            "author": "candyrainbow",
            "author_created_utc": 1388381032,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ekj7m",
            "created_utc": 1411328273,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h24ec/i_did_it_i_looked_at_my_grade/",
            "gilded": 0,
            "id": "2h24ec",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h24ec/i_did_it_i_looked_at_my_grade/",
            "retrieved_on": 1441160054,
            "score": 153,
            "secure_media_embed": {},
            "selftext": "It's been days... and I was anxious about looking at the grade for an English assignment I'd handed in. I couldn't even think about it without my heart pounding, and almost crying and wanting to give up and cancel all my classes and crawl into bed and never leave. \n\nBut today I looked. I don't know why... maybe because I'm in my favourite coffee shop with my favourite drink and I feel a little better than usual... Anyway, I got 95%! And I was even surprised by my teacher's comment: \n\n\"Very nice insight into the story and the character. You chose to discuss  lines that are rich in meaning. Well done. I enjoyed reading this. Let me know if you have any questions.\"\n\nI don't think my anxiety over checking grades has changed much... but it's nice to know that, once in a while, my anxiety isn't completely justified.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I did it. I looked at my grade...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h24ec/i_did_it_i_looked_at_my_grade/"
        },
        {
            "author": "Haiaimeeman",
            "author_created_utc": 1338483024,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7uwm3",
            "created_utc": 1411776787,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hkra0/just_a_quick_reminder/",
            "gilded": 0,
            "id": "2hkra0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hkra0/just_a_quick_reminder/",
            "retrieved_on": 1441151239,
            "score": 137,
            "secure_media_embed": {},
            "selftext": "Someone loves you. If you feel like no one loves you, I love you. And you are a badass son of a bitch for surviving life with anxiety. It gets better. Make a friend this weekend. Just go out and do it. Love you all!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just a quick reminder..",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hkra0/just_a_quick_reminder/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411913216,
            "domain": "np.reddit.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hp4i4/talk_therapy_cognitive_behavioral_therapy_cbt_not/",
            "gilded": 0,
            "id": "2hp4i4",
            "is_self": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hp4i4/talk_therapy_cognitive_behavioral_therapy_cbt_not/",
            "retrieved_on": 1441149137,
            "score": 122,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Talk therapy (cognitive behavioral therapy, CBT) – not medication – best for social anxiety disorder, large study finds: But many lack access to trained therapists, choose medication or nothing at all to treat the common mental illness • /r/psychology",
            "url": "http://www.np.reddit.com/r/psychology/comments/2houqk/talk_therapy_cognitive_behavioral_therapy_cbt_not/"
        },
        {
            "author": "FALLloutFREAK",
            "author_created_utc": 1337390444,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7r5qw",
            "created_utc": 1411529482,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2haozf/a_woman_said_i_have_nice_hair/",
            "gilded": 0,
            "id": "2haozf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2haozf/a_woman_said_i_have_nice_hair/",
            "retrieved_on": 1441155993,
            "score": 119,
            "secure_media_embed": {},
            "selftext": "So I'm really selfconscious about myself and am deathly afraid of meeting new people. But today I was walking when a woman stopped me. I was taken back I hadn't planned on this I was freaking out I started breathing weird I started sweating I stared to panic and I was about to beak down and cry because a person I hadn't planned on meeting stopped me. But all she said was \"Nice haircut.\"    And moved on. I was so pleased that someone actually liked my hair that the rest of my day I went on without even thinking what other people thought of me or were talking about me when I passed them. It really helped me get through a day peacefully.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A woman said I have nice hair.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2haozf/a_woman_said_i_have_nice_hair/"
        },
        {
            "author": "in-site",
            "author_created_utc": 1408067478,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hvw25",
            "created_utc": 1411626054,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hep6a/heh_you_know_you_might_have_anxiety_if_youre/",
            "gilded": 0,
            "id": "2hep6a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hep6a/heh_you_know_you_might_have_anxiety_if_youre/",
            "retrieved_on": 1441154127,
            "score": 100,
            "secure_media_embed": {},
            "selftext": "I actually worry about this with every post. Anyone relate? :P",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "heh - you know you might have anxiety if you're worried about people on the anxiety subreddit believing you have anxiety...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hep6a/heh_you_know_you_might_have_anxiety_if_youre/"
        },
        {
            "author": "theshadesgodown",
            "author_created_utc": 1382551260,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dmh16",
            "created_utc": 1411668854,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hg9up/do_you_feel_like_sometimes_people_belittle_your/",
            "gilded": 0,
            "id": "2hg9up",
            "is_self": true,
            "media_embed": {},
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hg9up/do_you_feel_like_sometimes_people_belittle_your/",
            "retrieved_on": 1441153331,
            "score": 92,
            "secure_media_embed": {},
            "selftext": "This is totally open for discussion, I'm just sharing my experience and hopefully you will do the same, but no pressure!! I'm just sharing because I feel like it's something I need to get off my chest.\n\nDriving. It terrifies me. Unfortunately, everyone looks at driving as a privilege, not a right. So people just assume I'm lazy, or a terrible driver. Forget them though, I am so proud at how far I have come, when it comes to driving! At 15, when my dad started teaching me, even though I had no desire because it was scary as hell. I would get in the drivers seat, and I would start shaking, I would break into a cold sweat and start crying. I couldn't control it. I hate driving. Not much has changed, except now I can actually drive. Just not legally. I'm on my third permit, and every time someone suggests I drive, my palms get sweaty and I get so anxious. I try explaining sometimes, 'I don't feel like driving.' Which is a much more acceptable answer than 'I'm terrified of stepping into the drivers seat.' The usual response though, is 'Get over it.' or 'Grow up'.\n\nBut it's not like I've never been anxious around these people before. Driving in general is very scary, and I get anxiety just BEING in a car. It helps if I have music on and I can focus on the scenery rather than what the driver is doing. Which is why driving is so hard, I can't shut my mind off, I have to think and stay focused!!!\n\nI don't know, I feel like people think that what I am anxious over, isn't worth being anxious over. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you feel like sometimes people belittle your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hg9up/do_you_feel_like_sometimes_people_belittle_your/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411864509,
            "domain": "self.Anxiety",
            "edited": 1411865051,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hnr2t/on_tuesday_i_was_going_to_kill_myself/",
            "gilded": 0,
            "id": "2hnr2t",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hnr2t/on_tuesday_i_was_going_to_kill_myself/",
            "retrieved_on": 1441149780,
            "score": 83,
            "secure_media_embed": {},
            "selftext": "I had the worst summer of my life. Ive always had anxiety but this summer was horrible. It pushed me to the point where I felt like not going on anymore.\n\nIve always been into drugs. Since I was 19 I smoked pot daily (with brief periods of sobriety). From 24-26 I did cocaine excessively. Id estimate I spent 25 grand during those two years. Ive done every drug imaginable that has ever come my way. Except booze. Ive drank. But I hate booze. Its the only thing that has ever made me wake up the next day hating myself.\n\nLast year I developed an opiate habit. It wasnt daily. It wasnt debilitating but it was a habit none the less. I quit blow on August 1st of 2013. I quit opiates on May 25 of 2014. Then I decided I finally had to stop living with a crutch to get through life so I quit smoking weed. Thats when I was no longer able to ignore the constant anxiety.\n\nAt this time I met a girl. She seemed amazing. We shared a similar history. We shared the same goals and fears. We clicked. I fell for her. I told her my feelings and she just kinda went MIA for a week. My anxiety went haywire but I left her alone. Then we talked one night. Didnt really talk about anything that needed to be said because I was too afraid of her answer but it seemed that we would then move forward.\n\nLater that night we went out for drinks. To a sketchy strip bar where Ive went countless times to grab drugs. I was on edge from the beginning. Near the end of the night she told me she was invited to an after party with 4 guys she met there. She said I could come but it was obvious by the guys reactions I couldnt. So for an hour I tried to talk to her calmly about it. She wouldnt listen. Finally I got scared for her (and her friend) to the point I lost it. I screamed at the guys. I screamed at her. I was terrified. She got in the guys car and left anyway. She had no idea where she was going. I had no idea where she was going. I stayed up all night worried about her and finally texted her asking her if she was ok. Her response was \"of course I was. As I told you I would be.\"\n\nFrom that day forward she treated me different but never told me why. We talked about the night but it was obvious it was different. So I generally left her alone. But the anxiety was killing me because it was emasculating to have that done to me. I tried to ask her several times to talk in person as the one conversation we had in text didnt go well. She refused but still acted normal around me while in person (we work together).\n\nTwo weeks ago it came to ahead. We fought through text and said some horrible things to each other. The worst I said to her was she was a horrible person. She called me possessive and controlling. Which killed me to hear. Because Im not. So since then all Ive done is play that night over in my head. Those words continually repeating themselves.\n\nLast Tuesday I asked her to talk one last time. She blocked my number and my facebook. So I couldnt handle it. I wrote the note but I couldnt actually do it. So I called my works EFAP number and talked to a counsellor. Who advised me to go to the ER. Which I did. Cuz I dont want to die. They gave me a two week script of clonezapam and its been a godsend. The thoughts arent racing anymore. Im finally able to stop letting the thoughts get away where its all my fault. \n\nI wasnt going to kill myself over a girl. It was just the straw that broke the camels back. Im 28. I live in my sisters basement. I have more debt than I know what to do with and I live with the regrets of being a drug addict who took advantage of any who trusted me. I work a minimum wage job 40 hours a week trying to go to school so I can actually move forward with my life but no matter what Ive done its always felt like one step forward and two steps back. \n\nSince Ive been taking the clonazapam Ive called my old job which owed me a significant sum of money through a pension. I had put it off for over a year because the anxiety of being told no kept me from making the call. The paper work is on its way. Ive talked to my teachers and have explained my absences and they will let me write the tests Ive missed and will let me make up some of the assigments Ive missed. Im also going to do a reduced course load.\n\nI cant tell you how amazing it feels to not have that feeling in my stomach. That constant dread of the next day. The thought of going to sleep at night and having those dark thoughts and trying to keep them at bay. I dont think the clonozapam will solve my problems. It is on me. Its just given me the ability to move through this dark period with a rational mind and a clear head.\n\nSo I honestly have no idea if any of you have ever thought of ending it because the anxiety gets too much but if you have. Please get help. Even in the last few days I feel like a different person. I feel like someone worthwhile. I see the future and see the person I can be. So even though its hard. Get help.\n\nEdit: Also I did try and see a psychiatrist in early August but he gave me a no diagnosis. Told me that all my problems are what everyone deals with. I have another appointment with my family doctor on Tuesday and I will not let them tell me I dont need some sort of help. I may not need it forever but I do need it today.\n\nAnd Im going to a counsellor once a week now to help with coping mechanisms for the next time life turns shitty. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "On Tuesday I was going to kill myself.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hnr2t/on_tuesday_i_was_going_to_kill_myself/"
        },
        {
            "author": "VZW_Matt",
            "author_created_utc": 1339625164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7zjj8",
            "created_utc": 1411915572,
            "domain": "imgur.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hp7gc/you_can_almost_see_the_exact_moment_i_told_myself/",
            "gilded": 0,
            "id": "2hp7gc",
            "is_self": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hp7gc/you_can_almost_see_the_exact_moment_i_told_myself/",
            "retrieved_on": 1441149099,
            "score": 82,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/m5FEBQdZWb0D8pyQVHYG6zCtzE_7BLLLOk1NbH-05S4.jpg",
            "title": "You can almost see the exact moment I told myself I wasn't going to let me severe anxiety dictate my life (step counter)",
            "url": "http://imgur.com/84kThxh"
        },
        {
            "author": "Htownbitches",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411745139,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hj9a9/social_anxiety_with_drinking/",
            "gilded": 0,
            "id": "2hj9a9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hj9a9/social_anxiety_with_drinking/",
            "retrieved_on": 1441151942,
            "score": 75,
            "secure_media_embed": {},
            "selftext": "Does anyone wake up after drinking and feel unbearably embarrassed or cringy? I always have fun going out drinking and talking.  I don't shut up when I'm drunk. Then the next day I'm incredibly embarrassed and have bad anxiety all day. It makes it where I don't want to go out. Which is what my friends do since we are all early twenties. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Social anxiety with drinking",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hj9a9/social_anxiety_with_drinking/"
        },
        {
            "author": "420MenshevikIt",
            "author_created_utc": 1389644363,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_esnba",
            "created_utc": 1411676419,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hgof2/psychiatrist_refused_to_give_me_an_appointment/",
            "gilded": 0,
            "id": "2hgof2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hgof2/psychiatrist_refused_to_give_me_an_appointment/",
            "retrieved_on": 1441153142,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "So I got a referral for a psychiatrist from my therapist after my pcp refused to prescribe ativan or clonazepam which was recommended to me during a hospitalization. I have my mom call the psychiatrist, as I can't make phone calls because of my anxiety. The psychiatrist calls us back, and refuses to give me an appointment unless I call her on the phone. She even went so far as to say \"What, is he *shaking* with anxiety so badly that he can't pick up the phone?\" in a really sarcastic tone of voice. \n\nI feel absolutely awful now. I've been crying and shaking from stress. This made my mood much worse and I feel awful about myself. It reminds me of how useless and broken of a person I am because of my stupid anxiety. I went outside yesterday for the first time in months to go to therapy and it was really difficult. And now, the person who is supposed to help me get over anxiety tells me that she won't even see me unless I can call her on the phone? What kind of a thing is that to say to someone who has anxiety? And her comment insinuating that I don't really have anxiety? Does she think I'm some person begging for drugs to abuse? It's not just anxiety medication I need, I want to try a new antidepressant again(for the 4th time). That just makes me want to go outside to a doctor even less. Do they all think that I'm faking this to get drugs? I hate this disease. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Psychiatrist refused to give me an appointment unless I called her on the phone",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hgof2/psychiatrist_refused_to_give_me_an_appointment/"
        },
        {
            "author": "TooManyVitamins",
            "author_created_utc": 1339756656,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_806bs",
            "created_utc": 1411390689,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h4ey8/i_finally_went_to_a_therapist_a_year_after_my/",
            "gilded": 0,
            "id": "2h4ey8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h4ey8/i_finally_went_to_a_therapist_a_year_after_my/",
            "retrieved_on": 1441158984,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "Yes, a year. It took me an entire year of agonizing to physically drive 5 minutes down the road to the office and go to the appointment. I saw a doctor a few times over the last year, discussed a mental health care plan, and waited for months and months to act on my referral to a psychologist but I DID IT!!!!! I sat in my car for an hour before the appointment all sweaty and shaky, walked up and down the stairs to the office twice before going in, but I DID IT! This is the first big real step to fixing half a decade of crippling anxiety! It was so overwhelming to get into action but now I've begun and I have a plan! I never ever thought I would be able to do this (scared, wasting therapist's time, etc) but today the psychologist told me: I have to stop feeling bad for trying to improve my life. And she's right! \n\nSorry for this unrelated post, it probably doesn't help anyone but the advice I've gotten from posters here has really helped me to start getting my life together and FINALLY I HAVE BEGUN! To anyone putting off appointments or therapy: you can do it! Thanks everyone, for all your help.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I finally went to a therapist, a year after my first post here asking for help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h4ey8/i_finally_went_to_a_therapist_a_year_after_my/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411719364,
            "domain": "self.Anxiety",
            "edited": 1411749442,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hif1o/does_posting_on_the_internet_give_you_anxiety/",
            "gilded": 0,
            "id": "2hif1o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hif1o/does_posting_on_the_internet_give_you_anxiety/",
            "retrieved_on": 1441152334,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "I don't know about anyone else but anytime I consider posting anything online I get very anxious. I'm an anxious person in general but I was cyber bullied by my \"best friends\" in high school after I got a girlfriend as well as in person, but after that things like inbox messages just make my stomach tight and make me so nervous. I always get really anxious when I'm about to hit post even on comments and most times type out a lot and just discard. Can anyone relate? I don't talk about it much\n\nEdit- logged on and saw inbox and got mega anxiety but everyone is really cool and I appreciate all of your replies! Thanks!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does posting on the Internet give you anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hif1o/does_posting_on_the_internet_give_you_anxiety/"
        },
        {
            "author": "Sploosh_Mcgoo",
            "author_created_utc": 1354678028,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9sri9",
            "created_utc": 1411835039,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hmi6s/rant_im_so_tired_of_feeling_this_way_and_being/",
            "gilded": 0,
            "id": "2hmi6s",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hmi6s/rant_im_so_tired_of_feeling_this_way_and_being/",
            "retrieved_on": 1441150424,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I'm always terrified I'm becoming schizophrenic. When I'm with my girlfriend or anyone else if I hear something that I can't but a cause to that's in the same area I'm in I always have to ask \"Did you hear that too?\" Every time the answer is yes, they heard it too. But it doesn't get easier. If I'm alone it's worse. Last night I was having a great night went and played some pool with my girlfriend and some old friends. Shared laughs and stories it was great. I get home and decide to read a bit before I go to bed. I'm feeling great. Then at like 1am I start hearing speeding cars and I usually don't hear those in my neighborhood so I go inside and I can still hear them in my room which I usually can't hear things outside while I'm in there. But it was a really quiet night and a Friday night and I live in a college town. But still I was questioning if what I was hearing was real and then a mosquito started buzzing in my ear and I turned over saw it and that freaked me out too especially when it went away like \"what if the mosquito isn't real?\" I'm just so tired of being scared of this shit all the time. It's really stressing me out. And for the record I was completely sober last night. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] I'm so tired of feeling this way and being scared constantly.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hmi6s/rant_im_so_tired_of_feeling_this_way_and_being/"
        },
        {
            "author": "Hehki",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411575072,
            "domain": "self.Anxiety",
            "edited": 1411623914,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hcad1/the_girl_im_dating_has_mild_social_anxiety_and_is/",
            "gilded": 0,
            "id": "2hcad1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hcad1/the_girl_im_dating_has_mild_social_anxiety_and_is/",
            "retrieved_on": 1441155250,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "Hi reddit!\n\nRecently, I've been going out with this girl for a while,  around 4-5 months and I really like her. So I guess emotionally, I'm kind of serious about her.\n\nHowever, every time I invite her to hang out with me and my friends, she declines. Sometimes, she just downright freezes on the spot and refuses to budge. She says that every time this happens, she feels like throwing up and that the ground is going to swallow her. When we tried to talk about this once, she even cried about it.\n\nAccording to her, she had been suspecting for some time that she has some sort of social anxiety disorder. I suggested multiple times that she should have herself checked by a doctor just so she could at least know what's happening to her. Or at least to figure out how bad the extent of her anxiety is. She refuses and says that she can handle it on her own. It's really important to me that she's able to meet my friends, as they are pretty much my family. But at the same time I don't want to force her into it or make her feel uncomfortable meeting them.\n\nIs there a way for me to help her out with this in any way? Or a way to make her feel more inclined to meeting my friends despite her mild social anxiety? What do you guys think I should do to help?\n\nThanks in advance everyone!\n\n\n**NOTE: Would it be wise to show her this in order to share your stories of overcoming your anxieties or would it better to just keep this to myself?**\n\np.s.\n\nI've also tried the one friend at a time approach. She wasn't too keen on doing it either.  :(\n\nAlthough she's met a few of my friends in passing. We pass each other while we're out and about by accident, so we say hi and hello. She's actually able to manage these short interactions.\n\np.s. 2\n\nI don't know if this is worth mentioning, but she said that her mood plays a part in whether she'd be up to meeting my friends or not.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The girl I'm dating has mild social anxiety and is having problems meeting my close friends. What can I do to help her out? [xpost from /r/relationship_advice]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hcad1/the_girl_im_dating_has_mild_social_anxiety_and_is/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411498995,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h96nd/in_what_ways_does_antianxiety_medication_actually/",
            "gilded": 0,
            "id": "2h96nd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h96nd/in_what_ways_does_antianxiety_medication_actually/",
            "retrieved_on": 1441156698,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "I don't mean like how does it work on a chemical level. More like, how does it make you feel and why does this lessen your anxiety? \n\nI have social anxiety, and I'd say I'm a fairly anxious person overall in most regards. I've been prescribed Xanax to help me sleep (which I've taken once with pretty much no effect) and Lexapro to take daily (which I'm still not sure I want to start taking), but when I really think about it, I'm not sure I can see how this stuff is actually supposed to work. Like I guess I could see how it would work if I had a disorder where I was always really anxious about like getting hit by a falling piece of a plane, or something crazy and unlikely like that. But all of my anxiety seems to me like things I really should be worried about. Maybe that's the way it is with all types of anxiety, but I can't wrap my head around how something could make me not worried about the things I obsess over, without just making me totally care free, like I'm drunk or something. \n\nI also feel like for as much grief as my anxieties cause me, they're also a part of me, if that makes any sense. I feel like if I took something that made me never worry about them again, I'd be a fundamentally different person, and I'm not entirely sure that's something I want.\n\nI've been feeling pretty anxious for the past day or so, so maybe I'm just not in the right space to comprehend this on my own. If anyone could try to help explain this to me or at least tell me about their own experience I'd really appreciate it. Thanks in advance.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "In what ways does anti-anxiety medication actually lessen a person's anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h96nd/in_what_ways_does_antianxiety_medication_actually/"
        },
        {
            "author": "DickDickVanDik",
            "author_created_utc": 1379624266,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_d7utk",
            "created_utc": 1411600642,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hdn1v/i_get_anxious_from_thinking_about_doing_homework/",
            "gilded": 0,
            "id": "2hdn1v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hdn1v/i_get_anxious_from_thinking_about_doing_homework/",
            "retrieved_on": 1441154619,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "              I have this college American history class. It's once a week for three hours, and there's an essay/writing assignment due each week. However, I've been working 40+ hours a week at my job, so I usually only have two days off. But whenever I have a day off, and think about doing my homework, it just makes me anxious as hell and I can't get myself to sit down and do it. It's like a big knot forms in my stomach from just the thought of doing it. \n\n                       It's made me really hate myself. I mean, all I have to do is an hour or so of reading, followed by a few hours of typing an essay. Why can't I just fucking buckle down and do my work like I'm supposed to? It's the fourth week of class, and I haven't done any of my homework. I'm thinking about dropping it, but I'd feel awful about it. I really fucking hate myself right now. I feel like a complete and total failure.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I get anxious from thinking about doing homework?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hdn1v/i_get_anxious_from_thinking_about_doing_homework/"
        },
        {
            "author": "samk19",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411654899,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hfk7i/dae_constantly_worry_about_their_elderly_pet/",
            "gilded": 0,
            "id": "2hfk7i",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hfk7i/dae_constantly_worry_about_their_elderly_pet/",
            "retrieved_on": 1441153663,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "My cat is 15... I cry when I think about how old she is getting. I hope I posted this to the right subreddit.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE constantly worry about their elderly pet passing away?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hfk7i/dae_constantly_worry_about_their_elderly_pet/"
        },
        {
            "author": "Throwawayyyyyyer",
            "author_created_utc": 1403214346,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h1sjr",
            "created_utc": 1411332351,
            "domain": "self.Anxiety",
            "edited": 1411336403,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h2bok/currently_sitting_in_a_toilet_at_my_new_job/",
            "gilded": 0,
            "id": "2h2bok",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h2bok/currently_sitting_in_a_toilet_at_my_new_job/",
            "retrieved_on": 1441159959,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "Wtf I only get anxiety when at work. The fact that I know I'm going to see these people and have to make some sort of relationship just skyrockets my anxiety. \n\nI don't know why but when one coworker left the room, literally everyone started shit talking about him. I'm there thinking if these people do the same to me. I know it's stupid, but ugghhhhh\n\nAnyone else feel like it. Commitment issues lol?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Currently sitting in a toilet at my new job, pretending I have to piss or shit when really it's my safezone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h2bok/currently_sitting_in_a_toilet_at_my_new_job/"
        },
        {
            "author": "Funny-Mouth",
            "author_created_utc": 1376443410,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cr09t",
            "created_utc": 1411468548,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h7u3o/i_find_that_when_i_get_sever_anxiety_attacks_i/",
            "gilded": 0,
            "id": "2h7u3o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h7u3o/i_find_that_when_i_get_sever_anxiety_attacks_i/",
            "retrieved_on": 1441157327,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I'm around 155 pounds, 72 inches tall and I absolutely LOVE eating; however, becoming seriously upset can make me completely lose my appetite and I don't eat. It's not intentional.\n\nAs of right now, I haven't eaten since two nights ago (don't worry, I'm going to go fix that right when I'm done typing this) and I want to know if anyone experiences the same thing/has any solutions?\n\nThanks in advanced ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I find that when I get sever anxiety attacks, I lose my appetite.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h7u3o/i_find_that_when_i_get_sever_anxiety_attacks_i/"
        },
        {
            "author": "do_not_recycle",
            "author_created_utc": 1280995479,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_48deo",
            "created_utc": 1411333626,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h2dwd/are_there_any_netflix_series_where_nothing_bad/",
            "gilded": 0,
            "id": "2h2dwd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 45,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h2dwd/are_there_any_netflix_series_where_nothing_bad/",
            "retrieved_on": 1441159930,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "Like sitcoms and the such where everything is just fine? Nice and calm?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Are there any netflix series where nothing bad happens?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h2dwd/are_there_any_netflix_series_where_nothing_bad/"
        },
        {
            "author": "reefguy007",
            "author_created_utc": 1411430029,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iizl9",
            "created_utc": 1411493902,
            "domain": "gamingrebellion.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h8wur/video_games_medicating_an_anxious_mind/",
            "gilded": 0,
            "id": "2h8wur",
            "is_self": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h8wur/video_games_medicating_an_anxious_mind/",
            "retrieved_on": 1441156824,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/kwwy6LL1lJOUO18StsR9Ww67IUTbB-LGtAdAOkyvEbg.jpg",
            "title": "Video Games: Medicating an Anxious Mind",
            "url": "http://www.gamingrebellion.com/2014/09/video-games-medicating-an-anxious-mind/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1411682543,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hgzlx/i_am_a_person_who_stutters_fear_of_words_and/",
            "gilded": 0,
            "id": "2hgzlx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hgzlx/i_am_a_person_who_stutters_fear_of_words_and/",
            "retrieved_on": 1441152997,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I am a 20 years old man that have been stuttering since age 7. A couple of years ago, I followed a speech therapy that significantly reduced it. I however strive for success : I want to speak fluently. More than I actually do. When I am not stressed out, in a good situation with a person I feel comfortable with, I'm fluent. My major problem is anxiety. For exemple, I feel anxious when it comes to ask questions in class. I expect to block on words. The fact that most people don't notice it most of the time makes it worst. I feel pressure to not block on words because people don't understand it's stuttering. They think I'm just dumb. Does anyone of you have tips to just not give a fuck? To feel more confident, more affirmative? Any subtle breathing or relaxation techniques would be appreciated too.\n\nSorry for the mistakes, english isn't my primary language!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I am a person who stutters. Fear of words and people's reaction make it worst. Help me out?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hgzlx/i_am_a_person_who_stutters_fear_of_words_and/"
        },
        {
            "author": "Zerquoy",
            "author_created_utc": 1387723674,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_eguxv",
            "created_utc": 1411513167,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2h9xei/help_a_girl_in_my_peer_group_seems_to_have_some/",
            "gilded": 0,
            "id": "2h9xei",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2h9xei/help_a_girl_in_my_peer_group_seems_to_have_some/",
            "retrieved_on": 1441156351,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "I'm a senior in high school (male, almost 18), and I am a peer group leader. That means that for forty minutes a week, me and my partner have what's called an outreach session with 15 other freshmen. Our jobs are to get them used to high school, and to be there for them as they enter high school. This is an actual class, where we have to make lesson plans for our outreach session.\n\nWhich brings me to one of the freshmen in my peer group. She is extremely shy, so much so that when we were going around introducing ourselves, she didn't even tell us her name. (Or, if she did say something, then it was so quiet that I didn't hear her). She didn't contribute for the rest of the session, and had her head down for most of the time. In the future, we'll be having a lot more games and discussions. We actually have an Olympics at the end of the year.\n\nWhile talking with my teachers, one of her homeroom teachers mentioned that one point in his homeroom, she just broke down crying, and has not been to school once.\nI spoke to a friend of mine who went out with her sister, and he says that she \"has a type of anxiety, and doesn't talk to people or anyone. She is scared\"\n\nAll I really want to do is be able to make her feel included and safe. Does anyone have any ideas of what I should do?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] A girl in my peer group seems to have some form of anxiety. What can I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2h9xei/help_a_girl_in_my_peer_group_seems_to_have_some/"
        },
        {
            "author": "darus214",
            "author_created_utc": 1320339539,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_668xi",
            "created_utc": 1411592323,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2hd82x/is_benadryl_an_effective_anxiety_med/",
            "gilded": 0,
            "id": "2hd82x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2hd82x/is_benadryl_an_effective_anxiety_med/",
            "retrieved_on": 1441154813,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I've noticed that my anxiety is a lot worse in the morning right when I wake up. For some reason I always have a runny nose and overall congestion after waking up which seems to correlate with my anxiety, at least that's what I have noticed. The worse my sinuses, the more anxiety I have. I read somewhere that Benadryl is great for anxiety but it's also for allergies/congestion. I was wondering if taking it would be like killing 2 birds with 1 stone. Anyone have any experience with Benadryl? \n\nI should mention that I've never taken allergy meds and have never been diagnosed with allergies but with my sinuses always being so  bad, I'm thinking I have some type of allergy. It's just weird that I get \"symptoms\" only in the morning. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is Benadryl an effective anxiety med?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2hd82x/is_benadryl_an_effective_anxiety_med/"
        }
    ]
}