{
    "data": [
        {
            "author": "maxenglander",
            "author_created_utc": 1409073355,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i27ap",
            "created_utc": 1409769242,
            "domain": "self.Anxiety",
            "edited": 1409775500,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fdnx0/survey_how_do_people_cope_with_stress_and_anxiety/",
            "gilded": 0,
            "id": "2fdnx0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 70,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fdnx0/survey_how_do_people_cope_with_stress_and_anxiety/",
            "retrieved_on": 1441188498,
            "score": 197,
            "secure_media_embed": {},
            "selftext": "Dear /r/anxiety, \n\nI am researching how Redditors think about and cope with stress and anxiety. I’d greatly appreciate 10-15 minutes of your time to fill out this survey.\n\n\nhttps://docs.google.com/forms/d/1bxRcrhmDMiX9KmvIjkBsRpb0Me4D3s05zU-q_Kj9OFs/viewform\n\n\nI’m hoping to use the information you share in a positive way to make it much easier for people to find and use information and treatments that work for them. Thank you so much! If you’d like to hear more about the service I’m working on, and are interested in helping, send me a private message or an email! \n\nmax.englander@gmail.com",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Survey] How do people cope with stress and anxiety? (upvote for more visibility)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fdnx0/survey_how_do_people_cope_with_stress_and_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1409620201,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f7u2r/anyone_else_feel_like_theyre_constantly_checking/",
            "gilded": 0,
            "id": "2f7u2r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f7u2r/anyone_else_feel_like_theyre_constantly_checking/",
            "retrieved_on": 1441191277,
            "score": 159,
            "secure_media_embed": {},
            "selftext": "I feel like whenever I'm feeling ok or fine, my mind checks itself, asking if there's anything to be worried/anxious about. Anyone else? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Anyone else feel like they're constantly \"checking\" their feelings.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f7u2r/anyone_else_feel_like_theyre_constantly_checking/"
        },
        {
            "author": "Sploosh_Mcgoo",
            "author_created_utc": 1354678028,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9sri9",
            "created_utc": 1409943565,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fko7g/i_just_wanted_to_tell_you_guys_something/",
            "gilded": 0,
            "id": "2fko7g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fko7g/i_just_wanted_to_tell_you_guys_something/",
            "retrieved_on": 1441185167,
            "score": 122,
            "secure_media_embed": {},
            "selftext": "Thank you, for being here. It seems we all are going through our own anxiety with different degrees of severity and reasons but this community has helped me and everyone else who frequents realize we are not alone in our suffering and that there is hope for all of us. And we will be okay. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just wanted to tell you guys something.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fko7g/i_just_wanted_to_tell_you_guys_something/"
        },
        {
            "author": "instantrobotwar",
            "author_created_utc": 1240872009,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3gmht",
            "created_utc": 1409987480,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fmdl2/i_want_to_give_you_all_some_hope_about_medication/",
            "gilded": 0,
            "id": "2fmdl2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fmdl2/i_want_to_give_you_all_some_hope_about_medication/",
            "retrieved_on": 1441184372,
            "score": 81,
            "secure_media_embed": {},
            "selftext": "My anxieties are mostly in the form of various phobias (coupled with an obsessive and unhealthy FOMO (fear of missing out), but that's for another post). I can't be on a plane, sleep alone in the dark, drive on steep mountain roads, be on cable cars, etc., without pretty severe panic attacks (involuntary gasping and screaming, crying, and seriously feeling like I'm going to die). \n\nNormally it feels like something I have NO control over the panic. Daily meditation, breathing exercises, yoga and exercise helped me feel better in times of non-anxiety, but didn't do much when I was actually in a panic. \n\nNormally when I'm in the dark alone, any sound will cause a feedback loop that escalates into fullblown panic, and I have to use a nightlight, which would in turn cause me to wake up every few hours and I wouldn't get a restful sleep. But last night - I turned off the light, laid in bed, listened to the sounds - and, miraculously, the panic never came. It seemed absent of its own accord. It's still slow-going but this has made me very hopeful.\n\nI want to give you hope too - go to a psychiatrist and don't be afraid to try medication if they recommend it. They have some side effects, but I'm starting to feel like a normal person again - though slowly, slowly. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I want to give you all some hope about medication - I'm on day 15 of an SSRI, and I was able to sleep in the dark last night without panic for the first time in 6 months.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fmdl2/i_want_to_give_you_all_some_hope_about_medication/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1409577448,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f610i/dae_wake_up_feeling_anxious/",
            "gilded": 0,
            "id": "2f610i",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f610i/dae_wake_up_feeling_anxious/",
            "retrieved_on": 1441192120,
            "score": 76,
            "secure_media_embed": {},
            "selftext": "Seriously. I wake up feeling like I'm on the verge of an anxiety attack. Wtf brain! What do you do?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "DAE wake up feeling anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f610i/dae_wake_up_feeling_anxious/"
        },
        {
            "author": "rufhaus",
            "author_created_utc": 1383955464,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_du007",
            "created_utc": 1409536336,
            "domain": "self.Anxiety",
            "edited": 1409595786,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f4s7m/rant_my_boyfriend_broke_up_with_me_my_sister/",
            "gilded": 0,
            "id": "2f4s7m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f4s7m/rant_my_boyfriend_broke_up_with_me_my_sister/",
            "retrieved_on": 1441192700,
            "score": 73,
            "secure_media_embed": {},
            "selftext": "Title pretty much explains it. A week ago my boyfriend broke up with me and that has been incredibly rough. I loved him more than I've ever loved anyone and saw a long future with him. He started taking Prozac awhile ago and it changed him a lot, so it feels like he died. I'm just trying to get through the grieving process but it's really difficult. I get worried I'm not going to be able to pick myself up from it. I'm trying to keep busy but when I have nothing to do my mind just races and I usually end up convinced that I wasn't pretty enough, or smart enough, or good enough for him. So that sucks. I'm trying to just give it time and stay busy but it still is horrible.\n\nA couple of days after that my sister moved away to college in another state. I'm really happy for her and I went away for college too so I know how exciting it is! It's just tough. I live with her and my dad and she's always been my best friend. I leaned on her a lot when my ex broke up with me because I don't have too many friends right now. Now it's just me and my dad in the house and it feels empty. I miss her. \n\nNow, just about an hour ago, my grandpa passed away. I honestly don't know what to think about that. He's had pretty advanced dementia for awhile so it feels like he's been gone for awhile. But I feel so terrible for my dad and I want to be there for him as much as possible - I just feel like such a shitty support system for him because I'm not stable right now. \n\nI just feel lost and overwhelmed. A lot is changing really quickly and I'm trying my best to keep up but I just want to sit in my room and cry. I don't really know what I'm asking or what I want, but I just needed a place to vent. Thanks for listening r/anxiety. \n\nEdit: Wow, I really didn't expect anyone to read this, waking up to all of these people telling me I'm going to be okay is so wonderful. Thank you guys so much for all of your advice and thoughtful, supportive comments. I want to reply and thank all of you... unfortunately I'll be busy all day, so here is my umbrella gratefulness to those I didn't get a chance to reply to. I can't tell you how much I appreciate it. This community is really amazing. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Rant] My boyfriend broke up with me, my sister moved away, and my grandpa died. This week is really fucking with me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f4s7m/rant_my_boyfriend_broke_up_with_me_my_sister/"
        },
        {
            "author": "Anyoneat",
            "author_created_utc": 1409752595,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i7pn7",
            "created_utc": 1409753033,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fcv6a/does_anyone_ever_think_back_to_something_they_did/",
            "gilded": 0,
            "id": "2fcv6a",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fcv6a/does_anyone_ever_think_back_to_something_they_did/",
            "retrieved_on": 1441188872,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "Hey there!\n\nDoes anyone ever get sudden flashes of memory and become embarrassed or ashamed? Sometimes I feel down right humiliated and from this, I get anxiety what others may think if they remember it too and what will happen if someone mentions it. \n\nI'm currently third year university student. Sometimes I'll be minding my own business and then I'll get like an intense, mostly painful memories. It sometimes affects my mood for days and my anxiety levels soar.\n\nIt was something I know is sort of stupid. When I was 17-18 I tinkered with the idea of leaving a note for a next student or freshman in a book, in the library. I found myself worrying a) if I even made a note and left it b) what I put in it considering I was severely depressed and c) if someone recently found it who knows me and now thinks I'm messed up. \n\nHow do you do with these memories? Is this normal?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone ever think back to something they did and get anxiety or panic attacks? How to fix this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fcv6a/does_anyone_ever_think_back_to_something_they_did/"
        },
        {
            "author": "somejeff",
            "author_created_utc": 1369188336,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_brhfb",
            "created_utc": 1409705057,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fb992/something_no_one_can_take_away_from_you/",
            "gilded": 0,
            "id": "2fb992",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fb992/something_no_one_can_take_away_from_you/",
            "retrieved_on": 1441189621,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "For me, a big part of anxiety/depression is feeling like I don't have much control over things in my life. There are so many factors that determine whether you get the job, friendships, and relationships you want, and if you get these things, holding on them always feels incredibly tenuous. Not to mention all the crushing daily anxieties of social interaction caused by the fact that you can't control how people (mis)interpret you.\n\nI've noticed a pattern in how many of us cope: exercise, gaming, self-isolation: these are all ways to spend time *on our own terms*. For a while, it really helped me to do some volunteer work, because I felt like even if everything else was turning to shit in my life, I could feel that I contributed a tiny bit of good to the world. I owned it completely. No one could take that away from me.\n\nI think having something like that helps a great deal, no matter what it is. So that when you're having a panic attack and feeling like you're suffocating in a box, you can breathe a bit when you remember that the triggering situation doesn't define you. There's more to life, there's something that's still entirely yours and can't be taken away.\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something no one can take away from you",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fb992/something_no_one_can_take_away_from_you/"
        },
        {
            "author": "nirvana124",
            "author_created_utc": 1329658879,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6ynl9",
            "created_utc": 1410087197,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fpl4m/im_petrified_to_get_a_job/",
            "gilded": 0,
            "id": "2fpl4m",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fpl4m/im_petrified_to_get_a_job/",
            "retrieved_on": 1441182825,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "I'm 18 and I've only work at one place my whole life. It was a fast-food. I spent a whole month there and it was one of the worst experience in my life.\n\nWhen I was in high school I was bullied by my friends because of my anxiety, for maybe two years. I got over it with time. However, at that job, everything started over again. My coworkers were girls older than me and, since the manager was always on vacation, they felt like they controlled everything. They were calling me names in front of me, getting angry after my third day because I was too slow for them. They fucking laughed at me in my face. I kept messing up because they were constantly criticizing me.I kept going in the back store because of my panic attacks. Finally, after a month, I quit. \n\nEver since then, I've always been petrified to get a job. I know, for most people, working somewhere isn't a big deal and maybe I took this too seriously, but I keep having panic attacks just thinking about it. I really need a job though and the idea that I don't have one it's stressing me out even more. \n\nAny tips?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm petrified to get a job.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fpl4m/im_petrified_to_get_a_job/"
        },
        {
            "author": "RaghibAhmed",
            "author_created_utc": 1356345259,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9zlwk",
            "created_utc": 1409852710,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fh1ck/advice_force_yourself_to_smile_and_laugh_to_help/",
            "gilded": 0,
            "id": "2fh1ck",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fh1ck/advice_force_yourself_to_smile_and_laugh_to_help/",
            "retrieved_on": 1441186924,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "We all want to feel at ease, comfortable, and happy. But anxiety can make it really hard. We get stressed, feel bad, and then get more stressed, and end up in a negative loop. \n\nWhen it comes to managing anxiety, it can be hard to implement changes into our lives due to how overwhelming it seems. But by doing very simple things consistently, we can genuinely feel better and reap a lot of benefits. Examples of these types of things are smiling, and laughing.\n\nWhen we smile or laugh, that's usually because of something that's made us happy. The action (smiling/laughing) is an emotional response to a stimuli. But, it also works the other way. \n\nWe can actually do the action of smiling and laughing (even if we don't feel happy), to get the emotional response of feeling better.\n\n**Forced smiles and laughter research**\n\nFor instance, in the study *[Grin and Bear it](http://www.scribd.com/doc/119200793/Grin-and-Bear-It-The-Influence-of-Manipulated-Facial-Expression-on-the-Stress-Response)*, the researchers found that forcing yourself to smile can reduce stress and induce a positive affect (emotion or feeling).\n\nIf you want an even stronger benefit, then you can laugh. There are many [studies](http://www.bupa.co.uk/individuals/health-information/health-news-index/2005/hi-160305-laugh) that show laughing can induce a range of positive benefits:\n\n* Laughter boosts your immune system which helps fight infections.\n* Laughter boosts blood flow, and can reduce the risk of heart disease.\n* Laughter reduces pain, which has led to funny videos being used in anaesthetic rooms at Manchester Children’s Hospital.\n* Laughter reduces allergies.\n* Laughter makes you happier, which is good for your mental and physical health.\n* Laughter reduces stress.\n\nForced laughter also increases Heart Rate Variance (HRV), according to [this](http://www.ncbi.nlm.nih.gov/pubmed/22894892) study. HRV positively correlates with being calmer, and more in control of your emotions. Studies like [this](http://link.springer.com/article/10.1007%2Fs12160-009-9101-z) one have even led to psychologists calling HRV the body’s best measure of self-control.\n\nHigh HRV makes your heart healthier, and therefore, makes you healthier in general. Stress, on the other hand, does the opposite. It reduces HRV, thereby reducing our health and self-control.\n\nSmiling and laughing improves our health, heart, and reduces stress - all these benefits increase HRV, which perpetuates further anxiety reduction.\n\nSmiling and laughing therefore, are a quick and easy way to induce positive affects, feel mentally and physically healthier, and reduce stress.\n\nIf you feel good, you’ll do good. If you do good, you’ll feel good. So forcing yourself to smile and laugh, consistently, are great ways to help alleviate the effects of any negative loop you might be in, and help get you out, and even put you in a positive loop.\n\n**Forced and natural smiling and laughing work**\n\nOf course, these benefits don’t have to be forced. Natural smiles and laughter work too. So you can watch funny videos, read jokes, or hang around with positive people. But if you aren’t in the vicinity of something external that can make you feel positive, no problem. You will always have the ability to physically force yourself to smile and laugh if you need a quick boost in mood and self-control. This is an excellent and easy tool to add to your arsenal for feeling better. Smile and laugh consistently, and you’ll convince your brain to feel good consistently. And if you feel good consistently, it'll be easier to get on with your life.\n\n**Smiling and laughing as a daily health recommendation**\n\nThe amount of studies which advocate positivity (smiling, laughing, and being happy) are numerous and growing. There are many health recommendations we hear about, like eating 5 portions of fruit and vegetables a day; drinking 8 glasses of water a day; and using the stairs instead of the lift – all so that we can live a longer and healthier life. It’s only a matter of time for smiling and laughing a few times a day to join these recommendations.\n\n**TL;DR** Smiling and Laughing makes you happier, healthier, and reduces stress. Force yourself to smile and laugh, consistently, to reap these benefits, consistently.\n\n^^^^^^^Adapted ^^^^^^^from ^^^^^^^my ^^^^^^^[blog](http://www.raghibahmed.com)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Advice] Force yourself to smile and laugh to help reduce anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fh1ck/advice_force_yourself_to_smile_and_laugh_to_help/"
        },
        {
            "author": "SmallOrange",
            "author_created_utc": 1354394050,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9rmu9",
            "created_utc": 1409587545,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f6eeu/how_i_cured_16_years_of_severe_depression_and/",
            "gilded": 0,
            "id": "2f6eeu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 68,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f6eeu/how_i_cured_16_years_of_severe_depression_and/",
            "retrieved_on": 1441191946,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "Hi everyone.\n\nI was directed to this subreddit after posting my story about anxiety/agoraphobia and depression elsewhere. I didn't know this subreddit existed until today. I am going to go in depth into what my anxiety was like for me and how it spiraled out of control and also how I cured my anxiety and depression through changing what I ate. If you are really sensitive to anxiety stuff you may want to skip to the end. \n\n**TL;DR: I changed the way I ate and was able to get rid of a lifetime of depression and 16 years of anxiety.** \n\nI was depressed for most of my life. The first time I remember wanting to kill myself I was less than 10 years old. This is a mentality that persisted all through childhood and into my late 20's. This, combined with the beginning of panic disorder when I was around 12 caused me to see myself and my own life in a very negative way. \n\nIn the beginning of my panic disorder I would have attacks sometimes 3 times a day. I was nauseous, light headed, freezing cold and shaky. I had trouble breathing and swallowing. My body felt like it was shutting down completely and I felt paralyzed when even one symptom of my panic attacks would show up. I was taking gravol in the morning, in the afternoon and before my job in the evenings. My life was spent in a haze. Despite being in therapy I found that my symptoms were not being alleviated and I had to force myself through each day of my life knowing that I would likely wake up already anxious, spend my day in that state and have trouble sleeping at night due to my catastrophic thought patterns as I was already anticipating my anxiety the following day. This was a cycle that I lived in from the age of 11/12 until 27.\n\nIn my mid 20's my anxiety attacks took a bad turn into agoraphobia. Where I was able to force myself to school and work and sometimes to social events I now found it impossible to go to the grocery store, the gas station, the bank or even to stand outside of my apartment on a nice sunny day. I had to leave for my job over an hour in advance knowing that I'd have a panic attack on the way and would have to allow extra time for \"emergency stops,\" etc and time to back out of going into work if things got too bad. At this time I was not medicated. I was very isolated, had no social life what so ever and the only thing that kept me going was having 2 cats that needed me. I was sometimes able to get into the grocery store to buy them food, but I could never be in there long enough to buy food for myself. I had to go through drive thru's just to get something to eat, and even in my car being in the lineup waiting was nearly unbearable. \n\nI ended up in therapy again for the 4th time in my life knowing that if I did not get my anxiety and depression under control that I was going to kill myself. I could absolutely not see another alternative. I was desperate. It took me nearly an hour of sitting in my car in front of my apartment to motivate myself to drive down the street. Mind you, this doctor's office I was going to was walking distance but I couldn't stand being outside and needed to have an immediate escape route at all times. It took me another 30 minute in the parking lot at the office to calm down enough to get in, only to have my anxiety get completely out of control waiting to see someone to get  help. I was shaking and sweating, clutching a bottle of water like my life depended on it, constantly scanning my surroundings for a place to hide or an excuse to get out. \n\nEventually I saw a doctor who gave me a prescription for ativan to get me through my worst days. I was set up with a therapist and had to focus on functioning before I could get help.\n\nBefore therapy I had put in hundreds of hours of research into curing my anxiety. I looked into meditation, walking, binaural beats, Z-Point release, drinking more water, trying to burn off the extra energy with more exercise, breathing exercises, counting exercises, etc. I had tried nearly everything in the book including anti-depressants which made me more suicidal. Finally, I was able to talk to someone who I felt like I could be open with and she was very surprised that despite the level of anxiety I had that I was still marginally functional. She was also amazed at the amount of coping skills that I had. However, she believed that I would likely have anxiety and depression for the rest of my life because it ran in my family and made the suggestion that I go on meds again. I was very hesitant. I was even hesitant to take Ativan after reading the information on it and seeing that it could be very addictive.\n\n\n**When My Food Changed:**\nFinally, she had given me some pamphlets on how to eat for anxiety. It talked about the role of sugar and processed foods in the body, insulin spikes, sugar crashes, etc. A lot of this information made sense to me and started me on a journey towards researching nutrition. At this point I lived off of mostly processed foods. I hated all vegetables. I barely liked any kind of meat. I was eating very little because I couldn't get to the store, and sometimes after a few days I would order take out and end up binge eating. This also contributed to issues I had with my weight.\n\nAfter some time, I discovered eating whole foods and how they interacted in the body. Over a very long period of time I stopped eating grains, sugars, dairy and essentially anything that could spike my blood sugar and send me spiraling. I wasn't thinking about changing my whole diet or eating healthier. I was thinking about eliminating everything I possibly could that would cause me to have anxiety or depression. Over the months, I came upon the Paleo diet and all of the researching surrounding a lower carb, higher fat diet and everything started to click in place. As my tastes expanded to like more veggies and even meats, I noticed that I was beginning to lose weight that I thought I would have on me for the rest of my life... You know, because of \"genetics.\" \n\nAs it turns out, my therapist was wrong. It's been nearly 2 years since I have had an anxiety attack. I no longer suffer from crippling depression. I now have an active social life, a great relationship, am at a healthy body weight and I have been living a life that I NEVER thought was possible for me. 65lbs later I am the healthiest I have ever been. I am re-learning how to live and be this new person that I have found in myself. I never realized how limited I really was by my anxiety and depression and I am kicking myself for not realizing how easy it was to start getting rid of it. All because I stopped eating processed foods, sugar, grains, etc. Even though those were huge staples of my diet through my whole life I can really say that I don't miss it and I don't miss being a complete mess.\n\nI just wanted to share this story for any of you who are going through bad anxiety and who have tried every other trick and gimmick in the book. I so strongly encourage you to look at what you are putting in your body and how it may be affecting your physical and mental health (which often go hand in hand).\n\nI'd also be happy to offer specific articles, studies, etc that I have read that helped me along my journey and even maybe write up what my days look like in terms of food/exercise or answer any other questions you may have.\n\nGood luck to all of you. You can reclaim control of your life! ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How I cured 16 years of severe depression and anxiety/agoraphobia with food.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f6eeu/how_i_cured_16_years_of_severe_depression_and/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1410036639,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fnyvh/should_i_live_alone_and_comfortable_or_be_social/",
            "gilded": 0,
            "id": "2fnyvh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 41,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fnyvh/should_i_live_alone_and_comfortable_or_be_social/",
            "retrieved_on": 1441183629,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "I'm pretty new to Reddit, and from what I've been reading there are a lot of wonderful people around here. It's comforting to read everyone's story and advice, and I thought I'd throw in my own experiences in hopes of feeling better about some thoughts I've been having lately.\n\nI'm 22 and for about a year now I've been living in a remote small town, where I moved to isolate myself from the world. I don't know if it's the right thing to do, but I feel SO good being alone and independent. I make just enough money to pay rent and eat relatively well (I work as a freelance artist / animator over the web). I have family and friends who love me, which I'm well aware of, but despite it all, I just feel the need to be alone.\n\nLately, my brother told me he's worried about me and that I should be more social, and that made me second-guess myself and for a few days I felt crushed and doubtful and lonely, but then I got back to that serene place where I'm just comfortable being by myself. \n\nAnd a few weeks later (a few days ago) I was watching a video on YouTube, and this guy was giving advice to young high school kids, and he said \"oh, and get out of the house, do things, don't stay inside like a little loser\", which once again triggered my anxiety and second guessing and miserable feelings...\n\nI don't know what to do... I know it's not \"normal\" at a young age like 22 to live such a solitary life, but I can't get myself to be social, I can't get myself to move back among friends and \"be normal\". Because the last time I allowed myself to do that I just felt like I was trapped in a cage, I felt miserable everyday, finding comfort in the few moments of solitude I could grab. I just feel like I'm made to be alone.\n\nI feel so comfortable here, in the middle of nowhere... but then there are these \"real\" moments when something brings me back to reality in a way, and it makes me feel horrible for being alone, it makes me feel like these past 22 have been wasted, that I didn't have fun ever, that I am indeed a \"loser\", and that I will die alone and nobody will find me.\n\nYou see my dillema? I just don't know what I should do.. how I should feel and how I should live my life. Am I being a coward? Any kind of feedback is appreciated! Thank you for reading!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Should I live alone and comfortable or be social and miserable?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fnyvh/should_i_live_alone_and_comfortable_or_be_social/"
        },
        {
            "author": "dangerzone14",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1410043535,
            "domain": "self.Anxiety",
            "edited": 1410044015,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fo95w/are_your_20s_meant_to_be_confusing_anxious_and/",
            "gilded": 0,
            "id": "2fo95w",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fo95w/are_your_20s_meant_to_be_confusing_anxious_and/",
            "retrieved_on": 1441183496,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "Apologies in advance for the long post. I'm a guy turning 24 this week and I guess i'm just wondering is it normal to feel like this in your 20's? I wouldn't say i'm depressed and there's moments where I really feel like i'm enjoying life, but my 20s has been way more difficult/awkward than I imagined.\n\nI have suffered pretty bad anxiety since I was around 14, mainly health related (hypochondriac) and also a bit of social anxiety aswell. I thought I would've outgrown this by now, especially social anxiety. I've improved in this area over the last few months, but I feel like an outlier for someone my age. I shouldn't worry so much. Should be living in the moment.\n\nLoneliness is also something I suffer with and didn't expect. I'm an only child so you think I'd be used to it by now but sometimes I feel pretty damn lonely. I don't have a huge circle of friends (1 very good friend who I'd see a lot) and 3 or 4 other mates who I'd see every couple of months. This is in stark contrast to the people on my facebook feed who have great lives and are most probably never lonely. I haven't been in a relationship since I got dumped over 2 years ago and i'm still living at home.\n\nI don't really have any social hobbies (because of the anxiety), so i'm not sure how to reduce the feelings of loneliness. I obsessively compare myself to other people my age and have an idea in my mind that most twenty somethings are always busy outside of work with either social hobbies or girlfriends/boyfriends whereas my typical day after work involves playing guitar in my room or watching soccer. My typical weekend involves a few drinks on Friday and sometimes Saturdays, with pretty much nothing done during the day.\n\nI've only had sex with 1 girl and without sounding sleazy I thought this was meant to be the most promiscuous stage of life where you go through multiple sexual partners? I've got with girls on nights out but i'm always too drunk to actually have sex with them, even when its basically on a plate for me. I'm sure other people my age have been with well more than 1 person!\n\nI'm also kinda confused about what I want career wise. I graduated last year from college and have a job until December but after that I'm not sure that I want to continue in that line of work. I've a desire to live in a city outside of my country for at least 1 year but no idea what i'd be doing. I guess I just thought I should know by now what I want from life as im assuming most other people my age do.\n\nAre your 20s really meant to be a struggle? Or am I just overreacting to a pretty normal thing that many people go through? Any advice would be appreciated.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Are your 20's meant to be confusing, anxious and lonely?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fo95w/are_your_20s_meant_to_be_confusing_anxious_and/"
        },
        {
            "author": "throwawhine",
            "author_created_utc": 1409629559,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i6i5r",
            "created_utc": 1409690517,
            "domain": "self.Anxiety",
            "edited": 1409724913,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fajmh/is_love_possible/",
            "gilded": 0,
            "id": "2fajmh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fajmh/is_love_possible/",
            "retrieved_on": 1441189957,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I'm unemployed, severely depressed, pseudo-suicidal (if i didn't have such a great fear of death I would have committed suicide a long time ago and would now if I hadn't), and have borderline agoraphobia from my anxiety and I was wondering if any of you guys in a similar situation have been able to have a relationship. Where do you meet someone? What do they think of your condition? How do you feel about the relationship?\n\nEDIT: Thanks for all the replies. I hope something clicks.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is love possible?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fajmh/is_love_possible/"
        },
        {
            "author": "_high_flying_duck_",
            "author_created_utc": 1397379813,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g3r6f",
            "created_utc": 1409933744,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fk6v5/one_year_practicing_mindfulness_this_is_how_i/",
            "gilded": 0,
            "id": "2fk6v5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fk6v5/one_year_practicing_mindfulness_this_is_how_i/",
            "retrieved_on": 1441185392,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "TL;DR I had severe anxiety and agoraphobia (spent months without leaving the house), but now my anxiety is almost compltetly gone.\n\nI shared my story few months ago (http://www.reddit.com/r/Anxiety/comments/22ww9w/my_rather_long_story_of_conquering_sa/ if anyone is interested) and I wanted to write a quick update, becuase it has been almost one year since I started practicing mindfulness meditation.\nLet me just say that mindfulness meditation totally kicks ass. Until recently I didn't know what it feels like to wake up feeling confident and rested. \nSince I can remember the first thing I noticed and thought when I woke up was the panic, the pain in my stomach, the stress and the feeling of danger. \nOn days when I had to interact with other people, it was even worse - I could barely hold it and not break down.\n\nBut something has changed ... something in my brain and the way I process certain situations.\nThe anxiety is replaced by a feeling of confidence that I can handle any situation (even when that's not the case :)). In other words I do not worry whether I am going to get a panic attack.\nI think that the confidence is the result of the fact that for the first time in my life I started to love my self. Love - not like in being narcissistic, but accepting - I accept my thoughts, my worries and everything I am right now. This acceptance IMHO is the crucial part - holding on hard to an idea that I have to be this or that is the thing that kept the status quo and prevented me from being able to change.\n\nThe fear and the anxiety from the possibility of getting panic attacks is the thing that kept me in my shell so much time. I do not feel the need to plan ahead every little detail of my interaction with others.\nAnd I used to do it a lot. I used to spend so much time on imagining how a conversation will go, what I will say, what might happen. Or the ruminating about past conversations - oh, I really hated this one.\nSometimes I catch a thought of anxiety, but it remains just that - a thought. I notice an old trigger thought coming and going so easy now that I sometimes wonder what all the fuss was about and why was I so afraid and even ashamed of my thoughts.\n\n\n\nNow, what I did/do: \nI started with 10-15 minutes two times per day, everyday. I simply couldn't handle more at the beginning. \nFew months later I was able to sit 45 minutes. More than this and I was beggining to feel the urge to stop ... like my mind couldn't take it anymore and needed to rest.\nRight now I can sit up to 2 hours, before my body gets physically tired and I have to stop. \nThere are different recommendations on what to concentrate on - some say on the sensations in your belly while breathing, others say on the tip of the nose... I prefer the sensations in my belly. Although with time it becomes less important and you can \"be in the moment breathing\" without needing too much effort \"tuning in\" to any bodily sensations... it just becomes effortless.\n\nMy advice to you all - start meditating, do not be hard on yourself, be patient and accept yourself the way you are right now and things will get better. Persistance is the key.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "One year practicing mindfulness - this is how I changed",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fk6v5/one_year_practicing_mindfulness_this_is_how_i/"
        },
        {
            "author": "xasthur",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1409893083,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fiwxi/my_skin_is_crawling/",
            "gilded": 0,
            "id": "2fiwxi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fiwxi/my_skin_is_crawling/",
            "retrieved_on": 1441185987,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I just can't deal with that feeling where you feel completely uncomfortable in your skin. Everything's jittery and there's a pit in the middle of your stomach taking away a lot of your breath capacity.\n\nI can't concentrate on anything and my eyes are just darting back and forth all over my room searching for something I don't know. \n\nI just feel so frustrated all the time for no reason. I'm glad for days when my anxiety isn't that bad so I can just focus on dealing with depression. But dealing with both at the same time is just unbearable. \n\nSome days I just want to leave everything in my life behind and just walk nowhere until I collapse and die.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My skin is crawling.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fiwxi/my_skin_is_crawling/"
        },
        {
            "author": "renenator",
            "author_created_utc": 1384315248,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dw56d",
            "created_utc": 1409792669,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fetp8/todays_anxiety_mantra/",
            "gilded": 0,
            "id": "2fetp8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fetp8/todays_anxiety_mantra/",
            "retrieved_on": 1441187957,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "Today, I'm choosing to refresh my mindset. Flip the positivity switch back to the 'ON' position and let the things that hurt me, irritate me or cause stress in my life roll off my back like water. I will love fearlessly but never waste a speck of energy on those who no longer enhance my life in any way.  \n\n\n\nIt's no secret, I'm the type that gets extremely affected by the actions and lives of others. I don't like to admit it but I'm extremely sensitive and struggle to stay a float, often drowning in a sea of my own emotion. Each day is a test, a battle. Most days I go to bed feeling like my anxiety has won. But not today, nor tomorrow. I will teach myself new thought patterns, breathe deeply and remember that I am not my anxiety. I am simply a living breathing human being that deserves a good life and peace of mind from time to time. I will allow myself this, I will participate in activities that calm me. I will face things that I am afraid of head on, improving little by little with each new day.\n\n\nThis is all I can do. I refuse to believe that this is something that is “happening to me” and I just have to lay down and take it. I will decide if I’ll let it consume me or not, I will silence my brain to allow myself some tranquility and coax my racing thoughts into submission from time to time. \n\n\n\n**I’m going to make anxiety my bitch today.**",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Today's Anxiety Mantra",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fetp8/todays_anxiety_mantra/"
        },
        {
            "author": "cameltoeee",
            "author_created_utc": 1398350597,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ga740",
            "created_utc": 1409624730,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f8141/the_feeling_of_being_an_anxiety_fraud_during/",
            "gilded": 0,
            "id": "2f8141",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f8141/the_feeling_of_being_an_anxiety_fraud_during/",
            "retrieved_on": 1441191185,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I was particularly happy today, just had a lot of good things going and really forgot about my anxious feelings due to the distraction. Anyways, at night I was thinking \"man, what if I don't have anxiety issues after all and I have been lying this entire time\" and that thought of ANXIETY really struck me funny, because I was having an anxious thought about not being anxious. I was wondering if anyone else has similar feelings like this some days, like you have been a fraud the entire time.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The Feeling of Being an Anxiety Fraud during times of Happiness",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f8141/the_feeling_of_being_an_anxiety_fraud_during/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1409618150,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f7qub/ocd_anxiety_disorders_crash_course_psychology_29/",
            "gilded": 0,
            "id": "2f7qub",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "CrashCourse",
                    "author_url": "http://www.youtube.com/user/crashcourse",
                    "description": "You can directly support Crash Course at http://www.subbable.com/crashcourse Subscribe for as little as $0 to keep up with everything we're doing. Also, if you can afford to pay a little every month, it really helps us to continue producing great content. *** Ever call someone OCD because they like to have a clean apartment?",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FaX7jnVXXG5o%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DaX7jnVXXG5o&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FaX7jnVXXG5o%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i.ytimg.com/vi/aX7jnVXXG5o/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "OCD &amp; Anxiety Disorders: Crash Course Psychology #29",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=aX7jnVXXG5o",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FaX7jnVXXG5o%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DaX7jnVXXG5o&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FaX7jnVXXG5o%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f7qub/ocd_anxiety_disorders_crash_course_psychology_29/",
            "retrieved_on": 1441191320,
            "score": 22,
            "secure_media": {
                "oembed": {
                    "author_name": "CrashCourse",
                    "author_url": "http://www.youtube.com/user/crashcourse",
                    "description": "You can directly support Crash Course at http://www.subbable.com/crashcourse Subscribe for as little as $0 to keep up with everything we're doing. Also, if you can afford to pay a little every month, it really helps us to continue producing great content. *** Ever call someone OCD because they like to have a clean apartment?",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FaX7jnVXXG5o%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DaX7jnVXXG5o&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FaX7jnVXXG5o%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.ytimg.com%2Fvi%2FaX7jnVXXG5o%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "OCD &amp; Anxiety Disorders: Crash Course Psychology #29",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=aX7jnVXXG5o",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FaX7jnVXXG5o%3Ffeature%3Doembed&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DaX7jnVXXG5o&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FaX7jnVXXG5o%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "OCD &amp; Anxiety Disorders: Crash Course Psychology #29",
            "url": "https://www.youtube.com/watch?v=aX7jnVXXG5o"
        },
        {
            "author": "anxietythrowaway945",
            "author_created_utc": 1409668846,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i6ves",
            "created_utc": 1409669843,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f9hje/i_dont_know_what_to_do_my_anxiety_is_taking_over/",
            "gilded": 0,
            "id": "2f9hje",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f9hje/i_dont_know_what_to_do_my_anxiety_is_taking_over/",
            "retrieved_on": 1441190506,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I'm 18 and have had mild anxiety all my life, but it's been getting a lot worse this past year. In my last year in college I couldn't even make it in for weeks even though I enjoyed it, I would throw up every morning and feel incredibly sick and when I did manage to get into college I often had panic attacks. Sometimes I was okay as I was heavily distracted with work deadlines and having friends around. I went to see a doctor about it at that point and she basically told me to get over it and couldn't give me anything as I was under 18 at the time.\nAfter finishing college I went job hunting and for the most part I was okay, and didn't have much anxiety, I went to my first interview feeling unwell due to it but it didn't get to the point where I would be physically sick. I did get through many packets of mints though.\nI got the job and my first day I was okay (yesterday), but today I went into work supposed to be doing 9-5 but only managed 9-2. I didn't sleep the night before and threw up in the morning before leaving. I felt heavily sick the entire day, and since I got up until 2 I had this overwhelming urge to cry and kept getting tears in my eyes whilst working and I didn't know why. Eventually I had to excuse myself to the loo and cry and throw up.\nI haven't stopped crying since then (almost 2 hours) because I feel so stupid for going home on only my second day of work, and I also feel like I'm not going to be able to manage and will get fired over it if I keep having to do it. I can't go In to work tomorrow as I threw up and you have to wait 48 hours so I'm going to the doctors but last time I went about this I could barely speak because I was in tears and didn't like talking about it, I feel so pathetic. \nI work in a nursery for 0-2 year olds and the people there don't know I've been suffering from anxiety and they just think I have a stomach bug. You would have thought I'd be distracted in a nursery but there's actually little to do other than sit on the floor and talk to kids who can't talk back to you. I thought this job would be perfect for me but even if I did get a different job I'd still have the same problems.\nI literally wish I could curl up into a ball in my house and never come out. I hate it and people just keep telling me to get over it but I don't know how. I also wish I could work from home but I don't think that's even a possibility, or easy to come by. \nI just really need some advice please. If anyone has even taken the time to read all of that I appreciate it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I don't know what to do, my anxiety is taking over [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f9hje/i_dont_know_what_to_do_my_anxiety_is_taking_over/"
        },
        {
            "author": "Katy-J",
            "author_created_utc": 1372451454,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c75ok",
            "created_utc": 1409698813,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2faymv/a_good_thing_happened_today/",
            "gilded": 0,
            "id": "2faymv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2faymv/a_good_thing_happened_today/",
            "retrieved_on": 1441189759,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "My supervisor and I had a talk today. I wanted to give her a heads up about my anxiety problems just because the last month or so has been kind of rough, and I've kind of been declining.. I found out that one of her sons has some serious problems with depression and anxiety. That makes me feel so much better because for once, I'm going to have a supervisor who actually kind of gets it. She said she even saw it in me before I even told her what was up. I'm not sure how I feel about that part, but I'm still so happy to have someone who understands. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A good thing happened today!!!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2faymv/a_good_thing_happened_today/"
        },
        {
            "author": "KayTeeRumble",
            "author_created_utc": 1370402614,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bxgvx",
            "created_utc": 1409659804,
            "domain": "self.Anxiety",
            "edited": 1410085675,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f93ea/i_am_constantly_anxious_about_work_and_being/",
            "gilded": 0,
            "id": "2f93ea",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f93ea/i_am_constantly_anxious_about_work_and_being/",
            "retrieved_on": 1441190689,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I started my dream job at a pharmaceutical company 5 weeks ago. I am so scared of losing my job to the point I can't even do it properly because I'm scared I'll make a mistake. I love the job itself but I've made a couple of mistakes in the last two weeks- emailing the team without consulting my manager and having it misinterpreted, speaking to a customer about things outside of my role and just today, I received a complaint against me for reasons I don't yet know and can't pinpoint at all. \n\nI am absolutely dreading waking up tomorrow and have cried so much today that my eyes are swollen shut right now. \n\nI can't relax and pick myself up again like every other time. I feel like one more thing will make me swerve my car into the oncoming lane. It's getting out of hand and everything is against me right now. \n\nI need people to tell me to snap out of it rather than to support or baby me, or at least help me put things in perspective again. \n\nUPDATE: Hi All, I'm faced with another problem... \n\nA former employer is asking me to pay a fine of AUD$1500 for accidentally setting off a smoke alarm...\n\nThe store is actually a customer of my company's and I have no idea what to do. Legally, I am not responsible as it was an accident- burnt toast- but I can't have this affect my current job as my old employer is a complete jerk and I'd go to say the worst human being I've ever met. \n\nI don't know what to do... I'm trying so hard to not let this get to me but it's just terrible timing that this happens in the same week and potentially makes me look like a troublemaker. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I am constantly anxious about work and being fired from my new (dream) job. I am completely overwhelmed and afraid of making mistakes now.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f93ea/i_am_constantly_anxious_about_work_and_being/"
        },
        {
            "author": "ineedsomehelplease",
            "author_created_utc": 1409879596,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_i8w81",
            "created_utc": 1409880809,
            "domain": "self.Anxiety",
            "edited": 1410016357,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2fif8j/someone_help_please/",
            "gilded": 0,
            "id": "2fif8j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2fif8j/someone_help_please/",
            "retrieved_on": 1441186217,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "please i can't take this anymore. i feel like a fucking monster. i feel like i'm going crazy. EVERY LITTLE THING gives me a panic attack. like, (please please don't joke or mock me about thisi already know how insane it sounds) yesterday i was texting with someone via facebook and the time was 9:45 pm but the time it marked as the 'seen message' was 9:46 pm and the rational part of my brain keeps telling me it was just a mistake, especially because this someone had been talking to me all day and posting stuff and so, it couldn't not be them and the more i talk about it, the more i realize there's no problem BUT I NEED to be sure and so (look at how crazy i am) i created fake accounts to see if the problem was there too, and i realized by the time the clock marked 20 seconds to the next minute, fb would already mark the next minute. for example, 8:44:40 pm and fb would already mark it as 8:45:00 pm, you know? and the problem is now gone and the reason i'm telling you this is just so you guys can see how crazy i am because that sent me over the edge and i don't know why. i kept thinking how ridiculous i am. what, the person was seeing the message from the future? by one minute? \n\nand then, for some crazy reaso, i started crying like hell and sometimes i don't even believe things are actually happening, i actually doubted that conversation even happened, i'm scared because this is serious, isn't it? doubting things are happening. sometimes i doubt the person i was talking to is really the person i'm talking to. what if there's someone mocking me on the other side?\n\nyes, i had a few problems when i was younger. some people made my life a living hell and now i don't trust anything, i can't even believe someone might be falling in love with me\n\nand these tiny little things make me cry and have a panic attack. i had a panic attack over a photo, i had another one when i convinced myself of something that wasn't true and i do mean panic attack---the out of breath, am i going to die kind. \n\ni just want to breathe. i don't know how to breathe anymore, my nerves are all damaged, my muscles all cramped, i have headaches and other aches all over my body and they never go away, they never ever go away i just want some help\ni already saw someone, i already talked about,  when i try to talk about it with people i'm close to i get yelled at because they can no longer hear me, they can't stand me anymore and i don't blame them, it's like every time something EXTREMELY GOOD happens i get an anxiety attack\n\ni feel like dying\nplease someone say something\nam i gonna be alright\nit's all in my head isn't it?\n\nEDIT: thank you everyone who commented and helped me. i feel a lot calmer now, i feel sane. even if it's just for today or i don't know, i feel a little bit of relief. thank you thank you &lt;3",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Someone Help Please",
            "url": "http://www.reddit.com/r/Anxiety/comments/2fif8j/someone_help_please/"
        },
        {
            "author": "rachiedoubt",
            "author_created_utc": 1296204816,
            "author_flair_css_class": "",
            "author_flair_text": "complex PTSD",
            "author_fullname": "t2_4ry3c",
            "created_utc": 1409652211,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f8w31/help_has_anyone_ever_had_anxiety_wake_them_up/",
            "gilded": 0,
            "id": "2f8w31",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f8w31/help_has_anyone_ever_had_anxiety_wake_them_up/",
            "retrieved_on": 1441190785,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "At least, I think that's what happened. Before I tell the whole story, I'll say this: I'm a 22 year old female, currently not on any medication. I've been diagnosed with social anxiety and generalized anxiety in the past but it's also currently affecting me. I was recently diagnosed with PTSD, however, after an incident that happened in January.\n\nSo, a few nights ago, I'm at a friends house. We had been smoking pot, drinking a little, having fun. I don't do that sort of thing much anymore, maybe only a few times a month. This was the first time I'd smoked in two weeks. I lay down to go to sleep, and it must not have even been 2 minutes later that I was woken up to my left shoulder jerking. Super hard. It was my shoulder/chest. It scared the hell out of me, and I darted awake. As I sat up, I had this feeling creep over my whole body. It was like hot water but cold water at the same time, and I felt like I was floating or about to just... die. So I went to the kitchen to get water, as I also felt light headed. By the time I'm in the kitchen, my arms are not just shaking, but they're jerking. My legs started to do it too. And for 45 minutes I sat on the kitchen floor jerking about, not able to stand or move or hold anything or get myself to breathe normally. The jerking itself is what freaked me out the most at first. I just kept crying and panicking because it felt like my legs would never stop, and I just felt so awful inside. I've never had that feeling. It was the worst thing. I can't even describe it with words now.\n\nAfter about an hour I started to have really bad chest pains. Before that, my chest was definitely tight. And it felt weird. But it randomly started hurting in the middle of everything else that was happening. And I just honest to god thought I was going to die. The pain was unbearable. It was like fire, knives, cracking. All in the middle of my chest, and I could feel my heart twitching and palpitating through my skin. All the while, still practically convulsing. I kept getting a bad headache, and my ears would feel like they were going to pop, and then they would ring, and then my face went numb. So, after almost 2 hours I was like, screw this, I'm going to the hospital. Because, yeah, I've had anxiety attacks for about... 8 years now, and NOTHING like this had ever happened. So I really didn't think that's what it was. And if it was (I'm thinking it was), I wouldn't have been able to logically handle the situation at that point anyway.\n\nWhen I got there my heart rate was above 120. They gave me an EKG, set me up to a heart monitor, and watched me basically calm down. My heart was still jumping all around, but I finally stopped twitching and being in excruciating pain after about 3 hours. They said at first they thought I was having a seizure, but nah, it was probably just severe anxiety. And I was like, wait, whut? REALLY? Simply because I'd never felt that way before in my life. I never knew I was capable of having anxiety THAT bad. \n\nI went home, slept a lot. The next day I felt like shit. So sore everywhere, even in my chest. My legs were weak. I took care of myself and then the next day I was feeling even better. Today. Without really thinking about it, I decided to smoke a little bit of pot today, too. I had one hit. And then... the feeling came on again. The light headed, warm water, cold water, tingly feeling. I can't find any other way to describe it other than that. It's like a feeling just rolls in onto you, and you can't push it off. It sticks. And I was like, wait. No. Fuck. This is NOT happening again. I had to go sit outside by myself to try and keep it at bay, but my legs started twitching again, and I kept forgetting to breathe and I kept randomly crying. Luckily I had a lorazepam left over so I took half of it, and an hour later I was ok. \n\nSo, my gut is telling me it's the weed. I don't know what else it would be, unless I'm having some kind of weird new PTSD kind of anxiety. Which it could be that too. Has this ever happened to anyone else? Sorry if I did a terrible job describing... I'm still a little weird from the lorazepam. But the night when it was REALLY bad, I had smoked significantly more than I did today when it happened again to a much lesser degree. It could also just be a combination of everything, and the state I've been in these past... 8 months. \n\nBut seriously. That night when I went to the hospital, I thought I was dying. I was convinced. I was jerked awake to a COMPLETELY physical anxiety attack. By my body. There was no emotion to it. I wasn't sad, or anxious, or worried about anything other than the fact that my legs were jerking and I couldn't stop it and inside I just felt this horrible dread like feeling, like I wasn't gonna make it out alive. I even started thinking about my funeral before I went to the hospital. That's when I was like, okay, if I actually think I might die, I need to go.\n\nSorry if I'm ranting. I'm still a little flustered and not fully recovered from it all. But if anyone has any insight or can even understand my messy paragraphs, I'd love some feedback or advice. Anything would help. Thank you, I'm gonna go pass out now. :P",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Has anyone ever had anxiety wake them up from sleeping, and then turn into a full blown attack?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f8w31/help_has_anyone_ever_had_anxiety_wake_them_up/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1409605449,
            "domain": "self.Anxiety",
            "edited": 1409608514,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2f7693/i_am_a_19yo_male_with_no_previous_history_of/",
            "gilded": 0,
            "id": "2f7693",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2f7693/i_am_a_19yo_male_with_no_previous_history_of/",
            "retrieved_on": 1441191585,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "Ok, so I'll give some background to my story.\nI'm a 19 year old Irish guy who is due to start university in about 3 weeks. I've had a pretty rough time the past 6-8 years of my life. Mainly the last 3 years. When I was 16 I was diagnosed with Crohn's Disease after falling very ill, my bodyweight dropped from 65kg down to 38kg in a space of three weeks, I needed a lot of surgery due to infection, it was a bad time for well over a year. I missed that whole year of school. Towards the end of that calendar year, halfway through a new school year,  an old bully of mine decided it was the right time to randomly attack me at school. He left me in hospital with a fractured skull and eye socket, and it didn't end there. He received no punishment and I was back in school with him a week later. For the next month I was attacked every day by him and his group of friends. The school knew about this and the only help they offered me was assistance in transferring schools, so I did.\nSo I moved school to finish my final year and a half in peace, deliberately making no friends and getting in no trouble. I did develop a dependency on alcohol and drugs for a while, which I have overcome now.\nI did my final school exams in June after an intense year of studying 10+ hours a day, and I am due to start college in 3 weeks time.\n\nThe point I'm trying to make with this is that I have had my fair share of shit, (no more than anyone else, it's not a competition) but NOT ONCE have I ever had a problem with anxiety.\n\nSo a month ago I got the results to my final exams. The day I went into collect them from school I suffered a massive panic attack. I understood what it was and just left immediately and went home to calm down. There was a lot going on these results (my success on reaching med school) so I wasn't really surprised to have a panic attack.\n\nHowever, everyday since that day I have had panic attacks.  They can get very severe leaving me unable to walk or talk, experiencing distorted vision and nausea etc.  I can't even leave my house anymore, even suffering episodes in my own house.\nSeeing as I have an autoimmune disease, and taking strong immunosuppressants,  and having herpes on my nose at the time of the first panic attack, my doctor feared the virus had spread into my spinal fluid and brain and that that was what was causing these panic attacks.\nI have just been discharged from hospital early today, all the brain scans and the lumbar puncture came back normal.\nIt really is just panic attacks.\n\nI never thought anxiety issues could just appear like that. I'm still coming to terms with all this and what it means for me. I'm worried that I might not be able to move out and start my life in university in the next 3 weeks.\n\n**tl;dr: Dealt with really stressful situations before, had no problems with anxiety. Out of the blue panic attacks everyday, I can't even leave my house anymore.**\n\nThis post has no real purpose so far, I suppose I just wanted to spill my story to a place that might give me some answers.\n\nAny opinions, advice, information, or guidance would be greatly appreciated.\n\n**Edit: I probably should have included this:**\n\nI have an appointment with my doctor this Wednesday, which is a pre-requisite to getting a therapist/psychologist. The hospital also prescribed me with a weeks supply of Diazepam 5mg, but I want to do more research before committing to medication. (But I will if it is necessary)\n\nRight now my family is completely clueless when it comes to panic attacks, but they will learn more about them, and I know they will be fully supportive and do their best to help.\nI'll be doing plenty of research now until I'm feeling comfortable with my knowledge on the topic!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I am a 19y.o. male with no previous history of anxiety problems. Starting a month ago I've had at least 1 panic attack every day, advice needed.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2f7693/i_am_a_19yo_male_with_no_previous_history_of/"
        }
    ]
}