{
    "data": [
        {
            "author": "Jammybrown11",
            "author_created_utc": 1343848107,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8iz25",
            "created_utc": 1427198755,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/304g3z/i_just_gave_a_presentation_without_stuttering_or/",
            "gilded": 0,
            "id": "304g3z",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/304g3z/i_just_gave_a_presentation_without_stuttering_or/",
            "retrieved_on": 1440835708,
            "score": 281,
            "secure_media_embed": {},
            "selftext": "I've had an anxiety disorder for over 7 years now - and for the first time ever, I just gave a decent presentation, where I had to talk for 10 minutes straight. \n\nI just wanted to share with you guys my little success story. I thought i'd share as some of you guys might be able to relate what an achievement this is :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just gave a presentation without stuttering or shaking!",
            "url": "http://www.reddit.com/r/Anxiety/comments/304g3z/i_just_gave_a_presentation_without_stuttering_or/"
        },
        {
            "author": "Squishydew",
            "author_created_utc": 1413476224,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iw0gs",
            "created_utc": 1427123686,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/300oj6/i_hope_positive_posts_are_okay_i_finally_bought/",
            "gilded": 0,
            "id": "300oj6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/300oj6/i_hope_positive_posts_are_okay_i_finally_bought/",
            "retrieved_on": 1440837465,
            "score": 191,
            "secure_media_embed": {},
            "selftext": "I don't know what came over me but today i just felt like i could do it, i told myself that fear meant a challenge, and that it was one i could take on!  \n\nI went out and walked past the clothing store at least 3 times, nervous, sweating, but not shaking, finally i went in determined to get what i needed, i even managed to try a set of pants on to get my correct sizes, normally i would've freaked out and left before even touching them!  \n\nI feel so damn proud right now, maybe It's ridiculous, maybe this can be a small motivator for someone, you can do it!!  \n\nI have pants, and they FIT! :D  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hope positive posts are okay! I finally bought clothes!",
            "url": "http://www.reddit.com/r/Anxiety/comments/300oj6/i_hope_positive_posts_are_okay_i_finally_bought/"
        },
        {
            "author": "Ididityaaaaaay",
            "author_created_utc": 1427508237,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mjb7t",
            "created_utc": 1427508419,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30k6vq/i_did_it/",
            "gilded": 0,
            "id": "30k6vq",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30k6vq/i_did_it/",
            "retrieved_on": 1440828241,
            "score": 191,
            "secure_media_embed": {},
            "selftext": "I stood up in front of my class and did an entire 15 slide presentation to my French class in front of my crush. I answered questions and remembered everybody's name. I got a 93% on it.\nI only threw up after the class a little bit.\n\nToday was a good day.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I did it!",
            "url": "http://www.reddit.com/r/Anxiety/comments/30k6vq/i_did_it/"
        },
        {
            "author": "hahatimefor4chan",
            "author_created_utc": 1291567249,
            "author_flair_css_class": "",
            "author_flair_text": "SoCal Anxiety",
            "author_fullname": "t2_4l5i3",
            "created_utc": 1427097332,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zzphr/i_got_on_the_deans_honor_roll_fu_anxiety/",
            "gilded": 0,
            "id": "2zzphr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zzphr/i_got_on_the_deans_honor_roll_fu_anxiety/",
            "retrieved_on": 1440837919,
            "score": 129,
            "secure_media_embed": {},
            "selftext": "http://imgur.com/uhgL7N5\n\n\n Total shitpost but i'm too excited to care. I've been battling anxiety while in college for a long time and it feels so good to see concrete progress. I still struggle with anxiety everyday but i'm doing alot better now then i used too so i guess its proof you can fight back against anxiety and not let it control you. Its 3am right now so forgive any typos and ramblings (ironically i'm having a hard time sleeping because of anxiety)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I GOT ON THE DEANS HONOR ROLL! FU ANXIETY",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zzphr/i_got_on_the_deans_honor_roll_fu_anxiety/"
        },
        {
            "author": "Prisaneify",
            "author_created_utc": 1351777269,
            "author_flair_css_class": "",
            "author_flair_text": "BPD",
            "author_fullname": "t2_9h1u6",
            "created_utc": 1426997058,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zvhux/my_son_is_9_and_tonight_we_had_over_our_first/",
            "gilded": 0,
            "id": "2zvhux",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zvhux/my_son_is_9_and_tonight_we_had_over_our_first/",
            "retrieved_on": 1440839885,
            "score": 125,
            "secure_media_embed": {},
            "selftext": "I've never been one to open up my space to anyone really, especially not another child. I just have way too much anxiety about not having the right food or not being able to entertain or whatever else is the case. I don't want to be responsible for anyone else but my kiddo.\n\nTonight I decided on the fly random to accept his cousin's dad's request to watch him, and so far we are about 3 hours in and we went to the store to get a few candy snacks, got some fro-yo, they played a game for a few minutes, then we stat down and watched Godzilla together, and now they are making paper swords and crap to play out their own version of the movie. \n\n\nSoon I'll put them to bed and call it a night myself.\n\nThis is a big step for me. Hopefully I can handle doing this again with someone not in the family so that I can give my kiddo at least some sense of a \"normal\" childhood at my house (does this all the time at his dads and such so he isn't missing out on it completely) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My son is 9, and tonight we had over our first guest. Ever.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zvhux/my_son_is_9_and_tonight_we_had_over_our_first/"
        },
        {
            "author": "Whyb52",
            "author_created_utc": 1370924442,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bzx9y",
            "created_utc": 1427388129,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30dzob/anyone_else_get_super_anxious_friendrequesting/",
            "gilded": 0,
            "id": "30dzob",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30dzob/anyone_else_get_super_anxious_friendrequesting/",
            "retrieved_on": 1440831196,
            "score": 110,
            "secure_media_embed": {},
            "selftext": "I just went through some friends suggestions on Facebook and requested a couple. It feels awful. I dunno, fear of rejection or something. These are people I see a few times a week and I could only bring myself to request a few of them. It's weird. I feel nauseous.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else get super anxious friend-requesting people on Facebook?",
            "url": "http://www.reddit.com/r/Anxiety/comments/30dzob/anyone_else_get_super_anxious_friendrequesting/"
        },
        {
            "author": "SweatingHell",
            "author_created_utc": 1427048463,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mf6s9",
            "created_utc": 1427049823,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zxe7e/sweating_i_hate_it_more_than_anything_in_my_life/",
            "gilded": 0,
            "id": "2zxe7e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 41,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zxe7e/sweating_i_hate_it_more_than_anything_in_my_life/",
            "retrieved_on": 1440839002,
            "score": 82,
            "secure_media_embed": {},
            "selftext": "I sweat. A lot.\n\nI've always sweat quite a lot, but it started to get worse when I started lifting weights around 17 years old. I got bigger and noticed I started sweating under my arms a bit more. That was fine, it wasn't a big deal. I just started using a stronger antiperspirant and it stopped. People noticed though, and commented, which obviously made me want it to stop, so I did something about it.\n\nSince then, I've become very self concious about my sweating. It seems to get worse and worse. It's a vicious circle; I know I'm going to start sweating, I can feel it coming, I try my hardest to stop it from happening, breathing, slowing down, trying to calm myself, but it still happens. To the point where I'm literally dripping. Everywhere, face, head, back, chest, neck, everywhere. \n\nIt's happened before where I've been in the chair about to get my hair cut. The barber has started chatting to me, like a normal human being would do, then I start getting a bit awkward and shock, begin to sweat. Just a tiny bit to start with, barely enough for anyone to notice. But then I think to myself, \"Please don't get any worse.\" But it does. Next thing you know, I'm sitting in the chair, sweat pouring from every single part of my body, the barbers grabbed a towel, got me a glass of water, asking if I'm ok, and I'm sitting there, more embarrassed than I've ever been in my life, just wishing it would stop. Wishing no one would say a thing and just let me calm down. Eventually I did, but even walking to the barbers now I can feel my heart beating faster, just waiting for my body to break out and look like I'm about to pass out.\n\nIt's whenever I talk to someone new. Or whenever I talk to someone I'm not totally comfortable with. I'm just too fucking self concious about everything and I hate it.\n\nIt's embarrassing, humiliating, and I don't want to be known as the guy who sweats like an animal.\n\nMy friends know I sweat a lot, but that's mainly when we're doing exercise or playing football or whatever. I'm dripping, literally dripping with sweat after about 10 minutes of mild exercise. The problem is, I don't care if I sweat during physical activity, that's expected, I know people sweat more than others. We joke about how it's because I'm in such bad shape, but I completed a 12 mile assault course about 5 months ago, I'm not too much of a couch potato. It's when I sweat just talking to someone that I hate.\n\nIt's genuinely making me depressed. I hate it. I'm content with everything in my life, but this. Giving a presentation to people at work; before I'd even stood up, I could feel what would happen. I don't care if I'm nervous, everyone gets nervous. But when I get nervous or anxious or self concious, I sweat more than anyone else I've ever seen in my life.\n\nI'm not trying to be melodramatic about this, I really do. I've never met anyone who even comes close to how much I sweat. I shouldn't have to go outside for 10 minutes to cool off and dry off every time someone I haven't known for 10 years talks to me for 30 seconds. That in itself is embarrassing. \"Where have you been?\", \"Oh, just had to go outside and calm down and let the sweat dry off because I can't talk to people without panicking and soaking my shirt through\", \"Oh... ok\".\n\nHas anyone else dealt with this? What did you do? I hate it. So so much.\n\nEven searching on the internet, I've yet to find examples of anyone struggling as much as I do. Maybe I've not been searching enough.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sweating. I hate it. More than anything in my life, I fucking hate it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zxe7e/sweating_i_hate_it_more_than_anything_in_my_life/"
        },
        {
            "author": "Optimum_Pooper",
            "author_created_utc": 1335237320,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7ji9p",
            "created_utc": 1427248506,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/307f6k/today_i_had_my_first_job_interview_in_almost_four/",
            "gilded": 0,
            "id": "307f6k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/307f6k/today_i_had_my_first_job_interview_in_almost_four/",
            "retrieved_on": 1440834261,
            "score": 76,
            "secure_media_embed": {},
            "selftext": "In the past four years, I've gone from retail employee, to student, to college dropout, to complete agoraphobic. I didn't leave my house for almost a whole year. And then, this past year and a half or so, I started pushing myself, with the help of my therapist, to get back out of the house and being around people. \n\nI attended church with my family (though I stood in the back where I could escape when I needed to), I started attending various open mic events at local coffee shops and bars, and I've made new friends that I never would have met, had I not pushed myself. \n\nNow, I've since become an agnostic/deist/whatever, I'm back in school (studying online, but it's better than nothing), I'm actually playing music at the open mic events on a regular basis, and I finally feel happy again. And, as I said in the title, I had a job interview today and I think it went really well.\n\nI still deal with anxiety on occasion, but I know how to manage it now, and without taking any prescriptions. \n\nI just want to add that, if you're dealing with anxiety, it can get better. You can take control of it. I want to encourage anyone and everyone here and say that you can do it!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Today, I had my first job interview in almost four years!",
            "url": "http://www.reddit.com/r/Anxiety/comments/307f6k/today_i_had_my_first_job_interview_in_almost_four/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1427341533,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30c3s6/do_you_ever_find_yourself_getting_stuck_in/",
            "gilded": 0,
            "id": "30c3s6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30c3s6/do_you_ever_find_yourself_getting_stuck_in/",
            "retrieved_on": 1440832075,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "So I have a thing where I just get stuck thinking about negative and/or worrisome things for long periods at a time such as 30 min to an hour. Whether it's something that worries me or something that makes me angry, I just get stuck in these little episodes for sometimes like an hour at a time. Like right now I've just had negative thoughts going through my head for the past 40 minutes and it's hard to get it out.\n\nCan anyone relate? Any solutions?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Do you ever find yourself getting stuck in negative thought \"loops\" ?",
            "url": "http://www.reddit.com/r/Anxiety/comments/30c3s6/do_you_ever_find_yourself_getting_stuck_in/"
        },
        {
            "author": "aerydotcalm",
            "author_created_utc": 1425982422,
            "author_flair_css_class": "",
            "author_flair_text": "Panic Disorder/Social Anxiety/OCD",
            "author_fullname": "t2_m13y1",
            "created_utc": 1427444789,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30h0o8/anyone_have_advice_for_exercising_at_home_to_help/",
            "gilded": 0,
            "id": "30h0o8",
            "is_self": true,
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30h0o8/anyone_have_advice_for_exercising_at_home_to_help/",
            "retrieved_on": 1440829722,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "Note: running outside is something that I have done quite a bit, but lately I just haven't been able to leave the house and the most contact I get with outside is letting my dog out the back door. \n\nI have a treadmill in the basement, but it feels like a dungeon down there with no windows and all concrete. Unfortunately, small house means there is absolutely zero room for it upstairs. I don't really know what I am looking for -- I would really like to lose weight, but I'm mostly looking for some good old happy endorphins, I think. Yoga, ballet barre, pilates, body weight stuff? I don't know, throw it at me! Something I could do in the living room would be best. If you know any really great people to follow that have some solid easing in to exercising or something to help with anxiety, that would be awesome. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone have advice for exercising at home to help with anxiety - some good youtubers to follow or similar?",
            "url": "http://www.reddit.com/r/Anxiety/comments/30h0o8/anyone_have_advice_for_exercising_at_home_to_help/"
        },
        {
            "author": "arrowhoodcobra",
            "author_created_utc": 1419445841,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kas3d",
            "created_utc": 1427300964,
            "domain": "self.Anxiety",
            "edited": 1427771919,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/309mgk/terrified_of_phone_calls_help/",
            "gilded": 0,
            "id": "309mgk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/309mgk/terrified_of_phone_calls_help/",
            "retrieved_on": 1440833233,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "This is basically my first reddit post ever so I'm not entirely sure how to go about this.\n\nBasically, whenever I have to make a phone call, I get crazy anxious. I basically curl up on my bed and rock back and forth. Sometimes I hide under the blanket for an hour or so. And when I finally do work up the courage to make a phone call, I shake like a leaf and stammer/can't reply a lot. \nI get anxious with receiving calls too but not nearly as bad. I basically react to my phone ringing like a jumpscare. I'm startled and afraid at first, but once I answer it seems to go perfectly fine. I guess as long as I'm not the one initiating the conversation, I do better.\n\nBut the biggest problem is that I have no idea how to work on getting better with this. I don't know anyone who has phone call anxiety nearly as bad as I do, and they don't know what to tell me. I'm so tired of being terrified of my own phone. Can anyone give me some advice?\n\nEDIT:: Sorry for taking so long to do this. Thank you to everyone who responded! You all had really useful advice and I feel like I can start being that much more confident with the phone :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Terrified of phone calls. Help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/309mgk/terrified_of_phone_calls_help/"
        },
        {
            "author": "hollow422",
            "author_created_utc": 1374255297,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cfulm",
            "created_utc": 1427414272,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30fofu/both_parents_sister_2_jobs_lost_in_2yrs/",
            "gilded": 0,
            "id": "30fofu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30fofu/both_parents_sister_2_jobs_lost_in_2yrs/",
            "retrieved_on": 1440830347,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "Hi, I'm Justin. 29y/o in Texas.\n\nSo, long story short. I didn't have the best relationship with my parents. (Shocker!) \n\n~2yrs ago: My mom was in hospice for about 2 months losing against lung cancer. I was trying to prepare myself for that inevitability. But, my dad shocked us all by going first. He had a heart attack at her bedside just days before she also passed. The next month, my dog suddenly dies,  I spend 2 weeks in the hospital with Pancreatitis. I miss too much work and get fired from the best job I ever had. I worked there nearly 5yrs to the day. I've struggled with anxiety &amp; depression most of my life, but it started to snowball hard at this point. I turned to drink and smoke to cope. But, it only made me paranoid and guilty on top of everything. \n\nJanuary 2015: Things were getting a bit better. Got a new job alongside my sister, my wife and I moved in with said sister and her husband. I started to enjoy simple things again. \n\nJanuary 20th my sister commits suicide. I subsequently lost my job because I couldn't be at work as much as I wanted to in the month following.\n\nI started to watch the world crumble, again... \n\nNow I'm struggling to stay away from drugs and booze. I'm trying to get another job, but results aren't instant. My wife must be furious and extremely disappointed in me. I've lied about the drugs and booze in the past, and again I'm just having trouble controlling my addictions and emotions. She needs a man to help her in life, not a scared man-child. I'm scared she's going to divorce me any day. Though she says it's not on her mind and that she loves me. I can still only think that I'm just hurting her at this point. \n\nI'm seeing my general doctor tomorrow to talk about therapy sessions and medication options. Any advice would be highly appreciated. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Both parents, sister, &amp; 2 jobs lost in 2yrs.",
            "url": "http://www.reddit.com/r/Anxiety/comments/30fofu/both_parents_sister_2_jobs_lost_in_2yrs/"
        },
        {
            "author": "alloutpenguinwar",
            "author_created_utc": 1381680476,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dhup7",
            "created_utc": 1427148897,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/302b5l/rantsorry_i_have_a_bs_worked_for_nasa_now_live/",
            "gilded": 0,
            "id": "302b5l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/302b5l/rantsorry_i_have_a_bs_worked_for_nasa_now_live/",
            "retrieved_on": 1440836705,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "I just need to rant. I graduated high school with a better than 4.0. Then I went to college and got a Bachelor's in Electrical and Computer Engineering. I was recruited by a NASA subcontractor and worked on many projects that are now in space including the Mars Rover, Curiosity.\n\nThen I met a girl. She made me fall in love with her. She moved in my house that I built from the ground up. We both loved animals and we made a wonderful zoo in that house. We got engaged. We starting making wedding plans. We talked about kids.\n\nThen I went to work one day, and I had an email from her saying she'd be gone by the time I got home and I'[d never see her again.  ....And I never have and never want to....she destroyed me. \n\nShe is the definition of pure evil. This was April 11, 2007.\n\nSince then I have been on every imaginable anti-depressant and anti-anxiety med. I moved back home closer to family because I was suicidal. I managed to work another 8-9 years as an engineer, but racked up an enormous debt trying to buy some happiness. My house was foreclosed on in the housing crisis.\n\nI still love the stupid girl that left me for no good reason out of the clear blue.\n\nLast year (2014) I couldn't engineer anymore. I ended up in the hospital for a week. New meds, more therapy, move back home with parents because I can't be trusted to be alone. My two cats are the only thing keeping me on this planet.\n\nLoving animals, I managed to get a part time job at a shelter. I mostly love my job, but it can be hard sometimes. I had to declare bankruptcy because going from making engineering dollars to shelter dollars does not pay the bills.\n\nI'm 33, live with my parents, and work part time. All my friends are married with kids. \n\nPut simply, I have failed at life. I keep trying new things, like going back to school (twice) and failed at those and now have more student debt. I can't go back to being an engineer. It's too much for my anxiety.\n\nI hate my life. I love my cats and my parents, and I love that sometimes I feel like I am helping animals and people at my job, but I see no way to progress from this stalemate.\n\nI'm stuck. My anxiety stops me from trying anything new. I have to work extremely hard not to start abusing my benzos. I have no ideas for what to do to fix things. It's been a year since the hospital and I'm not much more functional. \n\nI'm a waste of space and resources. I used to work for NASA, and was good at my job, now I can barely function day to day, and I'm always one step away from getting fired from my job because of attendance due to all my various mental disabilities. Really I should be on disability, but I don't want to be. \n\nI want to be useful. I want to help animals and people. But My anxiety prevents me from growing any further other than the small good I am able to do at the shelter. And I will probably have to live with my poor retired parents the rest of my life.\n\nTl:dr: Had a house, fiance, worked at NASA, fiance blew it all up, and now I'm a husk of a 33 year old being living with my parents barely able to leave the house except to work part time at a shelter with animals as my only outlet to help and make myself feel good about myself. But I can't improve anything in my life because of my anxiety.\n\nSorry for the rant. Very sorry.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[RANT...sorry] I have a BS, worked for NASA, now live with parents and barely function.",
            "url": "http://www.reddit.com/r/Anxiety/comments/302b5l/rantsorry_i_have_a_bs_worked_for_nasa_now_live/"
        },
        {
            "author": "ritorinoplserino",
            "author_created_utc": 1424499273,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lhwvm",
            "created_utc": 1426972989,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zucql/does_anyone_get_those_rushes_when_they_have_to/",
            "gilded": 0,
            "id": "2zucql",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zucql/does_anyone_get_those_rushes_when_they_have_to/",
            "retrieved_on": 1440840418,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I've been holding off on getting help because I get those anxiety pains when I think about it, but I just brought myself to do simple things like actually rent the textbooks I needed 4 weeks ago for my class and while I'm in the middle of it, I get this rush throughout my head/body like I'm high or something. Does that happen to anyone else, and what does it mean?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone get those rushes when they have to actually do things?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zucql/does_anyone_get_those_rushes_when_they_have_to/"
        },
        {
            "author": "acm162",
            "author_created_utc": 1421083887,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ko5rb",
            "created_utc": 1427341652,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30c40f/anxiety_regarding_the_heart/",
            "gilded": 0,
            "id": "30c40f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30c40f/anxiety_regarding_the_heart/",
            "retrieved_on": 1440832072,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "Does anyone else have anxiety that seems to exclusively center around their heart? I swear to God nothing makes me feel more anxious than starting to feel my heart beat quickly. I have even learned to avoid caffeine because just the thought of taking a stimulant makes me uncomfortable. Any time I get into a confrontation and my heart rate begins to increase, my anxiety peaks as well.  I have gone to a doctor and there is nothing wrong with my heart, but I can't use this logic to dispel the anxiety I feel about it. Has anyone else felt like this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety Regarding the Heart",
            "url": "http://www.reddit.com/r/Anxiety/comments/30c40f/anxiety_regarding_the_heart/"
        },
        {
            "author": "unintentionalanxiety",
            "author_created_utc": 1423263947,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_l7bw7",
            "created_utc": 1427475807,
            "domain": "self.Anxiety",
            "edited": 1427476993,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30icl6/helprant_my_mom_tried_to_kill_herself/",
            "gilded": 0,
            "id": "30icl6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30icl6/helprant_my_mom_tried_to_kill_herself/",
            "retrieved_on": 1440829101,
            "score": 40,
            "secure_media_embed": {},
            "selftext": "Three days ago, my mother attempted suicide. For privacy's sake, I won't go too in depth on the reasons. She's suffered from depression for a very long time, and it's gotten worse lately due to an injury causing her daily pain, which also prevents her from taking care of her daughter (my sister, special needs, needs assistance with everything). For the last several months since the injury, my sister has been staying with my dad, who, in spite of his denial, is outwardly rude and cruel to my mother. He's made her feel even more guilty than she already feels, saying she's \"abandoned\" my sister. \n\nThis combined with a multitude of other reasons slowly built into a clusterfuck of stress, which boiled over three days ago. Currently she's in the hospital, and recovery is slow. They've got a medication they're giving her that protects her kidneys and liver from the pain pills/other medications she overdosed on (we honestly don't know what all she took, but the potential amount makes it a miracle she's even alive), but it tastes like shit and she's been refusing it. \n\nI've dealt with anxiety for a few years now, and it was just starting to get better. I was doing well in my classes, I'd met a girl I really like, finally got in good enough shape to happy with my body, and my social life was better than ever. But now it feels like my entire world is falling apart. I haven't been to a single class this week, haven't talked to that girl at all this week except to tell her what happened, and I haven't seen my friends in two weeks.\n\nI feel absolutely useless, and powerless to change anything. She reminds me of a child, crying and refusing her meds, asking for her mother, clamping her mouth shut when we get a syringe to make her take the medication, crying \"no\" over and over again. For the first day all we could get out of her was \"I don't know\" and \"I've lost my mind\". Yesterday she barely spoke at all. The pain, confusion, and especially the shame in her eyes, hurts so much to see. It's the most painful thing I've ever experienced. \n\nThe worst part is she genuinely believes that what she did was wrong, and evil (literally her words). She believes that she's ruined all our lives, and that there is no recovering from this. We keep telling her it's not true, that we love her, and we're doing everything we can to bring her back. My brother flew across the country to be here, and her sister is flying here this Saturday. Even the nurses keep telling her how lucky she is to be so loved and have so many people who care about her. We really are trying, but I feel like she doesn't want to be saved, that she wants us to just let her die. I don't know what to do, and I'm not sure how much longer I can hold out. I can't even keep it together half the time I'm in the room with her, I've cried more in the last three days than I have in the last three years. \n\nSorry for the rambling wall of text. I just needed to let this out. \n\nIf anyone has any advice, thoughts, sympathies, suggestions, I'll take about anything at this point. I just want her back, even if she's not her old self anymore, we all just want her back. \n\n ***TL;DR My mom tried to commit suicide, I'm slowly losing my mind. What the fuck do I do?***\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help/Rant] My mom tried to kill herself.",
            "url": "http://www.reddit.com/r/Anxiety/comments/30icl6/helprant_my_mom_tried_to_kill_herself/"
        },
        {
            "author": "insomnolescent",
            "author_created_utc": 1427095896,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mfm7x",
            "created_utc": 1427098297,
            "domain": "self.Anxiety",
            "edited": 1427143121,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zzqdf/2_5_am_is_the_worst/",
            "gilded": 0,
            "id": "2zzqdf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zzqdf/2_5_am_is_the_worst/",
            "retrieved_on": 1440837908,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "I hate it when I can't sleep. It's not every night, but it comes in bouts of a few days when I'm particularly stressed. My mind fixates on one or two problems that are going on in my life, and just goes around and around worrying about them. It's the worst because there's absolutely nothing I can do at this hour to fix anything. And the problems aren't even that bad, I know this rationally but my anxious brain keeps circling around and around until they seem unsolvable. \n\nI know that during the day these problems will only feel about 10% as bad as they seem now, but somehow that doesn't help at all. I'm too exhausted to get out of bed to do anything to take my mind off things for now. I just want to fall asleep and wake up refreshed with a whole new day ahead of me. \n\nI read reddit when I can't sleep, so I thought why not post this here and see if anyone else goes through the same thing. I know there are things I can do to improve my sleep cycle, but that doesn't really help me right now at 4am. I just want to sleeeeep.\n\nEdit: thank you everyone for the replies! I fell asleep not long after I posted this, so maybe writing about it helped a little. A note about meds/supplements: while I appreciate the suggestions, I've tried lots of different meds over the years, and sometimes they help, and sometimes they don't, and sometimes I can't take them because of the side effects. The combo I'm on now is pretty much the one that works best for me, and it's better than nothing, but not ideal. I can't take anything too sedating or I won't be able to get up in the morning, which throws my sleep cycle off even more.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "2 - 5 a.m. is the worst.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zzqdf/2_5_am_is_the_worst/"
        },
        {
            "author": "ggill1313",
            "author_created_utc": 1357016306,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a28tf",
            "created_utc": 1426992558,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zvavj/racing_heart_stupid_smile_clenched_fists/",
            "gilded": 0,
            "id": "2zvavj",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zvavj/racing_heart_stupid_smile_clenched_fists/",
            "retrieved_on": 1440839976,
            "score": 34,
            "secure_media_embed": {},
            "selftext": "Time. What is it with time. You told me, remember? You told me when to expect you. I trusted that you meant what you said, I trust that most people do. I guess that's my problem.\n\n\n\nMaybe the secret is skepticism. No, tried that. Didn't work. \n\n\n\n\"Soon.\"\n\n\n\nI focus on the small things, the ones that shouldn't matter but I just can't seem to get out get out get out get out ***GET OUT***. Of my head. \n\n\n\nThink about it, this isn't an issue. No it's not. You are making it an issue because you are scared. Push her away, go on and do it. You always do, and this is no different. Talk to her about it. I don't know how without whining, without nagging, without pushing. \n\nNone of this makes sense. I can simultaneously experience it and criticize it for its lack of value.\n\nAnxiety.\n\n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Racing heart. Stupid smile. Clenched fists. Screaming insides. Just need to put it out somewhere, even if no one reads.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zvavj/racing_heart_stupid_smile_clenched_fists/"
        },
        {
            "author": "tinytiffany",
            "author_created_utc": 1345106904,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8or2t",
            "created_utc": 1427240231,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/306xh4/does_anyone_else_cry_a_lot_when_stressed/",
            "gilded": 0,
            "id": "306xh4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/306xh4/does_anyone_else_cry_a_lot_when_stressed/",
            "retrieved_on": 1440834490,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "So, I've had a job for about a month now and its the first job I've had in a year now because of my anxiety. Anyway, yesterday I had a catch up with the boss and he gave me some critique and I burst out in tears which wasn't ideal since I wanted to constructively contribute to our conversation instead of breaking down emotionally. It didn't help that I was anxious before the meeting and also am a perfectionist so now I feel as useless AF. Anyone else have this issue? I was also quite angry but couldn't voice my own experience because of said tears.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else cry a lot when stressed?",
            "url": "http://www.reddit.com/r/Anxiety/comments/306xh4/does_anyone_else_cry_a_lot_when_stressed/"
        },
        {
            "author": "Xpeer_i_mint",
            "author_created_utc": 1380211354,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dakm6",
            "created_utc": 1427420461,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30g0yy/i_got_hired_at_a_job_couldnt_take_it_and_quit_an/",
            "gilded": 0,
            "id": "30g0yy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30g0yy/i_got_hired_at_a_job_couldnt_take_it_and_quit_an/",
            "retrieved_on": 1440830184,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "I'm really stressed, guys. I've lost the respect of my father. I have literally $0.00 to my name. I have the computer I'm typing this on and I'm living with my parents, so things are OK, but I just wish they were better. I was so close to being employed, making $ and friends, moving forward with my creative passions and maybe hopefully finding a girlfriend, and now it's all just fucked up and I'm back to square 1, can't focus and I just feel totally defeated. I can't even exercise or look people in he eye. I'm a mess. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I got hired at a job, couldn't take it and quit an hour later, and now I've fucked up 4 job interviews.",
            "url": "http://www.reddit.com/r/Anxiety/comments/30g0yy/i_got_hired_at_a_job_couldnt_take_it_and_quit_an/"
        },
        {
            "author": "daddaddaddaddaddad6",
            "author_created_utc": 1417752766,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jt9ld",
            "created_utc": 1427249303,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/307gvv/does_anyone_else_feel_like_theyre_always_on_edge/",
            "gilded": 0,
            "id": "307gvv",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/307gvv/does_anyone_else_feel_like_theyre_always_on_edge/",
            "retrieved_on": 1440834238,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "Any time in public or at home i always feel like something bad is going to happen. Anytime i hear a loud noise or something out of the ordinary i immediately start playing out all the possibilities in my head of what can be happening. \"Robbery? Shooting? Someone dieing? What else can go wrong?\" I think of all the ways i would react in these situations until i finally get distracted.\n\nAny time i see someone reach into their pockets i always look at their hands thinking they could possibly pull out a weapon. I start thinking of all those videos of robberies and shootings.\n\nI've been mugged at gunpoint and there's been a few murders recently only a block or two away from me. I'm always thinking me or someone around me will be the next victim.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel like they're always on edge?",
            "url": "http://www.reddit.com/r/Anxiety/comments/307gvv/does_anyone_else_feel_like_theyre_always_on_edge/"
        },
        {
            "author": "whoreshandbag",
            "author_created_utc": 1402434139,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gxgty",
            "created_utc": 1426963047,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zttpu/i_have_an_actual_bladder_infection_and_im_happy/",
            "gilded": 0,
            "id": "2zttpu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zttpu/i_have_an_actual_bladder_infection_and_im_happy/",
            "retrieved_on": 1440840665,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "For the first time in 8 months I have an *actual real* UTI,  and after a trip to the out of hours I've got antibiotics for it,  and I'm actually weirdly happy about it.  \n\nThis is real,  it was a positive test result,  I have medication that can **fix** it,  instead of being up all night crying with the pain and worrying about getting into work when I can't leave the toilet or when I do I can't cope with the discomfort,  only to go to the doctors and it be a negative result. \n\nMy first non psychosomatic UTI in 8 months, and I'm so glad I can actually treat it.  \n\nNow I just need to treat my brain to stop getting \"UTI\" 's every two weeks... ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have an ACTUAL bladder infection and I'm happy about it.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zttpu/i_have_an_actual_bladder_infection_and_im_happy/"
        },
        {
            "author": "hotunicorn3",
            "author_created_utc": 1417925979,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_juv27",
            "created_utc": 1427344194,
            "domain": "heysigmund.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30c8al/if_you_want_anxiety_explained_like_youre_5_great/",
            "gilded": 0,
            "id": "30c8al",
            "is_self": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30c8al/if_you_want_anxiety_explained_like_youre_5_great/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "UpzAn6_Fb0uktmU5cyGoJIK5RPZIjEBhrlJIPhAj-lQ",
                        "resolutions": [
                            {
                                "height": 72,
                                "url": "https://i.redditmedia.com/9noZ-4mC-1bEksIBGQ3o3Aebf2xlOvkIWwN-Lh0zU5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=bd09d6786ff54cebe24dc8fbeb68a6d7",
                                "width": 108
                            },
                            {
                                "height": 144,
                                "url": "https://i.redditmedia.com/9noZ-4mC-1bEksIBGQ3o3Aebf2xlOvkIWwN-Lh0zU5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=1ec8d811531cab1e775c045c03fde56a",
                                "width": 216
                            },
                            {
                                "height": 213,
                                "url": "https://i.redditmedia.com/9noZ-4mC-1bEksIBGQ3o3Aebf2xlOvkIWwN-Lh0zU5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=4dc561ceec2cf80f6184301daf1afb08",
                                "width": 320
                            },
                            {
                                "height": 426,
                                "url": "https://i.redditmedia.com/9noZ-4mC-1bEksIBGQ3o3Aebf2xlOvkIWwN-Lh0zU5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=2247680af9b739aa9f87712949019719",
                                "width": 640
                            },
                            {
                                "height": 640,
                                "url": "https://i.redditmedia.com/9noZ-4mC-1bEksIBGQ3o3Aebf2xlOvkIWwN-Lh0zU5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=95ab1365a04f40a1282f5626376f9f87",
                                "width": 960
                            }
                        ],
                        "source": {
                            "height": 667,
                            "url": "https://i.redditmedia.com/9noZ-4mC-1bEksIBGQ3o3Aebf2xlOvkIWwN-Lh0zU5E.jpg?s=a0ba1c6abd23afe7beea58d65d95efc1",
                            "width": 1000
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440832018,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/MkzAKk3Opi8XXqTgB7ZFMOloCySqpbTlKkHVIR6mXfI.jpg",
            "title": "If you want anxiety explained like you're 5; great article",
            "url": "http://www.heysigmund.com/anxiety-in-kids/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1427047549,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2zx9k0/recovery_is_hard_venting/",
            "gilded": 0,
            "id": "2zx9k0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2zx9k0/recovery_is_hard_venting/",
            "retrieved_on": 1440839060,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I have made huge strides with my anxiety disorder over the last 10 months. (Panic disorder with agoraphobia) Shopping for groceries by myself, driving a car, going out to eat in restaurants, living by myself. Went out on a lunch date last week. I have not done these things for 10 years. \n\nThe last two weeks my anxiety has been all over the place. Up and down, up and down. I was worried I was going to be back to being agoraphobic. \n\nIt is easy to jump to the conclusion of you are broken again. It is easy to go back to those old familiar thoughts of \"never going to get better\".\n\nInstead of thinking about the negative, I try my best to think about all the awesome things I have done in the last 10 months. This part is what I find very hard to do. It is hard to build that confidence back up when it feels like your brain is trying it's best to break you down to nothing. \n\nLast week I was at the grocery store, something that I have done many times over the last 6 months without any anxiety. I had a full on panic attack. I had three choices going through my head. Abandon the cart and get home ASAP. Go to the check out right now and only have part of the things I went to the store for, or third ride it out and finish what I was doing. I have always went for option A, retreat ASAP. \n\nThis time and the first time ever I decided to stick it out. That I would finish my grocery shopping. I finished off my list of things I needed, it was very unpleasant. I didn't like it one bit. But I did it. \n\nI am learning that I can function even when my brain seems to be working against me. This experience I learned that it is not back to square one. It was also a reminder that recovery is hard, very hard. For me this is probably the hardest thing I have ever done in my life so far. For those that have read this rant, remember it is going to be easy one day, very hard the next. It is full of ups and down. All we can do is keep trying. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Recovery is hard. -Venting-",
            "url": "http://www.reddit.com/r/Anxiety/comments/2zx9k0/recovery_is_hard_venting/"
        },
        {
            "author": "ksavage1986",
            "author_created_utc": 1349893035,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_99j83",
            "created_utc": 1427474310,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/30i9cg/who_else_gets_anxiety_over_just_the_dumbest_things/",
            "gilded": 0,
            "id": "30i9cg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/30i9cg/who_else_gets_anxiety_over_just_the_dumbest_things/",
            "retrieved_on": 1440829143,
            "score": 18,
            "secure_media_embed": {},
            "selftext": "So I've had a bad cold that I'm just getting over, and my ears are stuffed up.  It's happened to me before, and it's always gone away.  But for some reason, my anxiety has spiked a bit.  I notice my brain going, \"Hey, maybe you'll just lose your hearing and be deaf for the rest of your life\".  In reality, this is a completely normal thing and will go away, yet my brain always wants to take it to the extreme!  Sometimes I just have to laugh at myself!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Who else gets anxiety over just the dumbest things?",
            "url": "http://www.reddit.com/r/Anxiety/comments/30i9cg/who_else_gets_anxiety_over_just_the_dumbest_things/"
        }
    ]
}