{
    "data": [
        {
            "author": "robbie9000",
            "author_created_utc": 1299309116,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4x7sl",
            "created_utc": 1440170006,
            "domain": "dakotamcfadzean.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3huvia/social_anxiety_summarized_in_four_panels/",
            "gilded": 0,
            "id": "3huvia",
            "is_self": false,
            "link_flair_css_class": "articleflair",
            "link_flair_text": "Article",
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3huvia/social_anxiety_summarized_in_four_panels/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "ICcn-t-iRoiGuJrwqrBPyFJPArKTXO9Sb5wC-ZCsG3g",
                        "resolutions": [
                            {
                                "height": 54,
                                "url": "https://i.redditmedia.com/njGDmq8Z4PJXwDxOz8flhrV6fYj7znzNfiyx21xaIgE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=2303b9899cbde607efaf5d25de3dfc1f",
                                "width": 108
                            },
                            {
                                "height": 108,
                                "url": "https://i.redditmedia.com/njGDmq8Z4PJXwDxOz8flhrV6fYj7znzNfiyx21xaIgE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=e970948dfe70182cd68319e6ae2ead24",
                                "width": 216
                            },
                            {
                                "height": 160,
                                "url": "https://i.redditmedia.com/njGDmq8Z4PJXwDxOz8flhrV6fYj7znzNfiyx21xaIgE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=fe0c3f16e32fb2ab62317b40c6263788",
                                "width": 320
                            },
                            {
                                "height": 320,
                                "url": "https://i.redditmedia.com/njGDmq8Z4PJXwDxOz8flhrV6fYj7znzNfiyx21xaIgE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=9ddff0bd66934c489ce22b7997789a4e",
                                "width": 640
                            }
                        ],
                        "source": {
                            "height": 375,
                            "url": "https://i.redditmedia.com/njGDmq8Z4PJXwDxOz8flhrV6fYj7znzNfiyx21xaIgE.jpg?s=992ed5fa2a0fa467cea259d2cac587b6",
                            "width": 750
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440533615,
            "score": 447,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/k8Dk6JDvNDcz8hYean5xESUpXOjgfQDyWAexH_mO4Bk.jpg",
            "title": "Social anxiety summarized in four panels.",
            "url": "http://dakotamcfadzean.com/comic/the-dailies-1421/"
        },
        {
            "author": "h00di",
            "author_created_utc": 1423588774,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_la33z",
            "created_utc": 1439661053,
            "domain": "self.Anxiety",
            "edited": 1439723304,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3h46mh/i_left_the_house_for_the_first_time_in_over_400/",
            "gilded": 0,
            "id": "3h46mh",
            "is_self": true,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "media_embed": {},
            "num_comments": 31,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3h46mh/i_left_the_house_for_the_first_time_in_over_400/",
            "retrieved_on": 1440546247,
            "score": 368,
            "secure_media_embed": {},
            "selftext": "Backstory: I've been agoraphobic since about March 2014. I couldn't get past the end of my road withuot having to turn back and just run inside. I saw a counselor for this and she really helped me make it further and further out of the house with exposure but I never made it past the end of the road.\n\n\nThe turning point: I started developing rashes all over my body. I had a GP visit and he told me it was chickenpox. I thought great, this will last 2 weeks and I'll be back to fighting anxiety instead of a skin problem. It got a lot worse than chickenpox, so my mum called a second Dr in. She advised me to go to hospital immediately (I made a post about this). I refused to go for a couple of days. On the 1st August, I woke up very badly. I called my mum into my room at 6am and just gave in. I needed hospital care. The ambulance refused to pick me up as I was still conscious and able to move, so my sister drove. I was too worried about my skin and this condition I was in to have time for the anxiety.\n\nHospital is a rough place to be when you've been alone in a house for a year. So many people coming in and out, observing and prodding. My anxiety was at an all time high but I was getting treated. I was informed I had Steven Johnsons Syndrome, an auto-immune disease that attacks the skin. \n\nLying in the hospital bed I was trying to come to the source of my anxiety. I ended on the stomach implications. Everytime I had a panic attack, I realised it always accompanied stomach upset and acid reflux. As I was in hospital I thought this was the best time to see a gastro doctor. This is where everything changed for me.\n\nShe understood. She had seen people with anxiety suffering from these acid symptoms and knew exactly what to do. She prescribed me lansoprazole and referred me to another doctor.\n\nThis doctor was a specialist in gastro-psychology. He would help patients suffering with mental health issues that also affected their stomachs. These were usually people who had stomach surgery and stress would give them heartburn and acid indigestion. I never knew people like him even existed. \n\nI only got 1 session with him before being discharged but that 20 minutes with him changed my life. I felt noraml. There's literally a specialist doctor for my problems and all the research I did at home never led me to anything like this. My journey home was effortless. I saw my area again.\n\nif you have stomach issues and think its anxiety related find someone like this doctor. The things he told me and the help I recieved was so valuable, and I'm scheduled to meet with him again this week. He made me realise I'm not alone in this. So many people suffer and I didn't have any scale of that before now.\n\nEDIT: I'm overwhelmed but not really surprised with the amount of people that suffer similarly. The doctors will have seen weirdeer scenarios so just go for it. Even if it doesn't cure the root of the anxiety like it was for me, it could be a huge stepping stone in gaining confidence. Thanks for everyones kind words. My eyesight is pretty bad due to the steroids I'm on for my skin but I'm trying my best to get back to everyone!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I left the house for the first time in over 400 days",
            "url": "http://www.reddit.com/r/Anxiety/comments/3h46mh/i_left_the_house_for_the_first_time_in_over_400/"
        },
        {
            "author": "Kristian26",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1439908246,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hg80u/dae_get_anxiety_when_they_have_someplace_to_be/",
            "gilded": 0,
            "id": "3hg80u",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hg80u/dae_get_anxiety_when_they_have_someplace_to_be/",
            "retrieved_on": 1440540570,
            "score": 168,
            "secure_media_embed": {},
            "selftext": "Let's say my friends have arranged to eat lunch at 12. It'll be like 9 am and all I'm thinking about is the time. \"When should I shower? Will there be traffic? I hope it isn't packed? I should get ready right now, so I won't be late.\" All this is going through my head as I'm pacing my house. Then I'll leave like at 11:30 when it takes my 10 minutes at most to get there just so I get out of the house quicker where my thoughts haunt me. I'm aware of all of this and people always tell me that I'm always early, that I'm always starting things way before they're due. Assignment due in a week? I can wait til the weekend right? Wrong. I'll start it and complete it that same day it was assigned if I can. It's annoying because I spend too much time giving a shit when other people just brush these things off.\n\nBasically, procrastinating gives me anxiety and I believe this is what started my anxiety back in the 8th grade. \n\nSorry if this sounded like a rant.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get Anxiety when they have someplace to be?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hg80u/dae_get_anxiety_when_they_have_someplace_to_be/"
        },
        {
            "author": "catandblanket",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1439832427,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hc5rs/they_claim_to_have_an_anxiety_disorder_but_they/",
            "gilded": 0,
            "id": "3hc5rs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 104,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hc5rs/they_claim_to_have_an_anxiety_disorder_but_they/",
            "retrieved_on": 1440542466,
            "score": 168,
            "secure_media_embed": {},
            "selftext": "Someone said this about me the other day, and it made me so angry. It's as though they think people with anxiety are incapable of doing certain things, when that is not true. It's unfair to question someone's mental health because it doesn't fit your description of how they should act. \n\nI am medicated for anxiety, have gone to counselling and therapy, do meditation and yoga, and yes, because of that there are times when I feel like I can push myself into doing things that require confidence. Those are the good days, and I am grateful for them, while this person uses it as ammunition to invalidate my problems. \n\nHas anyone else encountered this? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "\"They claim to have an anxiety disorder, but they do [insert activity here]\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hc5rs/they_claim_to_have_an_anxiety_disorder_but_they/"
        },
        {
            "author": "annxious3",
            "author_created_utc": 1439754773,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_plt2o",
            "created_utc": 1439755539,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3h8e3w/does_anyone_elses_anxiety_make_them_feel_like/",
            "gilded": 0,
            "id": "3h8e3w",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3h8e3w/does_anyone_elses_anxiety_make_them_feel_like/",
            "retrieved_on": 1440544284,
            "score": 165,
            "secure_media_embed": {},
            "selftext": "This is something I've been having a lot of trouble with, but basically, even though my life is objectively quite good, I feel like all of my friends are having a much better life than me. To the point where if one of those friends tries to talk to me about them having their own anxiety, I don't believe them and I think that they're just putting it on or are over-exaggerating their symptoms (and I don't know their lives, so I can't say that).\n\nReddit, for one, has me convinced that everyone in every other country has life better than me because I live in the US. I will admit that living here has some downsides (harder to travel to different countries, have to pay for medical insurance, Republicans), but my life has certainly never been bad. I live in a city with 3% unemployment and I'm in college on a full ride. Shits great. But I feel like my situation would immediately be improved if I were to move to any other country in the first world.  I feel like it would \"heal\" my anxiety the same way moving to the desert can \"heal\" allergies, in a sense. Even though I like where I live and definitely don't feel like uprooting my life. \n\nSo when my friends from other countries tell me about their anxiety, I offer support but I have a lot more trouble buying it on a personal level. The same happens with my richer/prettier/smarter friends living here in the US. I had a younger friend who absolutely idolized the shit out of me and emulated everything I did. One day, she came to me nearly in tears about how she felt like she was a failure because she procrastinated sometimes. She asked me if that was okay. I was like \"Yeah, I've definitely done the same thing, but I still get good grades\" and her eyes got real big and she said \"*You* procrastinate?? I never would have ever thought that. I've been studying diligently as much as I can every night to be more like you because I felt insecure about my abilities compared to you\". I was so shocked. This girl, in my opinion, is way smarter than me, and she looked up to me. I was so doubtful of that. It seemed impossible that anyone would ever want to be like me or live a life like mine. \n\nI feel ungrateful. I am ungrateful, and that makes my anxiety worse, but I can't be happy with my life for some reason. I also have OCD, so I'm always obsessively looking up negative things about my country/city/school/race, you name it. I am literally obsessed with that. \n\nDoes anyone else have this kind of anxiety and if so, how do you break out of it? I don't want to be a cynic forever! :(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else's anxiety make them feel like everyone else's life is much better than yours?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3h8e3w/does_anyone_elses_anxiety_make_them_feel_like/"
        },
        {
            "author": "qwiqi",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1439744220,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3h7qtl/anyone_else_experience_bursts_of_what_feels_like/",
            "gilded": 0,
            "id": "3h7qtl",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3h7qtl/anyone_else_experience_bursts_of_what_feels_like/",
            "retrieved_on": 1440544586,
            "score": 90,
            "secure_media_embed": {},
            "selftext": "Sometimes I get this overwhelming feeling that I can only describe as a bunch of happy, anxiety and/or sadness. I feel my throat getting tight, my eyes getting wet, and I just want to give someone a hug and say \"hey, everything's going to be okay\". \n\nDoes anyone else experience this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else experience bursts of what feels like [pure] emotion?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3h7qtl/anyone_else_experience_bursts_of_what_feels_like/"
        },
        {
            "author": "ActuallyfromAlnitak",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1439996909,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hlc4g/breakthrough_today_i_finally_took_a_deep_breath/",
            "gilded": 0,
            "id": "3hlc4g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hlc4g/breakthrough_today_i_finally_took_a_deep_breath/",
            "retrieved_on": 1440538123,
            "score": 66,
            "secure_media_embed": {},
            "selftext": "Long story short I'd been having some anxiety with a house guest who, of course, doesn't suffer from anxiety (at least not in the way I do) and I'd been trying to explain over and over that I needed life to be calmer. I need less. Less noise, less people, less excitement in my life. Less things to worry about. Less \"conversations.\" \n\nOMG...I'm actually a little euphoric right now. I feel like crying I'm so happy. It's like something finally clicked (who knows, maybe my prayers were answered) and finally, without an argument or an attempt to talk me into anything, my house guests finally gave me the space I needed. Even the one who I thought hated me waved at me before they left, which just made everything seem so much more NORMAL then it had been.\n\nI am so unbelievably relieved. Every muscle in my body just feels limp and exhausted but in a good way. I can't wait to jump in the shower and just lay around all day. \n\nI know it can't last (I do have work tomorrow after all) but oiy.....I wills savor this moment for as long as I can. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Breakthrough: Today I finally took a deep breath for the first time in nearly a month. I had no idea I'd even been holding so much in.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hlc4g/breakthrough_today_i_finally_took_a_deep_breath/"
        },
        {
            "author": "Anxiouspickle666",
            "author_created_utc": 1440042383,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_pp8r6",
            "created_utc": 1440042637,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hocrk/anyone_else_here_that_cant_even_enjoy_their/",
            "gilded": 0,
            "id": "3hocrk",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hocrk/anyone_else_here_that_cant_even_enjoy_their/",
            "retrieved_on": 1440536715,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "I just started a new job. Tomorrow is my first day without having help immediately available.\n\nMy palms are sweating even typing this. This whole weekend, and weekends while training, I couldn't even enjoy my time off because my anxiety causes me to stress even when I'm out and supposed to be enjoying myself. I'm watching movies til 3 or 4AM just to keep my mind occupied. When it ends, my heart sinks and I start into panic mode.\n\nI spoke with my employees about it and they laughed it off like why are you worrying about something 2 days away?\n\nI can't help it and I'm so annoyed by it. I don't even want to go to bed tonight. I've been having dreams that are obviously stress related and I wake up every hour on the hour, in anticipation of having to wake up.\n\nIt's not just this job, it's been every job. But with me being new I feel like I won't pick up on it quick enough and have an embarrassing crying/panic attack.\n\nAnyone else experience this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else here that can't even enjoy their weekends because anxiety from job?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hocrk/anyone_else_here_that_cant_even_enjoy_their/"
        },
        {
            "author": "Moejason",
            "author_created_utc": 1391621393,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f4xle",
            "created_utc": 1440017085,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hmrx5/an_anxiety_cause_and_effect_checklist_i_know_how/",
            "gilded": 1,
            "id": "3hmrx5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hmrx5/an_anxiety_cause_and_effect_checklist_i_know_how/",
            "retrieved_on": 1440537452,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "Hi there! So glad you opened this post, you won't regret it! You're feeling anxious right now? Not to worry, remember it's perfectly normal to feel like that and take 2-3 deep breaths for me before we move on, thanks guys :)     \n\nOk so in my own experience (I know this isn't the same for you all) I have found that a lot of my random bouts of anxiety have causes, often something that can be fixed. (Obviously when It was worse, this was not the case - counselling and regular meditation got me through that part of this journey)     \nEven when you feel better it is just a part of life that you feel anxious, and it *can* be totally random. It is often the case that slight changes in routine can make you feel a little more anxious - I'm hoping this checklist can help you figure out what :)     \nThese are of course gonna be different for everyone - also I am no expert, I have no sources besides what I have experience myself, like everything I say on here, please take it with a pinch of salt (cus sometimes I'm not sure if I get the right point across)    \n\nThe list:     \n**- Have you been getting enough sleep?**      \nSleep is a key part in our health in general, not getting enough leads to tiredness (duh), apathy and of course anxiety so it's important to get enough. If you're feeling a bit overwhelmed and anxious, think about how much sleep you have been getting lately and maybe give yourself an early night for a change. Get back into the swing of having at least 8 hours sleep a night. (Personally I find going sleep early and waking up early benefit me more than sleeping and rising late - but everyone is different)     \n**- Are you drinking enough water?**     \nThis is really just a small thing, always good to stay hydrated as not drinking enough can lead to headaches - if you're anything like me, anything that feels like a symptom of anxiety you're gonna associate with anxiety. Plus staying hydrated is punk rock and also great for your skin!     \n**- Do you meditate? Have you missed a few mediations?**     \nI like to keep my anxiety and emotions in check by meditating regularly, like once a day if I can. But like everyone I sometimes miss a few due to other things, perfectly normal. If you rely on this too, just make sure to get back into it when you can, there's no pressure on any of this - seriously it's all about doing what you can.     \n**- Is there anything in your life right now that is stressing you out?**    \nIdk like an argument this morning? Exams? Work? Girls? Boys? Could be anything, even something you think is silly. Honestly, everything is a contributing factor, if you can identify it though, it can make dealing with it a lot easier :)       \n**- Are you exercising?**      \nNot a necessity, again it's all about what you feel comfortable doing. Like with meditation if you use exercise to keep you anxiety at bay, missing a few days in succession could spark that queasy feeling down the bottom of your stomach, nothing major, just get back into it when you feel comfortable :)      \n**- Been outside lately?**      \nFresh air is fricken great okay, get outside and take a few deep breaths okay.     \n**- Do you spend too much/too little time talking to others**       \nI always think nothing makes me feel more alive than the relationships I have with others. Both the good and the bad. When did you last speak to mum or dad? You friends? A stranger(scary and difficult I get it)? Give it a try, it may help :)     \nSame goes for the opposite though, other people are great but sometimes they are just so... *noisy* You are perfectly entitled to a break when you need one.      \n**- Have you been drinking coffee?**      \nI LOVE COFFEE, but coffee tends to bring up my heart rate and makes me feel anxious - I failed a driving test because I couldn't stop shaking. That is NOT to say you should be scared of drinking coffee - what kind of person would I be if I told you to avoid the drink you loved most? Nah, just consider it - like I said earlier, knowing the cause of your anxiety helps a bunch, even if you can't get enough of it. It'll help keep you grounded, you know where it's coming from :)     \n**- Have you been drinking alcohol?**      \nAlcohol is also great when you know your limits, it can often exaggerate how you're feeling however so take it in moderation. And be aware that it may make you more anxious when you drink it. Not saying don't drink, I'm just saying be aware :)     \n**- Are you happy?**       \nAlways worth asking, I truly from the bottom of my heart hope that you are (Although again it's okay if you're not, that's life) but sometimes anxiety is just a symptom of something bigger. Don't let the rush of life distract you from what's going on inside, and vice versa :)      \n\nI think that is all I can come up with for now, add more in the comments if you like. Please remember these won't be true for all of you, it's just from my own experience. Also know that there are always people you can talk to about how you're feeling.     \n\nI really hope you're gonna be okay, you guys deserve to be :) (I haven't proof read this because it's quite late, hope that that is okay)\n\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "An anxiety cause and effect checklist (I know how much you guys like lists)",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hmrx5/an_anxiety_cause_and_effect_checklist_i_know_how/"
        },
        {
            "author": "LilSebastian4Prez",
            "author_created_utc": 1437048321,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ou84p",
            "created_utc": 1439639149,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3h364f/how_i_crushed_anxiety_in_the_hopes_it_helps_or/",
            "gilded": 0,
            "id": "3h364f",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3h364f/how_i_crushed_anxiety_in_the_hopes_it_helps_or/",
            "retrieved_on": 1440546720,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "Hey everyone!\nI'm new to Reddit and found this sub, how I wish I know it was here when I was at my worst. Anyway, the last few months I have finally overcome my Social Anxiety Disorder and Panic Disorder, it was a long, exhausting and arduous process which I thought would never end, but it did, so here's my tale.\n\nI don't want to get too personal but a fair amount of distressing situations occurred when I was in my late teens and early twenties. I started to develop these weird feelings before leaving the house, no matter where I was going. I would feel nauseous, dizzy, I would cry for no reason and many other symptoms I'm sure you're all familiar with. As months went on these escalated, I would be out in public when suddenly my body would shut down, my arms and legs would go numb and I would pass out cold right there on the street.\n\nWhen I woke up from these panic attacks I would feel as if I was on deaths door, but I didn't know they were panic attacks and being the repressive person I was, I ignored them.\n\nEventually I realised I had anxiety. I'm a *fixer* so I wanted to beat this as quickly as possible, which is not exactly the right attitude but it got me started.\n\nI started going to therapy for an hour every week, getting tips on mindfulness, meditation, exercising and did this for a year. My second year in therapy I felt basically no better, I decided to try medication as well. Well this was an extra adventure! I went on Mirtazipine, which made me gain weight and a bunch of other side effects with small progress being made, as well as adjusting doses and having to be incredibly patient as these drugs take time. After six months on this medication I stated being able to be social again, I still had symptoms of anxiety but the full blown panic attacks were gone, so my confidence rose each time I went for a walk or caught up with a friend (which was still very rare and included a lot of last minute panic bails on my part).\n\nThis year I started my third year in therapy and I've been on Mirtazipine for a year. After only four weeks my therapist cut the cord and told me to go live my life. I was shitting myself.\n\nBut, the amazing thing was I was crushing it. Three years ago I couldn't walk down the street without my mind screaming, my body doing it's whole crazy show and dance and having to run home.\n\nBut I've gone to parties, social events, exhibitions and even a job interview and four hour job trial with basically no anxiety at all. My confidence is back and I am so so proud.\n\nIt may take time, it may take resilience, practise, patience, commitment and most importantly it may take help. But if I can do it, you can all do it.\n\nEverything is temporary and this too shall pass. That was the best line I ever heard on my journey; \"this too shall pass.\" \n\nYou will get your confidence back, you will be yourself again and you're not going to feel this shit for the rest of your life. You can come out the other side and fucking high five yourself with every little bit of progress you make. It all counts, every little step forward is a huge accomplishment so be kind to yourself and reward your victories.\n\nIf you have questions fire away, like I said I'm a noob so I might be slow to reply but I will reply.\n\nI wish you all the best and truly truly hope you can come out the other side of this like I did.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How I Crushed Anxiety, in the hopes it helps or reassures you all :)",
            "url": "http://www.reddit.com/r/Anxiety/comments/3h364f/how_i_crushed_anxiety_in_the_hopes_it_helps_or/"
        },
        {
            "author": "ActuallyfromAlnitak",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1440116677,
            "domain": "vox.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hsddb/9_things_i_wish_people_understood_about_anxiety/",
            "gilded": 0,
            "id": "3hsddb",
            "is_self": false,
            "link_flair_css_class": "articleflair",
            "link_flair_text": "Article",
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hsddb/9_things_i_wish_people_understood_about_anxiety/",
            "retrieved_on": 1440534783,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "9 things I wish people understood about anxiety.",
            "url": "http://www.vox.com/2014/12/4/7262991/anxiety-disorder-help"
        },
        {
            "author": "neca112",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1440099895,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hrb3l/just_wanted_to_say_thank_you_for_existing_ranxiety/",
            "gilded": 0,
            "id": "3hrb3l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hrb3l/just_wanted_to_say_thank_you_for_existing_ranxiety/",
            "retrieved_on": 1440535279,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "i found this place a few days ago and since then i looked thru some posts, i was really surprised at how much i could relate to you guys, people around me don't seem to struggle with the things i do and knowing that somebody out there feels the same, makes me feel less alone ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "just wanted to say thank you for existing /r/anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hrb3l/just_wanted_to_say_thank_you_for_existing_ranxiety/"
        },
        {
            "author": "hellotheremax",
            "author_created_utc": 1439950331,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_po01g",
            "created_utc": 1439950677,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hj41g/insecurity_about_my_intelligence_and_anxiety_is/",
            "gilded": 0,
            "id": "3hj41g",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hj41g/insecurity_about_my_intelligence_and_anxiety_is/",
            "retrieved_on": 1440539161,
            "score": 49,
            "secure_media_embed": {},
            "selftext": "A bit of background: I'm a recent graduate from a prestigious college with a strong STEM degree and have moved back to my hometown whilst applying for jobs. During high school I was confident, had lots of friends and a girlfriend. I've always done quite well academically and feel as though this is where I got a lot of my confidence during my teenage years.\n\nSince going to college my confidence slowly started to decrease as my anxiety increased. This last semester I went to around 5% of my classes and just studied in my room or in the library which probably made me miss out on many opportunities to meet new people. During my graduation a few weeks ago I was surrounded by very smart people and I felt like an imposter. I felt as though I was only there because of the huge amount of work I put into my studies as opposed to any natural intelligence I thought I might have. I guess this insecurity is the result of being used to being a little smarter than my peers at school to becoming completely average at college. These people at college seemed to be living awesome lives while still bossing their studies.\n\nSince being home I've done absolutely nothing with my time. I leave the house 1-2 times a week to see old school buddies but that's it. I really have to psyche myself up before leaving the house and feel very anxious when doing so because I'm afraid of what people will think and expect of me. I keep having family/friends congratulate me on my graduation, telling me how smart I am and how successful I'm going to be. I know they are being sincere but I hate it. These people seem to think I have my shit together and that I'm a confident young man ready to conquer the world. These expectancies combined with the fact I'm really insecure have stopped me from applying to jobs because I think they'll just see through me at the interview and realise that I'm not as smart as my resume makes me out to be. I'm 21 and should be moving onto the next stage of my life but these insecurities have put my life on pause.\n\nI'm not entirely sure what I expect from posting this, but as a lot of people say it is nice to write it down and vent a little. Plus if you made it this far thank you for taking the time to read my post.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Insecurity about my intelligence and anxiety is stopping me from moving onto the next stage of my life",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hj41g/insecurity_about_my_intelligence_and_anxiety_is/"
        },
        {
            "author": "samwisehedges",
            "author_created_utc": 1435353948,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_od31z",
            "created_utc": 1439890331,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hfdma/the_love_of_my_life_left_me_and_my_sister_passed/",
            "gilded": 0,
            "id": "3hfdma",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Help",
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hfdma/the_love_of_my_life_left_me_and_my_sister_passed/",
            "retrieved_on": 1440540964,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "Hi all. Sorry for the wall of text. \n\n(I'm 17 just for clarification) \n\nSo about 2 months ago my sister died, she was an amazing human being, she suffered from SMA, a paralysing condition. We always joked she had the world record for the amount of things wrong with her. She had SMA, she had to be on a ventilator because her lungs weren't working properly, she was blind in one eye, she had diabetes, the works. And the thing that makes her so inspiring to me is that she would always get out of bed everyday and help others, if I needed advice or comfort, I'd go to her house and everything would be available for me to have and use. She always threw parties about the most ridiculous things. And one time she went to a Halloween party dressed as mitt Romney, although we live in the UK (she was a huge Obama supporter) I can't believe that someone could remain so positive after what happened to her. She always donated to charity, she went to festivals and concerts. She had a great life. And if in honest, it puts me to shame. \n\nNow when she died, my family were in tears every day. My family have had a hard life, our brother died, our auntie died, my sister had cancer twice, my other sister also has SMA, and now my other sister has died. My plan for this was to try to not cry because it may help my siblings feel slightly better. Doing this was a mistake as I believe it locked in many of my feelings and memories. To this day I still haven't cried about my sister. But I know I want to, I can feel them cropping up from time to time, but I just can't. \n\nAnd to make all the matters worse. My girlfriend of 1 year, who I was convinced was the love of my life, left me because of my anxiety. I can understand her viewpoint, as I would always text her asking where she was or what she was up to. But I rarely ever did anything stupid. She left me yesterday and didn't know how to take it. So I haven't even begun deal with my sisters death, and now I have to deal with losing my love.\n\nThis community is very understanding and kind. And I was wondering if anyone had any advice to deal with this hard time? I feel like I'm being plunged into depression. I feel lost and I don't know what to do. I have college in a few weeks and the thought of going makes me want to cry. This is a massive stretch... But could anyone help me? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The love of my life left me and my sister passed away... Help?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hfdma/the_love_of_my_life_left_me_and_my_sister_passed/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1439755206,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3h8dfa/im_realizing_that_ive_pretty_much_forgotten_how/",
            "gilded": 0,
            "id": "3h8dfa",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3h8dfa/im_realizing_that_ive_pretty_much_forgotten_how/",
            "retrieved_on": 1440544293,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "Whenever I have some downtime I'm always thinking of what I could be/should be doing and I can never allow myself to just relax in the moment.  I've been really stressed for a long time now and I can see its affected the way I think and act.\n\nAnyone else have trouble relaxing?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm realizing that I've pretty much forgotten how to relax... Anyone else have this issue?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3h8dfa/im_realizing_that_ive_pretty_much_forgotten_how/"
        },
        {
            "author": "mrbossy",
            "author_created_utc": 1384110101,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_durxs",
            "created_utc": 1440090217,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hqn8l/why_do_i_have_to_be_cursed_with_anxiety/",
            "gilded": 1,
            "id": "3hqn8l",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hqn8l/why_do_i_have_to_be_cursed_with_anxiety/",
            "retrieved_on": 1440535588,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "Why do I have to be cursed with this bullshit. Why do I have to doubt everything even my amazing relationship with this girl. Why do I have to live with this bullshit that takes over my life in ruins everything. Why do I have to struggle to keep me going. Why do I have to have thoughts of ending it all because I can't deal with this anxiety. Why do I after two months with feeling normal for once have to have everything to come back and make me now want to live do to anxiety. Why do I a 16 year old teenager have to have a mental illness like GAD. WHY do I have to deal with this bullshit and constant stress and shouldn't just stop living? God I can't wait for my therapy appointment tomorrow and hopefully medication soon afterwards again. I'm just so done with living.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Why do I have to be cursed with anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hqn8l/why_do_i_have_to_be_cursed_with_anxiety/"
        },
        {
            "author": "johnnytrix",
            "author_created_utc": 1438042811,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_p4dlx",
            "created_utc": 1440029198,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hnku7/how_can_i_overcome_social_anxiety_im_so_lonely/",
            "gilded": 0,
            "id": "3hnku7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hnku7/how_can_i_overcome_social_anxiety_im_so_lonely/",
            "retrieved_on": 1440537078,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "I'm 16 years old and I'm going to be a junior in high school. Ever since last year I've been incredibly anti social. The few people I'm friends with I do talk to and enjoy talking to them, but when it comes to meeting other people my age I'm horrible at it. I'm only good at talking to people like 20 years older than me. All of my friends have things to do. Girlfriends, visiting family, going out with other friends. And I'm stuck with nothing. I try to arrange plans with some of my close friends but they're all living their own social life. It doesn't help that I'm 6'5 and people always stare at me, it just makes my anxiety worse. I can never approach girls because I'm afraid they'll view me as creepy and I don't want to take the risk. The few girls that have decided to come up to me were immediately turned off by how socially inept I am.\n\nI'm seriously thinking about receiving medical help for this. Any advice?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How can I overcome social anxiety? I'm so lonely.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hnku7/how_can_i_overcome_social_anxiety_im_so_lonely/"
        },
        {
            "author": "stellathediver95",
            "author_created_utc": 1427745237,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mldyz",
            "created_utc": 1439880921,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hf1an/sugar_the_main_cause_of_my_anxiety_was_literally/",
            "gilded": 0,
            "id": "3hf1an",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hf1an/sugar_the_main_cause_of_my_anxiety_was_literally/",
            "retrieved_on": 1440541125,
            "score": 39,
            "secure_media_embed": {},
            "selftext": "I wanted to share this with this subreddit, because although I haven't posted much here, it's been the thing that helped me out most on some particularly bad days, and was the original reason I started realising there was a name for the ohgodeverythingisshitwhyme feelings that only I seemed to get. It's a bit long, cos I wanted to get out my story once and for all in the hopes that someone out there is struggling in a similar way and it could help them. \n\nSo I have anxiety. I guess I always have had, although as I've gotten older (early twenties now) got more responsibilities (a job, serious college, a flat, money) and more to lose (an excellent boyfriend, a damn good life), it has gotten significantly worse. I also have a problem with worrying about the past and unfortunately the older you get, the more past there is to worry about.\n\nMy anxiety could be about anything, but typically is focused on insecurity and needing to be in control. My boyfriend is the one who knows the worst of it - the crying fits because I burnt the eggs one morning after him making jokes about me being a terrible cook, for example. Inside my own head is where it's really bad though, the constant obsessive thought patterns going over and over the same things to the point where I can't concentrate on anything else. You all know the drill, probably. \n\nSo for the last six months I have been trying to get this under control, as I started to realise there was something \"wrong\" with me. I have all the tactics that there is out there, to do with obsessive thought patterns and anxiety. I could even get them to work sometimes, even a lot of the time on good days. I would say I went from 90% anxious thoughts to about 70%. But it still wasn't enough. I would still be calmly watching TV in the evening and then suddenly spiral into a pit of despair because of one of my regular thoughts coming back to me. It was better, but still hell. \n\nI went on a trip with the aforementioned boyfriend for a week, and was amazed to find how relaxed and happy I was. But seeing what it was like to not be wound up like a spring the whole time, then having to come back to \"normal life\" and get thrown back into the anxiety just made everything worse. I made the decision that I hadn't wanted to reach the point of: I was going to get on meds within the next month. \n\nThen I was browsing the internet one night and came across an article linking sugar to anxiety. Figured it was bullshit, but did some more research, and found a lot of things supporting it. This was interesting, you see, because I am a coke addict. Not that kind, the coca cola kind. At my worst I could drink a 2 litre a day easily, but about a year and half ago I gave that up for the sake of my health. For a while I gave it up entirely, but just replaced it with sprite or lucozade, because I felt sluggish and tired without any sugary drinks. So when I read this article I had been falling off the wagon a little, and for the past 2-3 months had been having at least one, if not two, cans/small bottles of coke a day. \n\nSo I decided I would give them up completely for a while and see.\n\nThe next day, I skipped my normal lunch-time coke at work. Twenty minutes later, I got a splitting headache which didn't go away until about eight pm. I figured this would happen, but it was still shite. I drank only water. The morning was the same, I got all caught up worrying about small stuff. But the afternoon, that was when I noticed the difference. Even if a usual worry came to mind, it was much easier to brush it aside and see the situation rationally. And that was just after one missed regular sugar fix. In the evening after work, I was much calmer and relaxed, (and, bonus, didn't crash in front of the telly at ten o clock like I normally do). I'm sure I must have skipped sugary drinks at some point in the last couple of years, (although it's very possible that I didn't...) but this was the first time that I'd paid attention to how it affected my anxiety. And I saw what a big difference it was making.\n\nI have kept it up for two weeks now. The headaches stopped after a few days. In the first few days I would also still get a few small episodes of genuinely worrying about something, but the more time went on, the more I was able to relax. \n\nI'm so much happier and calmer...over such a stupid reason. I'm genuinely annoyed at myself for not seeing it sooner. If a brain is naturally prone to overthinking and worrying, why would I think it was a good idea to provide it with excess energy that a desk job or college work just wasn't going to burn? As a side note, I think that's what happened on the holiday to make me so relaxed - it was chock-full of physical activity to burn off the sugar I put into myself. \n\nSugar may not be the actual cause of my anxiety, that's just how my brain is wired, but it has clearly been acting as a fuel for it for a long time. And being on a constant sugar crash afterwards was probably causing the negativity I seemed to always feel. Taking away the sugar doesn't completely take away the anxiety, but it makes it a hell of a lot easier to control. I would say I'm at around 20-30% anxious thoughts now.\n\nSo there you are. It's not going to help everyone, but I can't be the only one who is overly sensitive to sugar like this. If it sounds this could be you, just give it a try, because it's the best thing I could ever have done for myself. \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sugar: the main cause of my anxiety was (literally) under my nose the whole time",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hf1an/sugar_the_main_cause_of_my_anxiety_was_literally/"
        },
        {
            "author": "DavesAsylum",
            "author_created_utc": 1436675570,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_opsqb",
            "created_utc": 1440005329,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hlx4l/does_anyone_here_have_any_experience_with_bruxism/",
            "gilded": 0,
            "id": "3hlx4l",
            "is_self": true,
            "media_embed": {},
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hlx4l/does_anyone_here_have_any_experience_with_bruxism/",
            "retrieved_on": 1440537852,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone here have any experience with Bruxism or habitual teeth-clenching? And if so, how do you manage or 'cure' it?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hlx4l/does_anyone_here_have_any_experience_with_bruxism/"
        },
        {
            "author": "Oztek",
            "author_created_utc": 1358454743,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a9l39",
            "created_utc": 1439876317,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3heukg/i_have_anxiety_id_like_share_some_of_the_ways_i/",
            "gilded": 0,
            "id": "3heukg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3heukg/i_have_anxiety_id_like_share_some_of_the_ways_i/",
            "retrieved_on": 1440541211,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "It took a very long time for me to even know something was wrong with me. I thought everything I experienced was normal. I'd like to share some of the ways I can tell my anxiety is acting up, and how i attempt to deal with them.\n\n1. Breathing is shallow, and I find my self holding my breath occasionally. I didnt realize this until a fellow r/anxiety redditor pointed this out. This is a good indicator. Once I find myself doing it, I try hard to force my breathing to be deep and rythmic. It helps me take my mind off other things.\n\n2. Standing, sitting, leaning, doing things in an uncomfortable or awkward or unnatural position. I find myself leaning at weird angles to reach things, holding objects awkwardly, refusing to put things down to free up a needed hand. This strains my muscles. When i find myself doing this, I say \"fuck it\". I slow the hell down, to slightly faster than a turtles pace. I focus on just doing things with care, grace,and comfort, and attempt to shove the concept of speed and quickness out of my mind.\n\n4. What is going on in my brain? Is there music playing that i cant seem to stop? Are my thoughts disorganized and racing? Can I not seem to empty out my head? Do i feel the need to constantly be stimulated (looking at things, fiddling with things, talking lots, constantly be listening to music or podcasts, etc)? If I cant seem to empty calm my mind, i am having anxiety. Thoughts should only appear when requested to, not just appearing randomly and without a prompt. When this happens, I attempt to surround myself with as much nothing as possible. Maybe ill stare at a wall for some time, maybe ill just lie in bed, maybe read something very dry.\n\n6. Can I sleep? Can I empty my mind and relax? if im still awake at 3 am, Im having anxiety. Sadly, I still have not reached an effective work around. The best I can do is just focus on breathing.\n\nIn general, I find that I have to identify what is causing me anxiety. This is hard for me because I am very bad at introspection and understanding myself. Once i have identified something, I can start examining why its causing me anxiety. Usually, its fear of future consequences. Once I understand how and why, I need to justify my new, non anxiety fostering thoughts on the issue. I need to truly believe in what I tell myself. I need to accept it as a truth. This simultaneously difficult and easy. I can justify things (why i should eat that cake, why i should buy that bottle of bourbon, why I should try and date this person) but deep down I need myself to believe it fully; there cant be any shred of opposition to it. Silencing all dissent is the difficult part.\n\nThanks for reading. I wanted to share this with you. Protip: writing will help you identify your anxieties, and will lead you to a better understanding of yourself. Even if your post gets buried and no one upvotes you, its still a great exercise for dealing with those anxieties.\n\nGood night everyone.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have anxiety. I'd like share some of the ways I can tell my anxiety is getting out of control, and how I deal with it. Thank you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3heukg/i_have_anxiety_id_like_share_some_of_the_ways_i/"
        },
        {
            "author": "wifeofcookiemonster",
            "author_created_utc": 1271801294,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_40hdc",
            "created_utc": 1439787818,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3ha3wp/those_who_have_generalized_anxiety_disorder_do/",
            "gilded": 0,
            "id": "3ha3wp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3ha3wp/those_who_have_generalized_anxiety_disorder_do/",
            "retrieved_on": 1440543483,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I find that I have some symptoms of ADD kinda  - I have so much anxious noise in my brain that i have trouble getting things done efficiently sometimes.  Will that go away as I undergo treatment? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Those who have generalized anxiety disorder: do you find that you have trouble moving from one task to the next or focusing?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3ha3wp/those_who_have_generalized_anxiety_disorder_do/"
        },
        {
            "author": "pangalactic42",
            "author_created_utc": 1339743817,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_804z4",
            "created_utc": 1439760654,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3h8oro/a_group_was_asked_to_give_a_word_to_describe_me/",
            "gilded": 0,
            "id": "3h8oro",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3h8oro/a_group_was_asked_to_give_a_word_to_describe_me/",
            "retrieved_on": 1440544146,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "I was so surprised, and so...flattered? Proud? Impressed? I think I am the epitome of fake it til you make it. None of them know I have serious issues with anxiety so it feels like such a big win that I come across as confident to strangers :) I just wanted to share with a group who will understand how crazy this feels!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A group was asked to give a word to describe me today, and they all chose \"confident\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/3h8oro/a_group_was_asked_to_give_a_word_to_describe_me/"
        },
        {
            "author": "pornokitty",
            "author_created_utc": 1359409084,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ae9l3",
            "created_utc": 1439825700,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hbqk7/in_bangkok_right_now_and_freaking_out/",
            "gilded": 0,
            "id": "3hbqk7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hbqk7/in_bangkok_right_now_and_freaking_out/",
            "retrieved_on": 1440542663,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "For those who didn't hear a bomb exploded killing 27 and wounding at least 80. I'm not too close to where it happened but I'm scared of going to sleep in case something else happens. Also starting to worry about my food supply (I'm alone and I have nothing to eat...). \n\nI did find some comfort in packing an emergency bag with cash and my passport in case I need to get out fast, but I'm just feeling very paranoid and on edge. My mind keeps going over worst case senarios :(",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "In Bangkok right now and freaking out",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hbqk7/in_bangkok_right_now_and_freaking_out/"
        },
        {
            "author": "AKSasquatch",
            "author_created_utc": 1312215842,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5lnjx",
            "created_utc": 1440022548,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hn5hw/i_feel_like_my_anxiety_is_turning_into_deep/",
            "gilded": 0,
            "id": "3hn5hw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hn5hw/i_feel_like_my_anxiety_is_turning_into_deep/",
            "retrieved_on": 1440537276,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I suffer from panic attacks and GAD, yet no one has given me any pills to combat this and it is slightly disheartening.  I don't know what to do I spend all day reading about anxiety, but nothing changes, I'm fucking tired of it.  I feel like just quitting, I sit at work right now and just stare into space, I don't feel like working, talking, socializing and then when it's time to go home, I get anxious, my wife will have dinner, I'll hear about her day, I'll get back on the computer and she'll go to bed, I feel like I'm in this endless fucking loop that I can't escape it's horrible, I keep asking and asking for help from anyone including health care people and haven't gotten any.  I don't know what to do.  The best part of my day is being asleep.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I feel like my anxiety is turning into deep depression",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hn5hw/i_feel_like_my_anxiety_is_turning_into_deep/"
        },
        {
            "author": "kawaiimoesugoidesu",
            "author_created_utc": 1436298952,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_olucj",
            "created_utc": 1440110702,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3hs0pm/dae_get_babied_by_people_who_dont_understand_your/",
            "gilded": 0,
            "id": "3hs0pm",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3hs0pm/dae_get_babied_by_people_who_dont_understand_your/",
            "retrieved_on": 1440534947,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I have this friend who pretty much refuses to tell me if/when I'm being annoying or when he needs some time to himself because he thinks that if he's honest with me, I'll have an anxiety attack...that isn't even one of my triggers...\n\nAnybody else experience this? It's so freaking frustrating, I want to scream!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get \"babied\" by people who don't understand your anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3hs0pm/dae_get_babied_by_people_who_dont_understand_your/"
        }
    ]
}