{
    "data": [
        {
            "author": "shaolinshawdy",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1424523647,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wnho7/a_few_simple_suggestions_my_psychologist_gave_me/",
            "gilded": 0,
            "id": "2wnho7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 62,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wnho7/a_few_simple_suggestions_my_psychologist_gave_me/",
            "retrieved_on": 1440894693,
            "score": 255,
            "secure_media_embed": {},
            "selftext": "Hi friends. I recently decided to seek professional help for my anxiety and depression, and boy am I glad I did. I avoided going for many years, as I was apprehensive about being given a label or being put on medication. But yeah, therapy is nothing like I imagined, and I have noticed a big difference over only two sessions (up and down like a yoyo, but still an overall improvement).\n\nANYWAY. The really simple tips we've run through already:\n\n- Buy lavender fabric softener and wash your bedding with it. Lavender is naturally calming. I'm typing away in my room and it smells like heaven in here.\n\n- Grab some lavender oil! You can put this in your bath, and oil burner, or apply to your temples/back of neck/forehead. It's also nice to put a few drops on your pillow cases.\n\n- Walk in the morning (6/6:30am) and walk after work/in the afternoon. WITH MUSIC. This drowns out those horrible intrusive, self destructive thoughts.\n\n- Establish a bedtime routine. I now drink a cup of 'sleep time' tea, read and meditate (simple guided meditation - try applications Headspace and Smiling Mind). Note the best sleep you get is before 12am. I am trying to go to bed earlier, and rise earlier. \n\n- When you feel up to leaving the house and visiting the supermarket, stock up on super easy (but healthy) foods. Cheese, nice bread, frozen veggies, fruit, eggs, yoghurt etc.\n\nI hope these tips help you as much as they have helped me. \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A few simple suggestions my psychologist gave me that have really made a difference",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wnho7/a_few_simple_suggestions_my_psychologist_gave_me/"
        },
        {
            "author": "druskim",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1424035148,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w09d7/does_rain_make_you_calm_too/",
            "gilded": 0,
            "id": "2w09d7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w09d7/does_rain_make_you_calm_too/",
            "retrieved_on": 1440905652,
            "score": 201,
            "secure_media_embed": {},
            "selftext": "Everytime it rains ( I live in the middle east, so no much here ), I feel extremely calm and positive, if it's raining I always leave my window open so I can hear the rain and it just makes me so relaxed and such, do you have the same feeling too?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does rain make you calm too?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w09d7/does_rain_make_you_calm_too/"
        },
        {
            "author": "FishFollower74",
            "author_created_utc": 1423427834,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_l8jr8",
            "created_utc": 1424073231,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w232h/i_defeated_a_panic_attack_tonight/",
            "gilded": 0,
            "id": "2w232h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 57,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w232h/i_defeated_a_panic_attack_tonight/",
            "retrieved_on": 1440904801,
            "score": 178,
            "secure_media_embed": {},
            "selftext": "My biggest fear is of something being wrong with my heart, due to a family history of heart disease. I woke up about 12:30AM with some pain in my chest. While my rational mind was saying \"it's just muscle pain,\" my irrational mind freaked out. Heart started racing, got sweaty, etc. Typical panic attack symptoms. \n\nI just laid in bed and did some deep breathing and mental exercises...thought about taking a Xanax to calm me down, but I wanted to stare this attack down and come out on top. \n\nAnd I did, about 30 minutes later or so. Chest pain went away, heart rate went down to close to normal, and I feel OK now. I'm wide awake - I think from all the adrenaline - but feel good otherwise. \n\nBeing able to get control over an attack and ride it out without Xanax is s big step forward for me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I defeated a panic attack tonight",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w232h/i_defeated_a_panic_attack_tonight/"
        },
        {
            "author": "Murmaider666",
            "author_created_utc": 1424146304,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lej1t",
            "created_utc": 1424206890,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w8gbi/i_will_get_through_today_and_so_will_you/",
            "gilded": 0,
            "id": "2w8gbi",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w8gbi/i_will_get_through_today_and_so_will_you/",
            "retrieved_on": 1440901769,
            "score": 157,
            "secure_media_embed": {},
            "selftext": "Last night I may not have been able to breathe or see well from a few hour anxiety attack, and woke up in the same state, but I will get through today.  I have made breakfast and taken my medication, and will not sink into the couch to extend my low to new depths.  I will draw, then go buy groceries because I am important.  I will take care of myself.   No matter how small the accomplishment, it makes a difference.  Even if it's just breathing. One day at a time.  Thank you for listening.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I will get through today, and so will you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w8gbi/i_will_get_through_today_and_so_will_you/"
        },
        {
            "author": "alternativeeden",
            "author_created_utc": 1297454073,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4u04s",
            "created_utc": 1424197516,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w7uq9/ive_suffered_from_severe_anxiety_for_16_years/",
            "gilded": 0,
            "id": "2w7uq9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w7uq9/ive_suffered_from_severe_anxiety_for_16_years/",
            "retrieved_on": 1440902048,
            "score": 131,
            "secure_media_embed": {},
            "selftext": "I've been able to manage my anxiety (with greater or lesser success) over the last (almost) two decades. In the last few months, after completing my PhD comprehensive exams, my anxiety has gotten to the point where I can barely function. Today, I made an appointment with my family doctor and he prescribed me 0,5 mg of clonazepam. In addition to this, I made an appointment with a counselor at my university to inquire about cognitive behaviour therapy. \n\nI feel like I've let myself down in asking for help because it's something that I wanted to be able to overcome on my own. However, if the last 16 years are any indication (and the last few months, especially), then I think it's pretty clear that I can't do it alone. \n\nI also told my parents today, the first time I've told anybody about how severe my anxiety is. 16 years of being in the \"anxiety closet\" is now in the past.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've suffered from severe anxiety for 16 years (since I was 12 years old). Today was a huge milestone: I asked for help.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w7uq9/ive_suffered_from_severe_anxiety_for_16_years/"
        },
        {
            "author": "glitter-octopus",
            "author_created_utc": 1410448982,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_icogu",
            "created_utc": 1424179025,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w6tqe/youll_all_probably_understand_how_amazing_this_is/",
            "gilded": 0,
            "id": "2w6tqe",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w6tqe/youll_all_probably_understand_how_amazing_this_is/",
            "retrieved_on": 1440902528,
            "score": 126,
            "secure_media_embed": {},
            "selftext": "It's always amazing to me how incredibly draining anxiety is. I have health anxiety and GAD so the day after when I feel like this I always start to worry that I had a heart attack in my sleep or something - which logically I know doesn't make sense, but anxiety seems to create all of these illogical medical scenarios in my head. I'm just so glad I can stay home, try to relax, and not face the world this morning.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "You'll all probably understand how amazing this is - I was having a lot of anxiety last night, heart racing, couldn't sleep - woke up today, and my office is closed so I'm working from home.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w6tqe/youll_all_probably_understand_how_amazing_this_is/"
        },
        {
            "author": "flame_in_darkness",
            "author_created_utc": 1360048998,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ahdfm",
            "created_utc": 1424405562,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wihkd/dae_get_this_feeling_where_your_body_is_anxious/",
            "gilded": 0,
            "id": "2wihkd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wihkd/dae_get_this_feeling_where_your_body_is_anxious/",
            "retrieved_on": 1440897086,
            "score": 108,
            "secure_media_embed": {},
            "selftext": "It is very strange and uncomfortable. My stomach feels out of place, idk how to describe it, and my body just feels very light in general.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get this feeling where your body is anxious and your mind is calm?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wihkd/dae_get_this_feeling_where_your_body_is_anxious/"
        },
        {
            "author": "Stupiddrunkenme",
            "author_created_utc": 1424340885,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lgkx6",
            "created_utc": 1424342995,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wf2pm/i_did_something_really_really_fucked_up_and_dont/",
            "gilded": 0,
            "id": "2wf2pm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 55,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wf2pm/i_did_something_really_really_fucked_up_and_dont/",
            "retrieved_on": 1440898678,
            "score": 106,
            "secure_media_embed": {},
            "selftext": "I'm mostly just looking for people to talk to... I need to get this off my chest.\n\nLast night I went to a Mardi Gras party at one of my (very new) coworkers places. Our restaurant chain is all intertwined and I know many of the people who work at the other stores. We've never hung out outside of the restaurants and I don't know them very well, but they happened to all be there last night and I wanted to make good impressions.\n\nWell that didn't happen... I had forgotten to refill my Zoloft prescription for 3 days and finally took it two hours before the party. As some probably know, SSRIs make alcohol affect you much, much harder, and on top of that we were all drinking heavily and having a good time. \n\nSomewhere in the night I went dark. I wake up in my bed today, vomit on my sheets, and a missing phone. I INSTANTLY felt like something was very wrong and ran to the bathroom where I started hyperventilating. I had NO recollection of the night past a point but I had this feeling in my gut that something bad happened... And apparently I was right. \n\nI called up my best friend (who was there) from my house phone and she told me and I quote \"you caused a scene. You should probably apologize to some people.\" I felt my blood just go cold and started crying again. She then refused to tell me anything else \"while I was being hysterical\" so I hung up and proceeded to have an hour long fucking breakdown. I couldn't move onto the bed, couldn't eat or speak, I just curled up on the ground and hated myself and cried until I gagged.\n\nI knew I had to do damage control so when my friend (with benefits... It's a weird situation) called my house, I instantly apologized and told him I don't know what I did but I know it was bad. He told me yes, it was a shit show where I apparently tried to drag another guy into the bedroom after just hooking up with him, sobbing uncontrollably, screaming back and forth at him, and refusing to leave. He said he had to FORCE me into my coworkers car so they could take me home. \n\nThen, as he gets me inside my house I go sit on the floor, cuss him out, and start hitting him and biting him (explains the massive bruise on my palm). I apologized sincerely and told him that I don't know what is wrong with me, but that I'm done with alcohol for a LONG time. He told me he accepts my apology and is not upset anymore, just worried because it seemed like I was drugged. My best friend and her boyfriend who drink with me OFTEN also said they've never seen me go off the deep end quite like this (I've been known to cry), but I wasn't drugged. That would that make a nice excuse if I was, but no.\n\nI'm not a violent or hateful person sober. I'm reserved, perpetually anxious, level headed... And I've been drinking for years! I've NEVER been an emotionally disturbed drunk until recently, with all the crying and now this. I have no idea what's going on or how to make this right with everyone. I apologized to my coworker when she brought me my phone at work, and she said \"everyone was worried... It was bad.\" I won't be surprised if I'm never invited to her place again. \n\nMy best friend had texted my mom in the middle of the night expressing concern for me and my state. Her boyfriend (also my coworker) made fun of me all night at work for it. I can't show my face in the other restaurant anymore.\n\nPlease someone tell me you did something stupid at some point too and it all got better :( my mind won't stop replaying it over and over and over ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I did something really, really fucked up and don't know how to calm myself down",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wf2pm/i_did_something_really_really_fucked_up_and_dont/"
        },
        {
            "author": "VPI_1991",
            "author_created_utc": 1341451326,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_889o1",
            "created_utc": 1424126038,
            "domain": "self.Anxiety",
            "edited": 1424219044,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w4jl0/54321_exercise/",
            "gilded": 0,
            "id": "2w4jl0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w4jl0/54321_exercise/",
            "retrieved_on": 1440903654,
            "score": 105,
            "secure_media_embed": {},
            "selftext": "Hey, /r/Anxiety \n\nI'm a constant over thinker and have been for as long as I can remember.  In some aspects, it's actual very helpful, but in others it is a curse.  I just wanted to take a minute and share an exercise that was taught to me.  I've found it helps ground me in times of panic or while perseverating on a negative thought and keeps me in the current moment.  I tend to be a very practical person who has difficulty doing things like imagining peaceful scenes and the like, so this exercise with it's concrete instructions is really helpful.\n\nI hope it's as helpful for you as it has been to me!\n\nI learned this strategy from someone and it is really, really helpful for me when I need to focus on becoming more mindful of the present moment. She called it \"5,4,3,2,1\" and it goes like this:\n\nEither say aloud or just think:\n\n5 things you see\n\n5 things you hear\n\n5 things you smell\n\n5 things you feel (physically)\n\n4 things you see\n\n4 things you hear\n\n...\n\nUntil you get to 1.\n\n\n\n\nAt the end of this exercise you'll be much, much more focused upon the present moment and will hopefully be less focused upon perseverating on a negative thought or in a state of panic.\n\nEdit: I'm glad to see that this exercise has helped so many people!  Thanks for taking the time to read!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "5-4-3-2-1 Exercise",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w4jl0/54321_exercise/"
        },
        {
            "author": "dkfjghdgdcfg",
            "author_created_utc": 1424288111,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lg40p",
            "created_utc": 1424288630,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wcfhr/phone_calls_make_me_insanely_anxious_anyone_else/",
            "gilded": 0,
            "id": "2wcfhr",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wcfhr/phone_calls_make_me_insanely_anxious_anyone_else/",
            "retrieved_on": 1440899913,
            "score": 78,
            "secure_media_embed": {},
            "selftext": "I have no idea why, but the idea of talking on the phone with a stranger fills me with paralyzing fear.  It's been this way for years.  I have no problem talking on the phone with people I know--I frequently call my wife, my mom and my grandparents for example.  But when it comes to talking to someone I don't know, it's like night and day.  I almost always avoid answering the phone when I get a call from an unknown number--which has caused me problems in the past as you might imagine, but I can't seem to stop doing it.  Answering the phone in that situation feels like trying to talk myself into jumping off something really high--I know I probably won't get hurt, but every instinct in my body is screaming at me that it's dangerous.  I just found out that I have to call someone for work this afternoon, and added to the anxiety of not knowing him is the fact that I don't really feel equipped to discuss the issue I need to talk to him about.  I've been battling flight-or-fight response for the past hour but I just don't see any way out of this.  I feel shaky right now just writing about it, I really don't know how I'm going to do this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Phone calls make me insanely anxious. Anyone else? Any advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wcfhr/phone_calls_make_me_insanely_anxious_anyone_else/"
        },
        {
            "author": "lildicey",
            "author_created_utc": 1421089362,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ko7pf",
            "created_utc": 1423999956,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2vypk4/sitting_in_a_coffee_shop_feeling_incredibly_lonely/",
            "gilded": 0,
            "id": "2vypk4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2vypk4/sitting_in_a_coffee_shop_feeling_incredibly_lonely/",
            "retrieved_on": 1440906375,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "Don't really know where else to post this so I thought id just write about it here for therepeuatic reasons. So yesterday was valentines day and I went out with my sister and her friends. Whilst out I couldn't help looking at couples and feeling so envious. I am 19 and I've never really had a serious girlfriend. I feel like being in a relationship is a huge aspect of life that i simply haven't experienced yet. I'm not socially awkward or anything. I just feel I've never really built a relationship with girls that I know. Tonight I decided to go to a coffee shop and get a coffee and read my book to relax but I'm literally just sitting here feeling utterly lonely. On the way over here I kept walking past restraunt windows and seeing happy couples eating and it literally just makes me feel like I want that so much. The whole situation reminds me of that George rr Martin quote about how being lonely at a party hurts so much.\n\nAnyways I just wanted to write this because I feel writing makes me feel better. Have a great night. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Sitting in a coffee shop feeling incredibly lonely.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2vypk4/sitting_in_a_coffee_shop_feeling_incredibly_lonely/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1424205198,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w8cmd/friendly_psa_please_think_critically_about_how/",
            "gilded": 0,
            "id": "2w8cmd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w8cmd/friendly_psa_please_think_critically_about_how/",
            "retrieved_on": 1440901817,
            "score": 65,
            "secure_media_embed": {},
            "selftext": "Hello fellow anxious people. \n\nRecently on this sub I've seen a few threads that have left a bad taste in my mouth. It has concerned people with illness anxiety asking for help with their symptoms. As a hypochondriac myself, I've seen and heard some really bad advice. If you don't have illness anxiety, I just want to explain a little bit about it. \n\nGenerally, at any given point someone with illness anxiety is ruminating on whatever disease or disorder they believe they have. Some people take this a step further by doctor shopping, getting a plethora of tests done, and probably looking for validation that what they are experiencing is real and they are totally gonna die or need a limb chopped off or something. I know this because **I am one of those people.** I have gone to see multiple different specialists, had tons of tests done, and been desperate to figure out what was medically wrong with me. While I do have a few things medically wrong with me, the biggest culprit of my physical symptoms is anxiety. I know this isn't true for everyone, but for most young people with hypochondria, it is.\n\nIf someone posts a thread stating that they have been to multiple doctors and had multiple tests with no results, please do not suggest more expensive and invasive tests for them. If someone is afraid of an illness, please do not suggest serious illnesses they may have (cancer, heart issues, other diseases). This can become terrifying to someone freaking out about their body. I have spent literally weeks in bed just crying because a doctor suggested that I may have some rare disease. Even hearing potential diagnoses can become an unhealthy obsession for some people (some people may even just post over and over to fish for an internet diagnosis to have something to validate their ideas. I think it's especially important that these people get help with their anxiety first and foremost!).  \n\nThis is not at all to say that I don't think that people looking for answers shouldn't be given resources to find them. People with illness anxiety deserve support like anyone else. I just ask that you think beforehand, and try not to make it worse for them. \n\nTo my fellow hypochondriacs, I love you. We get each other. We are a special brand of anxiety for sure. I know things seem terrifying sometimes, but we are totally going to be okay. Try treating your anxiety first and see how many symptoms persist. You probably don't have that really weird disease you heard about on House (but what if? amiright?). \n\nThe only person who can make a real diagnosis about anything we are experiencing is our doctor. Reddit really has no idea about our medical history, how our brain works, or what's going on in our lives. If you are scared I urge you to speak to your doctor. They can determine if you need medical treatment or treatment for anxiety. Illness anxiety is *exhausting* and incredibly persistent. I am really sorry if you are experiencing it and you can PM me if you ever feel like talking or need reassurance. \n\nI don't mean to hurt anyone's feelings with this post or make anyone feel bad, so I hope I don't. I just want people to know that even the tiniest of things can greatly influence someone, especially on this sub. Make sure that the advice you are giving is helping to life someone up rather than giving someone an excuse to keep being down. \n\n&lt;3",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Friendly PSA: Please think critically about how you respond to people with hypochondria!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w8cmd/friendly_psa_please_think_critically_about_how/"
        },
        {
            "author": "Obskure22",
            "author_created_utc": 1424013713,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lddcf",
            "created_utc": 1424265924,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wb4n9/today_is_better_than_yesterday/",
            "gilded": 0,
            "id": "2wb4n9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wb4n9/today_is_better_than_yesterday/",
            "retrieved_on": 1440900520,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "Yesterday I struggled with anxiety all day. Nothing hit the point of an attack, but it was there, always present. \n\nToday will be better. I'm at work, I feel okay, I feel like I can eat something. After work, I'm babysitting my best friends' son who is like a nephew to me. Then his sister will get home with her mom and give me a big hug. It helps me to see how happy those kiddos are, that life really isn't meant to worry about everything. I need to enjoy life",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Today is better than yesterday",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wb4n9/today_is_better_than_yesterday/"
        },
        {
            "author": "anxietyexists",
            "author_created_utc": 1423527157,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_l9mbz",
            "created_utc": 1424337580,
            "domain": "anxietyexists.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wexdh/i_cant_explain_what_depression_is_like_unless_you/",
            "gilded": 0,
            "id": "2wexdh",
            "is_self": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wexdh/i_cant_explain_what_depression_is_like_unless_you/",
            "retrieved_on": 1440898747,
            "score": 49,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/qiT3xhbVNoZyg2DAqyFbK3bJRqaesGpeu0taJVkyDEA.jpg",
            "title": "\"I can't explain what depression is like unless you suffer from it\": Korn frontman Jonathan Davis",
            "url": "http://anxietyexists.com/i-cant-explain-what-depression-is-like-unless-you-suffer-from-it-korns-jonathan-davis-shares-his-battle/"
        },
        {
            "author": "CalmUrselfHorsethief",
            "author_created_utc": 1420660664,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kkmfq",
            "created_utc": 1424457378,
            "domain": "self.Anxiety",
            "edited": 1424484738,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wknk5/probiotics_have_been_helping_me_a_ton_and_i_think/",
            "gilded": 0,
            "id": "2wknk5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wknk5/probiotics_have_been_helping_me_a_ton_and_i_think/",
            "retrieved_on": 1440896075,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Probiotics have been helping me a TON and I think more people need to try it (links to academic studies provided)",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wknk5/probiotics_have_been_helping_me_a_ton_and_i_think/"
        },
        {
            "author": "Unc1eRuckus",
            "author_created_utc": 1333850293,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7dzdn",
            "created_utc": 1424484182,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wm59q/when_i_get_stressed_i_shut_down_how_do_i_handle/",
            "gilded": 0,
            "id": "2wm59q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wm59q/when_i_get_stressed_i_shut_down_how_do_i_handle/",
            "retrieved_on": 1440895319,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "When I get stressed I shut down, how do I handle this",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wm59q/when_i_get_stressed_i_shut_down_how_do_i_handle/"
        },
        {
            "author": "ChimpWithAGun",
            "author_created_utc": 1307078551,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5bp6g",
            "created_utc": 1424158547,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w67y2/watching_cosmos_helped_me_put_thing_in_perspective/",
            "gilded": 0,
            "id": "2w67y2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w67y2/watching_cosmos_helped_me_put_thing_in_perspective/",
            "retrieved_on": 1440902810,
            "score": 35,
            "secure_media_embed": {},
            "selftext": "Neil DeGrasse Tyson describes life and the universe in such a beautiful way, that it made me realize how dumb my anxiety is: we focus our feelings in such insignificant matters, that we forget to enjoy life. If you want to know exactly what I'm talking about, watch Carl Sagan's \"[The Pale Blue Dot](http://youtu.be/4PN5JJDh78I)\".\n\nI've been dealing with so much stress at work that my anxiety has been kicking in way more often than it used to, and it was kind of making it hard for me to control it. But I just watched the last episode of the 1st season of Cosmos, and I'm not going to lie, I cried. I cried of happiness. I'm so glad I have what I have, I am where I am, and in the end, whatever happens at work is just temporary, and in the long term, it is even meaningless. So I should enjoy the process instead of stressing. I should be happy and mindful.\n\nWell, I just wanted to vent. I feel better and I trust my ability to control my anxiety. I always end up controlling it. Everything, including my anxiety, is temporary.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Watching Cosmos helped me put thing in perspective",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w67y2/watching_cosmos_helped_me_put_thing_in_perspective/"
        },
        {
            "author": "IrritatingComment",
            "author_created_utc": 1391845949,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f6d6k",
            "created_utc": 1424311670,
            "domain": "markmanson.net",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wdu5o/how_to_not_give_a_fuck/",
            "gilded": 0,
            "id": "2wdu5o",
            "is_self": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": true,
            "permalink": "/r/Anxiety/comments/2wdu5o/how_to_not_give_a_fuck/",
            "retrieved_on": 1440899256,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "nsfw",
            "title": "How to not give a fuck.",
            "url": "http://markmanson.net/not-giving-a-fuck"
        },
        {
            "author": "HumpingMantis",
            "author_created_utc": 1407957971,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hv3xf",
            "created_utc": 1424374060,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wgmj7/i_have_existential_death_anxiety_help/",
            "gilded": 0,
            "id": "2wgmj7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 40,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wgmj7/i_have_existential_death_anxiety_help/",
            "retrieved_on": 1440897955,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "This happens only at night while I'm trying to go to sleep.\n\nI think about what happens after I die, and how I'm going to cease to be. Like, non-existent. Think about how you were before you were born...that's what it's like after you die, right? Terrifying.\n\nI don't want to be nothing. It's not about not feeling anything or knowing or whatever. It's literally not being anything.\n\nI have a hard time thinking about anything else. When I do, it all comes back to not existing.\n\nPlease help...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I have Existential death anxiety [Help]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wgmj7/i_have_existential_death_anxiety_help/"
        },
        {
            "author": "hahahthrowawayy",
            "author_created_utc": 1413454638,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ivubm",
            "created_utc": 1424437978,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wjl43/i_cant_eat_pls_help/",
            "gilded": 0,
            "id": "2wjl43",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wjl43/i_cant_eat_pls_help/",
            "retrieved_on": 1440896573,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I need help\nMy anxiety has grown so debilitating that i am struggling very much so  with the act of eating, I find myself focusing on my throat a lot so when i swallow food down it feels like its getting trapped or im going to choke or that my throat's closing up or something, its actually tthe worst i know the foods going down but my anxiety causes me to cough or start hyperventilating to make sure that im ok, how do i deal with this? i seriously need help :( Im getting CBT, its been kinda helping bt im pretty fresh to it. Someetimes i try to distract myself by watching shows but im too focused on myself if anyone could help it would be much appreciated &lt;3\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I cant eat pls help",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wjl43/i_cant_eat_pls_help/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1424166771,
            "domain": "self.Anxiety",
            "edited": 1424173892,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w6gil/my_description_of_my_anxiety_for_a_book_im_writing/",
            "gilded": 0,
            "id": "2w6gil",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w6gil/my_description_of_my_anxiety_for_a_book_im_writing/",
            "retrieved_on": 1440902699,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "Anxiety occurs in an assortment of shapes, sizes, and deviations. The situations, processes, thoughts, or events that procure it, derive it, or prompt it are also diverse and often entirely dissimilar. They may be distinctive, unusual, prophesied, or unforeseen. I have endured numerous such events of anxiety, but my personal torment with the condition appears to most frequently stem from thoughts or rejection, failure, the unknown, the known, self-hate, and a loss of control of situations that concern me. \n\nMy current form of anxiety is complex and difficult to eloquently explain. I struggle to clearly pinpoint the foundation, but I can describe the feeling within me to those who will listen to my musings. \n\nTo me, anxiety can be described as perversely caring too much about everything. It is holding a long list of complications, often fabricated or unlikely, in my head that causes excess and hideous worry for no apparent logical reason. The occasional realisation that you are the architect of your own suffering can then in turn cause enough self-hate to circle your thoughts and perpetuate yet further ill feeling, generated by your own sentiment. Feeling anxiety in a given moment can be likened to an invoked need to flee away from something, but the efforts are futile, because that something is your own mind.\n\nAnxiety can cause a separation of body from mind. It can produce a ghostly external figure that observes your being and criticises, insults, and revels in your sorrow. It provokes and insinuates the judgements and condemnations of others through their disgust and intolerance of you. You are an abject failure. \n\nYour own body and skin can become an inescapable torture chamber and sacrificial ground. Your brain develops a lining of barbed wire, and even the rare contemplation of a nirvana outside its walls is met with an ambivalent punishment or increased anguish and torment. Anxiety can instigate deep fear of anticipated events, non-events, results, or outcomes, however likely or fabricated they may be. The feeling of fear causes further horror. \n\nAnxiety can escalate and worsen with rapid speed, often with no clear justification for doing so. However mild or intense, you can’t snap out of it, banish it, or evade it. Redemption can, and more often is, entirely futile. I liken the mere suggestion as demanding a person having a heart attack to stop, and compose oneself. Anxiety is an illness that requires treatment, like any other. The brain is an organ, and perfectly capable of malfunction on occasion, like any other. \n\n\nEDIT: Some of the above was influenced by my reading of people's similar experiences posted in this sub. Thanks guys. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "My description of my anxiety for a book I'm writing.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w6gil/my_description_of_my_anxiety_for_a_book_im_writing/"
        },
        {
            "author": "soimthinking",
            "author_created_utc": 1421727973,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ktqbm",
            "created_utc": 1424113443,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w3r7c/do_you_find_that_being_sick_makes_your_anxiety/",
            "gilded": 0,
            "id": "2w3r7c",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w3r7c/do_you_find_that_being_sick_makes_your_anxiety/",
            "retrieved_on": 1440904021,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I've come down with a very bad head cold and woke up this morning feeling horribly anxious. Nothing is out of the ordinary otherwise, but I'm not anxious about being sick. It's just making me think about other things and get anxious about those instead.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Do you find that being sick makes your anxiety worse?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w3r7c/do_you_find_that_being_sick_makes_your_anxiety/"
        },
        {
            "author": "Anthemz",
            "author_created_utc": 1412298203,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ioioe",
            "created_utc": 1424060849,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2w1l8q/did_you_always_have_anxiety_or_did_something/",
            "gilded": 0,
            "id": "2w1l8q",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2w1l8q/did_you_always_have_anxiety_or_did_something/",
            "retrieved_on": 1440905032,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "All of my life, I was a pretty outgoing person. I had a care free soul, and lived life to the absolute fullest. But that dreadful day on November 15th, 2014 changed everything. Up until then, I never gave much thought to anxiety or any mental illness for that matter. But when it struck me for the first time, I couldn't believe how awful and life changing this affects a person. \n\n\nIt was honestly the most frightening moment of my life. When an anxiety attack strikes you for the first time - and you have no idea what's happening since you never experienced it before... I have never been so scared. \n\n\nI had been struggling with a ton of stress in my life for a magnitude of reasons, and for reasons I am ashamed to admit, dabbled into a cocktail of drugs on the night that it happened. Doing the drugs is what definitely set me overboard, and my brain finally just stopped and said \"I can't take this anymore!\" and thus, the beginning of my anxiety began.\n\n\nI remember going to the washroom of the party and I looked in the mirror and I couldn't recognize the person in the mirror. I freaked out at my alien figure and started panicking. My neck tensed up and I could barely breathe. I fell to my knees and began blacking in and out. I started feeling intense brain zaps and felt like I was either a) having a seizure/stroke or b) I was about to die.\n\n\nI ran out of the house, past my friends, and into my truck to drive myself to emergency. As I hopped into my truck, I started experiencing everything in 3rd person view. It felt like I had come out of my body and was observing myself from an overhead view of me panicking inside my truck. Was I fucking dead?!?! I didn't know at this point. Suddenly I came back into my body. And for some reason I was focused on the clock on my dashboard illuminating back at me. \"2:44\" it showed. I kept saying over and over again \"Time of death 2:44, time of death 2:44..\" I kept repeating that for some fucking reason, and all of the sudden I snapped back into reality... and I realized I was driving on THE HIGHWAY THE WHOLE TIME and was almost at the hospital. I have zero recollection of even driving from my friends house to the hospital. In my mind I was still in my friends driveway at the party just sitting inside my truck looking at the clock. \n\n\nI pull into the hospital and I hop out. Another wave of panic hits me. My neck begins to tense up. I fall down to my knees again and look up at the hospital and tell my brain \"You just gotta get through those doors.\" I was fully convinced the hospital staff was going to find my dead body in the parking lot. I managed to get to my feet though and I walk into the hospital doors clenching my neck with my hands very tightly. I didn't realize that I was actually choking myself more than my neck was actually tense. The doctors see my state and get me into the ER. They sedated me immediately as I was in a huge fit and next thing I know I am waking up in hospital with a heart monitor attached to me and a nurse monitoring my vitals. Everything that had happened previous to that, just felt like a bad dream, but it all actually happened and I couldn't wrap my head around it. The kind doctor explained to me what happened, and they let me talk to a therapist for an hour, free of charge, and he explained to me what anxiety was and how it happens. They gave me anti-anxiety meds and I felt a million times better.\n\n\nEver since that dreadful evening on November 15th, 2014.. I still battle the odd anxiety. The antidepressants I am on really help in keeping my mind in control, but now that anxiety has been triggered, I feel like it will never quite go away. It will always linger in some degree. I've had attacks since, but I have been able to keep a rational head. However, I have develop hypochondria, and am always awfully aware of my own heart and what my brain is doing/thinking. It's safe to say I'll never be the same again, but I like to think this horrific thing that happened to me, and that has happened to all of us, will only make us better prepared for whatever we may have to battle in the future. \n\n\n**TL;DR** For those who want to skip my story, basically what I'm asking is, have you always had anxiety? Or did something happen on a particular day that triggered this horrifying mental illness on you? Have you learned to cope with it and manage your attacks? \n\n\nThanks r/anxiety! This subreddit has really helped me in so many ways and I just wanted to share my story and hear more from the community. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Did you always have anxiety? Or did something trigger it one day? What happened on that day? How do you cope now?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2w1l8q/did_you_always_have_anxiety_or_did_something/"
        },
        {
            "author": "ssgtgriggs",
            "author_created_utc": 1413059022,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_it7tx",
            "created_utc": 1424258575,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wavth/never_before_have_i_heard_a_song_that_described/",
            "gilded": 0,
            "id": "2wavth",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "Huy Q",
                    "author_url": "http://www.youtube.com/channel/UCRJvFOqHrtuGnTdrAQX_aMA",
                    "description": "Lyrics] Fine on the Outside - Priscilla Ahn (\"When Marnie Was There\" Ending theme song) I DO NOT own this content. Hope you guys like this!! :D",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FWD7eOgBp6UU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWD7eOgBp6UU&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FWD7eOgBp6UU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "http://i.ytimg.com/vi/WD7eOgBp6UU/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "[Lyrics] Fine On The Outside - Priscilla Ahn (\"When Marnie Was There\" Ending theme song)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=WD7eOgBp6UU",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=http%3A%2F%2Fwww.youtube.com%2Fembed%2FWD7eOgBp6UU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWD7eOgBp6UU&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FWD7eOgBp6UU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wavth/never_before_have_i_heard_a_song_that_described/",
            "retrieved_on": 1440900635,
            "score": 22,
            "secure_media": {
                "oembed": {
                    "author_name": "Huy Q",
                    "author_url": "http://www.youtube.com/channel/UCRJvFOqHrtuGnTdrAQX_aMA",
                    "description": "Lyrics] Fine on the Outside - Priscilla Ahn (\"When Marnie Was There\" Ending theme song) I DO NOT own this content. Hope you guys like this!! :D",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FWD7eOgBp6UU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWD7eOgBp6UU&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FWD7eOgBp6UU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.ytimg.com%2Fvi%2FWD7eOgBp6UU%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "[Lyrics] Fine On The Outside - Priscilla Ahn (\"When Marnie Was There\" Ending theme song)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=WD7eOgBp6UU",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FWD7eOgBp6UU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWD7eOgBp6UU&amp;image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FWD7eOgBp6UU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/1-K1ROBcF-fbAYlGeVsWP0nsPtBzV1SumL_qWM0TOCs.jpg",
            "title": "Never before have I heard a song that described my life better. It's kind of sad, but also comforting.",
            "url": "https://www.youtube.com/watch?v=WD7eOgBp6UU"
        },
        {
            "author": "ILoveHotGayMen",
            "author_created_utc": 1367234188,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_bhyu7",
            "created_utc": 1424304706,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2wdg18/does_anyone_else_become_addicted_to_people_as_a/",
            "gilded": 0,
            "id": "2wdg18",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2wdg18/does_anyone_else_become_addicted_to_people_as_a/",
            "retrieved_on": 1440899440,
            "score": 22,
            "secure_media_embed": {},
            "selftext": "Ever since I was 13 or so (29 now) I have been infatuated with a certain individual. The person changes, but the addiction process stays the same. I meet someone I like, I start a friendship, start flirting, and it spirals until I get bored with them. I have figured out through therapy that it is a coping mechanism for dealing with my Anxiety due to growing up in an abusive and dysfunctional atmosphere as a child. These addictions make me happy when I am stressed, but the problem is they consume me. I will become to the point where I am obsessive about another individual. I think about them non stop and constantly want their attention, and when I don't get it, it's agonizing. I hate this about myself, and as you can imagine it causes me lots of problems in my personal life, especially so because I am married. I do not want this, but I am having a hard time battling it. I recently opened up to my Husband about it, and we are working on it in Therapy. I just want to know if anyone else out there has dealt with this, so perhaps I don't feel so alone. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else become addicted to people as a coping mechanism?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2wdg18/does_anyone_else_become_addicted_to_people_as_a/"
        }
    ]
}