{
    "data": [
        {
            "author": "Trollohunter",
            "author_created_utc": 1325105128,
            "author_flair_css_class": "",
            "author_flair_text": "MDD/Panic Disorder",
            "author_fullname": "t2_6j63n",
            "created_utc": 1420313766,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r87b4/dae_watch_movies_or_tv_shows_that_theyve_seen/",
            "gilded": 0,
            "id": "2r87b4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 175,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r87b4/dae_watch_movies_or_tv_shows_that_theyve_seen/",
            "retrieved_on": 1440987069,
            "score": 363,
            "secure_media_embed": {},
            "selftext": "I more often than not watch something that I have already seen because I already know that it is something that I enjoy. Whenever I feel depressed or anxious this is something I use to seek refuge.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE watch movies or tv shows that they've seen before because they are comforting?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2r87b4/dae_watch_movies_or_tv_shows_that_theyve_seen/"
        },
        {
            "author": "mcmelonhead",
            "author_created_utc": 1373927333,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ce364",
            "created_utc": 1420460985,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rea38/treat_your_anxious_thoughts_as_though_they_are/",
            "gilded": 0,
            "id": "2rea38",
            "is_self": true,
            "media_embed": {},
            "num_comments": 42,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rea38/treat_your_anxious_thoughts_as_though_they_are/",
            "retrieved_on": 1440984175,
            "score": 298,
            "secure_media_embed": {},
            "selftext": "This idea from The Happiness Trap Pocketbook was a big help for me and everyone I've passed it on to has said it helped them. So thought I'd share.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Treat your anxious thoughts as though they are stories on a bias corporate TV News program. Your anxious thoughts are bias and have no credibility.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rea38/treat_your_anxious_thoughts_as_though_they_are/"
        },
        {
            "author": "Starblush",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420147840,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r1d03/methods_to_help_anxiety_that_wont_hurt_your_wallet/",
            "gilded": 0,
            "id": "2r1d03",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r1d03/methods_to_help_anxiety_that_wont_hurt_your_wallet/",
            "retrieved_on": 1440990262,
            "score": 147,
            "secure_media_embed": {},
            "selftext": "Hi guys,\n\nI used to suffer very badly with anxiety, but fortunately am doing a lot better these days and have learned a lot from what I went through.  I know that the cost of different treatments can be a big worry, so I thought I'd put together a post that outlines some helpful methods I learned that are either totally free or cost very little.\n\nI'd urge any of you suffering with anxiety and panic attacks to see your doctor first, it's really important to get proper help and guidance. The post I'm writing here is only meant to be used alongside what proper medical treatment you're getting. \n\nThe new year is a great time to take up some new practices in our lives, so I thought that today would be a good time to post :) \n\n***\n\n**Cognitive Behavioural Therapy** - Often anxiety is driven by our own thoughts and the way that we worry about things. CBT will help you get a handle on this and learn to change unhealthy thought patterns. There's a free website called [Mood Gym](https://moodgym.anu.edu.au/welcome) that will teach you the principles of CBT for free. CBT takes hard and persistent work, but it's a powerful tool for recovery. \n\nI would highly recommend going to a CBT therapist if you can afford it. Remember that therapists will work with what you can pay, you can space out sessions as little or often as you can afford. In some countries you can be referred to free CBT by your doctor, check it out.  \n\n**Meditation** - When we're stressed or anxious a lot, it's the sympathetic nervous system (SNS) that is often engaged. This keeps us on edge and feeling anxious. To combat it we need to engage the parasympathetic nervous system (PSN) which will calm us down and help us deal with stress/anxiety better.  Meditation has been shown to do just this, even just ten minutes a day is enough to make measurable changes on both mental and physical health. It is wonderful for anxiety.  \n\nThere are a lot of websites and videos on YouTube that will teach you to meditate for free. I recommend starting with a very simple meditation on the breath. \n\nIf you're a member of your local library then you might find this book helpful: [Soul-Centered](http://www.amazon.com/Soul-Centered-Transform-Your-Weeks-Meditation/dp/1401935869/ref=asap_bc?ie=UTF8) by Sarah McClean. But there are loads of books out there, often available second hand on Amazon.\n\nGuided meditations, where someone talks you into a very relaxed state, can be a good place to start if you find it hard to sit in silence (I found this really hard when my anxiety was bad). Again, there are loads of lovely guided meditations for free on YouTube, I love [The Honest Guys'](https://www.youtube.com/user/TheHonestGuys) channel :)\n\n**Emotional Freedom Technique** - A few years ago a therapist thought me this odd tapping technique called EFT. It's very effective for cutting off panic attacks, and actually I haven't had a full blown one in the several years since I learned it.  There are plenty of YouTube videos that will teach it to you for free. It's a strange one, but very helpful. \n\n**Mindfulness** - Mindfulness has been growing in popularity over the last few years, and for very good reason. Like meditation, it will help you to handle stress better.  It teaches you to stay in the moment and pay attention to the present instead of allowing your mind to run away with worries.  It's kind of similar to CBT in that way.  \n\nThere's lots of free information online about mindfulness, and plenty of YouTube and TED videos about it.  Have a look around on YouTube, there are lots of interesting talks about it that you might find interesting.  \n\nIf you'd like a book on the topic, I'd recommend [Mindfulness](http://www.amazon.com/Mindfulness-Eight-Week-Finding-Peace-Frantic/dp/1609618955/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1420147376&amp;sr=1-1&amp;keywords=mindfulness) which explains the research behind it as well as how you can start practising it. \n\n**Exercise** - Exercise is important because it raises levels of hormones in your body that will boost your mood and help you deal with stress better.  It's also very hard to be anxious when you're focused on your body and breath, honestly it gives such a welcome break from worrying. Running/jogging/walking/cycling is free, frisbee is cheap and fun, swimming is great for your whole body - there are so many options that won't cost you much. Aim for 20 minutes exercise every second/third day. \n\nYoga in particular is wonderful for anxiety, it will teach you to focus on your body and breath and help calm your mind. There are lots of videos that will teach you the basics of yoga for free on YouTube, but if you can afford it I'd recommend joining a class once a week as it really is such a treat for your body and mind. \n\n**Breathing exercises** - These work in a similar way to meditation, they engage the PNS and help your mind to slow down and relax.  I used to do them at my desk at work, or on the tram to work, when I was feeling particularly anxious.  I still use them when I'm feeling overwhelmed with any emotion, like when I get angry.  They're very subtle, no one will notice you doing them so you can practice anywhere when you feel the need.  \n\nThere's lots of info for free online, but here is a very simple one: breathe in for 7 counts, hold your breath for 2 counts, then breathe out for 11 counts, repeat for 4/5 minutes. Please note that these don't need to be deep or prolonged counts, just gentle and regular breathing.  If you find it makes you dizzy then you're probably breathing too deeply or doing it for too long, so simply stop and try again another time.  If you practice regularly you will notice that you feel calmer.  \n\n**Diet** - It's important that you eat well and eat regularly if you're struggling with mental health issues.  Skipping meals can cause drops in blood sugar that can feel similar to panic attacks, anxiety and even depression, so please never skip meals and especially breakfast.  Caffeine, sugar and other stimulants will make you feel on edge, so they're best kept to a minimum or avoided completely.  Foods that are rich in B vitamins and magnesium can be soothing to the nervous system.  Drink plenty of water, dehydration can make you feel worse.  Alcohol can heighten anxiety, especially the morning after when your blood sugar will be low and you'll be dehydrated, so keep it to a minimum. \n\n**Sleep** - Bad sleep makes everything seem worse and can make you feel even more stressed, so it's really important to sleep well.  If you're having trouble sleeping then do some googling with the term \"sleep hygiene\" for some advice on what might help.  If you find it hard to switch off your worries when you go to bed at night then a guided meditation will help because it forces you to listen to the meditation and relax.  \n\n**Mood boosting** - Raising your basic levels of mood boosting hormones is really important.  This is a nice one because it basically means being good to yourself, kind to yourself and giving yourself permission to indulge in the things that make you feel good.  So many of us feel guilty about taking time to ourselves, especially if we have families, busy jobs, or people in our lives who need to be cared for - but honestly, it's essential for good mental health, and learning to make yourself happy will help you more than you can imagine.  Consider it an investment in your health, and make time for yourself. \n\nGive yourself time every day to do something nice for yourself.  Go for a walk in your favourite park, read a new book, watch a movie or tv show that makes you laugh (laughter raises levels of endorphins in the body, it's a great tool!), spend time with your favourite people, have a bubble bath, play with your pet (very therapeutic!), take up a new hobby, listen to music that lifts your mood (also good for mental health), learn to cook your favourite food.  Basically do anything and everything that makes you smile and feel good.  If you don't have many ideas then it can be a wonderful journey of discovery, learning what ways to make yourself happy.  Doing nice things for the people that you care about will also boost your mood, it's a great way to let go of worries for a while and build bonds with others.  \n\n**Journalling** - Another free way to help yourself.  Journalling is very cathartic, it helps you to get worries out on the page and let them go, it can help far more than you think.  Write a page or two every morning or evening, let all your worries out, then close your notebook and don't look over what you've written for at least six months.  \n\n**Gratitude journal** - Research has shown that a regular gratitude practice can improve mood and even relationships, it's a lovely way to be reminded of the good things we have in our lives despite the worries that weigh us down.  Keep a simple gratitude journal that where you jot down three things a day that you are grateful for.  It can be something simple such as the colour of the sky, it can be anything that you appreciate in your life at that very moment.  \n\n**Anxiety research** - learning about anxiety, how it works, what drives it and what we can do about it is an empowering thing to do.  There is so much information out there online for free, have a look around and you'll find even more tips and tricks that work.  \n\n***\n\nThis has been a huge post, but please don't feel overwhelmed.  Pick one or two things that appeal to you and give them a try.  Figure out what works for you.  I firmly believe that learning to be good to ourselves, understanding how mental health works and carving a lifestyle that supports and boosts good mental health is a great basis for recovery.    \n\nHappy new year everyone, I really hope that some of you find this helpful.  If you have any tips of your own please add them! Take care :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Methods to help anxiety that won't hurt your wallet",
            "url": "http://www.reddit.com/r/Anxiety/comments/2r1d03/methods_to_help_anxiety_that_wont_hurt_your_wallet/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420115819,
            "domain": "spacebeard.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r056h/an_antianxiety_music_playlist_i_put_together/",
            "gilded": 0,
            "id": "2r056h",
            "is_self": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r056h/an_antianxiety_music_playlist_i_put_together/",
            "retrieved_on": 1440990891,
            "score": 95,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/sGFevTdH-cqwIPu3brviaUKCJ9GnVjadbi-2CEgMY4Y.jpg",
            "title": "An Anti-anxiety music playlist I put together, compiled of songs that make me feel better when I need it. A little varied, so you might find what suits you",
            "url": "http://spacebeard.tumblr.com/post/106791318580/playlist-for-the-anxious-mind"
        },
        {
            "author": "SaxonWitch",
            "author_created_utc": 1343648961,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8i0mx",
            "created_utc": 1420199548,
            "domain": "self.Anxiety",
            "edited": 1420199747,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r3eeh/fed_up_with_being_told_that_i_can_fight_my_anxiety/",
            "gilded": 0,
            "id": "2r3eeh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r3eeh/fed_up_with_being_told_that_i_can_fight_my_anxiety/",
            "retrieved_on": 1440989311,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "Hello, Sorry but this is going to be long!\n\nI have been suffering from anxiety since I can think. Which makes it around 45 years. In this time I suffered from Panic attacks, OCD, Hypochondria and everything in between.\n\nWhen I was a kid, nobody really knew what was wrong with me [Germany, 70's, anxiety wasn't really a thing]. However I read everything I could to find a reason for my 'madness'.\n\nAs I grew older, I understood that it was actually a mental illness. I then studied Neuroscience literally because I thought that if I knew how the brain works, it could help me.\nWhat I learned was that anxiety doesn't equal anxiety.\n\nSome people have short term anxiety after a trauma for example, others have phobias [thought disorder] and then some have actually physically too many/little ion channels in their brains producing either too little [depression] or too much serotonin [anxiety].\n\nStrangely enough, just knowing this made me feel easier [not less fearful].\nThe only thing that has ever worked was medication [SSRI] that keep my serotonin amount on a  more or less 'normal' level.\nIt makes sense.\n\nYet, having taken them for so long, the body probably just compensates and gets used to it. The anxiety is still there [albeit much less compared to before].\n\nNow to my gripe. \n\nWherever I go [GP, Therapist etc], everyone tells me the same thing. That I should breathe a certain way and the anxiety will go, that my thinking is wrong and if I could just change it, my anxiety will go, that if I rationalise my fears and make lists, it will go, that if I become more 'mindful', my synapses will grow a different way and my anxiety will gradually become less...[lol, synapses are not ion channels and have nothing to do with the production of serotonin, but hey].\n\nBeing told all these things was brilliant at first. Most I had heard of already, other things were new and worth a try.\nOnly that most things are just plasters, covering up a symptom but do nothing about the actual origin [apart from SSRIs].\n\nI am meditating and I watch my breathing and my muscle tension, I do things slowly now and try hard to reschedule my worries [not much luck]. Apart from that, most else is useless to me.\n\nWhy? Because of a great variety of things, from certain beliefs [not religious but still have beliefs about life] to the way my life just is; I am an individual and not a thing where a certain formula WILL work on.\n\nAlso because I have a funny brain, all the \"you must do this and that, and your anxiety will get less and less\" has now caught me like an extra worry. [Be careful who you ask to do what].\nSimilar to anorexic people, my mind is preoccupied with rules about how to stop my anxiety.\nAlmost every second I feel obsessed to 'watch my anxiety', everything I do goes through the 'anti anxiety check' and because I also suffer from CFS/M.E it is becoming very exhausting and frankly I wish I could just be me.\n\nJust the thought of someone telling me that it is OK to have anxiety [as I read on some blog] instantly calmed me more than all the 'do's and don'ts. I wish someone would say:\n\"YOu've had it for so long and you are still alive, just do what you can and ACCEPT who you are.\n\nInstead, especially right at this moment in time I feel like a:\n\n- Failiure:\nThere are all these fail-safe things I can do, that helped many people but it just doesn't work for me. Therefore I must be doing something wrong.\n\n\n- Idiot:\nDespite going to Uni and having a reasonably high IQ I seem to be too stupid to do what others have done so successfully. Everything I have read and tried was obviously rubbish. Therefore I must be stupid moron.\n\n\n- Guilty:\nThe only one to blame for my anxiety is myself, because others managed and if I don't, the ball is back in my hand and I am obviously not doing it right, so don't blame those that try and help you and don't blame your physical differences because the only one to blame for my anxiety is = MYSELF.\n\n\n- Stressed:\nDo this, do that, new rules for everything, because it will change my neurons and my thinking. Therefore if you don't do it all, guess who's to blame? Doing just a few things that I can manage doesn't work. Hence stress.\n\n\n- More fear:\nTelling someone that doing all of the above will CURE them [with an anxiety disorder they at best can manage but never realistically heal] has cause more anxiety [remember who you are telling these things Therapists, if we were all calm we wouldn't have a problem in the first place]. \n\n\nThis I think is the big elephant in the room.\n\nPhobias can be sorted very easily with CBT, temporary fear also. Physical anxiety...nope.\nAlso people who had it all their life should be approached differently. We are NOT NORMAL [whatever that means]. There is a reason we do what we do, because of our illness, which is very real, just as real as kidney disease or whatever.\n\nTelling us that we only 'think wrong' is patronising and preposterous. \n\nBelieving that we will do everything you tell us is also very naive.\n\nWe are not robots who only need a program and everything will be fine, we are people. Each one with a different way of life, each one with different experience in life, beliefs and behaviours that sometimes [SHOCK] stop us from doing everything exactly as Therapists tell us.\nWe are human and yes we all live different lifestyles.\n\nI will finish with something I would love to hear instead of more rules for me to follow.\nIf you suffer from Phobias, CBT is brilliant.\nIf you suffer from trauma induced anxiety, CBT and Mindfulness is really good!\nIf you suffer from OCD, depending on how long you've had it. CBT and Mindfulness can help. If it is part of a general anxiety disorder that is physical, then you should pick some good bits from CBT and Midfulness but also read up on things like Buddhism, Zen, herbal remedies etc. Broaden your knowledge, the more you know, the less scary some things become.\n\nIf you are just a fearful, nervous worrier and you have tried everything but it only works only for a short while because your brain is a crafty bastard and comes up with something completely unexpected and not covered by your 'new behaviour rules'.\n\nSod it!\nBe who you are. Say \"I am a person who has anxiety, it isn't my fault; and for who I am, I tried as best as I can. I have lived with it this long, I will live with it. It is who I am, accept it because I have. I am neither a failiure, nor a moron if I don't want to or can't follow all those rules given to me, because I am human.\"\n\nJust allowing myself to say this feels already better and has a far more calming effect than any therapy I ever went to.\n\nI know doctors and therapists are there to help us but they do have to understand that one formula does not work for everybody. \nSo stop blaming us for something we really can't change, rather help us live with it.\n\n\nTL;DR: I want to learn how to live with anxiety, rather than constantly fighting it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fed up with being told that I can 'fight' my anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2r3eeh/fed_up_with_being_told_that_i_can_fight_my_anxiety/"
        },
        {
            "author": "psiph",
            "author_created_utc": 1135486800,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_1pqk",
            "created_utc": 1420264491,
            "domain": "theonion.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r6hzb/thought_you_guys_could_use_a_little_humor_from/",
            "gilded": 0,
            "id": "2r6hzb",
            "is_self": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r6hzb/thought_you_guys_could_use_a_little_humor_from/",
            "retrieved_on": 1440987865,
            "score": 81,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/O3kZclNo1CQfbULGrHyk_KD0J3uvU-aTgexTW7macww.jpg",
            "title": "Thought you guys could use a little humor. From the Onion: \"Brief Moment Of Lucidity Called Panic Attack\"... I totally feel this way sometime :)",
            "url": "http://www.theonion.com/articles/brief-moment-of-lucidity-called-panic-attack,35473/"
        },
        {
            "author": "conorisfunsometimes",
            "author_created_utc": 1364649924,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b4le2",
            "created_utc": 1420554304,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2riknm/some_tips_i_use_when_a_panic_attack_comes_on/",
            "gilded": 0,
            "id": "2riknm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2riknm/some_tips_i_use_when_a_panic_attack_comes_on/",
            "retrieved_on": 1440982112,
            "score": 80,
            "secure_media_embed": {},
            "selftext": "When I feel a panic attack coming on I usually try doing the following things to lessen the effect:\n\n#1 - Say out loud what is happening. When I feel my heart start to beat faster and my stomach twist and turn, I say to myself (aloud if possible) 'I am having a panic attack. This too shall pass.' I repeat this as a little mantra to let my consciousness know I am aware of what's happening, and as a step to regain control.\n\n#2 - Deep breathing. Probably the most common but very effective. Deep slow breaths in and out, focusing all the time on the breathing alone. This distracts me from the thoughts and feelings of the attack and allows my mind to calm and my heart rate and breathing to normalise.\n\n#3 - Pretend I'm excited. This was advice from a really successful businessman I had the pleasure of meeting. He told me he suffers with extreme anxiety but his tip to me was 'when you feel a panic attack coming or are generally just very anxious, tell yourself you're actually excited about what's happening.' Until I tried this myself I was dubious but with practice it becomes easy to substitute the attack for false-excitement and makes it easier to deal with.\n\nLet me know if you do any of these and feel free to post some of your own tips below.\n\nStay cool.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Some tips I use when a panic attack comes on...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2riknm/some_tips_i_use_when_a_panic_attack_comes_on/"
        },
        {
            "author": "nidenikolev",
            "author_created_utc": 1414072790,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j0d6h",
            "created_utc": 1420439782,
            "domain": "soundcloud.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rdnm4/six_months_ago_i_was_diagnosed_with/",
            "gilded": 0,
            "id": "2rdnm4",
            "is_self": false,
            "media": {
                "oembed": {
                    "author_name": "Niden Kolev",
                    "author_url": "http://soundcloud.com/niden-kolev",
                    "description": "I'm just a kid who likes to explore his inner-psyche and present what I find",
                    "height": 500,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F96008829%26show_artwork%3Dtrue&amp;url=https%3A%2F%2Fsoundcloud.com%2Fniden-kolev&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000122360958-k2r1pb-t500x500.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "SoundCloud",
                    "provider_url": "http://soundcloud.com",
                    "thumbnail_height": 500,
                    "thumbnail_url": "http://i1.sndcdn.com/avatars-000122360958-k2r1pb-t500x500.jpg",
                    "thumbnail_width": 500,
                    "title": "Niden Kolev",
                    "type": "rich",
                    "version": "1.0",
                    "width": 500
                },
                "type": "soundcloud.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F96008829%26show_artwork%3Dtrue&amp;url=https%3A%2F%2Fsoundcloud.com%2Fniden-kolev&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000122360958-k2r1pb-t500x500.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 500,
                "scrolling": false,
                "width": 500
            },
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rdnm4/six_months_ago_i_was_diagnosed_with/",
            "retrieved_on": 1440984465,
            "score": 65,
            "secure_media": {
                "oembed": {
                    "author_name": "Niden Kolev",
                    "author_url": "http://soundcloud.com/niden-kolev",
                    "description": "I'm just a kid who likes to explore his inner-psyche and present what I find",
                    "height": 500,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F96008829%26show_artwork%3Dtrue&amp;url=https%3A%2F%2Fsoundcloud.com%2Fniden-kolev&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000122360958-k2r1pb-t500x500.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "SoundCloud",
                    "provider_url": "http://soundcloud.com",
                    "thumbnail_height": 500,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000122360958-k2r1pb-t500x500.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 500,
                    "title": "Niden Kolev",
                    "type": "rich",
                    "version": "1.0",
                    "width": 500
                },
                "type": "soundcloud.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fw.soundcloud.com%2Fplayer%2F%3Fvisual%3Dtrue%26url%3Dhttp%253A%252F%252Fapi.soundcloud.com%252Fusers%252F96008829%26show_artwork%3Dtrue&amp;url=https%3A%2F%2Fsoundcloud.com%2Fniden-kolev&amp;image=http%3A%2F%2Fi1.sndcdn.com%2Favatars-000122360958-k2r1pb-t500x500.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=soundcloud\" width=\"500\" height=\"500\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 500,
                "scrolling": false,
                "width": 500
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/rO52S8-rNBXXgOBgTe7lpNCbxmLj3anVZhh4VWP1F6A.jpg",
            "title": "Six months ago, I was diagnosed with psychedelic-induced PTSD; so, I've been channeling that frustration by recording/mixing an album in my bedroom. It would mean the world to me if you took a listen.",
            "url": "https://soundcloud.com/niden-kolev"
        },
        {
            "author": "MHMinecraft",
            "author_created_utc": 1419963218,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kenct",
            "created_utc": 1420051360,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qxvj3/xpost_from_rminecraft_starting_a_mental_health/",
            "gilded": 0,
            "id": "2qxvj3",
            "is_self": true,
            "media_embed": {},
            "num_comments": 50,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qxvj3/xpost_from_rminecraft_starting_a_mental_health/",
            "retrieved_on": 1440991949,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "**Who I am**\n\nI'm a 25 year old sort-of Behavioral Neuroscience student struggling with mental health issues. I am disappointed with the resources I have found locally for those issues, so I have started playing with the idea of starting an online support group of like-minded (haha!) individuals who need friends to care about and to be cared for by. \n\nI'm an emotionally in-tune person when I am not terribly devastated by my own problems and I have a history of starting projects to bring people together.\n\n**What I Want**\n\nI want to start a small community of lonely, neuroatypical people, preferably within their 20s and 30s but not a requirement, to work together and play together. I want to start with Minecraft, probably with a modpack (although if everyone prefers Vanilla we can do that as well), and a group Skype call that we can join while we play. The idea is that for those of us struggling with mental health, and especially those who cannot hold a job, we can provide comfort and a stable platform for friendship and support. And also video games.\n\nThis isn't a dating service and this isn't for hookups. I know they can and do happen, because hearts are just as crazy as we are, but please don't join to be a predator. I myself have struggled with that and I won't tolerate it in this safe place I am trying to start. Don't be evil, guys. Please.\n\n**How Do We Start?**\n\nPlease PM me your Skype or some other method of communication, along with your age and a little about what you are going through. I will add you as soon as I see the message, and we can talk a little one on one before I introduce you to the others. This can be either text or voice, whichever you prefer. If you seem like you are genuine, I will add you to the group.\n\nThe server doesn't exist yet. This is just day one. I need to see how many people would like this sort of event/place to exist, and then we can go from there.\n\nThanks for reading!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[xpost from /r/Minecraft] Starting a mental health community using Minecraft as video game therapy.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qxvj3/xpost_from_rminecraft_starting_a_mental_health/"
        },
        {
            "author": "thescariestroom",
            "author_created_utc": 1404899667,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hbloh",
            "created_utc": 1420376998,
            "domain": "self.Anxiety",
            "edited": 1420643619,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2raqb4/anxiety_preventing_me_from_telling_anyone_how_bad/",
            "gilded": 0,
            "id": "2raqb4",
            "is_self": true,
            "media_embed": {},
            "num_comments": 12,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2raqb4/anxiety_preventing_me_from_telling_anyone_how_bad/",
            "retrieved_on": 1440985831,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "Basically, I've had social anxiety for years, (which has resulted in little to no close friends) and more recently just anxiety in general about everything, and all I've ever wanted is just to tell someone absolutely everything. I have several problems though.\n\nWhen a rare opportunity to tell someone anything comes around I get stage fright, for want of a better phrase and my mind goes blank and I can't even make any intelligent sound. Really just what happens whenever I try and do any kind of public speaking. Then people forget I was ever trying to tell them anything.\n\nI don't want to have to go to the doctors, especially if they try were to try and put me on any weird drugs. \n\nI'm scared of people seeing me not strong. I've managed to appear strong my whole life. I can't even remember the last time I properly cried in front of someone. I just don't want anyone to be worried about me.\n\nI don't want everything to become about anxiety. I hate when people ask me if I'm ok and if people know about mental illness they greet you with a sympathetic 'hello, how are you doing today' and accompanying head tilt and saccharine smile.\n\nEDIT: Thanks for the responses, they've given me a little boost. It's nice knowing I'm not alone apart from anything else.\n\nI want to beat this and develop brilliant friendships with a group of people I've recently met but I am so scared I'm gonna leave it too late and everyone will just forget about me.\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety preventing me from telling anyone how bad my anxiety is",
            "url": "http://www.reddit.com/r/Anxiety/comments/2raqb4/anxiety_preventing_me_from_telling_anyone_how_bad/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420086137,
            "domain": "self.Anxiety",
            "edited": 1420086734,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qzdcy/ok_this_shit_is_ruining_my_fucking_life/",
            "gilded": 0,
            "id": "2qzdcy",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qzdcy/ok_this_shit_is_ruining_my_fucking_life/",
            "retrieved_on": 1440991251,
            "score": 60,
            "secure_media_embed": {},
            "selftext": "Now this shit has fucking plagued me my entire life. When I was around 9 or 10 I remember having my first \"episode\", an anxiety/panic attack. I was done taking a shit, got up to wipe my ass and collapsed on the floor. I sat there for a good 10 minutes or so, trying so desperately to call for my mom, or sister, brother, father, whoever was there, but I couldn't talk, the words just were not coming out of my mouth. I tried to, but it wasn't happening. I laid there on the bathroom floor with a shitty ass, trying to keep myself from blacking out.\n\nSo After 3 years of drug addiction and alcohol problems I managed to stay somewhat clean for a month and got a job as a taxi driver. \n\nIt was OK for the first 2 days, not a bad job at all, if you work enough hours you can make a lot of money, and I did, over about a 4 or 5 day period.\n\nThe third day, I started having a lot of chest pain and anxiety. But I kept moving forward, I needed the money. Later that night I had a fare that was a nightmare. I had to pull over and take a breather/walk around while (from what I've read about anxiety and panic attacks, your body goes into basic fight or flight mode, and I fucking flew, had to get out of the car.) they were still in the back of the fucking cab. Unprofessional. I thought I was going to pass out on the interstate. It was absolutely fucking terrible. Terrifying. I got lost too, it was absolutely humiliating.\n\nAfter this I started having even more sever anxiety/panic attacks for the next few days\n\nLong story short, I couldn't pay the taxi lease on the first week. Well, I could, but chose to go to the DR instead, with all that money I had earned. It ended up costing me around $200. \n\nAnd then I quit. \n\nAnd now my siblings/parents look down on me like they always have. I'm the oldest of 3, 1 parent. I'm fucking 29 and have worked since I was 16. I've worked every job you can think of between IT and construction, from landscaping to..whatever....I've never went longer than a few months with out SOME kind of work/income.\n\nBut this shit is ruining my life. Looking back now, every job I've ever had, I've either quit or gotten fired because of this shit. These attacks should not be fucking happening. both of my eyes twitch all day long. I am sick and fucking tired of it. \n\nThe stupidest shit - like driving a car in heavy traffic - trigger attacks. Bad ones. I'm talking near the point of passing out. It's absolutely crippling. Sometimes when I think too long about having an attack, I have an attack, and while I'm having that attack, my brain is telling me that I'm going to die. And I'm convinced at that point. **I wouldn't wish this on my worst enemy**\n\nI don't know what to do anymore. This shit is ruining my life. What the fuck is wrong with me? I take benzos - they help - but I don't want to rely on them the rest of my life. \n\nNow I have no money. It's new years eve and I'm back to drinking alone. \n\nI'm just fucking lost. \n\n*sorry for this post being all over the place and not properly formatted",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "OK, this shit is ruining my fucking life.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qzdcy/ok_this_shit_is_ruining_my_fucking_life/"
        },
        {
            "author": "babsa90",
            "author_created_utc": 1386650089,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ea4oj",
            "created_utc": 1420608723,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rlmmd/i_only_feel_like_myself_when_under_the_influence/",
            "gilded": 0,
            "id": "2rlmmd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rlmmd/i_only_feel_like_myself_when_under_the_influence/",
            "retrieved_on": 1440980687,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "I feel like a robot trying to pass off as human 24/7. I feel so fucking boring all the time. I feel so free and happy when i am buzzed. I feel like this is what it must feel like to not be plagued by social anxiety. Even drinking by myself feels so free and liberating. I don't drink very often, nor am i dependent on it. It's just a very nice switch up from the normal monotony. It's nice to be gregarious and move throughout conversation with ease. I love hearing people tell me how much fun I was the night before - I am never paid such a compliment otherwise. I can't imagine ever feeling like this all the time... I would be so fucking happy...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I only feel like myself when under the influence of alcohol",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rlmmd/i_only_feel_like_myself_when_under_the_influence/"
        },
        {
            "author": "andrew_who",
            "author_created_utc": 1350023391,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9a35y",
            "created_utc": 1420636046,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rmi99/i_cant_ask_for_help_with_my_anxiety_because_i_am/",
            "gilded": 0,
            "id": "2rmi99",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rmi99/i_cant_ask_for_help_with_my_anxiety_because_i_am/",
            "retrieved_on": 1440980276,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "Every time i go to setup a doctors appointment or even post on this sub it literally feels like my blood turns to mud and everything is becomes too difficult and I feel like when I try to combat my anxiety I lose my ability to get through the days without a breakdown. \n\nSo with my heart racing I am going to just hit submit, get over it and then go to work and come home and look up a doctor and make an appointment. \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I cant ask for help with my anxiety because I am too anxious.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rmi99/i_cant_ask_for_help_with_my_anxiety_because_i_am/"
        },
        {
            "author": "strangeloops3",
            "author_created_utc": 1395024484,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fq921",
            "created_utc": 1420413252,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rcdn9/anxietydissociation_worse_in_late_afternoondusk/",
            "gilded": 0,
            "id": "2rcdn9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rcdn9/anxietydissociation_worse_in_late_afternoondusk/",
            "retrieved_on": 1440985062,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "I've been noticing for awhile that I tend to dissociate and get anxious more often during the late afternoon when the sun is beginning to set.  Then when it's completely dark, I usually feel totally fine again, even on really bad days.\n\nI've been trying to figure out what this is a result of.  I don't remember any particular negative associations with dusk.  I was thinking maybe it's something about the quality of light that makes me dissociate more, and it in turn causes anxiety? \n\n Does anyone else experience this? \n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety/dissociation worse in late afternoon/dusk? What is this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rcdn9/anxietydissociation_worse_in_late_afternoondusk/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420071833,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qyuor/happy_new_year/",
            "gilded": 0,
            "id": "2qyuor",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qyuor/happy_new_year/",
            "retrieved_on": 1440991493,
            "score": 51,
            "secure_media_embed": {},
            "selftext": "To all of you fighting anxiety, whatever country you're in, and whatever language you speak I'd like to extend a new years wish; that this is the year you finally beat anxiety.\n\nHere's to 2015, I hope it's a good year for you all.\n\nLove from England\nKT",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Happy New Year!",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qyuor/happy_new_year/"
        },
        {
            "author": "electrical_outlet",
            "author_created_utc": 1313450895,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5o9p5",
            "created_utc": 1420494746,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rfzcp/does_anyone_else_feel_like_their_generalized/",
            "gilded": 0,
            "id": "2rfzcp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rfzcp/does_anyone_else_feel_like_their_generalized/",
            "retrieved_on": 1440983380,
            "score": 47,
            "secure_media_embed": {},
            "selftext": "Like I feel like if I sit and think about it long enough I'll have a lightbulb moment and think \"Of course! That's what I'm anxious about.\", and then I can deal with it. \n\nIt's a nice thought. Currently I'm anxious over seemingly nothing at all. I just feel like there's gotta be something bothering me on a subconscious level that I just need to recognize so I can tackle it. Somehow. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel like their generalized anxiety is actually stemming from something that you're just unable to put your finger on? Some sort of subconscious worry?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rfzcp/does_anyone_else_feel_like_their_generalized/"
        },
        {
            "author": "goldenspiderduck",
            "author_created_utc": 1350497747,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9bzl2",
            "created_utc": 1420654069,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rnebs/does_anyone_avoid_getting_too_close_to_people_due/",
            "gilded": 0,
            "id": "2rnebs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rnebs/does_anyone_avoid_getting_too_close_to_people_due/",
            "retrieved_on": 1440979861,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I have a hard time getting really close to people (\"best\" friends, close relationships, family) for fear of losing them.  I'm easy at making friends and have lots of general acquaintances, but also keep people I should (and would like to) be closer to at that distance as well and I feel like I'm missing out on an important part of life.\n\nMy dad died when I was young (14) which is the source of a lot/all of my anxiety around death.  I have been treated for generalized anxiety including panic attacks, but now that I'm a bit older that's all under control without medication.  \n\nAnyway, my question is, for those of you who have the same sort of anxiety, how have you all pushed through that?  I don't want my coping strategy for anxiety to be avoiding the source of it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone avoid getting too close to people due to anxiety about losing them?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rnebs/does_anyone_avoid_getting_too_close_to_people_due/"
        },
        {
            "author": "ooga34",
            "author_created_utc": 1418758268,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_k2v28",
            "created_utc": 1420430130,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rd7qs/thank_you/",
            "gilded": 0,
            "id": "2rd7qs",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rd7qs/thank_you/",
            "retrieved_on": 1440984672,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "(Sorry if I did something wrong with this post. This is my first post on reddit!)\n\nI know that this probably isn't the sort of thing that's usually posted here, but I just felt like I had to say something. I've been struggling with anxiety for years now and I've seen many professionals about it but this subreddit is by far the place where I've felt the most accepted. I only read a couple of posts before I started crying simply because I finally felt like there was someone else out there who understood. So yeah, I just really want to say thank you to everybody here for making my day better!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thank You",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rd7qs/thank_you/"
        },
        {
            "author": "kmh0394",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420513647,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rh293/a_new_method_to_calming_myself_down_when_i_get/",
            "gilded": 0,
            "id": "2rh293",
            "is_self": true,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rh293/a_new_method_to_calming_myself_down_when_i_get/",
            "retrieved_on": 1440982817,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "I found this out last week and its been helping me a lot. So when I get super frustrated and I have a million anxious thoughts and I can't control myself, I make a mess. It can really be any mess but I usually use my bedside table. I sprawl out all the things I use day to day: bobby pins, remotes, cups, medicine, etc etc. \n\nThen, after the mess is made and I'm like 10% more anxious, I start organizing things and associating them with my thoughts. The smaller things like the bobby pins I see as the little nagging thoughts that come up every now and then, like \"are you sure you turned that file in to your boss?\" And I use the big things like remotes and cups as my biggest worries. \n\nI organize the objects (metaphorically, my thoughts) by use and then take them away because I don't need bobby pins on my nightstand or half the things I originally put on there. \n\nBy the end I'm left with usually remotes (the big things) but by then, they seem so small compared to when I first made the mess that it puts my thoughts in perspective and makes everything seem just that much less heavy on my mind. \n\nThis works really really well for me, I hope it can help somebody else out there. \n\nTLDR; I make a mess, attribute the big items in descending order relative to my thoughts (big item=what I'm most worried over), I organize, I get rid of the things the I don't need, I'm left with a clean area and a realistic perspective on how important those \"big worries\" are and can then clearly process them.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A new method to calming myself down when I get flustered",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rh293/a_new_method_to_calming_myself_down_when_i_get/"
        },
        {
            "author": "news_flesh",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420156314,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r1rto/is_anyone_else_scared_to_go_to_a_psychiatrist/",
            "gilded": 0,
            "id": "2r1rto",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r1rto/is_anyone_else_scared_to_go_to_a_psychiatrist/",
            "retrieved_on": 1440990069,
            "score": 38,
            "secure_media_embed": {},
            "selftext": "Basically, I'm afraid that I don't have any sort of anxiety disorder and...I'm just making a big deal out of nothing, I guess? Like, there's no medical basis for why I feel like this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is anyone else scared to go to a psychiatrist because they might not diagnose you with anything?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2r1rto/is_anyone_else_scared_to_go_to_a_psychiatrist/"
        },
        {
            "author": "dangerzone14",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420132384,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r0mu5/obsessively_trying_to_remember_conversations/",
            "gilded": 0,
            "id": "2r0mu5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r0mu5/obsessively_trying_to_remember_conversations/",
            "retrieved_on": 1440990663,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "Anyone else get like this? I had a really good night out last night for NYE but for some reason I am spending the whole day obsessively trying to remember all of the conversations I had last night. I've no idea why, but I guess it's curiousity as to what I was talking about with different people or maybe a bit of OCD.\n\nThing is, i'm never gonna remember with all of the drink I consumed. I just sometimes find it mad how you can be having drinks with friends for four hours and not remember much of what was said, despite it being a fun night.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Obsessively trying to remember conversations after nights out?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2r0mu5/obsessively_trying_to_remember_conversations/"
        },
        {
            "author": "jiggysuave",
            "author_created_utc": 1386912198,
            "author_flair_css_class": "",
            "author_flair_text": "I am worthy of love and respect",
            "author_fullname": "t2_ec3ec",
            "created_utc": 1420600600,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rl7vm/i_do_good_things_i_deserve_presence_and_opinions/",
            "gilded": 0,
            "id": "2rl7vm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rl7vm/i_do_good_things_i_deserve_presence_and_opinions/",
            "retrieved_on": 1440980877,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "Lately, my anxiety has been taking a toll on my self-esteem. I am afraid of expressing myself or sharing my opinions for fear of other people disapproving or not liking me. I have also been extremely hard on myself lately. Everything I do is inadequate in my mind or I think it doesn't live up to someone's expectations, and I am an absolute wreck if I actually mess up or make a mistake or bad choice. I have been watching myself shrink in an effort to cause less harm and be less of an inconvenience to to other people. This is not fair. I know that people like me and respect me, but for some reason a part of me keeps telling me that is not true. \n\nMy new year's resolution this year is to meditate everyday. So far I have been sticking to just breathing, but tonight I decided to add a mantra: \"I do good things. I deserve presence and opinions.\" Tonight I repeated over and over again the words that I so desperately want to believe. That I deserve to take up space, that I make positive contributions to the lives of the people around me, and that people are interested in the things I have to say. \n\nIt is now a few minutes after I stopped the mediation, and I can feel the negative self-talk and anxiety creeping back. But for a little while, I genuinely felt like I mattered more than I have in a long time. I am hopeful that 2015 will be a better year and I can't wait to meditate again in the morning. Let's just hope I can fall asleep while I'm still feeling relatively good about myself!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I do good things. I deserve presence and opinions.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2rl7vm/i_do_good_things_i_deserve_presence_and_opinions/"
        },
        {
            "author": "billyrubin25",
            "author_created_utc": 1398888777,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gdh7v",
            "created_utc": 1420581406,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2rk4kl/what_is_the_craziest_thing_your_anxiety_has_made/",
            "gilded": 0,
            "id": "2rk4kl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 49,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2rk4kl/what_is_the_craziest_thing_your_anxiety_has_made/",
            "retrieved_on": 1443168124,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I've done some pretty bizarre things when I was anxious. One time, I came home to find that my housemates were having a small party with their friends. I could have gone in the front door and joined them like a normal person, but that would have involved a small amount of social awkwardness, so instead I decided the best option was to go around back, jump over the wall into my garden and climb into my bedroom through the window. It was only afterwards that I realised that if a neighbour had seen me they probably would have called the police and I would have had to answer some difficult questions.\n\nSo tell me a story of when your anxiety made you act in a crazy or stupid way.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "What is the craziest thing your anxiety has made you do?",
            "url": "https://www.reddit.com/r/Anxiety/comments/2rk4kl/what_is_the_craziest_thing_your_anxiety_has_made/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420250498,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2r5unw/im_really_anxious_about_going_back_to_school/",
            "gilded": 0,
            "id": "2r5unw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2r5unw/im_really_anxious_about_going_back_to_school/",
            "retrieved_on": 1440988166,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I'm Freshman and 15 years old. For the past two weeks, I was on Winter Break. Now that school's starting again this Monday, I feel really anxious going back. It's difficult for me to manage the homework load I get. I'm a good student and I get very high marks, but it feels so stressful playing at this level.\nI don't have any troubles with social situations. But I can't stand school work.\nCan someone give me advice/words of wisdom/motivation for starting school again? Thanks a lot!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I'm really anxious about going back to school. Motivation?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2r5unw/im_really_anxious_about_going_back_to_school/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1420090180,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2qzibg/dae_have_enhanced_anxiety_when_theyre_sick/",
            "gilded": 0,
            "id": "2qzibg",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2qzibg/dae_have_enhanced_anxiety_when_theyre_sick/",
            "retrieved_on": 1440991187,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I think I either have a bad cold or the flu (achy, slight fever), and my anxiety is in hyper drive. I'm convinced I'm going to develop some horrible complication and die. For example: I had a bit of a sore neck today, and instead of my first thought being, \"I've been propping my neck up laying in bed for hours and it's sore,\" it was, \"I'm definitely getting meningitis and should go to the hospital ASAP.\"\n\nDoes anyone else think like me when they're not feeling well? Does anyone have any tips to break this type of thinking? I feel like a total wuss. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "DAE have enhanced anxiety when they're sick?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2qzibg/dae_have_enhanced_anxiety_when_theyre_sick/"
        }
    ]
}