{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421841812,
            "domain": "self.Anxiety",
            "edited": 1421991834,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t5vy1/selfie_thread_selfie_thread/",
            "gilded": 1,
            "id": "2t5vy1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 975,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t5vy1/selfie_thread_selfie_thread/",
            "retrieved_on": 1440954076,
            "score": 212,
            "secure_media_embed": {},
            "selftext": "Share your beautiful faces \n\n\nI will start  http://i.imgur.com/Ec9p70o.jpg\n\n\nEdit1: i love seeing what everyone looks like. Thanks for the response \n\n\nEdit 2 : order the comments so the new ones show up first. Spread the  love. \n\nEdit 3 : thanks to the kind stranger who gave me a gold.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Selfie thread? Selfie thread",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t5vy1/selfie_thread_selfie_thread/"
        },
        {
            "author": "beautifulmelody",
            "author_created_utc": 1413811242,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iyfij",
            "created_utc": 1421383564,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2slj8b/is_anyone_else_terrified_of_making_a_phone_call/",
            "gilded": 0,
            "id": "2slj8b",
            "is_self": true,
            "media_embed": {},
            "num_comments": 53,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2slj8b/is_anyone_else_terrified_of_making_a_phone_call/",
            "retrieved_on": 1440963692,
            "score": 199,
            "secure_media_embed": {},
            "selftext": "I used to be terrified of making phone calls or talking on the phone and then it got better for a couple of years. Now my fear is back and worse than ever. I can't even talk to my dad on the phone! I just freeze up and get silent. I'm usually okay in person so I don't know what it is about the phone that gives me such bad anxiety. Is this just a me thing or does anyone else deal with this also?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is anyone else terrified of making a phone call?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2slj8b/is_anyone_else_terrified_of_making_a_phone_call/"
        },
        {
            "author": "riccarjo",
            "author_created_utc": 1309282113,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5fudo",
            "created_utc": 1421517629,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sr176/does_anyone_else_have_time_anxiety/",
            "gilded": 0,
            "id": "2sr176",
            "is_self": true,
            "media_embed": {},
            "num_comments": 72,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sr176/does_anyone_else_have_time_anxiety/",
            "retrieved_on": 1440961067,
            "score": 134,
            "secure_media_embed": {},
            "selftext": "I've had anxiety my entire life, it used to be half social, half anxiety about life.  However as I've gotten older, I have no social anxiety anymore, but I would still have this nagging anxiety about every aspect of my life.  Even being shut inside didn't do much for me, the only way to get away from it was to keep myself busy with either video games or alcohol, or what have you.\n\nA few months ago, however, I stumbled upon [this article](http://www.psychologytoday.com/blog/happiness-in-world/201308/time-anxiety) and I started to cry because I realized what exactly my anxiety was about.\n\nI'm so fucking afraid of wasting my life.  In my college years I would take 6 classes (18 credits), I was the Leadership chair of my fraternity, started my own honor society, got my senior thesis published, moved to D.C. for a semester, had 5 internships, and a bunch of other things.\n\nI say this not to brag, but to show you that even while doing all those things, I still felt \"You can be doing more!  You suck!  Why aren't you making more money?  Why don't you have a 4.0?  You're wasting your time!\"\n\nThe only downtime I had would be filled with playing video games, it's all i looked forward to.  I would have a rare day off, and for weeks would just look forward to it so I can sit on my couch and try to keep up with all my video games or to listen to music, or just fucking relax.  Yet the next day I had almost a hang over.  I felt worthless, I had horrible anxiety, I literally felt like I was sick because I had taken a day off.\n\n\nPart of the reason I feel like this is because my parents weren't very ambitious people, they worked the same 40k salary jobs for 35+ years, then my dad got laid off about 8 years ago.  We've almost lost our house a few times, I've skipped birthdays, etc.  It's sucked, and I'm just deathly afraid of being like that.\n\n\nI don't even know why I'm writing anymore, I could write a fucking book about how I feel, but I just want to know if anyone else has this type of anxiety, of just wasting opportunity, of doing one thing but wondering \"Would I be better off doing something else?\" it's gotten to the point where I can't even listen to a song, without wondering if I'd enjoy another song.\n\n**TL;DR:** Does anyone else have a hard time enjoying things because they think they'd be better off doing something more \"meaningful\"?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else have \"Time Anxiety\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sr176/does_anyone_else_have_time_anxiety/"
        },
        {
            "author": "quebecblue",
            "author_created_utc": 1417633077,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_js1q0",
            "created_utc": 1421344379,
            "domain": "self.Anxiety",
            "edited": 1421438170,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sja97/anyone_with_anxiety_have_trouble_accepting_love/",
            "gilded": 0,
            "id": "2sja97",
            "is_self": true,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sja97/anyone_with_anxiety_have_trouble_accepting_love/",
            "retrieved_on": 1440964742,
            "score": 128,
            "secure_media_embed": {},
            "selftext": "I haven't discussed this with my therapist yet, because I feel pretty dumb about it, but I've been dating my boyfriend for almost a year now, and I still have days where I wake up (sometimes at his apartment!), and in the first few hours of my day, I have these intrusive, negative, anxious thoughts like:\n\n\"He doesn't really love me, he'll realize it because I _____ (did something or said something dumb)\"\n\"What's the point of a relationship? One of us will inevitably get bored one day, or our feelings will disappear.\"\n\"I don't do enough for him, I'm so selfish and I don't deserve him.\"\n\nHe is a wonderful, caring, passionate guy, and for Christmas this year, while I was visiting my family, he built me a new bed and bought all the trimmings for me. (He also spent the week over Christmas with me and my family.) When I came home, he had put everything together and had written me a long poem about us. I want to cry sometimes, thinking about how wonderful he is to me. I love him very much.\n\nDo you ever feel like your anxiety makes you high-maintenance in relationships, or clouds the truth? I feel like I'm always fighting with myself internally to say, \"I'm not perfect but that doesn't mean he doesn't love me.\"\n\nDoes anyone have advice on calming down and not being in a shame spiral where you're constantly having to convince yourself that everything is fine?\n\nEdit: WOAH this kind of blew up. I feel better now that I know other folks struggle with similar feelings...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "anyone with anxiety have trouble accepting love?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sja97/anyone_with_anxiety_have_trouble_accepting_love/"
        },
        {
            "author": "HashtagNotJewish",
            "author_created_utc": 1421118122,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_koinp",
            "created_utc": 1421557804,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2st0ea/weighted_blankets_the_best_things_ever/",
            "gilded": 0,
            "id": "2st0ea",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2st0ea/weighted_blankets_the_best_things_ever/",
            "retrieved_on": 1440960144,
            "score": 122,
            "secure_media_embed": {},
            "selftext": "I found out about weighted blankets last year after battling depression-fueled insomnia. My mom made me one for Christmas 2013, and since then, I can count my restless nights on one hand. It's so comforting for a person with anxiety (or me, at least)- it's like a full-body hug at night, and when I've had a particularly rough day at work, I wrap it around myself, and it alleviates at least some of my agitation immediately. The only drawback is that they can be a bit expensive, but very very worth it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Weighted Blankets: the best things ever",
            "url": "http://www.reddit.com/r/Anxiety/comments/2st0ea/weighted_blankets_the_best_things_ever/"
        },
        {
            "author": "BruhMan_",
            "author_created_utc": 1416398898,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jg4e8",
            "created_utc": 1421754833,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t1k6r/how_many_of_you_suffer_from_palpitations/",
            "gilded": 0,
            "id": "2t1k6r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t1k6r/how_many_of_you_suffer_from_palpitations/",
            "retrieved_on": 1440956096,
            "score": 113,
            "secure_media_embed": {},
            "selftext": "Anyone else extremely aware of their heart beat? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How many of you suffer from palpitations?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t1k6r/how_many_of_you_suffer_from_palpitations/"
        },
        {
            "author": "safferoonicle",
            "author_created_utc": 1398380635,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gag3a",
            "created_utc": 1421696758,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sytqe/anyone_else_get_disturbingintrusive_thoughts_that/",
            "gilded": 0,
            "id": "2sytqe",
            "is_self": true,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sytqe/anyone_else_get_disturbingintrusive_thoughts_that/",
            "retrieved_on": 1440957372,
            "score": 106,
            "secure_media_embed": {},
            "selftext": "Hello everyone. I've suffered from anxiety, emetophobia and depression for around 4 years now. It's snowballed so quickly over the past few months. Every time I get a headache I think I'm going to get sick, I'm scared of going near people in the street/next to people on the bus etc. I have to carry hand sanitiser around all the time. I have cut myself several times in the past few years, and I'm close to doing it again. I think about death as a relief every time I get anxious. More recently, and I'd rather not go into detail but I'm getting awful thoughts that make me feel guilty and like a fucking awful person. I have assignments to do at university and I just can't, I don't feel like having sex with my boyfriend anymore, and he's constantly on the other end of all my shit, I feel so bad for him. These thoughts are taking over my life and I just want to know if anyone else gets these and how they have helped themselves?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else get disturbing/intrusive thoughts that make you feel guitly and like killing yourself?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sytqe/anyone_else_get_disturbingintrusive_thoughts_that/"
        },
        {
            "author": "imanidiot1214",
            "author_created_utc": 1419737131,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kctng",
            "created_utc": 1421608939,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2suspp/in_order_to_seek_therapy_i_need_to_do_the_exact/",
            "gilded": 0,
            "id": "2suspp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2suspp/in_order_to_seek_therapy_i_need_to_do_the_exact/",
            "retrieved_on": 1440959311,
            "score": 99,
            "secure_media_embed": {},
            "selftext": "I was in therapy for years from ages 8 to 16 as we tried to deal with one very specific symptom of my anxiety (my inability to go to school or complete work without feeling disproportionately overwhelmed). When I ended up dropping out of school, I was pulled from treatment because it seemed like I'd \"won.\" I started college part time and pulled As and Bs and things seemed alright.\n\nOver the past few years, though, it's gotten worse. I'm overwhelmed by anything and I'm at a point now where I'm not good for anything; I shower, I eat enough to not pass out, and I lay in bed until my boyfriend has time to come see me (when I'm physically with him, my symptoms are eased dramatically). I often feel like it won't get better and wrestle down thoughts of suicide because I feel so far gone and can't picture myself living a life where I'm functioning and independent. \n\nMy lovely boyfriend sat me down last night and told me that he's incredibly worried about my condition and it hurts him because he loves me but is starting to need to look out for himself and that can't happen if I'm weighing him down with my poor condition. I don't blame him; this is a lot for anyone, but specifically a regular, nice guy in his early 20s to handle. He's been insisting that I seek professional help, and I've agreed for a long time, but recently it's become more clear to both of us that the need is VERY urgent. \n\nI'm now freaking out because I know I have to do this by myself. My mother (who is minimally helpful and generally unkind to me) tried making an appointment with a counselor but was told that, because I'm technically an adult now, I have to make the appointment myself. \n\nOne of the number one stressors in my life is my inability to ask for help. Whether it's asking a retail employee to let me into a fitting room or calling the doctor and asking to make an appointment, I would rather go without than advocate for myself and my own needs, no matter how basic. \n\nI found out that I need to make my own appointment on Wednesday and have spent most of my free time since trying to turn off the panic mechanism in my brain. I've toyed with asking a female friend to call for me, but I don't see it taking much, if any of the edge off of the experience (since I'd need to be present to tell which days I'm available). \n\nAs if the stress of having to figure out how insurance works and worrying about explaining my problems aren't enough of a deterrent, I literally can not even begin to find help without having my whole respiratory system lock up on me and I don't know what to do.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "In order to seek therapy, I need to do the exact thing that I need therapy for (making phone calls and asking for help). What do I do?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2suspp/in_order_to_seek_therapy_i_need_to_do_the_exact/"
        },
        {
            "author": "GalleonLogic",
            "author_created_utc": 1316813072,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wx08",
            "created_utc": 1421423225,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2smxmx/success_just_gave_a_lecture_to_200_people/",
            "gilded": 0,
            "id": "2smxmx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2smxmx/success_just_gave_a_lecture_to_200_people/",
            "retrieved_on": 1440963039,
            "score": 88,
            "secure_media_embed": {},
            "selftext": "So this might be a bit more of an unusual post, but I wanted to share it with the community.\n\nWhile I feel that my anxiety is not a severe as many of the users I see on here, I still suffer greatly when public speaking (as one person pointed out, it's most likely a form of social anxiety).  I work as a researcher, so I have to give increasingly more presentations, which in general I don't like doing, but are generally to small groups of people (that doesn't make it much better).\n\nHowever, today my boss needed me to cover a lecture for him (and some subsequent teaching).  This was by far and a way the biggest thing I've ever had to do (public speakingwise) and managed to do it without having too many problems.  I may have stumbled over a few things and repeated things unnecessarily, but I managed to do it in as positive a manner as possible.  I am now however completely exhausted (mentally and physically).  \n\nI would really like to thank the community here, since thanks to all of the stories and advice I've managed to handle this one.  Hopefully, I can carry this into future presentations and completely overcome it.\n\n**tl;dr: Had to cover a lecture, didn't panic, didn't go horribly, thanks everyone**\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Success] Just Gave a Lecture to 200 People",
            "url": "http://www.reddit.com/r/Anxiety/comments/2smxmx/success_just_gave_a_lecture_to_200_people/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421861441,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t6tzp/everyone_will_take_turns_introducing_themselves/",
            "gilded": 0,
            "id": "2t6tzp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 49,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t6tzp/everyone_will_take_turns_introducing_themselves/",
            "retrieved_on": 1440953576,
            "score": 77,
            "secure_media_embed": {},
            "selftext": "*goes to the restroom*\n\nOne of my worst unexplainable fears",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "\"Everyone will take turns introducing themselves to the class\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t6tzp/everyone_will_take_turns_introducing_themselves/"
        },
        {
            "author": "eisenkatze",
            "author_created_utc": 1397333787,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g3iu1",
            "created_utc": 1421788919,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t3e7e/am_crippled_barely_human_wreck_dont_even_know_how/",
            "gilded": 0,
            "id": "2t3e7e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 63,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t3e7e/am_crippled_barely_human_wreck_dont_even_know_how/",
            "retrieved_on": 1440955240,
            "score": 68,
            "secure_media_embed": {},
            "selftext": "I'm sorry if I'm posting this in the wrong place. Haven't ever made a post on reddit before and I've been wanting to reach out for help for ages but never managed to come up with even a vague idea of what to write. But I NEED to ask someone who might even remotely know what is wrong with me.\n\nI'm terrified of work, of responsibility, or making mistakes, of doing absolutely anything. I've been on academic leave for three years because I started getting nauseous just looking at my homework reading assignments, or getting close to the university. I broke down sobbing and shaking when my boyfriend asked me to bring him home a cheese sandwich and I didn't know which one to choose. But most importantly, I'm terrified of anything resembling work.\n\nI do freelance translation and there's a job in front of me which is almost a week overdue, an easy, short, freeform essay about a subject I'm interested in, and the client even transferred the money to me already and is really worried about having passed the deadlines, I'm fucking up other people's professional plans and I've stayed in my home for a week refusing to say goodbye to friends leaving the country or take care of my nephew, sleepless and dirty because I just sit in front of the computer with a knot in my stomach, too terrified to open the document, too terrified to breathe sometimes. This happens every time I need to write something, make a resume, or indeed walk up to a store I want to work at and ask if they are hiring. I genuinely feel FUCKING INSANE because I know these things are easy, hell I've even done them before when I was better or when some kind of altered state comes over me after 24 hours of not sleeping... and I can't do it, I just can't do it. It feels like it will physically hurt if I force myself to open that document and look at those words. I tried doing it drunk, it helped a little but I became scared again.\n\nI'm a parasite on everyone because I don't work. I *like* working, I enjoy coming up with a nice translation, I like communicating with people and LOVE working with customers, but I simply cannot up and get started. It's impossible to explain to anyone I know, even people with big anxiety problems don't understand (and I know a lot of them from the mental hospitals I've been to).\n\nXanax doesn't really help. Antidepressants don't help either. Seroquel hasn't helped before but maybe I will try again.\n\nThis is even more confusing since I'm a basket case diagnosed with Asperger's, bipolar disorder, social anxiety and mixed personality disorder (mostly avoidant). I've been in therapy a lot, mostly group therapy programs which helped me relax slightly, especially dance movement therapy and vocal yoga, but the individual therapy was a complete fail.\n\nI don't know. I don't know where I was going with this. Perhaps there's someone out there that could give a name to my problem, because I've searched high and low for similar stories and I found nothing. Perhaps someone even feels the same way. I'm tired of being a useless parasite mooching off other people because I get close to throwing up whenever \"writing a resume\" is mentioned.\n\nI hope someone was able to finish this wall of text. Please.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Am crippled, barely human wreck, don't even know how to google my problem",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t3e7e/am_crippled_barely_human_wreck_dont_even_know_how/"
        },
        {
            "author": "davesfakeaccount",
            "author_created_utc": 1328073036,
            "author_flair_css_class": "",
            "author_flair_text": "Social phobia, suicidal ideation",
            "author_fullname": "t2_6t46k",
            "created_utc": 1421470301,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2spggk/i_just_want_to_go_to_sleep_and_not_wake_up/",
            "gilded": 0,
            "id": "2spggk",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2spggk/i_just_want_to_go_to_sleep_and_not_wake_up/",
            "retrieved_on": 1440961863,
            "score": 61,
            "secure_media_embed": {},
            "selftext": "After two years on medication, I'm feeling more stable than ever in my life. But I also just really want to die. I guess I'm pretty 'suicidal'. But I'm not going to kill myself; I just really want everything to be over. It's so pointless, and at almost 40 it's just a long slog to a painful heartbreaking end. \n\nI'd so much rather it all be over now, and not have to go through all of that crap. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just want to go to sleep, and not wake up.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2spggk/i_just_want_to_go_to_sleep_and_not_wake_up/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421682288,
            "domain": "webmd.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sxxxr/the_american_psychiatric_association_has_added/",
            "gilded": 0,
            "id": "2sxxxr",
            "is_self": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sxxxr/the_american_psychiatric_association_has_added/",
            "retrieved_on": 1440957843,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "The American Psychiatric Association has added three related disorders to its list of official diagnoses: caffeine intoxication, caffeine-related anxiety, and caffeine-related sleep disorders.",
            "url": "http://www.webmd.com/balance/features/brewing-trouble"
        },
        {
            "author": "Chladaigh",
            "author_created_utc": 1386167754,
            "author_flair_css_class": "",
            "author_flair_text": "Nurse: Anxiety/Panic Disorder,GAD,OCD,Depression",
            "author_fullname": "t2_e778m",
            "created_utc": 1421646314,
            "domain": "self.Anxiety",
            "edited": 1421680160,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2swpld/to_those_who_suffer_from_palpitations_read_this/",
            "gilded": 0,
            "id": "2swpld",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2swpld/to_those_who_suffer_from_palpitations_read_this/",
            "retrieved_on": 1440958419,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "Let's start here by talking about a very special part of the human anatomy called the Vagus nerve. The vagus nerve, also referred to as the 10th cranial nerve, is appropriately termed a \"mixed\" nerve. It provides a sort of two-way communication of nerve impulses back and forth between the brain and the pharynx, larynx, esophagus, stomach and associated abdominal viscera (basically, your throat, windpipe, your tummy and guts), the heart, lungs and several more complex but irrelevant body organs or functions. The vagus nerve is the longest and most complex of the cranial nerves in the body.\n\nThe key point here is to make note that this nerve involves the \"heart,\" the \"lungs\" and basically the whole digestive system of your tummy and intestines. Now let's pair that with some real specific and limited physiology about the heart and its rhythm. We also need to bring clarity to some of the medical jargon being talked about by many of you in your messages. The term PVC, or Premature Ventricular Contraction, is just one of many arrhythmias and not necessarily isolated to what many term as \"palpitations.\" So for our purposes here, when we speak of benign palpitations, what we in essence are referring to is the presence of extra cardiovascular electrical activity and the precise induction of these beats felt as dancing of the heart or a flutter sensation in the chest, the prominence or intensity of which is determined by the precise moment of the extra beats in proximity to the most recent beat and the upcoming beat or contraction of the heart ventricles or atria. \n\nThink of it in relation to your memory of your worst date, where the person you're with has no rhythm whatsoever but wants to impress you with all the right moves and clumsily tries to introduce their own dance-step into your otherwise smoothly flowing and natural pace with the music. Depending upon their rather untimely entry, they can cause awkwardness that either simply causes you to quickly pause and regain your rhythm or literally trip you repeatedly until you're forced to leave the dance floor. Well, the same holds true for the heart in our example. The extra beat, or palpitation might come at a point that's subtle, or it might be at a point where the heart is in a different part of the cardiac cycle and stumbles repeatedly until normal sinus rhythm is regained. Now let's get to \"why\" palpitations occur.\n\nThe heart has a natural pacemaker called the sinoatrial node among several less distinct and similar pacers, whose steady rhythmic signals can be affected by which nerve? You guessed it; The VAGUS nerve.\nAmong its many duties, the vagus nerve helps transfer signals within the parasympathetic nervous system to the brain to regulate the heart in addition to other functions taking place and is doing its job right now in each and every one of us. Think of the nervous system as a two-way street, one being the sympathetic nervous system that sort of represents stepping on the gas pedal, and the parasympathetic nervous system that is analgous to stepping on the brakes so to speak. When your heart races, think sympathetic nervous system and when it slows down, think of the parasympathetic system. See?\n\nSo for our purposes, we want to focus mainly on the parasympathetic nervous system, particularly with respect to the 10th cranial nerve otherwise known as the vagus nerve. The variability of your heart rate during inspiration and expiration of your lungs is an effect of the vagus nerve. We've all noticed that when we take a breath in, our heart tends to beat just a little faster and when we breathe out, a little slower. It's an entirely normal bodily function and is connected to the need by the body's system to respond to the environment. It's a very simple example of the sympathetic and parasympathetic nervous system working in concert with other physiological processes. But sometimes extra signals along the vagus nerve due to over-stimulation can directly affect the organs involved in a way that was not normally intended, namely the heart, and cause extra activity to occur like palpitations. It merely represents a misguided nerve impulse coming from the nervous system and not a message from the heart that something is wrong in this case. Does that make sense? It's sort of like an involuntary muscle twitch. Nothing more.\n\nNow that we kind of have a little medical background under our belts, let's take one of the complaints by many of you regarding the proximity or untimely appearance of palpitations and indigestion. Remember that we said the vagus nerve is linked to the tummy, the throat and the heart. Let's assume that we've eaten a meal and it's caused us to experience some gastrointestinal discomfort, or in other words, gas. The irregular presence and activity by your tummy and intestines stimulates, more appropriately irritates, the vagus nerve which sends a rather inappropriate signal back along the pathway to guess where? That's right, the heart. \n\nThe heart is busy pacing away regularly and is relatively unconcerned with all the food you poured into your tummy, when all of a sudden in comes a signal from the vagus nerve because it has been inappropriately stimulated and tells the heart to beat. Well, just like our bad date example, the signal to beat is rather untimely and awkward but the heart has to accept it and respond. The result is extra beats that make the heart feel like it is stumbling. The degree to which it stumbles oftentimes depends upon the extent to which the vagus nerve is irritated and the relative states of indigestion present as the causative agent.\n\nThere is most often no pain associated with this occurrence because it is not the result of a lack of blood or oxygen that creates the palpitation, but rather just a simple additional electrical impulse or series of impulses. Pericardial pain, or pain adjacent to the heart, can sometimes accompany palpitations or exist exclusive of any arrhythmia, but is not necessarily considered pathologic or harmful to us. Remember that we're dealing with inappropriate electrical impulses and typically more nerves than just the Vagus nerve are affected and can respond inappropriately, causing a jabbing or shooting pain than many describe as a \"catch\" in their chest. We'll talk more about chest pain in a bit.\n\nLet's discuss the sensation that some of you described as a warm flushing sensation of your face and perhaps other body areas that accompanies the palpitations. One of the causes for this is epinephrine, also known as adrenaline, released from the adrenal glands atop the kidneys and is designed to help prepare the body for fight or flight. Its effects can cause sensory disturbances, sweating, palpitations, nausea and other changes in physiology. Also recall our anatomy lesson. The vagus nerve stimulates many areas of the body in response to our environment or internal conditions caused by the outside environment, ie. a meal that produces indigestion. The vagus nerve provides all of us with a stable process called vagal tone. This tone or stability keeps us in a state of physiological preparedness with relation to our environment. \n\nIn response to environmental cues or situations, that tone or stability changes to prepare for what may be required. You've probably all seen a guy(or gal) that makes your heart \"skip a beat.\" Ever wonder why that phrase ever came about? Think for a moment. If you've ever been emotionally overcome, your heart races or feels like it pounds in your chest, we begin sweating, our blood pressure rises, we feel nervous and at some point our face is overcome by a warm flushing sensation that we attribute to nervousness or embarrassment. Well, guess what nerve plays a very big role in that entire process? Right Again!!! The VAGUS nerve. And epinephrine is right there to assist in the process.  \n\nThe above scenario would be a case of increased vagal tone. Well, if there's an increase, there's likely to be a case of decreased vagal tone as well. Indeed there is. Decreased vagal tone can make us weak, nauseated, tremble, and even faint. It happens in cases of being excessively startled or frightened. Other conditions, such as diabetes can cause decreased vagal tone, but for our purposes we'll stick to conditions that by what I've read from all of you are non-disease provoking conditions, with the exception of one individual with Mitral Valve Prolapse but we'll touch on that in a bit.\n\nThe point is that our body doesn't always accurately recognize proper environmental cues and the vagus nerve doesn't always know when and how to act. In other words, it misbehaves once in a while as a result of inappropriate stimulation. All sorts of things make the vagus nerve act out, including stress, anxiety, depression, illness and even idiopathic causes (origin or cause is unknown). In fact, there is work going on right now using electrical vagus nerve stimulation to treat depression, anxiety and even seizures. And here's a little extra for those who cough when experiencing a palpitation. Recall your anatomy lesson again. Remember we said the vagus nerve stimulates the pharynx, larynx, bronchi and esophagus. Well, what do you know? Those are exactly the processes involved in the cough reflex. So when the vagus nerve inappropriately stimulates the heart and causes a palpitation it also stimulates in some cases the cough reflex. How about that!\n\nSo we begin to see that the cause for palpitations and the palpitation itself is not a life-threatening occurrence at all. It concerns us for several reasons. First, it has to do with our heart and hey, that's the thing that keeps us alive basically. Big concern! Secondly, we've been bombarded by all the medical revelations and awareness about heart disease. But a case for heart disease does not make for every condition the heart demonstrates, especially palpitations. If you've ever had a cramp in your hand from typing too much, it probably never gave you pause to think you might not make it, so to speak. You reason in your mind that the cramp is caused by repetition fatigue and you need to take a break, massage your hand and rest momentarily. Well, palpitations can be considered sort of a cramp and nothing more. Under stress and other factors we talked about, the vagus nerve gets irritated or fatigued and acts out. Just because the heart is affected, doesn't mean that you've got heart disease or vascular problems that are looming. They're annoying, worrisome and even frightening, but knowing where they come from and why will help go a long way in knowing that they are non-injurious and if we respond appropriately, will subside and we can go about our lives with far less worry.\n\nLet's touch on anxiety for a moment. Anxiety and depression too, can definitely cause a state of dysfunction in many areas of our body. Many patients who have these disorders are exhausted from constantly presenting themselves to the medical community with real and valid symptoms of pain, fatigue, bowel problems, vision problems, tinnitus or ringing in the ears, difficulty swallowing, excessive saliva, dry mouth, sore or sensitive tongue, and many more troublesome circumstances only to have repeated tests all return normal. How can that possibly be?!! It's there, we feel it, we experience it, we hate it. Why doesn't the test confirm that it's there? How frustrating is that?\n\nWell, here's some news that should make you feel a bit less frustrated and even comfort you. Most all tests are based upon the algorithmic or sequential processing, of certain symptoms and signs that are all conclusive of various disease and illness. When someone with anxiety, depression or other condition that has somatic features(felt physically)undergoes these tests, the components that underlie the actual diseases which have similar symptoms simply does not add up and no presence of the actual disease is evident. So it's a case of false identity, sort of like having a biopsy of a mole that turns out to be benign. Looks like cancer, but is not cancer. Well, that same thing can happen to us with regard to all sorts of disorders and diseases. They look similar in presentation, but one reveals true disease and the other a non pathologic condition or illness. So the next time your doctor tells you he can't find anything wrong, be glad for that much at least. Many people get far worse news!\n\nSo with regard to depression and anxiety, these conditions impart disturbance upon body functions. I suppose you're already guessing that the vagus nerve is not exempt from those circumstances and you're exactly right. So when you have an episode of anxiety, rest easy when you have a palpitation or two, or three or even four. The vagus nerve is irritated and needs a break or to reset. No problem whatsoever and you needn't worry any longer that a palpitation is sure indication of worse things to come. Nothing else happens. Just an extra heartbeat or two where there should not normally be. What a relief!!!!!\nAnd the caveat I promised to the individuals with Mitral Valve Prolapse, your heart condition, while not necessarily life-threatening at all, does predispose you to panic disorder which I'm sure you are probably already aware.\n\nOkay, so now we know what these palpitations are and what causes them. What the heck do we do about 'em? Well, there are several techniques that can help. Firstly, let me say that if a run of palpitations makes you feel faint or weak, don't panic and try to make it somewhere less embarrassing. Be safe and think smart. Squat to your knees or sit down until the feeling subsides. No sense in cracking open your skull by trying to make a mad dash for privacy. Anyone can feel faint and people in your company will always rally to your aid more often than not. So relax. The conditions will quickly pass and you'll be back to yourself in a jiffy.\n\nSecondly, if you sense indigestion and gas, discomfort and bloating when the palpitations are present, try merely changing positions which often causes the distention to realign from its offending position proximal to the vagus nerve. If that doesn't work, then a short walk will usually help. Even taking small sips of water will eventually help relieve the indigestion. And you can certainly use antacids if necessary, but take care not to over-use them or other problems may begin to occur to make matters worse... More in comments 1/2\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "To those who suffer from palpitations, read this.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2swpld/to_those_who_suffer_from_palpitations_read_this/"
        },
        {
            "author": "respectfulpanda",
            "author_created_utc": 1416184151,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_je6tf",
            "created_utc": 1421669161,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sxfp7/so_i_went_to_the_doctors_with_a_recurring_neck/",
            "gilded": 0,
            "id": "2sxfp7",
            "is_self": true,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sxfp7/so_i_went_to_the_doctors_with_a_recurring_neck/",
            "retrieved_on": 1440958079,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "and walked out with a prescription for Effexor XR.\n\nI have always suffered from strong anxiety, usually around stupid things such as inability to contact someone or whether or not something I said might have offended someone.  These would send me into hours of me sitting panicking (been this way since about the age of 21, so over 20 years).\n\nAdd to that, stress of the normal type, financial, career, family and such, I didn't realize how bad the symptoms had got.\n\nPins and needles on the arms and legs.\nHot flashes.\nHigher blood pressure (hoping this one is related).\nIrritability\nLoss of focus (a big one).\n\nFor several months, I've been dealing with this recurring neck ache, I had no idea that anxiety and stress could do all of the above.\n\nSo, I'm almost a week into the prescription and I can honestly say, the anxiety levels of dropped somewhat.  I seem to be handling the more common triggers that would freak me out with a little more ease, the neck pains seemed to have been greatly reduced, the pins and needles haven't been happening and the irritability seems to have been greatly reduced.\n\nThe focus still hasn't come back to where I want it, but I'm only a week in, so hopefully that solves the problem there.  I feel, normal?\n\n\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "So I went to the Doctor's with a recurring neck pain...",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sxfp7/so_i_went_to_the_doctors_with_a_recurring_neck/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421725993,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t0j5u/does_anyone_feel_like_they_have_had_a_slow_coming/",
            "gilded": 0,
            "id": "2t0j5u",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t0j5u/does_anyone_feel_like_they_have_had_a_slow_coming/",
            "retrieved_on": 1440956575,
            "score": 25,
            "secure_media_embed": {},
            "selftext": "I feel like I'm having epiphanies that I should've had when I was 13, not in my college years. High school for me was more like elementary school, it wasn't difficult but I followed the rules like a good kid but I had wild emotional break downs that restricted me from life in a very harmful way. It still shows through today. I feel like I'm permanently ruined.\n\nBut at the same time I think maybe it's because I'm slow to age? Let me explain: I wasn't talking until 6 years old. I slept in bed with my mom until 10. I didn't actually make the mental connection in my head that I lost my best friends by middle school. It didn't register, just as if I was still a youngster. I had no place of belonging in high school, no clubs, sports, no social group. My relationship of 5 months showed my immaturity in flying colors. I was acting like a timid middle schooler during these 5 months. \n\nBut now I'm just confused and socially inept. There was very much for me to gain from all of this, but it just wasn't at the right time for me to process any of it.\n\nI'm having a more difficult time than ever keeping friends and I have severe commitment issues (which goes hand in hand, make friend -&gt; lose it because I don't pay enough attention). \n\nLately I've been thinking I'm better off alone. I'd rather live on some mountain somewhere than deal with this false reality fate has given me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone feel like they have had a slow coming of age?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t0j5u/does_anyone_feel_like_they_have_had_a_slow_coming/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421756936,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t1mf9/ironically_visiting_this_subreddit_gives_me/",
            "gilded": 0,
            "id": "2t1mf9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t1mf9/ironically_visiting_this_subreddit_gives_me/",
            "retrieved_on": 1440956066,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I love you guys but i try to stay unsubbed as much as possible. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Ironically visiting this subreddit gives me Anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t1mf9/ironically_visiting_this_subreddit_gives_me/"
        },
        {
            "author": "Mt105",
            "author_created_utc": 1364082151,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b1wsw",
            "created_utc": 1421284772,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sgt7e/im_doing_my_university_thesis_film_about_anxiety/",
            "gilded": 0,
            "id": "2sgt7e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 99,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sgt7e/im_doing_my_university_thesis_film_about_anxiety/",
            "retrieved_on": 1440965957,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "Hey guys,\n\nI am doing my thesis film about anxiety. The goal of this film is to help viewers understand what those with anxiety go through.\n\nSo, what do I need from you? Tell me what its like for you to have anxiety. What does it feel like? Tell me your experiences? The more you can tell me the better. I will be picking bits and pieces out from each off your explanations and using them to write my script!\n\nI want everything to be from somebody with anxieties mouth. It will be COMPLETELY anonymous unless you want me to credit you for your contribution. \n\nThanks for your time\n\nMat.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Im doing my [University] thesis film about anxiety, could you [anonymously] share your experiences? [More Info in Post]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sgt7e/im_doing_my_university_thesis_film_about_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421286644,
            "domain": "self.Anxiety",
            "edited": 1421289684,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sgwse/help_i_need_help_i_need_answers_someone_please/",
            "gilded": 0,
            "id": "2sgwse",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sgwse/help_i_need_help_i_need_answers_someone_please/",
            "retrieved_on": 1440965911,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "I have to let this out to someone. I have to tell someone or I fear that It will take over my whole life and I will commit myself to a mental ward.\n\nThe facts: I'm 20 years old, soon to be 21. I just moved. Can't find employment where I live, and I'm living with my father. No college experience because life has not been exactly \"easy\" for me. Long story short, lots of emotional abuse (Ie: \"You're worthless, no one will ever love you, you're a heartless bastard, You're a bitch, go cry in your room faggot, go suck a dick like you always wanted too\" Stuff like that I heard alot.) I moved from house to house, never really a stable time period in a certain area, parent's constantly fighting, not happy myself, etc. \n\nHere is the thing, and what's going on. First off, I don't understand emotions. No, I'm not some emotional robot or anything, I just can't recognize feelings anymore, except pain really. If you were to ask me if I love my family, I could say yes, but I honestly can't remember what it feels like to love someone. This makes relationships difficult obviously, those have not been going well. The last time I can recall really caring about people was 3 years ago. Since then, I haven't exactly been happy. I don't really know what happiness feels like anymore, really all I have in life is just quiet..I like it quiet. When it's quiet, I am calm and everything is okay. I'm highly irritable, especially with noise. like, noise **really** sets me off. When people talk and I'm trying to concentrate, it really pisses me off. If someone were to ask me if I were happy, I could say yes.. but honestly I have no idea. What **does** happiness feel like? how do you know you are happy? I guess I could say I am content with life. Things are pretty easy, but I don't walk outside and think 'I love my life'.\n\nOn to the cheese I guess. I worry constantly. It latches onto certain subjects and I obsessively worry ALL the time constantly. Basically, I find myself having to step away from my skype partner, just so I can talk myself into feeling okay and normal, like their isn't something bothering me. I worry about a certain subject usually about 35-50 times a day, and it takes anywhere from 2 minutes to 5 minutes to feel normal again. If you add that up, thats at least a couple hours of worrying. \n\nFor about two months straight I worried I was a psychopath. I'm just getting over now the fact that I'm not a pedophile. What set's these thoughts and worries off are silly things. The psychopath thing was a youtube video, yet it catastrophically changed my life for two months. I lost a relationship, and parts of my daily life just researching and asking for constant reaffirmation that I was not a psycho. What set off the the pedophile freakout? I started wondering why I was attracted to 15 year olds still at 20. Even after researching that it's pretty normal to find them attractive still, I obsessed over reaffirming I am not either of the above. It was a constant worry, I didn't want to be something like either of those. These things take over my life to the point to where its constantly on my mind. I can't go more than an hour without thinking of a worrisome thought, and its slowly killing me. I had one month where I had no worries ( at least that I can remember), and it was like heaven.\n\nThe reason why I am here today is because I am tired of it. I can't deal with it anymore.\nI am starting a new relationship. We have alot in common, more than anyone else I have ever talked. She makes me smile and laugh, and I generally enjoy her company (although we are long distance, that doesn't change anything). \n\nThe problem is the crippling fear that started AFTER my last relationship 3 years ago.(Actually, around 18 is when this ALL started.) Ever since this point, I have worried basically about how much my partner weighs. Why? I don't know.. and its killing me. The problem is, it does NOT stop no matter what body type I date, and its crippling. I have dated from average to fat. All of them I still constantly worry about. I'm attracted to average and even curvy girls (IE: She has hips or is a bit chubby). The problem is, I feel this pressing worry in my mind when I am dating someone no matter what size. It's not like I think directly ABOUT size, but it seems to stem from that. \n\nThe girl I am talking to right now is probably curvy worst scenario. Even then, I am still worrying constantly about how she looks. I thought that maybe it would go away with some of the stress from my parents finally divorcing, but no. It's still here. She is attractive to me, but I worry at least 30 times a day about it. It stems into the relationship when i am with them. It's not serious, but at least once or twice while I am with them I feel uncomfortable about their looks I guess. I am generally able to push past it and not worry about it, but sometimes I end up obsessing about it on my own. That's not to say that I do not enjoy my time spent with them, because I do, I love it, but the worries take over and kill my relationship like a cheetah to a wounded gazelle.\n\nI am scared that this might be G.A.D, because it is NOT just focused on relationships. I have worried about plenty of other things that are not relationship based, and I am scared that I have a mental illness causing all of this. Could this also be depression? I'm not sure. \n\nI know I need to a see a medical professional about all of this but I am scared.. I'm really scared I will be placed in a nut ward for how I feel emotionally inside. it's like I'm dead, I don't know what love feels like, or caring, or missing someone. I only really feel pain and small bursts of happiness here or there. I'm not crazy you know, I wouldn't ever hurt someone or do something that Isn't normal. I'm mentally \"there\". I have had alot happen in my life and I'm scared this stems from it, I'm not sure.\n\nI will be up answering/replying for as long as anyone cares to notice. This has calmed me down even just pouring this out.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Help] I need help, I need answers. Someone please just help me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sgwse/help_i_need_help_i_need_answers_someone_please/"
        },
        {
            "author": "cashclash",
            "author_created_utc": 1414206399,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_j1akx",
            "created_utc": 1421801675,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2t47cu/ditching_caffeine_and_alcohol_theyre_just/",
            "gilded": 0,
            "id": "2t47cu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2t47cu/ditching_caffeine_and_alcohol_theyre_just/",
            "retrieved_on": 1440954862,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I've struggled with anxiety and depression for as long as I can remember (diagnosed GAD and major depression). I'm not a heavy coffee or alcohol drinker. I usually have a cup of coffee every other day or so and have a drink every 2-3 days (more in social settings). I've realized for a long time I've been using these things as crutches. They do not provide any real relief and just make things worse. The caffeine will pick me up out of the grogginess, but then comes the crazy anxiety attacks. The alcohol will dull the anxiety temporarily but then I feel more numb and generally out of it, and the anxiety comes back in full force when it wears off, especially when I'm hungover (hungover anxiety is the fucking worst).\n\nIt's finally time to knock this self-medicating shit off. I'm done with it. Time to be healthier. \n\nTreat yourself right and be kind to yourself, guys and gals. I wish you the best.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Ditching caffeine and alcohol. They're just crutches that get me nowhere.",
            "url": "http://www.reddit.com/r/Anxiety/comments/2t47cu/ditching_caffeine_and_alcohol_theyre_just/"
        },
        {
            "author": "angryalpha",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421614536,
            "domain": "healthguidance.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sv3iv/how_to_stop_morning_anxiety/",
            "gilded": 0,
            "id": "2sv3iv",
            "is_self": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sv3iv/how_to_stop_morning_anxiety/",
            "retrieved_on": 1440959170,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ghjn0NakvNfKQSwVA3IUb2-sdv8pa7Mj5NvaNpQiI_o.jpg",
            "title": "How to Stop Morning Anxiety",
            "url": "http://www.healthguidance.org/entry/15495/1/How-to-Stop-Morning-Anxiety.html"
        },
        {
            "author": "weasel521",
            "author_created_utc": 1419202734,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_k8vmi",
            "created_utc": 1421294566,
            "domain": "self.Anxiety",
            "edited": 1421450512,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2shbyx/dae_have_memory_problems_associated_with_anxiety/",
            "gilded": 0,
            "id": "2shbyx",
            "is_self": true,
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2shbyx/dae_have_memory_problems_associated_with_anxiety/",
            "retrieved_on": 1440965714,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I was just wondering if anyone experiences memory problems? I've noticed that when Im in a set of anxiety I feel like I can't remember anything. Whether it be long term or short term. I also will feel like something happened weeks ago when it only happened days ago. I've had really bad health anxiety in the past and feel like this might just be the next disease I \"get\".\n\nSo here I am at 19 terrified of having dementia of some type. I've gotten all my blood work done and everything was perfect. If anyone could offer even advice for me to calm down that would be so helpful. Im just so sick of feeling this way.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE have memory problems associated with anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/2shbyx/dae_have_memory_problems_associated_with_anxiety/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421564223,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2st8rz/hi_ranxiety/",
            "gilded": 0,
            "id": "2st8rz",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2st8rz/hi_ranxiety/",
            "retrieved_on": 1440960035,
            "score": 19,
            "secure_media_embed": {},
            "selftext": "I've been going out with this guy and he told me the only reason we've been hanging out is so he could get in on my roommate. \n\nI'm going to have an panic attack and cry .\n\n-100 self esteem \n&lt;/3",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Hi /r/anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/2st8rz/hi_ranxiety/"
        },
        {
            "author": "godfuckingdambit",
            "author_created_utc": 1421437928,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kr8he",
            "created_utc": 1421438196,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2sntci/need_to_get_my_license_to_live_cannot_bear_to_get/",
            "gilded": 0,
            "id": "2sntci",
            "is_self": true,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2sntci/need_to_get_my_license_to_live_cannot_bear_to_get/",
            "retrieved_on": 1440962628,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "I am at my wits end. I live in a rural area and need to get my driver's license. I am 20 years old and all of my friends and associates have their licenses. I can't fucking stand driving, not only does it cause me anxiety and panic attacks, but I just fucking hate driving, nothing about it is enjoyable to me, other than the transportation part.  I don't know what to do at this point, If I don't get my license now I won't be able to move out, and I will be completely fucked. I could move to a big city and carless, but I hate cities and like living in the wilderness where I can go hike different mountains and whatnot, but I can't do any of this without a license.   I guess I may aswell start biking around.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Need to get my license to live. Cannot bear to get my license. [Rant]",
            "url": "http://www.reddit.com/r/Anxiety/comments/2sntci/need_to_get_my_license_to_live_cannot_bear_to_get/"
        },
        {
            "author": "angryalpha",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1421715391,
            "domain": "helpguide.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/2szyj0/generalized_anxiety_disorder_gad_symptoms/",
            "gilded": 0,
            "id": "2szyj0",
            "is_self": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/2szyj0/generalized_anxiety_disorder_gad_symptoms/",
            "retrieved_on": 1440956842,
            "score": 17,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/MuNiySh_GEpKJFNh1o53aQM0sXKuiMSGAORVcoY4HEQ.jpg",
            "title": "Generalized Anxiety Disorder (GAD): Symptoms, Treatment, And Self–Help",
            "url": "http://www.helpguide.org/articles/anxiety/generalized-anxiety-disorder-gad.htm"
        }
    ]
}