{
    "data": [
        {
            "author": "Dean_Winchester36",
            "author_created_utc": 1435113742,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_oawrt",
            "created_utc": 1437439797,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3e0j9c/does_anyone_else_cry_when_they_get_yelled_at_or/",
            "gilded": 0,
            "id": "3e0j9c",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 136,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3e0j9c/does_anyone_else_cry_when_they_get_yelled_at_or/",
            "retrieved_on": 1440599256,
            "score": 363,
            "secure_media_embed": {},
            "selftext": "Especially when its a teacher or something.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else cry when they get yelled at or when someone raises their voice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3e0j9c/does_anyone_else_cry_when_they_get_yelled_at_or/"
        },
        {
            "author": "jellyfishp0op",
            "author_created_utc": 1436474090,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_onnwg",
            "created_utc": 1437316889,
            "domain": "self.Anxiety",
            "edited": 1437363725,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3du6n9/whenever_i_go_out_the_next_morning_i_feel_like/",
            "gilded": 0,
            "id": "3du6n9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 39,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3du6n9/whenever_i_go_out_the_next_morning_i_feel_like/",
            "retrieved_on": 1440602280,
            "score": 129,
            "secure_media_embed": {},
            "selftext": "Whenever I go out and get tipsy/drunk I suffer from intense anxiety. The next morning I feel like everyone I went out with the previous night will hate me on top of strong feelings of wanting to kill myself. The wanting to kill myself feelings are harder to deal with because I can't stop repeating in my head that I want to kill myself and the voice in my head gets so persistent that I end up absent mindedly saying it aloud. It's only been getting worse as time goes on. I don't know why I have these feelings or how to get rid of them and I was just wondering if anyone else experiences the same thing.\n\nEdit: I want to thank you guys for being nothing but supportive and kind. You're all amazing!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Whenever I go out the next morning I feel like everyone hates me and I want to kill myself.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3du6n9/whenever_i_go_out_the_next_morning_i_feel_like/"
        },
        {
            "author": "crashdowncafe",
            "author_created_utc": 1425417499,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lumv9",
            "created_utc": 1436991164,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3df76y/does_anyone_else_shake_literally_from_anxiety/",
            "gilded": 0,
            "id": "3df76y",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 33,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3df76y/does_anyone_else_shake_literally_from_anxiety/",
            "retrieved_on": 1440609391,
            "score": 106,
            "secure_media_embed": {},
            "selftext": "So this morning I woke up literally shaking in bed. I also have a shaking arm sometimes when awake that won't just get away. \nThe GP, neurologist, my psychologist and I are all convinced it is due to stress/anxiety. I (25f) started a new job today after 6 month of reintegrating at another job due to burnout/depression. So it's not that strange that I woke up shaking. The only thing is I can't stop it, which leads me to feeling panicky, which leads to a massive panic attack. So I was wondering does anyone else have this? and how do you cope with this? I also don't use any medication. \n\ntl;dr: sometimes I wake up shaking or my arm shakes all on its own. How to deal with this?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else shake literally from anxiety?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3df76y/does_anyone_else_shake_literally_from_anxiety/"
        },
        {
            "author": "somethingsarcastic",
            "author_created_utc": 1331441447,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7549j",
            "created_utc": 1437151417,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dn38e/breakthrough_just_want_to_share_my_realization/",
            "gilded": 0,
            "id": "3dn38e",
            "is_self": true,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dn38e/breakthrough_just_want_to_share_my_realization/",
            "retrieved_on": 1440605651,
            "score": 98,
            "secure_media_embed": {},
            "selftext": "So I spend so much time being so frustrated with my SO, friends, and family essentially because they don't meet my expectations of what I think they should be doing for me. But, it occured to me this morning that it's completely fucking stupid to get angry at people for not changing themselves to do what YOU want because THEY ARENT YOU. They are them. So, instead of getting angry I accept them as they are and instead evaluate whether what I'm asking for is even reasonable, and most of the time it's not. It's basically just about accepting people. It's not about changing them, it's about asking yourself if you can accept them for who they are and what they do and can do for you. \n\nI know it seems kind of dumb and round about, but this new perspective is really allowing me to release a lot of anger (and therefore anxiety) and allows me to just accept others. It's relieving a lot of tension in my relationships. I'm just a little proud of myself for this breakthrough...years in the making! I'm hoping this helps others as well. :-)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "**Breakthrough** Just want to share my realization, amazing change!!",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dn38e/breakthrough_just_want_to_share_my_realization/"
        },
        {
            "author": "nrf92",
            "author_created_utc": 1420489054,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kj2sv",
            "created_utc": 1437498898,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3e3c8v/i_just_discovered_this_subreddit_and_i_already/",
            "gilded": 0,
            "id": "3e3c8v",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3e3c8v/i_just_discovered_this_subreddit_and_i_already/",
            "retrieved_on": 1440597946,
            "score": 92,
            "secure_media_embed": {},
            "selftext": "Looking forward to hearing everything you all have to say and to have a community of people who understand how I feel (especially since I don't have that in my personal life)\n\nWith that being said - what are some of your strategies to discuss your anxiety / when you're anxious with people you have relationships with in real life that don't suffer from anxiety (significant others, parents, friends, coworkers)?\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I just discovered this subreddit and I already feel a rush of calm over me because I can tell this will be a great resource for me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3e3c8v/i_just_discovered_this_subreddit_and_i_already/"
        },
        {
            "author": "socialawkwardthrow",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1437353706,
            "domain": "self.Anxiety",
            "edited": 1437355723,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dw4nd/advice_needed_cant_poop_with_friendspartner_in/",
            "gilded": 0,
            "id": "3dw4nd",
            "is_self": true,
            "media_embed": {},
            "num_comments": 35,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dw4nd/advice_needed_cant_poop_with_friendspartner_in/",
            "retrieved_on": 1440601373,
            "score": 89,
            "secure_media_embed": {},
            "selftext": "I have no idea where to post this and if you can recommend a better sub, I'll go there. The only thing I think this can be is anxiety.\n\nI've always had this problem, but it's become a more serious issue now that I (25/F) have a boyfriend (my first, four months). He sleeps over once a week, typically for a night and all of the next day. This past weekend, he slept over two nights in a row.\n\nI live in a studio apartment, so the bathroom is right by the living/bed area. But this has always been an issue for me, even when I've been at friends' houses and stayed overnight. If I was there for multiple days, I'd go to the college building right by there and use a zero-traffic public bathroom. When I dormed very briefly, I used a one-person occupancy stall by the lounge or waited until my roommates are gone.\n\nAt this point, it's not so much about the noise, although there is that. It's in part him/them realizing I must be pooping because of how long I take . . . but then there's also just something else. I feel like I'm in \"on\" mode or something, like I'm wired and just can't relax. I feel like I need to be constantly socializing/entertaining him (studi apartment, no wifi, no TV).  I've tried just sitting and waiting a long time whenever I do go to the bathroom (set a timer), but it doesn't work.\n\nAs soon as he leaves, literally within five minutes, I feel my body relax and I can go. I have been effortfully drinking a lot of water/eating a lot of fiber to make it easier to go. \n\nI love him sleeping over, but it becomes painful when I can't go and it distracts me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Advice needed. Can't poop with friends/partner in the house. Overnights/long weekends are painful.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dw4nd/advice_needed_cant_poop_with_friendspartner_in/"
        },
        {
            "author": "daaygo",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1437402575,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dy6k9/if_youre_suffering_go_to_the_doctor_i_did_this_is/",
            "gilded": 0,
            "id": "3dy6k9",
            "is_self": true,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dy6k9/if_youre_suffering_go_to_the_doctor_i_did_this_is/",
            "retrieved_on": 1440600354,
            "score": 88,
            "secure_media_embed": {},
            "selftext": "I started having panic attacks early this year.\n\nI wouldn't wish them on my worst enemy.\n\nEverybody's panic is different - mine manifested in being convinced I would die.  If I was hot - I interpreted that as a risk of heat stroke.  I had an episode last 4-6 hours, ending in me laying naked on the bathroom floor, sopping wet from being in the shower, trying to find any way to cool down.  I was covered in goosebumps and I forgot what being cold/hot felt like.  I couldn't interpret it anymore.  I thought surely I was going to have a stroke.\n\nIf I started to think about my breathing, I was afraid I wasn't breathing enough.  I would start panicking.  It started with a numb feeling in my face, until I would get tremors that coursed through my body, thinking I was dying, that there was something wrong with me.\n\nI would search for a pulse and if I couldn't find one (I've always had difficulty finding my pulse) I would think my heart stopped and any second, I was going to die.\n\nIf my heart was beating rapidly, I would think I was having a heart attack.\n\nSo I accommodated my anxiety more than I should of.  I couldn't stand direct sunlight anymore.  After my first public panic attack in the super market that lead me locked in a public bathroom, laying on the floor, I didn't want to leave the house anymore.\n\nAfter enough attacks, I wished I would die during them, just so I wouldn't have to live in the constant fear of another attack anymore.  Death would at least offer me a reprieve.  I began seriously thinking about this - how could I live my life in such constant stress and fear?\n\nHowever, through most of this, I never sought help.  I was told by my mother that I was \"more logical\" than that, to receive medication, and by others I loved that I should just \"deal with it\" on my own.\n\nThen I spoke to some people on forums who told me:  Just get the prescription.  Just go to the doctor - get something to control it.\n\nThe stigma on medication was very negative from others in my life.  But I realized that because of this - I didn't need the strength to overcome the disease - I needed the strength to acknowledge that I needed help.  To break this habit, to stop suffering.\n\nI went to the doctor who prescribed me a no-refill xanax prescription, 0.5 mg.  Not a daily dose.  She said take 1 if I have anxiety, 2 if I have a full-blown attack.\n\nI read online before taking any that you shouldn't take it if you have breathing problems.  Because I am as paranoid and as scared as ever, I had a pulmonary function test (breathing test).  It didn't go too well (I fell short of the reference marks, but not too short, and I did react to one of the medications I inhaled, but not until the second-highest dose showing that I was sensitive, but likely didn't have severe asthma), but it didn't say that I had a severe problem either.  Still, my fear was strong.  I didn't take any of the drugs.\n\nI had my 30 pills for a month.  The strange thing is during this time - I didn't have an attack.  Just the placebo effect of knowing I had a way to stop an attack IF NECESSARY made them not develop fully.  Sure, I still had episodes of me sitting around worrying, I still felt great dread at leaving the house too far, but none developed into the 5 hour crippling sense of fear and demise that lead to me being locked in my bedroom, avoiding those I loved.  I was able to go on an overnight trip, I feared being in the car a little less.  It wasn't the solution - but it was made just a little bit more bearable.\n\nI didn't want to get 'fucked up' on these pills, but it sure was nice knowing I had a way to lessen the fear - even if I didn't take them.\n\nThen, the time had come to take one.\n\nIt was last night.  All weekend I was in a heightened state of anxiety.  And last night it started culminating.  I was feeling very hot, which lead me to feel not like I was dying but like I was very ill, very off.  I was acting very irritated.  I started to get afraid that I would have an attack again, which only made things worse.  My boyfriend, initially against the medication, suggested I take one pill.\n\nI did and the fear set in immediately.  What if I'm allergic?  What if I do have a breathing problem?  What if I die from this?  I drank half a beer 24 hours ago, what if they mix poorly?\n\nFor twenty minutes I lie still and repeated a mantra to myself. \n\nThen it worked.\n\nIn twenty minutes, I did not feel high.  I didn't feel 'fucked up.'  I simply felt calm.  \n\nNot relaxed, not sleepy, just simply and utterly calm - I couldn't force myself into an attack.  The idea that something was seriously wrong stopped being broadcast on my consciousness.  It went out not with a bang, but with a whimper.\n\nI had been dealing with this monster for months before seeking help, and finally, for one time, I didn't have to lie in fear.  I didn't have to coax myself into sleep just to avoid lying awake in panic.  I got to feel normal for a night, before drifting off to sleep.\n\nI plan on enrolling in cognitive behavioral therapy once I can afford to, hopefully sometime during my next school semester - this is the optimal way of dealing with anxiety FOREVER.\n\nIn the meantime, I have a message for those suffering who have not sought help - please do.\n\nPlease do not suffer when there is something out there that can break the habit, that can offer you a sense of normalcy.  Do not abuse these drugs because if you do, their reward will be truly lost.  But do not avoid them either due to stigma.  I get it, 'white-man lab-coat medicine bad' is what I've been told all my life.  But there IS a reason that these drugs are on the market - it's because they work.\n\nNow I feel even my state of anxiety will be lessened over time, since I have taken the pill and seen that I have no reason to fear it.  I hope at the end of my prescription, with no refills, I will have no reason to ever seek it out again.  But in the meantime, I feel truly healed.  Do not let the fear of prescription drugs prevent you from getting help like I did - start healing, and start healing today.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If you're suffering - go to the doctor. I did, this is what has happened so far",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dy6k9/if_youre_suffering_go_to_the_doctor_i_did_this_is/"
        },
        {
            "author": "Bobspizzaplace",
            "author_created_utc": 1435067566,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_oagk7",
            "created_utc": 1437262488,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3ds9ey/rant_i_hate_going_out/",
            "gilded": 0,
            "id": "3ds9ey",
            "is_self": true,
            "link_flair_css_class": "rantflair",
            "link_flair_text": "Rant",
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3ds9ey/rant_i_hate_going_out/",
            "retrieved_on": 1440603177,
            "score": 84,
            "secure_media_embed": {},
            "selftext": "I'm going to try to keep it short. I need to vent and put it into words. Maybe you'll share the same feelings. \n\nI hate going out. If I have to stay out late at some bar, I can't deal. I have panic attacks all night, wishing that someone would please just let me go home. No, I'm not handcuffed, but there's pressure from my s/o and friends to go out and stay out. \n\nThe only way that I can function being out late is to get drunk. Then I can't drive. Then when I sober up enough and fall back into my anxiety, it's later, I can't drive, and I feel like crap. \n\nI have a limited capacity for social interaction. I get \"burned out\" by being around people. I need my space. I need my peace and quiet. \n\nSorry for ranting. I just find this community \"gets it\" more than I can ever explain others who don't. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[rant] I hate \"going out\"",
            "url": "http://www.reddit.com/r/Anxiety/comments/3ds9ey/rant_i_hate_going_out/"
        },
        {
            "author": "azulaverdi",
            "author_created_utc": 1420864473,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kmfe8",
            "created_utc": 1437327084,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3duorl/i_went_outside_today/",
            "gilded": 0,
            "id": "3duorl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3duorl/i_went_outside_today/",
            "retrieved_on": 1440602045,
            "score": 78,
            "secure_media_embed": {},
            "selftext": "I went outside today, which is big victory for me because I think people are ruthlessly criticizing me in public. I didn't talk much, but I did go to three stores. After I got home, I had some palpitations, which is usually the start of a panic attack, but I managed to calm down, and I avoided the panic attack! I think today was such a success because of the medicine I've been taking, which is: Lexapro. It's been helping my anxiety a lot. I just wanted to share my success for today.  ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I went outside today",
            "url": "http://www.reddit.com/r/Anxiety/comments/3duorl/i_went_outside_today/"
        },
        {
            "author": "ChillyWillster",
            "author_created_utc": 1286052245,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4ealz",
            "created_utc": 1437071517,
            "domain": "self.Anxiety",
            "edited": 1437080115,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dj7ru/thoughts_of_suicide/",
            "gilded": 0,
            "id": "3dj7ru",
            "is_self": true,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dj7ru/thoughts_of_suicide/",
            "retrieved_on": 1440607458,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "I experience thoughts of suicide when  my anxiety is at its worst. \n\nI have cystic fibrosis and while I'm doing amazing all things considered I sometimes just wish I could cease to exist.  \n\nNo more suffering.  No more pain.  \n\nEven just posting this thread I'm filled with feelings of disappointment and inadequacy. \n\nI have a handle on my situation most of the time but I needed to vent.\n\nEDIT: thank you all for the support and kind words.  Got things under control again. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Thoughts of suicide",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dj7ru/thoughts_of_suicide/"
        },
        {
            "author": "TouphiLTouphi",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1437203771,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dpt6r/holy_freaking_crap_be_careful_what_you_read/",
            "gilded": 0,
            "id": "3dpt6r",
            "is_self": true,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dpt6r/holy_freaking_crap_be_careful_what_you_read/",
            "post_hint": "self",
            "preview": {
                "images": [
                    {
                        "id": "Hse5L_rcaCapDCixyKBisg81r6xjmwpz5GHc2xyiJkw",
                        "resolutions": [
                            {
                                "height": 72,
                                "url": "https://i.redditmedia.com/tCZbLs50wMiDZOWZ_c6Hiq-hBzpxcbol2vcJpFZGWjU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=239d6b969c06a8535e59773531884350",
                                "width": 108
                            },
                            {
                                "height": 144,
                                "url": "https://i.redditmedia.com/tCZbLs50wMiDZOWZ_c6Hiq-hBzpxcbol2vcJpFZGWjU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=17a38aef21304371495bc68e8101700f",
                                "width": 216
                            },
                            {
                                "height": 213,
                                "url": "https://i.redditmedia.com/tCZbLs50wMiDZOWZ_c6Hiq-hBzpxcbol2vcJpFZGWjU.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=52ea7faa32c604e848f0d963b63c6dba",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 234,
                            "url": "https://i.redditmedia.com/tCZbLs50wMiDZOWZ_c6Hiq-hBzpxcbol2vcJpFZGWjU.jpg?s=6212ffa518509b3c5d0703f376c7da77",
                            "width": 350
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440604320,
            "score": 62,
            "secure_media_embed": {},
            "selftext": "Alright, I'm going off of Lexapro so I'm pretty \"blah\" and spending a lot of time online researching for comfort and stuff. Came across [this](http://cchrflorida.org/ssri-withdrawal-effects-are-brutal-and-long-lasting/) article which scared the heck out of me! \n\nExcept it's stupid.\n\nI scrolled to the bottom and actually clicked on the \"study\" to read it, and lo! It's one of the most ridiculous \"scientific\" documents I've seen in my entire life. It must be seen to be believed.\n\n[Nonsense.](http://www.karger.com/Article/Pdf/341178)\n\n**These people literally *Googled* for their sources. They admit it, plain as day.**\n\nThe sources for this fear-mongering article are forum posts. Not only that, they're forum posts FOUND VIA GOOGLING for exactly what the study is looking for!\n\nIt's like confirming a conspiracy theory by googling for conspiracy theory forum posts!\n\nI can't believe I allowed myself to get scared by this BS clickbait.\n\nPlease be careful folks.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Holy freaking crap, be careful what you read online. Some \"scientific\" studies are SO stupid, as are the articles that report them.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dpt6r/holy_freaking_crap_be_careful_what_you_read/"
        },
        {
            "author": "_smosbol_",
            "author_created_utc": 1430577216,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_n8xq3",
            "created_utc": 1436961112,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3ddeai/does_anyone_else_have_that_feeling_you_have_when/",
            "gilded": 0,
            "id": "3ddeai",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3ddeai/does_anyone_else_have_that_feeling_you_have_when/",
            "retrieved_on": 1440610234,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "It's getting crazy. I receive a phonecall, my chest starts to hurt and feels as if it contracts, my heart is pounding, I'm ready to have a heart attack. I have to go somewhere to get some paperwork done. While walking there I get the same thing, as if I saw an axe murderer in front of me and I needed to fight him to the death.\n\nI'm so jumpy all the time, I can't handle it anymore. The adrenaline in my body is raging. I've been declared healthy by multiple specialists but I can feel my blood pressure spiking, my muscles tensing up, especially in my neck and my arm.\n\nWhenever I chill out I feel that it takes it's toll on my body. I get tired quickly, I'm nauseous and sick to my stomach, I eat less and therefore I'm skinny as hell. I need to find some kind of way to let off steam because it's not normal to feel all tense in resting mode. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else have that feeling you have when you can brake just in time not to hit the car in front of you when you're not paying attention, multiple times a day for minor things?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3ddeai/does_anyone_else_have_that_feeling_you_have_when/"
        },
        {
            "author": "patheticlittlegirl",
            "author_created_utc": 1437031796,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ou3u0",
            "created_utc": 1437033743,
            "domain": "self.Anxiety",
            "edited": 1437098879,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dhecn/i_would_just_like_to_introduce_myself/",
            "gilded": 0,
            "id": "3dhecn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 95,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dhecn/i_would_just_like_to_introduce_myself/",
            "retrieved_on": 1440608366,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "Hi, my name is Ellie.\n\nEdit: Thank you so much everyone who commented, it was very kind and touching to see\npeople introducing themselves. I was initially very scared and hesitant to post, I've been on Reddit for 4 years now and drummed up the courage to make an account and post!\nI hope we can all be close friends, it's nice to finally have someplace I feel comfortable.\nThank you.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I would just like to introduce myself..",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dhecn/i_would_just_like_to_introduce_myself/"
        },
        {
            "author": "boxmansreaper",
            "author_created_utc": 1337462882,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7rctb",
            "created_utc": 1437403312,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dy83k/everything_is_so_hard_i_dont_even_know_why_i/",
            "gilded": 0,
            "id": "3dy83k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dy83k/everything_is_so_hard_i_dont_even_know_why_i/",
            "retrieved_on": 1440600334,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "I don't know how people communicate. I honestly don't. I'm in college. The place where everyone says how easy it is to meet new friends, the girl of your dreams, etc... Yeah fucking right. I try to make conversation with people in class, just trying to be friendly and I always feel like I'm annoying the shit out of the person. Honestly, it's probably me, not them. I'm not ugly or anything, I've actually been told I'm pretty good looking. But god, I feel so boring. The moment I start talking to someone it's like my mind blanks. I have nothing to talk about and that makes me start worrying, which makes it even harder to find something to talk about. And than I'm just left feeling like a huge dork who can't even have casual small talk with someone.\n\n\nIt's not like I'm completely alone, I have a group of friends that I hang out with everyday, but I feel like aside from them there's no one I really connect with and feel comfortable being around.\nGod, and then theres the problem with me even leaving my apartment. I have to try so hard just to get myself to go out and buy food. When I have free time, I just lay around my place with my roommates complaining about how bored I am. But I don't know how to fix it. I never have energy to do things, and even when I wanna do something it always just feels like so much work and I wonder why I even left my apartment in the first place.\n\n\nEveryone can't be like this. It feels like there is something wrong with me, and I have no idea how to fix it. I don't want to be like this. I don't want to be bored, I don't want to be boring. I want to connect with people and be social. But it always feels like there is an invisible field between me and everyone else...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Everything is so hard. I don't even know why I bother putting in effort",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dy83k/everything_is_so_hard_i_dont_even_know_why_i/"
        },
        {
            "author": "WestCoastBestCoast01",
            "author_created_utc": 1375766789,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cn8vk",
            "created_utc": 1437066516,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3diw4o/ive_decided_i_want_to_start_therapy_for_my/",
            "gilded": 0,
            "id": "3diw4o",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3diw4o/ive_decided_i_want_to_start_therapy_for_my/",
            "retrieved_on": 1440607610,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "How do I find a therapist that will take my health insurance? I'm on my parent's still and out of state, what if I can't find a therapist in my area that will take my insurance? How much does it usually cost? What do I do if I can't afford anyone in my area?\n\nI also struggle with the idea of opening up with a stranger about something I've kept a secret (even from family and best friends) for nearly 10 years. Did anyone else have that problem?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I've decided I want to start therapy for my anxiety/depression.. but I don't even know where to start.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3diw4o/ive_decided_i_want_to_start_therapy_for_my/"
        },
        {
            "author": "mvicsmith",
            "author_created_utc": 1340328149,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_82u5t",
            "created_utc": 1437153210,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dn78c/the_fog_after_anxiety_anyone_else/",
            "gilded": 0,
            "id": "3dn78c",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dn78c/the_fog_after_anxiety_anyone_else/",
            "retrieved_on": 1440605599,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I notice that after a long, horrendous, rough day of panic attacks and anxiousness, if I meet with people, a close friends, or close friends, I feel like I am in a fog.  I have been so wrapped in my brain, it is hard to fully cohere what is going on during a conversation.  I feel out of my body, almost high, distant or something.  Then, of course, it makes me anxious because I am thinking \"am I crazy?  I am completely sober, why do I FEEL this way?  Is something wrong with my brain?!\" Ugh, anyways, thought it might make me feel better if I am not alone on this.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "\"The fog\" after anxiety, anyone else?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dn78c/the_fog_after_anxiety_anyone_else/"
        },
        {
            "author": "agmatine",
            "author_created_utc": 1267327290,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3wue8",
            "created_utc": 1436924408,
            "domain": "self.Anxiety",
            "edited": 1436999166,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dbuwf/earworm_music_stuck_in_your_head_vs_intrusive/",
            "gilded": 0,
            "id": "3dbuwf",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dbuwf/earworm_music_stuck_in_your_head_vs_intrusive/",
            "retrieved_on": 1440610950,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "I suffer from generalized anxiety, as well as obsessive and intrusive thoughts (among other things). I'm working with my therapist on not being bothered by my thoughts so much, and he brought up an interesting point. He asked if I ever have music stuck in my head, and I do - pretty much all the time. I've been playing guitar/bass for 10 years now and listen to music a lot, so it's only natural that a certain riff will stick out to me and I'll repeat it in my head over and over. He said that a lot of people are bothered by this, but I'm not. Music is music, a sequence of notes; there's nothing about it that would cause me anxiety or other negative emotions.\n\nWhat surprised me is that he said that you can train yourself to see negative, intrusive thoughts the same way. Has anyone thought about this before?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Earworm (music stuck in your head) vs intrusive thoughts.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dbuwf/earworm_music_stuck_in_your_head_vs_intrusive/"
        },
        {
            "author": "34ghosts",
            "author_created_utc": 1435369052,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_od7sl",
            "created_utc": 1436900932,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dadgw/almost_21_and_i_cantdont_drive_it_makes_me_feel/",
            "gilded": 0,
            "id": "3dadgw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dadgw/almost_21_and_i_cantdont_drive_it_makes_me_feel/",
            "retrieved_on": 1440611644,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I'm from NY state and the majority of people here don't drive until they are 18. When I was 18 and preparing for my road test, I went through a really bad stage where I frequently had a lot of anxiety and panic attacks. I soon stopped learning how to drive, because it was way too stressful for me and driving made me nervous. Fast forward 3 years, I'm on the brink of becoming 21 and I still can't drive. I live in the suburbs, where public transportation sucks and I rely on others to get around and it sucks. Thinking about driving during the day where there's other people and traffic makes me anxious.\n\nFor a period there, I was actually learning how to drive. I've been told I'm a good driver, technically, but when it comes to making critical decisions and driving around other cars, I get extremely anxious and it just screws everything up. I took my road test and failed due to not making enough of a full stop. After that instance , I just felt like driving was impossible for me.\n\nIt's such a simple and ordinary task but I see it as such a huge hurdle. Driving would make my life infinitely easier and overall more enjoyable, but it's such a mental roadblock for me. I see 16 yr olds driving around like nothing and I, for the life of me, cannot bring myself to actually feel confident enough to do it. I feel extremely self conscious about not having a license, and it holds me back from a lot. :/ I feel like a loser whenever I have to tell people my age I don't drive and brings down my overall self-esteem.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Almost 21 and I can't/don't drive. It makes me feel really crappy about myself.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dadgw/almost_21_and_i_cantdont_drive_it_makes_me_feel/"
        },
        {
            "author": "smcnally",
            "author_created_utc": 1166036494,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_uoqs",
            "created_utc": 1436971927,
            "domain": "cosmopolitan.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3ddxp1/parenthoodinduced_anxiety_is_a_real_thing_and_pot/",
            "gilded": 0,
            "id": "3ddxp1",
            "is_self": false,
            "link_flair_css_class": "articleflair",
            "link_flair_text": "Article",
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3ddxp1/parenthoodinduced_anxiety_is_a_real_thing_and_pot/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "Yjv1KUe5jXc0PS7h_Ol-fid3AS82wu5E63SkoyoC90k",
                        "resolutions": [
                            {
                                "height": 54,
                                "url": "https://i.redditmedia.com/5S_5OYSc4IyFMHWJ2jfTMkav4vvnVaHwShDjBRhWW9E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=b5db7c4f74715775d8eb621cae9b36b7",
                                "width": 108
                            },
                            {
                                "height": 108,
                                "url": "https://i.redditmedia.com/5S_5OYSc4IyFMHWJ2jfTMkav4vvnVaHwShDjBRhWW9E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=ee9bc5ea683efb32611207f432a2600c",
                                "width": 216
                            },
                            {
                                "height": 160,
                                "url": "https://i.redditmedia.com/5S_5OYSc4IyFMHWJ2jfTMkav4vvnVaHwShDjBRhWW9E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=41252740bceccda642a24395595d4081",
                                "width": 320
                            },
                            {
                                "height": 320,
                                "url": "https://i.redditmedia.com/5S_5OYSc4IyFMHWJ2jfTMkav4vvnVaHwShDjBRhWW9E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=06076aaf4f06a464ac79643c16c57b57",
                                "width": 640
                            },
                            {
                                "height": 480,
                                "url": "https://i.redditmedia.com/5S_5OYSc4IyFMHWJ2jfTMkav4vvnVaHwShDjBRhWW9E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=0e3bb55484a9144a9a003e8a817ff00d",
                                "width": 960
                            }
                        ],
                        "source": {
                            "height": 512,
                            "url": "https://i.redditmedia.com/5S_5OYSc4IyFMHWJ2jfTMkav4vvnVaHwShDjBRhWW9E.jpg?s=782f399140370887732180628eb6c1f1",
                            "width": 1024
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440609982,
            "score": 30,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/SOB3rfqmJD7RyzIuMbIXISa-ZtnCQL1c8XQF1MTcnps.jpg",
            "title": "\"Parenthood-induced anxiety is a real thing, and pot is my anti-anxiety drug of choice.\"",
            "url": "http://www.cosmopolitan.com/lifestyle/a43211/marijuana-mom/"
        },
        {
            "author": "knightwind",
            "author_created_utc": 1435835489,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ohe2f",
            "created_utc": 1437394676,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dxrw5/did_anyone_at_one_point_wish_they_were_someone/",
            "gilded": 0,
            "id": "3dxrw5",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dxrw5/did_anyone_at_one_point_wish_they_were_someone/",
            "retrieved_on": 1440600544,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "Because you see that person as the opposite of being anxious?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Did anyone at one point wish they were someone else?",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dxrw5/did_anyone_at_one_point_wish_they_were_someone/"
        },
        {
            "author": "mikerowaev",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1437404965,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dybrt/saw_somebody_else_suffering_today/",
            "gilded": 0,
            "id": "3dybrt",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dybrt/saw_somebody_else_suffering_today/",
            "retrieved_on": 1440600285,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "I have been suffering with anxiety and panic disorder for 10 years. In all that time I have never visibly seen somebody else suffer. Today, however, I saw somebody suffering. They had the look of distress in their face and I could see them doing breathing exercises, which I believe they were doing too fast. I wanted to help them so bad but I was thinking how I would react if somebody came up to me when I'm having an attack. I'm pretty sure if somebody told me they know what I'm going through, I wouldn't believe it.\n\nI saw them while I was going to pick up my sibling from school. My sibling told me they had just borrowed their phone. They said some things like they \"just couldn't do it\" and were apologizing a lot. As somebody who's been punched in the face by his father just for having an anxiety attack I have to wonder if they are also in an abusive environment.\n\nBut I'm probably thinking too hard about this. I went ahead, got my sibling, and left. I figured if they were doing breathing exercises they're not clueless about their symptoms.\n\nShould I have helped? What would you have done? How would you react if somebody walked up to you offering help during an attack?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Saw somebody else suffering today.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dybrt/saw_somebody_else_suffering_today/"
        },
        {
            "author": "Spaghettiarmsss",
            "author_created_utc": 1341704437,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_89b4m",
            "created_utc": 1437127726,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dlytm/anxiety_and_digestion_problems/",
            "gilded": 0,
            "id": "3dlytm",
            "is_self": true,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dlytm/anxiety_and_digestion_problems/",
            "retrieved_on": 1440606175,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "Hi, this particular stretch of anxiety has been going on for about a month now and for that whole time I've been unable to go to the toilet properly. I know that the adrenaline rushing though your body causes digestion abnormalities, but was wondering if anyone has found a way to overcome this. \n\nI'm struggling to eat as it is, and most of my anxiety is at night/in the morning so when I assume most of the digesting gets done.\n\nI'm reluctant to go to the doctor as I've been a lot recently and they're just trying to get me to take pills which I don't think I need quite yet.\n\nThanks in advance for any suggestions!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anxiety and digestion problems",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dlytm/anxiety_and_digestion_problems/"
        },
        {
            "author": "LunaSkyWitch",
            "author_created_utc": 1437318709,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_owygy",
            "created_utc": 1437331129,
            "domain": "self.Anxiety",
            "edited": 1437364126,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3duwox/hello_my_name_is_luna_and_i_am_new_here_pleasure/",
            "gilded": 0,
            "id": "3duwox",
            "is_self": true,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3duwox/hello_my_name_is_luna_and_i_am_new_here_pleasure/",
            "retrieved_on": 1440601942,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "EDIT: Thank you for all the welcome notes. Finally a place where I belong!  :-) ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Hello, My name is Luna and I am new here. Pleasure to meet all of you.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3duwox/hello_my_name_is_luna_and_i_am_new_here_pleasure/"
        },
        {
            "author": "senmyad",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1437094378,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dkl4x/i_was_able_to_play_my_instrument_while_my_parents/",
            "gilded": 0,
            "id": "3dkl4x",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dkl4x/i_was_able_to_play_my_instrument_while_my_parents/",
            "retrieved_on": 1440606819,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I'm a musician that can't play her primary instrument due to expense (percussion is super pricey, so I'm probably never going to play again) so I'm learning ukulele. I love it. It makes me feel so normal and *me* to be playing music again.\n\nBut I have an intense aversion to practicing when my parents are able to hear me. If it's my boyfriend, I don't care. If it's my friends, I care a little but only if they're my musician friends. It's my parents that I absolutely refuse to practice in front of for some reason. Thanks, G.A.D....\n\nNowadays, of course, my mother is unemployed and home almost 24/7. So, obviously, I don't practice. Then I get into a loop of \"I don't practice, so I don't want to practice, but now I'm not good and never want to practice, because I'm still bad.\" etc.\n\nBut today I was talking to one of my bosses at work about this. He's very realistic and blunt without being mean, so what he said really worked for me. He said something along the lines of, \"You don't practice because she can hear you? That's silly! Practice anyway, and if she says something condescending just say \"That's why I'm practicing!\" You're doing this for fun, right? So have fun.\"\n\nAnd as much as the \"just get over it\" approach doesn't work for some things, it really does help me in particular with some of my more irrational anxiety moments.\n\nSo I came home, did some homework, and by god I actually practiced for half an hour for the first time in months. *Both* my parents are home, but they're sitting out on the front porch so they can only hear me faintly. And ukulele is a lot quieter than a vibraphone, so they may not have even noticed. My dad was even pleasantly surprised to come inside and see me using my instrument. He's going deaf though, so I'm not surprised that he didn't hear it at all lol.\n\nI'm so proud of myself. Now I just have to keep doing it! If I'd kept up practicing since this time last year when I got the thing, I'd be good at it by now. But it's better late than never, right? And who cares if my mom hears me (unless she's sleeping, I'm not a jerk)? I certainly shouldn't! Hell, she's probably pleased to hear me doing something that isn't Internetting.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I was able to play my instrument while my parents were home today!",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dkl4x/i_was_able_to_play_my_instrument_while_my_parents/"
        },
        {
            "author": "Protolore",
            "author_created_utc": 1433904751,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_o0ezp",
            "created_utc": 1437131986,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3dm3sl/i_cant_remember_a_day_ive_lived_without_felling/",
            "gilded": 0,
            "id": "3dm3sl",
            "is_self": true,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3dm3sl/i_cant_remember_a_day_ive_lived_without_felling/",
            "retrieved_on": 1440606110,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Edit: some* not since\n\nI've been living with GAD for about 5 years, I'm 27 and I don't remember the last time I went a day without feeling anxious. I also have a depression problem I should mention that I've had for my entire life. I mean litterally speaking I can think back to before my first panic attack and remember days without anxiety, but since then is tough, there probably been a good number in 5 years, but I really don't remember my last \"good\" anxiety few day. It rules my life, I try my best to left it not, I go to therapy, I take medications as needed, I have cbt therapy work books I use, I've even turned to religion. But nothing ever really helps. I'm married and have a daughter, I feel neglectful to my wife, I almost missed our daughter's birth. I don't want to keep living my life like this. Has anyone ever really overcome their anxiety to never suffer from it again? I mean I haven't gone on family vacations, or a plane in years because I'm worried about what could happen I haven't even been able to finish college or hold down a decent job. I know what a panic attack is and that they will pass, but that didn't prevent them from coming or make them less traumatic. I'm not sure what else to say, part of be just needed to vent and clear my head so I can hopefully get some sleep, part of me is going for any and all advice.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't remember a day I've lived without felling since degree of anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/3dm3sl/i_cant_remember_a_day_ive_lived_without_felling/"
        }
    ]
}