{
    "data": [
        {
            "author": "kcraw12",
            "author_created_utc": 1325697714,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6kyn2",
            "created_utc": 1431406720,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35oey5/i_photographed_myself_depicting_my_anxiety/",
            "gilded": 0,
            "id": "35oey5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 61,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35oey5/i_photographed_myself_depicting_my_anxiety/",
            "post_hint": "self",
            "preview": {
                "images": [
                    {
                        "id": "oAGaQOHUfdCZ8Flt7F7fBXzDDjHaurb0cqMyeLv42oU",
                        "resolutions": [
                            {
                                "height": 60,
                                "url": "https://i.redditmedia.com/6rzlifUYGJPyoY47mk5IPaYyxPoCNJq0cbjSVTVm_-U.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=a2f0dfc27dff45861bdd388f0b93abbd",
                                "width": 108
                            },
                            {
                                "height": 121,
                                "url": "https://i.redditmedia.com/6rzlifUYGJPyoY47mk5IPaYyxPoCNJq0cbjSVTVm_-U.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=3a298f950afcffc28e7ba300abd510d7",
                                "width": 216
                            },
                            {
                                "height": 180,
                                "url": "https://i.redditmedia.com/6rzlifUYGJPyoY47mk5IPaYyxPoCNJq0cbjSVTVm_-U.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=742fa2867d8e28a04536975a475f3a4c",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 270,
                            "url": "https://i.redditmedia.com/6rzlifUYGJPyoY47mk5IPaYyxPoCNJq0cbjSVTVm_-U.jpg?s=7bc7c5bf991659ade848108cf1bc2b1d",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440741061,
            "score": 443,
            "secure_media_embed": {},
            "selftext": "First of all, thank you to everyone on this subreddit that has offered support and encouragement over the past few years. You have been a source of comfort and help that I desperately needed.\nI have dealt with anxiety for over a decade now and up until this last year, I was convinced if it didn't kill me, it'd make me do it.\nI am a photography student and for my senior thesis exhibition, chose to use self portraits to depict the struggles I've had with this disorder.\nI used /r/Anxiety as a resource for ideas and also for encouragement when I was struggling.\nI hope that these photographs can both help you understand that you're not alone as well as helps you articulate to someone who may not fully understand how it is you feel.\n\n[my anxious heart gallery] (http://imgur.com/gallery/8zLTl)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I photographed myself depicting my anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/35oey5/i_photographed_myself_depicting_my_anxiety/"
        },
        {
            "author": "fixationed",
            "author_created_utc": 1407542385,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_hsioo",
            "created_utc": 1431339974,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35kz5h/if_youre_having_a_bad_day/",
            "gilded": 1,
            "id": "35kz5h",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35kz5h/if_youre_having_a_bad_day/",
            "retrieved_on": 1440742665,
            "score": 172,
            "secure_media_embed": {},
            "selftext": "Hey.\n\nI know it's hard. I know it's exhausting and seems like you're never going to really feel okay. Anxiety can just be this constant, terrible feeling that something in life is fundamentally wrong. You're so tired of being afraid, of constantly thinking and worrying and never just waking up to feel completely sure that you can handle this day like other people do.\n\nBut you are okay. Life is fucking weird and difficult. I know you might not realize it, but everyone is afraid of something. Even those people who seem to really know what they're doing. Think of all your favorite people. Do you think they always feel normal? And during the times they don't, aren't they still valuable, important, beautiful people? Like you?\n\nI don't know exactly what your fear is. Mine is health. Maybe yours is social, or school, or money, or places, or everything. But no matter what, you are not alone. I know it sucks, but I hope that a year from now, you look back at this time and think of how proud you are of getting through it. Whether you still feel this way in the future or not, just remember that you will have good days too. And the good days are what really matter. Happiness isn't the lie, anxiety is.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If you're having a bad day",
            "url": "http://www.reddit.com/r/Anxiety/comments/35kz5h/if_youre_having_a_bad_day/"
        },
        {
            "author": "TheRedditPaperclip",
            "author_created_utc": 1358535892,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a9zxp",
            "created_utc": 1431098015,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35aqke/if_youre_thinking_that_youre_wanting_to_quit_your/",
            "gilded": 0,
            "id": "35aqke",
            "is_self": true,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "media_embed": {},
            "num_comments": 47,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35aqke/if_youre_thinking_that_youre_wanting_to_quit_your/",
            "retrieved_on": 1440747562,
            "score": 133,
            "secure_media_embed": {},
            "selftext": "Alright so here is the deal friends. I've been on some anti-anxiety medications for a few years. A few months ago I had been feeling pretty good. I was at the point where I was just kind of tired of taking meds every morning, and thought that I could get it over with by cutting it off cold turkey, and getting over the side effects. \n\nI mean, they couldn't be that bad right? Just a day or so of feeling a little bad, then it would pass. Totally doable right? Nope.\n\nThat was probably one of the worst decisions I had ever made in my life. For about a week I was constantly dizzy, had nausea, diarrhea, head was constantly spinning and had motion sickness. Any time I stood up I thought I was going to fall down and throw up. Extreme paranoia set in which made everything worse. I was an absolute trainwreck of a human being. A blob on the floor too afraid to move or do anything. \n\nAfter about 2 weeks and feeling like the pain would never end, I caved and went back to taking my meds. Eventually I ended up going back to my doctor and now we are in the process of having me weaned off of them instead, which is a much more pleasant experience.\n\nSo just a heads up people. If your taking anxiety meds, for the love of god don't quit them cold turkey ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "If you're thinking that you're wanting to quit your medication cold turkey, don't.",
            "url": "http://www.reddit.com/r/Anxiety/comments/35aqke/if_youre_thinking_that_youre_wanting_to_quit_your/"
        },
        {
            "author": "pussicat_",
            "author_created_utc": 1425685309,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lyb9g",
            "created_utc": 1431192806,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35etaj/something_i_wrote_for_my_husband_to_help_him/",
            "gilded": 0,
            "id": "35etaj",
            "is_self": true,
            "link_flair_css_class": "lovedones",
            "link_flair_text": "Help A Loved One",
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35etaj/something_i_wrote_for_my_husband_to_help_him/",
            "retrieved_on": 1440745600,
            "score": 104,
            "secure_media_embed": {},
            "selftext": "This is what it is like for me just about every day….\n\nI am walking down a nice lovely little path, which I walk down the same every day. When suddenly there is a small bump in the road. Most people may think “So what?” or not even notice it. Others may notice and wonder or even worry “Hey why is there a bump there? Someone may trip.” but they continue to walk on letting it be forgotten easily.\n\nInstead I panic. “Why is there a bump here suddenly? Where did it come from? What does this mean?”  Alarms start going off. I worry. I freak out. The fire alarm was suddenly pulled; warnings are being thrown around in my head like fireworks exploding. I compare it to chicken little, the sky is falling, the absolute worst is about to happen.\n\nOf course that makes no sense. I do not purposefully jump to the absolute worst conclusion. I’d much rather let it go like everyone else and be quite content. My mind doesn’t work that way, it doesn’t let me just let it go so easily. All of those alarms FEEL 100% real. My mind and even my body are telling me that the world is ending and I should panic, that I should be scared. I have a tricky fight or flight switch and that thing keeps getting hit to on. \n\n\nIt can be difficult to understand because obviously you can see that it is just a little bump and nothing to be worried over, or at least not as worried as I am. You try to use reason; you try to say “Hey calm down it is nothing”. But that doesn’t just *poof* make everything better. It doesn’t turn off those alarms. It is as if I see a giant spider that no one else can see, and I am terrified of spiders. Sure tell me it isn’t there but my eyes are telling me it is.\n\n\nWhat is worse is that I partially do agree with you. I have a little quiet whisper of a voice who speaks up from the back; “Hey there, the sky really is not falling. The world isn’t going to end. Everything will be ok.” I can use reason and logic and tell myself there is nothing to worry about. There is no giant spider because that is absurd. But really try telling yourself that when you can obviously see it right in front of you. It is a pretty big argument to have with yourself. I am not saying it is impossible.  Some days I can talk myself down but it is a real struggle. \n\n\nFor every little whisper telling me not to worry there is a million other voices pointing out why I should worry. They are not a little whisper either. They scream. They shout. They make a huge fuss that is hard to drown out. They tell me that yes indeed the sky is falling. The world is going to end. It is more than likely my fault. I must be stupid. I am definitely a horrible excuse for a human. The universe is out to get me. Everything just goes so wrong. Why do I even bother? Why do I even try? And honestly they often make very good points that are easy to be swept up by. You know this has happened before….because it has or something similar had. So why shouldn’t I believe it isn’t happening now, again? Or they tell me that I am horrible and undeserving and no one likes me and brings up a million reasons to support this. Every little flaw, every stupid thing I have done, every mistake. They make a nice little link of cause and effect, because if abc happens then it is going to lead to xyz.\n It all makes sense at the time. I have fireworks &amp; alarms going off in my head, fighting amongst myself. I am in full panic mode. It is so much to take in at that moment. It is scary.\n\n\nSo when things go wrong, when there is a kink in my schedule or my plans it sends me into a panic. So if for some reason I miss my favorite show because of something you did, then that must mean that you hate me. You obviously do not care about me or my feelings. And I have to wonder what I did wrong? Why am I such a horrible wife? Are you going to leave me? I am going to be all alone. I am all alone. I am sad and lonely and miserable and just want to die. \n\n\nIt is dark and scary and spirals out of control so quickly.\nI remember once my mom’s schedule got messed up and I was going to have to go into work hours early. I freaked out and people acted like I was selfish and a horrible person. But for me it was completely terrifying. My comfort got shaken up. I was going to have to go to work early and just hang out and wait. People who worked with me might see me and wonder what I am doing. They might think I am weird or judge me somehow. What would I do just waiting? I would be bored. My mind would wonder which would equal even more bad thoughts and panicking. \n\n\nIt seems silly. I know that. People would just say, don’t worry about what others are thinking. But I just don’t have a switch to turn my crazy mind on and off. I constantly worry over everything. I try so hard not to. To tell myself everything will be ok or just wait it out. But the voices in my head just don’t shut up. I have to constantly fight with myself. It is so tiring and so hard.\n\n\nJust imagine if someone followed you around 24/7 and told you how horrible you were. They brought up every mistake you have ever made, reminded you of every embarrassing idiotic thing. Whenever anything happened they would try their best to make you believe the worst was about to happen and that it was your fault. That is how I feel.\n\n**I don’t actually hear voices…just inner dialogue with myself\n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Something I wrote for my husband to help him understand my anxiety",
            "url": "http://www.reddit.com/r/Anxiety/comments/35etaj/something_i_wrote_for_my_husband_to_help_him/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431618573,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35ygly/rant_i_havent_eaten_in_4_days/",
            "gilded": 0,
            "id": "35ygly",
            "is_self": true,
            "link_flair_css_class": "rantflair",
            "link_flair_text": "Rant",
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35ygly/rant_i_havent_eaten_in_4_days/",
            "retrieved_on": 1440736313,
            "score": 102,
            "secure_media_embed": {},
            "selftext": "My mom died suddenly a few months ago. My boyfriend of 5 months broke up with me on mother's day, my first mother's day without my mom. I found out yesterday he was cheating on me. He told the girl he was cheating on me with (his ex) that I'm too emotional about my mom and that it's killing him. We got into a physical altercation in public. I was diagnosed with PTSD today, caused by my mother's death. \n\nMy heart hurts. I can't eat because my CONSTANT anxiety is making me nauseous and my throat closes up when I try. I used to throw up and now I just dry heave. I'm dizzy and tired. It's been a long week. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "[Rant] I haven't eaten in 4 days",
            "url": "http://www.reddit.com/r/Anxiety/comments/35ygly/rant_i_havent_eaten_in_4_days/"
        },
        {
            "author": "ri0tnrrd",
            "author_created_utc": 1152082395,
            "author_flair_css_class": null,
            "author_flair_text": "your friendly ri0t",
            "author_fullname": "t2_9btk",
            "created_utc": 1431521298,
            "distinguished": "moderator",
            "domain": "s-media-cache-ak0.pinimg.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35tp10/change_your_breathing_change_your_life/",
            "gilded": 0,
            "id": "35tp10",
            "is_self": false,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35tp10/change_your_breathing_change_your_life/",
            "post_hint": "image",
            "preview": {
                "images": [
                    {
                        "id": "MKXru7pYgt4YhN9nHEAvTO22lKiSWvM0A7MSQyWHxSA",
                        "resolutions": [
                            {
                                "height": 224,
                                "url": "https://i.redditmedia.com/pm-nbEKskOsrT2joM1qQzJB0h-c8KIP2mbrbxW-EfE4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=d276e387232ca123a20d9cf6060bc78c",
                                "width": 108
                            },
                            {
                                "height": 449,
                                "url": "https://i.redditmedia.com/pm-nbEKskOsrT2joM1qQzJB0h-c8KIP2mbrbxW-EfE4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=3f57bed14c37dcfe2287d8cce8193cf5",
                                "width": 216
                            },
                            {
                                "height": 666,
                                "url": "https://i.redditmedia.com/pm-nbEKskOsrT2joM1qQzJB0h-c8KIP2mbrbxW-EfE4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=a472a483a4c5e951d0475613ce9e97ee",
                                "width": 320
                            },
                            {
                                "height": 1333,
                                "url": "https://i.redditmedia.com/pm-nbEKskOsrT2joM1qQzJB0h-c8KIP2mbrbxW-EfE4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=6c7e66772676f07d5bda8b458eed370a",
                                "width": 640
                            }
                        ],
                        "source": {
                            "height": 1533,
                            "url": "https://i.redditmedia.com/pm-nbEKskOsrT2joM1qQzJB0h-c8KIP2mbrbxW-EfE4.jpg?s=188573b7fedc21599ddf524b3d5c1752",
                            "width": 736
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440738537,
            "score": 95,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/NXjT1TsMsuzOefuryxwO3vzOLApn2xJ9KzDagHgJzqg.jpg",
            "title": "Change Your Breathing - Change Your Life",
            "url": "https://s-media-cache-ak0.pinimg.com/736x/55/8c/2d/558c2dadd3ed4ce2009a4b8a51cc5cbf.jpg"
        },
        {
            "author": "Kristian26",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431390713,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35nr9j/does_your_anxiety_make_you_really_sensitive_to/",
            "gilded": 0,
            "id": "35nr9j",
            "is_self": true,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35nr9j/does_your_anxiety_make_you_really_sensitive_to/",
            "retrieved_on": 1440741367,
            "score": 78,
            "secure_media_embed": {},
            "selftext": "By this I mean do you feel really self conscious about your heart beat? I'm really anxious atm and I feel like my heart beat is pulsing through my body but my pulse actually feels normal.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "does your anxiety make you really sensitive to your pulse?",
            "url": "http://www.reddit.com/r/Anxiety/comments/35nr9j/does_your_anxiety_make_you_really_sensitive_to/"
        },
        {
            "author": "TheConfusedMango",
            "author_created_utc": 1362528546,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_au0vo",
            "created_utc": 1431346906,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35l7m1/the_light_of_my_life_is_leaving_me/",
            "gilded": 0,
            "id": "35l7m1",
            "is_self": true,
            "media_embed": {},
            "num_comments": 51,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35l7m1/the_light_of_my_life_is_leaving_me/",
            "retrieved_on": 1440742555,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "I am sitting here shaking with fear and sadness as every second of the clock feels like a dagger straight through my heart and every memory we shared becomes ghosts that taunt me about times that were genuinely good, but now can never multiply. We're on a break, because my girlfriend wanted to. She doesn't know if she feels as much for me as I do for her, which is just tearing me apart. I have no one to be with, and my shrink won't call me back, so I am just trying to survive second by second.. Thanks for reading my rant, I am just losing it.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "The light of my life is leaving me.",
            "url": "http://www.reddit.com/r/Anxiety/comments/35l7m1/the_light_of_my_life_is_leaving_me/"
        },
        {
            "author": "1exp",
            "author_created_utc": 1380613069,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_dcenx",
            "created_utc": 1431137028,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35cu3k/prework_anxiety_that_sometimes_gets_so_bad_i_want/",
            "gilded": 0,
            "id": "35cu3k",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35cu3k/prework_anxiety_that_sometimes_gets_so_bad_i_want/",
            "retrieved_on": 1440746523,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "It's odd because of all the jobs I've had, I actually really enjoy this one. It's a very low-stress cashiering position where even on the busiest, lines-out-the-door days, I don't feel like I'm about to have a panic attack as I often had in past jobs. So ideally, I shouldn't have any stress about this.\n\nExcept every day, like clockwork, about 2 hours until my shift begins pretty much up until an hour into my shift, I feel terrified and unhappy and like I should just call in and leave. Like I start thinking about my overall life and how I should be elsewhere (back in school training, or on the days where I beat myself up most—in some long term career job. I'm 26, mind you.)\n\nAbout an hour in, I feel the storm subside, like, \"Okay, this isn't so bad, I'm sticking it out, remember, this is the easiest job you've ever had and there is literally no reason to freak out like you did.\"\n\nI'd really love to just... I dunno, not feel so anxious and self-defeating in that time leading up to my shift though. \n\nOn good days, I go to work and clock in and do what I do without a second thought about it. But good days are like... once a month. \n\nI have no intention of quitting this job and I don't want to hurt my attendance with these irrational urges to call-in and lock myself up at home beating myself up over my social anxieties (because I've done it before and I don't ever want to go back to that.)\n\nDoes anyone else suffer these sorts of pre-work anxieties and have any methods to overcome it? Thanks for reading, guys~!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Pre-work anxiety that sometimes gets so bad I want to call in sick. Any tips on how to fight this?",
            "url": "http://www.reddit.com/r/Anxiety/comments/35cu3k/prework_anxiety_that_sometimes_gets_so_bad_i_want/"
        },
        {
            "author": "knightarmor",
            "author_created_utc": 1417372984,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jpc2y",
            "created_utc": 1431222450,
            "domain": "thoughtcatalog.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35ga0k/50_simple_minihabits_that_actually_help_with/",
            "gilded": 0,
            "id": "35ga0k",
            "is_self": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Help",
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35ga0k/50_simple_minihabits_that_actually_help_with/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "GAXZ38965co342la23FNP-5ypPpcY0qrzI4KBLi2oxs",
                        "resolutions": [
                            {
                                "height": 76,
                                "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=d1da7b5e19a22e86ecf55e3dd041cfe9",
                                "width": 108
                            },
                            {
                                "height": 153,
                                "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=71602d6005bcd2ab4a3d20cc03d00bf4",
                                "width": 216
                            },
                            {
                                "height": 227,
                                "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=2b8213dcaf0bd5d9541d5c77785875c4",
                                "width": 320
                            },
                            {
                                "height": 455,
                                "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=72f764bbac09ddfbf8f5cc3bd615778c",
                                "width": 640
                            },
                            {
                                "height": 683,
                                "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=63a7b8502eb13b185d28658b7244503f",
                                "width": 960
                            },
                            {
                                "height": 768,
                                "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=9572c956d6440ad8f944a5ce4e119a53",
                                "width": 1080
                            }
                        ],
                        "source": {
                            "height": 854,
                            "url": "https://i.redditmedia.com/_JbRY7HOEawPHgIA1UuP08oY1F7uVqkhOkpJ1RI_P5E.jpg?s=a0b2840555cc8903c1e62afc1cf43ec0",
                            "width": 1200
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440744917,
            "score": 71,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ISbzpbXURxcOOYDZqWnShO-jWeV3fdepwY1to2qtPXM.jpg",
            "title": "50 Simple Mini-Habits That Actually Help With Anxiety",
            "url": "http://thoughtcatalog.com/christine-stockton/2015/04/50-simple-mini-habits-that-actually-help-with-anxiety/"
        },
        {
            "author": "potionboatchild",
            "author_created_utc": 1357518453,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a4mo1",
            "created_utc": 1431555783,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35vpzn/dae_struggle_to_invest_in_their_future_because/",
            "gilded": 0,
            "id": "35vpzn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35vpzn/dae_struggle_to_invest_in_their_future_because/",
            "retrieved_on": 1440737592,
            "score": 69,
            "secure_media_embed": {},
            "selftext": "I am in a bad job and applying for others takes me way longer than it should because I am plagued by constant thoughts of \"I won't even pass my certification tests to qualify for this job, so why bother?...even if I do, I bet they won't take someone without years of experience anyway\" and on and on.  LOGICALLY I know that if I apply for enough positions and follow up, it will work out because I am well-suited and in an in-demand field.  But my anxiety just keeps throwing these thoughts at me and it at least doubles how long it takes me to write a cover letter.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE struggle to invest in their future because they are CONVINCED something awful will happen before the investment pays off?",
            "url": "http://www.reddit.com/r/Anxiety/comments/35vpzn/dae_struggle_to_invest_in_their_future_because/"
        },
        {
            "author": "cgoettel",
            "author_created_utc": 1422387004,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kzc2y",
            "created_utc": 1431177020,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35e3f8/we_all_hide_behind_a_smile_mental_health/",
            "gilded": 0,
            "id": "35e3f8",
            "is_self": false,
            "link_flair_css_class": "healthflair",
            "link_flair_text": "Health Related",
            "media": {
                "oembed": {
                    "author_name": "Chris Goettel",
                    "author_url": "http://www.youtube.com/channel/UC2JXJrIivXbY2ho2OV4l3Gg",
                    "description": "http://thinkpacifica.com We all hide behind a smile. 40 million Americans have an anxiety disorder. 2 out of 3 do not seek help. What if help was in your pocket? Pacifica (iOS &amp; Android) Daily tools for anxiety based on therapy, meditation, and wellness. Private, at your own pace, one moment at a time.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FTQqCupQDFOo%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DTQqCupQDFOo&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FTQqCupQDFOo%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.ytimg.com/vi/TQqCupQDFOo/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "We All Hide Behind A Smile (Pacifica)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=TQqCupQDFOo",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FTQqCupQDFOo%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DTQqCupQDFOo&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FTQqCupQDFOo%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35e3f8/we_all_hide_behind_a_smile_mental_health/",
            "post_hint": "rich:video",
            "preview": {
                "images": [
                    {
                        "id": "e5iUPm6ka9yUDB96W4D3fLUVpeKP-Xwa8t3lKThGbww",
                        "resolutions": [
                            {
                                "height": 81,
                                "url": "https://i.redditmedia.com/n5lFkhbtcJwh3yKGf90nS5d8CavZr94QNT7rPPdHEH4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=e2b2ef73786e862df4b55c5d863e5e15",
                                "width": 108
                            },
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/n5lFkhbtcJwh3yKGf90nS5d8CavZr94QNT7rPPdHEH4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=c3da3ca2c283154de4246654529a272b",
                                "width": 216
                            },
                            {
                                "height": 240,
                                "url": "https://i.redditmedia.com/n5lFkhbtcJwh3yKGf90nS5d8CavZr94QNT7rPPdHEH4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=d3eafdfc2e926eb775f64faf7e73b714",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 360,
                            "url": "https://i.redditmedia.com/n5lFkhbtcJwh3yKGf90nS5d8CavZr94QNT7rPPdHEH4.jpg?s=b3532ab5cc7d9b7b579ee2f5912fbc5b",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1440745936,
            "score": 67,
            "secure_media": {
                "oembed": {
                    "author_name": "Chris Goettel",
                    "author_url": "http://www.youtube.com/channel/UC2JXJrIivXbY2ho2OV4l3Gg",
                    "description": "http://thinkpacifica.com We all hide behind a smile. 40 million Americans have an anxiety disorder. 2 out of 3 do not seek help. What if help was in your pocket? Pacifica (iOS &amp; Android) Daily tools for anxiety based on therapy, meditation, and wellness. Private, at your own pace, one moment at a time.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FTQqCupQDFOo%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DTQqCupQDFOo&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FTQqCupQDFOo%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "http://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FTQqCupQDFOo%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "We All Hide Behind A Smile (Pacifica)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=TQqCupQDFOo",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FTQqCupQDFOo%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DTQqCupQDFOo&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FTQqCupQDFOo%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/GPOv3Nxw3s7Bk8mPJnwibDWXGOSq5YPPXixBJgDGylc.jpg",
            "title": "We All Hide Behind A Smile (Mental Health Awareness Month)",
            "url": "https://www.youtube.com/watch?v=TQqCupQDFOo"
        },
        {
            "author": "efgmimicry",
            "author_created_utc": 1428633565,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mtf1r",
            "created_utc": 1431044368,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/358jmj/does_anyone_else_have_strictly/",
            "gilded": 0,
            "id": "358jmj",
            "is_self": true,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/358jmj/does_anyone_else_have_strictly/",
            "retrieved_on": 1440748585,
            "score": 66,
            "secure_media_embed": {},
            "selftext": "I've caved and I'm finally acknowledging that my shaking/sweatiness/heart palpitations are actually not normal when I check my grades, think about my grades, or take an exam. I know people, to some degree, get nervous when doing any of the three. I'm just now acknowledging that my reaction is \"too far.\" I need help. \n\nLong story short, I broke down from school. The pressure to do well was too great. I wasn't doing that well. It became a cycle, and I fell to the pressure and went through depression when I failed my first exam. Perhaps it is over-dramatic (as someone else said) ...but I had to see a therapist regardless. My grades have tanked incredibly since then. I had a 3.4, and it is now going to be a 3.0. I get anxiety attacks during the exam when I feel unconfident. When I know I'm on the cusp of a A/B or even B/C, I realize how important this test is, the pressure builds up, and I have a very low-key panic attack - My thoughts are cloudy, I'm sweating, my heart is beating, and I'm on the verge of tears. \n\nSometimes it doesn't happen. I can pull high As on exams. I was doing well in one class. Then, I was underprepared for one exam, and I panicked. I got a 55. Now I'm fighting to just get a B in that class and I'm hurting myself over my lost grade I was doing so well in. \n\nThis is happening in all my classes. I thought it was normal, but I really cannot stay calm anymore when I think about grades, pressure, and the future. \n\nSorry for the small rant. I just wanted to turn to someone who may have gone through the same thing. I'm trying to think of what I'm going to do next. Probably therapy? But do I want to take medication? Would I have to even take any? Can I avoid it? Who do I go to? I'm thinking through all of this right now. \n\nOh, and grad school. Almost broke down when I realized my anxiety is literally destroying my grades and I might not get into grad school anymore. \n",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else have strictly school/pressure-related anxiety attacks? Would just like to turn to someone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/358jmj/does_anyone_else_have_strictly/"
        },
        {
            "author": "No_Freebies_",
            "author_created_utc": 1424832206,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_llvey",
            "created_utc": 1431534788,
            "domain": "self.Anxiety",
            "edited": 1431535175,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35ufqk/does_anyone_else_use_suicidal_ideation_to_calm/",
            "gilded": 0,
            "id": "35ufqk",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35ufqk/does_anyone_else_use_suicidal_ideation_to_calm/",
            "retrieved_on": 1440738191,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "To be clear, I haven't been actively suicidal/serious about suicide since childhood. I've been struggling with anxiety, OCD, and depression as of late, but it's by no means unbearable. Yet, I do use suicidal ideation to relax/calm myself down after a really stressful episode of panic and/or during the depression that often follows. \n\nBack when I was actively suicidal, the real appeal was the perceived relief that would follow death. But even just *imagining* myself preparing to comitt suicide, planning out the details of my death, writing the goodbye notes in my head, imaging the funeral and all my loved ones' responses...for some reason, this gives me a very peaceful, temporary sense of relief and for a few brief minutes, I feel like I am free of all my problems, anxieties, and worries. I have a good cry over my imagined suicide--maybe with some sad music on--and after that, I feel refreshed in mind and soul, ready to take on the world once more. I've never talked to anybody about this coping mechanism--not even my bf or counselor--because I am afraid someone will think I am *actually* suicidal when I'm not. I am just using the fantasy to gain some relief.\n\nJust wondering if anyone else does this or if I am a total weirdo? :/",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else use suicidal ideation to calm down or am I just a total weirdo? [Trigger Warning]",
            "url": "http://www.reddit.com/r/Anxiety/comments/35ufqk/does_anyone_else_use_suicidal_ideation_to_calm/"
        },
        {
            "author": "StonedDonkey",
            "author_created_utc": 1363783394,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_b0jlv",
            "created_utc": 1431471009,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35rlmp/i_havnt_been_to_work_in_3_weeks/",
            "gilded": 0,
            "id": "35rlmp",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35rlmp/i_havnt_been_to_work_in_3_weeks/",
            "retrieved_on": 1440739514,
            "score": 62,
            "secure_media_embed": {},
            "selftext": "Every day i wake up, get ready, kiss my parents goodbye, drive to work, then keep driving.\nI can't bring myself to pull in, its getting bad, i need the money desperately but i just can't do it, i dont know what to do...\nRight now im sitting in a truck stop, having just driven by work AGAIN, any words of wisdom would be much appreciated ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I havnt been to work in 3 weeks...",
            "url": "http://www.reddit.com/r/Anxiety/comments/35rlmp/i_havnt_been_to_work_in_3_weeks/"
        },
        {
            "author": "ri0tnrrd",
            "author_created_utc": 1152082395,
            "author_flair_css_class": null,
            "author_flair_text": "your friendly ri0t",
            "author_fullname": "t2_9btk",
            "created_utc": 1431178362,
            "distinguished": "moderator",
            "domain": "self.Anxiety",
            "edited": 1431331651,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35e58k/success_thread_share_your_victories_large_and/",
            "gilded": 0,
            "id": "35e58k",
            "is_self": true,
            "media_embed": {},
            "num_comments": 240,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35e58k/success_thread_share_your_victories_large_and/",
            "retrieved_on": 1440745912,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "Greetings /r/Anxiety,     \n    \nAs I'm sure all of you already know first-hand it can be overwhelming even to do the \"little\" or \"normal\" things in life for those with anxiety issues. It's about time every one of us bragged about our triumphs big and small in our day to day life. \n    \nI want you to tell me about your victories - **large and small**. Because let's face it - for those suffering with anxiety really is all about the little little things. \n    \nWe've all seen success stories and victories mentioned briefly in comments all over /r/Anxiety. Successes and even minor victories happen all the time and these are worth sharing. In theory this will be the start of a weekly or bi-weekly recurring thread, and by sharing your successes and victories, you're helping fellow Redditors by giving them encouragement and hope. It helps to know that there are people actually beating this.    \n\n~~****Edit: These have been great guys and gals keep them coming!! I'm hoping in an hour or so I can post mine hehe****~~\n\n**FINALLY** I can post mine!?!? I submited my stupid final paper and on top that that BEFORE deadline (as in real deadline no more late days) The weight off my shoulders is just...omg my breathing can go back to normal. Or I'm assume it will once the shock of hitting the send button for that email submission wears off.\n    \n    \nri0t",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Success Thread: Share your victories large and small!",
            "url": "http://www.reddit.com/r/Anxiety/comments/35e58k/success_thread_share_your_victories_large_and/"
        },
        {
            "author": "DrBallMedicalDoctor",
            "author_created_utc": 1430710367,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_n9wje",
            "created_utc": 1431287095,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35iqmp/just_a_question_why_do_i_always_have_to_be_in/",
            "gilded": 0,
            "id": "35iqmp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35iqmp/just_a_question_why_do_i_always_have_to_be_in/",
            "retrieved_on": 1440743769,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "I always fall in love with the idea of people and then focus too much of my attention on them... then when i fall out of love with them i find someone new to fall in love with the idea of and wont pay attention to like any other girls. I cant stop and its really annoying. Anyone have any insight why i might do this? thanks!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Just a question: Why do i always have to be in love with someone?",
            "url": "http://www.reddit.com/r/Anxiety/comments/35iqmp/just_a_question_why_do_i_always_have_to_be_in/"
        },
        {
            "author": "b0x0fawes0me",
            "author_created_utc": 1328144682,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tdk5",
            "created_utc": 1431315053,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35k54x/help_sometimes_i_just_feel_like_i_wasnt_really/",
            "gilded": 0,
            "id": "35k54x",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Help",
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35k54x/help_sometimes_i_just_feel_like_i_wasnt_really/",
            "retrieved_on": 1440743054,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "Like it needed a certain puzzle piece and I just wasn't it. I've been having a really hard time connecting with people lately, and nobody really understands or cares how much anxiety I feel doing the simplest tasks. I just moved out and my roommates are the polar opposite of me. I'm pretty quiet and I keep to myself and I like to study (well, I don't *like* to, but I want to succeed), they like to party and they don't understand why I don't like to. I'm sharing a bathroom with one and I feel really annoying because I have to pee like ten times a day. I feel like they already don't like me, but I'm probably just paranoid.\n\nI don't know, I just.. I'm having a really hard time. I want to know it gets better. I want to know I'm going to find my people who understand me. I hate college. I really do. It's supposed to be the \"best time of my life\" but I can't fucking relate to any of these people I'm meeting. I don't *want* to get involved because I'm already stressed out enough without making small talk with strangers in these groups.\n\nI'm so frustrated. I just constantly feel not good enough because I'm never validated. It seems like everything in my life is constantly pointing to *not good enough. failure. bad friend. bad person.* I want to start running again to alleviate some of my anxiety but I feel self conscious running in a new neighborhood. I pretty much feel like throwing up all the time because I'm so stressed. \n\nI'm just really fucking sad. I miss my parents, I miss living at home. I wasn't necessarily happy there either but at least I had support. My semester starts tomorrow and I'm scared my grades are going to be shit because I can't get my act together.\n\nI met this really great girl last semester and I felt a real connection. We hung out a bit and it was going great, and then all of a sudden, she shuts me out. I don't know what happened. I gave up trying to talk to her because she obviously doesn't want to talk to me. God, sometimes I feel like I'm completely socially inept, but I wasn't always like this. I was so fucking social as a kid and now I can't even keep a god damn friend.\n\nI just need someone, anyone, to tell me it's going to be okay. That they got through something hard, or something. That I'm going to find people that I connect with. That I'm going to get through this semester with my roommates. I'm feeling really low right now.\n\ntl;dr: did anyone else have a hard time socially/generally in college but ended up okay?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[Help] Sometimes I just feel like I wasn't really meant for this world",
            "url": "http://www.reddit.com/r/Anxiety/comments/35k54x/help_sometimes_i_just_feel_like_i_wasnt_really/"
        },
        {
            "author": "imjustheretoday",
            "author_created_utc": 1412558692,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iq19h",
            "created_utc": 1431299396,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35jdsc/reminding_myself_that_its_okay_to_make_mistakes/",
            "gilded": 0,
            "id": "35jdsc",
            "is_self": true,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35jdsc/reminding_myself_that_its_okay_to_make_mistakes/",
            "retrieved_on": 1440743408,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "It never fails. Sunday night comes along and my anxiety heightens. Monday is tomorrow; work is tomorrow. I love my job so much, but I'm constantly getting in my own head about it - letting small mistakes define me, being too hard on my self for not doing \"more\" (even though my bosses are all pleased with my performance), paranoid I'm going to be let go at any minute...it's exhausting. I am not perfect. I am young in my career (25, marketing) and have much to learn. Nobody is expecting me to have it all figured out. I once heard that \"it's only a mistake if you make it twice\" anyway. If anyone else is having a difficult moment, day, week, month, etc. please try and be kind to yourself. Take care of yourself. Forgive yourself. I will try too. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Reminding myself that it's okay to make mistakes which means it's okay for you too!",
            "url": "http://www.reddit.com/r/Anxiety/comments/35jdsc/reminding_myself_that_its_okay_to_make_mistakes/"
        },
        {
            "author": "relentlessjoe",
            "author_created_utc": 1387861270,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ehpdg",
            "created_utc": 1431545936,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35v48d/refuge_in_restrooms/",
            "gilded": 0,
            "id": "35v48d",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35v48d/refuge_in_restrooms/",
            "retrieved_on": 1440737873,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "I don't know about you guys, but when I'm out and about and am feeling overwhelmed by anxiety or panic attacks, the restroom is my place of comfort. It's a sort of shelter from everyone and everything and for a moment you feel like you can just let go without worrying about others.\n\nI usually just lie against the wall and take slow breaths. \n\nWish you all a good day. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Refuge in restrooms",
            "url": "http://www.reddit.com/r/Anxiety/comments/35v48d/refuge_in_restrooms/"
        },
        {
            "author": "Swirlybread",
            "author_created_utc": 1362386602,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_at8uz",
            "created_utc": 1431622965,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35yq41/dae_feel_like_its_too_late_to_be_normal/",
            "gilded": 0,
            "id": "35yq41",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35yq41/dae_feel_like_its_too_late_to_be_normal/",
            "retrieved_on": 1440736129,
            "score": 31,
            "secure_media_embed": {},
            "selftext": "My anxiety went untreated for almost half my life and it kept me from forming healthy relationships with people growing up. Now I'm in therapy and taking medication, but I still feel totally incapable of making friends. I just feel like I missed out on learning how to interact with others. It seems to come so easily to everyone around me and I don't know how to continue a conversation beyond \"Hello\".",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel like it's too late to be \"normal\"?",
            "url": "http://www.reddit.com/r/Anxiety/comments/35yq41/dae_feel_like_its_too_late_to_be_normal/"
        },
        {
            "author": "RighteousTurd",
            "author_created_utc": 1337844474,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7spxs",
            "created_utc": 1431178203,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35e519/i_cant_anymore/",
            "gilded": 0,
            "id": "35e519",
            "is_self": true,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35e519/i_cant_anymore/",
            "retrieved_on": 1440745915,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "I've had G.A.D and severe depression all my life but it wasn't until 6 months ago I got hit with severe panic attacks. I'm lost without insurance and I'm afraid I might dive into the deep end and give up. I have a panic attack nearly every day. Sometimes more than once a day. Warmlines have only done so much. I've never felt so frustrated in my life. I'm tired of feeling this way. And I fucking hate it guys. I'm at my witt's end. I hate these fucking panic attacks. I hate feeling like I'm dying I almost wish I was really dying. I'm fucking suffocating in this and I almost wish that it would take over and finally kill me somehow so that'd I'd stop experiencing it every god damn day. What the fuck do I do guys? I'm at a complete loss. I don't know where else to turn to so I found an anxiety subreddit and posted to it first. Any and all advice is extremely appreciated",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't anymore",
            "url": "http://www.reddit.com/r/Anxiety/comments/35e519/i_cant_anymore/"
        },
        {
            "author": "capatiller",
            "author_created_utc": 1345726920,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8rgmr",
            "created_utc": 1431273483,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35i0st/attack_wont_back_off/",
            "gilded": 0,
            "id": "35i0st",
            "is_self": true,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35i0st/attack_wont_back_off/",
            "retrieved_on": 1440744103,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "So I have posted a few times recently. I had a total break down a week ago. Completely  lost my mind and have been having non stop anxiety attacks  since. Usually my xanax will dial them down. I cannot shake it today. I hade been hiding out at a friends for a week, but was brought back home friday. Today is just bad. Along with feeling like a failure as a parents and them giving me gifts, due to everything  going on in my brain I didn't realize today is my S/O birthday. I am unable to leave the house, not even step on my porch ir work in my prized gardens. \n\nI feel today is is just spiraling  out of control. I took 1/2 mg xanax. Not sure if I should take more, but I feel so miserable. I can't sit still, I feel I need to escape. But to where and how. My car has been taken away, and even if I wanted to drive I can't go outside.  My mom is coming tomorrow  to help cate for me. She feels for the time I will need daily therapy and need a driver. Just the drive from my friends to here as a passenger, 40 miles, I was full blown panic. Crying, sobbing, begging to go back to my bubble. I thought being back home would be better, but it's worse. The kids hover and want to talk to me, granted they haven't seen me in two weeks, but it is triggering me. I don't know why.  What do I do? I am fucking losing it again. I can feel another break down coming.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Attack won't back off",
            "url": "http://www.reddit.com/r/Anxiety/comments/35i0st/attack_wont_back_off/"
        },
        {
            "author": "throwawaypanic12",
            "author_created_utc": 1423277584,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_l7fsh",
            "created_utc": 1431347331,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35l88n/first_session_of_therapy_tonight/",
            "gilded": 0,
            "id": "35l88n",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35l88n/first_session_of_therapy_tonight/",
            "retrieved_on": 1440742547,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "I finally got the courage to call someone professional for help and I've got my first therapy session tonight. Hoping that I can get over my past and get rid of my nightmares and anxieties. Anyone have any stories about their first session?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "First session of therapy tonight!",
            "url": "http://www.reddit.com/r/Anxiety/comments/35l88n/first_session_of_therapy_tonight/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431359678,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35lute/you_guys_have_been_there_for_me_many_times_but_i/",
            "gilded": 0,
            "id": "35lute",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35lute/you_guys_have_been_there_for_me_many_times_but_i/",
            "retrieved_on": 1440742255,
            "score": 26,
            "secure_media_embed": {},
            "selftext": "Hi guys. To start off I need to say that I work at a group home for the developmentally disabled. \n\nIt's usually a pretty quiet job, considering I'm the night worker there and spend my time simply watching over the house and cleaning, but I also have about 5 hours of interaction with the guys each shift. \n\nThis morning an altercation was going down between two of the guys, one was being administered his medications while another barged in and refused to leave out of pure laziness and spite for the other client (they have a history of hating one another). One thing led to another and the one who barged in started threatening to physically aggress on the other, raising tensions. After a cup of milk was thrown at another staff member and I as we tried to persuade the \"intruding,\" client to leave, the other staff member left the office to grab another staff member to see if he could help de-escalate the situation as we were having no luck; leaving me in the office alone with the clients. \n\nThe intruding client then, completely unprovoked, decided to start threatening even more and grew louder, and more antsy physically (hopping up a little, showing signs of physically aggression). I stood between the two as to protect the client who was trying to receive his meds, when the other jumped up without a word and started coming at *me*. \n\nEverything happened so fast. To explain, I'm a 6'0 19 year old with ~8 months of experience in this company / field, while the aggressor is a 40 some year old 6'7 man. He attempted to punch me with one arm after the first, resulting me in grabbing both of them to protect myself. Eventually he pulled away extremely hard and while doing so slipped backwards, falling. Since I still had ahold of his arms I lowered him to the ground to the best of my ability so he wasn't hurt during the fall. By then my coworkers ran in and simply stood around me, not knowing what to do. All I could do is hold on to his arms until he was done showing signs of attacking me further, then I went outside for a break when everything calmed down and was safe for everyone. \n\nHere's why I'm worried. My company has been known to be extremely strict, even furthermore than state guidelines, towards staff rather than clientele. I was told straight up by my boss that this would likely get investigated by the company, which isn't unheard of but is very worrisome. The company has a small list of \"approved,\" holds for situations like these, but in that moment the training I received ~9 months prior proved to be not as easy to implement on someone who's hellbent on \"breaking your fucking face in\". I wasn't able to do an approved hold, but nor did I do a *banned* hold... Or any real \"hold,\" for that matter... But I'm still worried. \n\nI love this job and now I feel like I'm on the radar. I know I did my best and did nothing wrong, but it's still nerve wracking. Like having a cop pull up behind you, even though you've done *literally nothing* wrong, you still have that sense of dread and worry. Not to mention the fact that he's the most unhygienic client in that particular group home, and he left a bleeding scratch down my chest with his feces ridden fingernails (due to laziness and lack of washing hands thoroughly). \n\nAfter the altercation I had to write a report, and I was as thorough and honest as all possible, but I'm still worried... Even with him showing no signs of harm post-incident, and me being scratched up. \n\nMy anxiety can't handle much more from this incident, and it's not even *truly* begun.   ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "You guys have been there for me many times, but I need you now more than ever.",
            "url": "http://www.reddit.com/r/Anxiety/comments/35lute/you_guys_have_been_there_for_me_many_times_but_i/"
        }
    ]
}