{
    "data": [
        {
            "author": "Brainstorm95",
            "author_created_utc": 1432213334,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nloqe",
            "created_utc": 1432213801,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36r1i0/people_without_anxiety_dont_realize_how_lucky/",
            "gilded": 0,
            "id": "36r1i0",
            "is_self": true,
            "media_embed": {},
            "num_comments": 47,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36r1i0/people_without_anxiety_dont_realize_how_lucky/",
            "retrieved_on": 1440722741,
            "score": 203,
            "secure_media_embed": {},
            "selftext": "I've had anxiety for almost 6 years. And it all began after i got my first real heart palpitation while working out and I feel like I've been super depressed just having to think about how each day will go, and I keep asking myself quesitons like - \"When will I have my next heart palpitation/panic attack.. I bet it's just hours away\". It really is pure mental torture.. Nothing else",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "People without anxiety don't realize how lucky they are.",
            "url": "http://www.reddit.com/r/Anxiety/comments/36r1i0/people_without_anxiety_dont_realize_how_lucky/"
        },
        {
            "author": "AgedTwenties",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431845090,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/368q3g/anyone_else_deathly_afraid_of_coming_across/",
            "gilded": 0,
            "id": "368q3g",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/368q3g/anyone_else_deathly_afraid_of_coming_across/",
            "retrieved_on": 1440731404,
            "score": 143,
            "secure_media_embed": {},
            "selftext": "I am deathly afraid of coming across people I know. I just moved back to my hometown. A small town of about 5000. I know atleast one person I went to high school with or know in general that works at almost every business in town. Literally. I hate this and avoid certain businesses and certain times of business  because of this. I hate seeing people I know in the grocery store or where ever. I don't want to talk to them I don't want to catch up. I will admit I fear/don't want to be judged or compared to them or anyone is part of the reason. I don't want them to be like \"So what do you do for work?\" And have them judge me, like I have been a failure since highschool or am not successful. Even the people who I have been more successful than I don't wish to see. I was just in one of the two supermarkets in town a walmart shopping at 1:30 am to avoid people already and came across a old friend I had in highschool. But we're not friends and we went completely different ways. I immediately turned and hoped he didn't recognize me and left my cart and left the store and drove to the next closest walmart 25 minutes away where there would be less of a chance to run in to someone I know. What's up with this? Anyone similar? The feeling I feel when I see someone is like going on the apex of a roller coaster. My stomach is in the air I am freaking out on the inside and try to hide and escape the situation. :/ I hate this shit.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else deathly afraid of coming across people you know in daily life?",
            "url": "http://www.reddit.com/r/Anxiety/comments/368q3g/anyone_else_deathly_afraid_of_coming_across/"
        },
        {
            "author": "thatsitbacktowinnipg",
            "author_created_utc": 1428502651,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ms7a8",
            "created_utc": 1432047472,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36hyh1/does_anyone_else_feel_exhausted_that_it_takes/",
            "gilded": 0,
            "id": "36hyh1",
            "is_self": true,
            "link_flair_css_class": "deaflair",
            "link_flair_text": "DEA Questions",
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36hyh1/does_anyone_else_feel_exhausted_that_it_takes/",
            "retrieved_on": 1440727036,
            "score": 114,
            "secure_media_embed": {},
            "selftext": "I recently was discussing the topic of anxiety with a friend of mine, and we came to the realisation that it takes so much effort to rid ourselves of our anxious state and 'return to normal/feeling good' - does this mean that if we did nothing at all (which many of us do - no exercise, bad diet, etc) then our constant state would be one of anxious feelings and discomfort? Would this essentially mean that we are always fighting a battle against ourselves to rid us of what appears to be a 'grey cloud looming'??\n\nDoes anybody else feel this way? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel exhausted that it takes them so much energy to Not feel anxious?",
            "url": "http://www.reddit.com/r/Anxiety/comments/36hyh1/does_anyone_else_feel_exhausted_that_it_takes/"
        },
        {
            "author": "LilyoftheRally",
            "author_created_utc": 1300061047,
            "author_flair_css_class": "",
            "author_flair_text": "Very bad driving anxiety",
            "author_fullname": "t2_4yjdo",
            "created_utc": 1432045659,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36huf2/i_freak_out_when_i_get_surprise_phone_calls_and/",
            "gilded": 0,
            "id": "36huf2",
            "is_self": true,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36huf2/i_freak_out_when_i_get_surprise_phone_calls_and/",
            "retrieved_on": 1440727089,
            "score": 109,
            "secure_media_embed": {},
            "selftext": "I'm looking for work so I expect a few surprise phone calls, but I'm always afraid of screwing up when I answer the phone. I tend to let the person talk to my voicemail, which I then have to check, which I also hate doing.\n\nI also got a surprise email this morning for a job I don't think I applied for and probably wouldn't want in the first place. It's in my field, but not something I would ever want to do, because I don't know if it's that useful to the clients receiving it.\n\nI always want to respond by saying \"who the hell are you and why are you contacting me randomly\". If I ever become famous, which I hope I never do, I'm going to hire someone to deal with random people contacting me.\n\nI don't want to tell anyone about the surprise email because I don't want my parents to find out about it. I don't know if I should respond to it or just delete it, and I only want help from people who understand, not my parents.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I freak out when I get surprise phone calls and emails.",
            "url": "http://www.reddit.com/r/Anxiety/comments/36huf2/i_freak_out_when_i_get_surprise_phone_calls_and/"
        },
        {
            "author": "HankDodd",
            "author_created_utc": 1426697247,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mc5ib",
            "created_utc": 1432156867,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36odit/weed_isnt_for_everyone_sa_depression/",
            "gilded": 0,
            "id": "36odit",
            "is_self": true,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36odit/weed_isnt_for_everyone_sa_depression/",
            "retrieved_on": 1440723982,
            "score": 104,
            "secure_media_embed": {},
            "selftext": "Sorry for the long post\n\nSummary: Smoked a bale of weed, became socially anxious (among 100 other horrible symptoms), took a semester off from college, will hopefully be able to function when I return. \n\nI went into a tailspin in January. Until that time, my self-image consisted of an intelligent, admittedly awkward, but otherwise standard-issue, gawky white kid. Normal amounts of extroversion, if not a little more than typical. There wasn’t much to indicate my future troubles. I had night terrors when I was little. \n\nI’m not sure exactly what happened to me. Throughout my first semester of college I smoked an exponentially growing amount of weed, drank a little, and studied my ass off. Looking back, I honestly acted a little manic. I really hit the ground running, joining clubs, talking my ass off, meeting people, etc. As time went on I found some great friends and smoked a lot of weed, as much as I could and still make good grades. \n\nI stopped playing frisbee and writing for the school newspaper. I probably knew that my level of fucks given correlated negatively with the amount of weed I was smoking, but I was having a fucking blast. I always smoked with two guys who are some of the highest quality human beings I’ve ever had the fortune to meet. \n\nBy December, every time I got high was miserable. Smoking weed gave me so much anxiety that I was afraid to move or speak. I felt like I was getting much higher than my friends. I definitely couldn’t function while high as well as them. Neurotic thoughts spilled over into my sober time. By the end of the semester I felt like I was losing my mind. I was worried that I would hear voices any day, that my friends would abandon me, that people were looking at me and judging me. I had a couple of panic attacks when I texted my friends and they didn’t text back immediately. Whenever that happened, I would just lay in bed and stare at the wall. I stopped exercising and eating well. I stopped leaving my room, except to smoke with my fellow stoners. \n\nI gritted my teeth and focused on getting through finals. The times that I couldn’t avoid going to the cafeteria were hellish. I didn’t want to sit with people or have them look at me. I was extremely self-conscious. If that sounds cute or manageable at all, you haven’t been anywhere near as self-conscious as I was. It was like all of my thoughts turned inward and negative. I couldn’t think of a single redeeming quality I had. I experimented with cutting myself, but didn’t find any relief from it. \n\nI got through finals by the skin of my teeth. I think I probably drank three pots of coffee a day (or about 12 cups) and smoked every night. \n\nWinter break was tough. I smoked a couple of times and it was absolutely horrible. I quit smoking weed on New Year’s day and couldn’t sleep. When I could, my dreams were incredibly vivid. I went over to an old friend’s house and literally could not understand a board game that his family played at dinner (they were a household of engineers, bless them). I couldn’t speak and play halo at the same time. My friend, who is a great guy but probably isn't as intelligent as I am, started making fun of me saying “umm” so much, then actually got a little annoyed with me. I was terribly worried that I was becoming retarded, that I had accidentally smoked something in the prior semester that had given me brain damage (I didn’t). I had some suicidal thoughts, but they never got very bad. I spent long periods of time in front of mirrors due to a channel of twisted thoughts related to my self-consciousness. \n\nI went back to college for a week. My friends were incredibly supportive when I told them I didn’t want to smoke anymore, but my condition still wasn’t improving. I couldn’t get my thoughts organized enough to buy books from the bookstore or understand my readings. I couldn’t speak to people without feeling as if I was in front of a gun. I couldn’t even walk past people in the hallways without feeling as if I was moving awkwardly. I called my parents and they made the 17 hour drive at, I was told, on average 95 miles an hour because they thought I was going to kill myself. \n\nToday is May 20th, and I have made a lot of progress. I found a psychiatrist that is extremely objective. She prescribed me Paxil (an SSRI antidepressant) in February because some of my symptoms sounded obsessive-compulsive to her, and I agree. It nuked my anxiety and depression, but made me very drowsy and didn’t quite make me feel comfortable around people again, so I recently switched to Lexapro (another SSRI). I’ve written a couple of articles for local magazines and feel as mentally sharp as ever. I’ll go back to school in August and take another swing at it. I haven’t smoked weed except once since January. My goal is to get to where I can feel comfortable hanging out with acquaintances, at minimum. Strangers still spook me. \n\nI shared all of this to let people who are going through similar situations have some perspective and to know that anxiety and depression are very treatable. While December and January were gray, dead months for me, my life is at least worth living now. I think weed is an amazing and excellent drug, but ask your parents what your family’s incidence of mental illness is before you try any drugs. It turns out that most of the adults in my family are fucked up somehow. And if your highs start to become miserable, give it a rest. I’ll never smoke again because I very strongly suspect weed is worse for people with social anxiety than almost anyone else (a theory I developed during long periods of anxiety driven research, sorry but I don’t have links). \n\nIf you have thoughts in response or questions, feel free to PM me, I get on reddit about once a week. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Weed Isn't For Everyone (SA, Depression)",
            "url": "http://www.reddit.com/r/Anxiety/comments/36odit/weed_isnt_for_everyone_sa_depression/"
        },
        {
            "author": "Nine-Inch-Nipples",
            "author_created_utc": 1418414236,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jz8rr",
            "created_utc": 1431709120,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/362tnh/need_to_break_it_to_a_couple_that_their_wedding/",
            "gilded": 0,
            "id": "362tnh",
            "is_self": true,
            "media_embed": {},
            "num_comments": 43,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/362tnh/need_to_break_it_to_a_couple_that_their_wedding/",
            "retrieved_on": 1440734217,
            "score": 100,
            "secure_media_embed": {},
            "selftext": "I shoot wedding videos for a living. Generally when I shoot a wedding video; I come home and unload it onto my external hard drive and then when I get around to it I upload it to dropbox. However...in the case of a recent harddrive crash, I hadn't gotten around to backing up that specific wedding yet. The data recovery lab said all data is corrupted/fragmented, so there's officially nothing I can do now but refund them. \n\nThe primary issue is...I don't know how to break it to them. I have depression and anxiety issues enough as it is; and hearing backlash from someone about something like this that's important to them...is something I can't handle to be honest. One of the points I figure I'll make is \"At the very least, you have your photos, which is what most couples stick with anyways, having video as a secondary option\". I'm really broken up about this...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Need to break it to a couple that their wedding footage I shot...is gone.",
            "url": "http://www.reddit.com/r/Anxiety/comments/362tnh/need_to_break_it_to_a_couple_that_their_wedding/"
        },
        {
            "author": "grill212",
            "author_created_utc": 1431805467,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nige6",
            "created_utc": 1431806002,
            "domain": "self.Anxiety",
            "edited": 1431883882,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3670x7/22_year_old_black_guy_whose_a_nervous_wreak/",
            "gilded": 0,
            "id": "3670x7",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Help",
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3670x7/22_year_old_black_guy_whose_a_nervous_wreak/",
            "retrieved_on": 1440732197,
            "score": 85,
            "secure_media_embed": {},
            "selftext": "I've been teased throughout highschool for not being a typical black person, which has led me to be a much more quiet person. I feel like everything I do, from the way I talk to the way I do things, my hobbies etc. all have to seem like something black people would do in effort to not get ridiculed. It has led me to a lot of trust issues, and not being able to let someone know everything about me. \n\nAs a result my social skills suck so much. I cannot approach girls with the purpose of getting to know them at all. I cannot approach acquaintances in public because I feel anxious. \n\nI also feel very stupid in front of my friends. Many of them know common things like music, geography, kinds of beer. I can't contribute to those kinds of conversations which makes me feel so inferior and stupid. I feel like my friends think I'm retarded because  I don't know common things. I just graduated university with a computer science major, but always feel like a dumbass.\n\nPlease help me find a way to let all this shit go, so that I can stop feeling anxious and be more sociable. I want to be a person who everyone enjoys talking to, not the nervous wreak who mumbles.\n\nEDIT1: Wow everyone thank you so much for the advice. I realize that I'm not as alone as I thought. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "22 year old black guy whose a nervous wreak, please help",
            "url": "http://www.reddit.com/r/Anxiety/comments/3670x7/22_year_old_black_guy_whose_a_nervous_wreak/"
        },
        {
            "author": "stupidlyparanoid",
            "author_created_utc": 1431182921,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ndk8q",
            "created_utc": 1431980722,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36epgn/extreme_feeling_of_dread_as_if_everything_is/",
            "gilded": 0,
            "id": "36epgn",
            "is_self": true,
            "media_embed": {},
            "num_comments": 24,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36epgn/extreme_feeling_of_dread_as_if_everything_is/",
            "retrieved_on": 1440728553,
            "score": 64,
            "secure_media_embed": {},
            "selftext": "Basically what the title says. I've felt similar things before, as I'm sure many people have, but never this intense. It feels real. It feels like there's no way the future is possibly going to be okay. My chest feels so tight and heavy. Has anyone else experienced this and come out the other side?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Extreme feeling of dread, as if everything is ruined and something unbearably terrible is about to happen.",
            "url": "http://www.reddit.com/r/Anxiety/comments/36epgn/extreme_feeling_of_dread_as_if_everything_is/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431642814,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/35zx09/if_you_have_hypochondria/",
            "gilded": 0,
            "id": "35zx09",
            "is_self": true,
            "link_flair_css_class": "healthflair",
            "link_flair_text": "Health",
            "media_embed": {},
            "num_comments": 41,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/35zx09/if_you_have_hypochondria/",
            "retrieved_on": 1440735573,
            "score": 63,
            "secure_media_embed": {},
            "selftext": "... Don't wander into the r/AskReddit thread about what kinds of symptoms you should never ignore. I made the mistake of going in there and I've been stressing out about what undiagnosed ailments I probably don't have. \n\nAfter my husband got home, he reassured me that my normal bloodwork from earlier this year and tendency to bruise easily my whole life meant I probably don't have leukemia. \n\nHas this happened to anyone else today? :) I know it felt better when I talked through my irrational fears, so if anyone else is feeling the same feel free to share!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "If you have hypochondria...",
            "url": "http://www.reddit.com/r/Anxiety/comments/35zx09/if_you_have_hypochondria/"
        },
        {
            "author": "Trollohunter",
            "author_created_utc": 1325105128,
            "author_flair_css_class": "",
            "author_flair_text": "MDD/Panic Disorder",
            "author_fullname": "t2_6j63n",
            "created_utc": 1431893191,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36akiw/called_a_hotline_yesterday/",
            "gilded": 0,
            "id": "36akiw",
            "is_self": true,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36akiw/called_a_hotline_yesterday/",
            "retrieved_on": 1440730543,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "Yesterday I had the worst panic attack of my life. I had never considered suicide so seriously before. If you told me I had to do that for even a week straight I would rather blow my brains out. Called a hotline for the first time in a while. A nice women attempted to calm me down through my sobbing. She told me that I should go lay down/get water etc.. but I couldn't stop crying enough to even open my eyes. After a little more of this she literally just said \"well, you can do it. Im going to hang up now\". I felt so scared I tried to keep her on the line but she just hung up. This made me feel so upset. My last resort for when I feel suicidal just left me in the dark. I sat there crying for 30 more minutes before I was able to calm myself down and get up. It felt so awful. I NEVER want to experience that again. Im afraid for the future. Im afraid of life. I don't know if I can continue to exist if this is my reality I have to face.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Called a hotline yesterday",
            "url": "http://www.reddit.com/r/Anxiety/comments/36akiw/called_a_hotline_yesterday/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1432167850,
            "domain": "themighty.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36p2y8/31_secrets_of_people_who_live_with_anxiety/",
            "gilded": 0,
            "id": "36p2y8",
            "is_self": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36p2y8/31_secrets_of_people_who_live_with_anxiety/",
            "retrieved_on": 1440723655,
            "score": 55,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "31 Secrets of People Who Live With Anxiety",
            "url": "http://themighty.com/2015/05/31-secrets-of-people-who-live-with-anxiety/"
        },
        {
            "author": "summeresc",
            "author_created_utc": 1431877934,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nixqa",
            "created_utc": 1431878317,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/369s12/how_do_i_stop_torturing_myself_with_comparing_my/",
            "gilded": 0,
            "id": "369s12",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Help",
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/369s12/how_do_i_stop_torturing_myself_with_comparing_my/",
            "retrieved_on": 1440730912,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "To break it down, I have 1-0 friends, no social life and generally very behind compared to my peers. I deal with GAD and I over think everything and have a hard time just \"getting out there\". I love torturing myself with looking at other peoples instagrams etc. and see how well they're doing compared to me. I know that it's social media and people generally choose to show what's nice etc. but I can't help but notice that the people I see do have friends, something going for them and a general social life. I've never been to a party my entire life.\n\nI have a facebook user but I don't use it, I maybe go on there for 2 minutes or 1 minute one time every second week. Facebook often makes me break down because it makes me notice a thing I haven't been invited to and so on and on. \n\nI know it's somehow my own fault that I'm not getting anywhere in life because I have a hard time getting it on with other people and such but it's just a vicious cycle.\n\nAny help, tips and maybe similar experiences would be nice. Thank you. :)",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "How do I stop torturing myself with comparing my life to other peoples lives? (Help)",
            "url": "http://www.reddit.com/r/Anxiety/comments/369s12/how_do_i_stop_torturing_myself_with_comparing_my/"
        },
        {
            "author": "throaway1914",
            "author_created_utc": 1431939832,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_njfne",
            "created_utc": 1431948055,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36cwi5/turned_21_still_feel_like_a_child_xpost_from/",
            "gilded": 0,
            "id": "36cwi5",
            "is_self": true,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36cwi5/turned_21_still_feel_like_a_child_xpost_from/",
            "retrieved_on": 1440729455,
            "score": 50,
            "secure_media_embed": {},
            "selftext": "So, the 14th was my birthday and instead of living it up with my closest friends I was stuck at home playing video games with them - which isn't bad or anything to be embarrassed about. The thing is, I go to community college while all my friends (only have a handful besides my girlfriend) go to a good state college. I should be going into my senior year of college but I'm still at approximately sophomore year.\n\nNot to mention I can't ever hold a job because for some reason I just stop going to them after about 4-5 months. I don't know why, I just lose the urge, motive, and/or desire to go to work out of the blue.\n\nAnd this behavior is not just limited to work; school is another issue. It's the same pattern. Go to class first month or two and do well. Get A's and B's on assignments and tests. Then, out of the blue, I lose motivation and skip/slack off and play video games instead or just waste time in general. My lack of discipline, drive, and willpower have been reoccurring themes in my life and I've almost come to accept and welcome them as a normal part of my life. Which is wrong, so very very wrong. As a result of these habits I've become extremely depressed.\n\nOne saving grace is that I may have an attention disorder which explains my spotty attendance and lackadaisical behavior. But when I went to do an assessment the psychiatrist basically told me to go somewhere else and talk to a different person as he would not help me. (A fucking doctor told me this!) So I've been pretty put off of seeking professional help unless someone is willing to PM me and lives in the Northern Virginia area to give me a personal recommendation to a doctor, therapist, or social worker who will hear me out.\n\nIn case you've made it this far and are willing to keep reading: I'll provide some context and background on myself.\n\n* When I was 9 my father got sick and could not work any longer.\n* He passed away when I was 10 1/2.\n\nMy dad was not neglectful or mean, but was always busy so I never got to really talk to or learn who he was. I only have the word of others to paint the picture of who he was (a great man).\n\nAs a result, and due to my brothers having to quit high school and college respectively to work in the family business, I had no proper male figure in my life to help me. No values of hard work, a set schedule, or drive to get things done was instilled in me. Now, it is kind of a cop-out to blame my father's death and refuse to grow up, and I've thought of that plenty of times too but I just can't get out of this funk I've essentially been in for a decade.\n\nI try every year really hard, but I just end up making a mistake and then feeling like the world around me is caving in and everything I've done is all for naught. On the rare occasion when I do own up to my mistakes or fuck ups and try to make things right: I am plagued by severe social anxiety about what my peers, superiors, friends, or even family members will think about me when they find out I've failed and am in the process of fixing my mistakes. \"Oh, he did it again.\" \"Typical throaway1914,he always makes the same mistakes.\" \"What is wrong with him?\"\nI know I have serious issues and problems, and I really want to fix them, I just don't know how and struggle with depression, anxiety, and an addiction to competitive video gaming.\n\nAt least you'd think I'd find solace in being a really good player at this video game, but alas I may be in the 99th percentile of the player base, but I am still not famous, recognized, or even \"that good\" to make a splash into the professional scene. Nor do I want to be known as a pro gamer, it's just a hobby, nothing more. I want to have a life where I can actually benefit others and help them with real, serious issues and problems in their lives - but I can't do that if I can't even finish community college.\n\nI don't even know what I am looking for posting this... But it is sort of relieving to put it all out there even if it is anonymous and no one will likely read this or care too much. Although, if you or someone you know has been through a similar ordeal PLEASE PLEASE PLEASE tell me what steps you took to better yourself or improve your situation. It would mean a lot to hear of someone digging themself into a hole like I have and crawling their way out of it.\n\nTL;DR I have anxiety, a gaming addiction, and depression due to the aftermath of a ruined childhood by my father's passing when I was an adolescent.\n\nI forgot to mention that although my friends and family are aware of my predicament, however I consistently lie or tell them half of the truth about my situation. I don't want them to worry about me, but paradoxically will lie to them and try to do better, but end up making my problems worse, and then in the end they're even more pissed/disappointed because I lied and the end result of my efforts is just a steaming pile of shit.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Turned 21, still feel like a child [X-Post from r/depression]",
            "url": "http://www.reddit.com/r/Anxiety/comments/36cwi5/turned_21_still_feel_like_a_child_xpost_from/"
        },
        {
            "author": "mag_cue",
            "author_created_utc": 1286142447,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4edkz",
            "created_utc": 1431915131,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36boyl/does_anybody_else_hate_hearing_heartbeat_sounds/",
            "gilded": 0,
            "id": "36boyl",
            "is_self": true,
            "link_flair_css_class": "deaflair",
            "link_flair_text": "DEA Questions",
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36boyl/does_anybody_else_hate_hearing_heartbeat_sounds/",
            "retrieved_on": 1440730019,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "It always makes me hyperaware of mine and sometimes causes me to freak out a little bit as it always quickens my pulse.\n\n\nWondering if this is a pet peeve for anybody else. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anybody else hate hearing heartbeat sounds in movies, songs, etc?",
            "url": "http://www.reddit.com/r/Anxiety/comments/36boyl/does_anybody_else_hate_hearing_heartbeat_sounds/"
        },
        {
            "author": "bluestocking_16",
            "author_created_utc": 1320740259,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_67cd9",
            "created_utc": 1432129271,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36mgiu/my_intolerance_of_uncertainty_is_the_root_cause/",
            "gilded": 0,
            "id": "36mgiu",
            "is_self": true,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36mgiu/my_intolerance_of_uncertainty_is_the_root_cause/",
            "retrieved_on": 1440724876,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "Does anyone have any words of advice and wisdom to overcome the fear of not knowing? Mine is so bad and ridiculous that I can't even watch a movie or TV show, or read a book without knowing the ending. I just can't stand not knowing... To me the only way I can control things from spiralling into a massive anxiety clusterfuck is to have some sort of guarantee. I know this type of thinking is faulty as there are no guarantees and 100% certainties in life, but still this doesn't stop my brain of being afraid.   ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My \"intolerance of uncertainty\" is the root cause of my GAD",
            "url": "http://www.reddit.com/r/Anxiety/comments/36mgiu/my_intolerance_of_uncertainty_is_the_root_cause/"
        },
        {
            "author": "goodatstupidthings",
            "author_created_utc": 1410743076,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_iej70",
            "created_utc": 1431774110,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/365mu5/anybody_else_have_anxiety_related_to_throwing_up/",
            "gilded": 0,
            "id": "365mu5",
            "is_self": true,
            "link_flair_css_class": "deaflair",
            "link_flair_text": "DEA Questions",
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/365mu5/anybody_else_have_anxiety_related_to_throwing_up/",
            "retrieved_on": 1440732906,
            "score": 47,
            "secure_media_embed": {},
            "selftext": "I get so nervous about throwing up that I make myself feel like I am going to throw up. It only comes up at times that throwing up would be really bad(In public, before work, when I need to get something done)\n\n Its not so much about the puking then it is about me getting sick. I just hate the idea of being out for the count for a couple days due to a sickness. Got a really bad stomach bug earlier this year that I had to go to urgent care for and that really didn't help(I've been dealing with this way before that though) \n\nUsually I can avoid it by being really proactive about what I eat and when I eat it. Unfortunately I had to eat right before I went to bed so now I am awake at 5 am feeling shitty due to indigestion and my anxiety blew it up into deaf con 5 nausea mode.\n\nThere was period in my life where I got rid of this anxiety by drinking a lot and realizing puking isn't that bad. Now its more about being sick and not being able to fulfill certain responsibilities because of said sickness. \n\nI was wondering if anyone else had this issue and had any ways of coping? Things I do are, watching when and what I eat, avoiding caffeine, anti nausea medicine(Works wonders) Acid re flux medicine, tums, and cold water. I also like to go on walks outside because for some reason puking outside feels more safe than in a confined bathroom.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anybody else have anxiety related to throwing up that leads to a viscous cycle?",
            "url": "http://www.reddit.com/r/Anxiety/comments/365mu5/anybody_else_have_anxiety_related_to_throwing_up/"
        },
        {
            "author": "Jpro124",
            "author_created_utc": 1358624955,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_aae9i",
            "created_utc": 1431646462,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36041a/dae_have_high_anxiety_before_bed_and_waking_up_to/",
            "gilded": 0,
            "id": "36041a",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36041a/dae_have_high_anxiety_before_bed_and_waking_up_to/",
            "retrieved_on": 1440735482,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "It seems as soon as I hit the pillow, my anxiety shoots up. Also, the minute I wake up in the middle of the night, I have an anxiety attack.  I just got broken up with and will be moving into my own place, alone. Any tips on how to help stop dreaming and thinking about my ex?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE have high anxiety before bed and waking up to attacks?",
            "url": "http://www.reddit.com/r/Anxiety/comments/36041a/dae_have_high_anxiety_before_bed_and_waking_up_to/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431988768,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36f7xl/does_anyone_else_get_obsessed_with_things/",
            "gilded": 0,
            "id": "36f7xl",
            "is_self": true,
            "link_flair_css_class": "deaflair",
            "link_flair_text": "DEA Questions",
            "media_embed": {},
            "num_comments": 17,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36f7xl/does_anyone_else_get_obsessed_with_things/",
            "retrieved_on": 1440728313,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "I feel like I get obsessed with silly things and until it's resolved I feel anxious about it. For instance, I had wanted a leappad for my daughter. Once I had the idea I wanted it, I was obsessed with it until we finally bought one. Like, I had a consistent nagging feeling until we paid and then it was instant relief. At the moment it's a certain baby carrier I've been wanting, and we can't afford it at the moment. I know I don't need it and I already have one, but my brain is just stuck. My husband says it's just bc I'm a SAHM and my brain has nothing better to do, but I really feel like it's my anxiety doing this to me. These were just two specific instances I can think of, but it's been going on for as long as I can remember. Sometimes it's silly things I want or sometimes it's certain thoughts. \n\nDoes anyone else have this same issue? Any recommendations for getting the brain \"unstuck\"? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Does anyone else get obsessed with things?",
            "url": "http://www.reddit.com/r/Anxiety/comments/36f7xl/does_anyone_else_get_obsessed_with_things/"
        },
        {
            "author": "bhoyay7",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431900779,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36az38/if_someone_tells_you_to_breath_deeply_maybe/",
            "gilded": 0,
            "id": "36az38",
            "is_self": true,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36az38/if_someone_tells_you_to_breath_deeply_maybe/",
            "retrieved_on": 1440730354,
            "score": 29,
            "secure_media_embed": {},
            "selftext": "breath deeply, in out, in out, again, again...i tried it that way for years and never once did it calm me down..if anything, it made things worse....ok it might have helped for 2 minutes during the forced breathing to an extent but the anxiety itself would just gradually or rapidly increase soon after.....\n\nthen i tried it a different way...'observing the natural breath'...or listening to the natural intake and outtake of your breathing....for me, not only did it calm me down, but it was incredibly relaxing...i got into that practice for a long time and each time i did it, i always felt the same..relaxed..\n\nits definitely worth giving it a go...after all, we are always breathing, but never really notice it....try it, just sit and breath....if you get anxious or have excessive thinking, then gently go back to observing your breath again...the more you practice the easier it will be to 'get back' to your breath..\n\nsome might call this technique 'meditation'....but who cares about that stuff when you feel like crap?....you can look up that stuff later if you found the technique helpful right?...\n\nhope this helps abit...anxiety can be beaten, just takes practice with the breathing and a few other realisations that happen naturally once you get the 'observation' part...gl guys ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "if someone tells you to breath deeply, maybe consider this instead.",
            "url": "http://www.reddit.com/r/Anxiety/comments/36az38/if_someone_tells_you_to_breath_deeply_maybe/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1432127682,
            "domain": "self.Anxiety",
            "edited": 1432140209,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36mdf9/so_im_asking_someone_out_later_today/",
            "gilded": 0,
            "id": "36mdf9",
            "is_self": true,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36mdf9/so_im_asking_someone_out_later_today/",
            "retrieved_on": 1440724916,
            "score": 24,
            "secure_media_embed": {},
            "selftext": "So yeah, not much to say here. I'm gonna ask this girl out later cause we've been talking a lot and there might be a connection there. Or not. I'm freaking out internally and I feel on edge but I gonna force myself to do it. Wish me luck.\n\nI will update later if anyone even sees this\n\nEdit 1: Thanks for the support everyone! I will update with results in ≈ 2 hours\n\nEdit 2: Well, this is the top post on /r/anxiety now... Results on the way in like an hour\n\nEdit 3: Haha.... Yeah I didn't do it. There's still a chance though so I might make another post later tonight",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "So I'm asking someone out later today...",
            "url": "http://www.reddit.com/r/Anxiety/comments/36mdf9/so_im_asking_someone_out_later_today/"
        },
        {
            "author": "Foxrightleft",
            "author_created_utc": 1432073861,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nkkm2",
            "created_utc": 1432074308,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36jtgp/im_dying_inside/",
            "gilded": 0,
            "id": "36jtgp",
            "is_self": true,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36jtgp/im_dying_inside/",
            "retrieved_on": 1440726168,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "My anxiety is consuming me to the point of total blankness. I can't even put into words how hopeless I feel. On the surface my life is great. At this point I don't know what to change in order to fix things. I'm on meds, maybe that prevents extreme panic, maybe it's not doing anything. It's so hard to imagine life getting better because I don't know what \"thing\" (tangible or intangible) I'm lacking. I'm at a complete loss. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm dying inside",
            "url": "http://www.reddit.com/r/Anxiety/comments/36jtgp/im_dying_inside/"
        },
        {
            "author": "DaRepublic",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431782182,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/365vyb/fucked_up_hugely_at_work/",
            "gilded": 0,
            "id": "365vyb",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/365vyb/fucked_up_hugely_at_work/",
            "retrieved_on": 1440732788,
            "score": 21,
            "secure_media_embed": {},
            "selftext": "I fucked up hugely at work.  Don't want to say what it was but this could get me fired and humiliated.  I have the weekend to think about it and then go back in on Monday and try to scramble(?) and possibly fix the damage.  So I'm on edge right now.  And yes this is objectively a fuck up not just in my imagination.  Just throwing this out there.  Thx guys ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Fucked up hugely at work ....",
            "url": "http://www.reddit.com/r/Anxiety/comments/365vyb/fucked_up_hugely_at_work/"
        },
        {
            "author": "Kristinl1281",
            "author_created_utc": 1399060887,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_geh8l",
            "created_utc": 1431655265,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/360kc6/there_is_a_life_after_anxietyor_should_i_say_with/",
            "gilded": 0,
            "id": "360kc6",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/360kc6/there_is_a_life_after_anxietyor_should_i_say_with/",
            "retrieved_on": 1440735270,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I haven't posted in 9 months, and 9 months ago I was a mess, and 15 months ago I was a non-functioning bag of nerves. I've wanted to write this for a long time, but was unsure how, I know those in the throws of anxiety can be triggered by those who have overcome it, but anyway here it goes:\nI've always been uptight, and have experienced mild panic attacks, however 16 months ago my whole life change. Literally in a blink of an eye. I experienced a series of consecutive and debilitating panic attacks that lasted weeks. I was in and out of the hospital, this pattern continued for about a year. I stopped going outside, being a proper mother and wife, I gave up on life, and wanted to die some days. Every day was spent in intense fear, something \"others\" don't understand. Not my friends, my family, or my husband. I couldn't eat or sleep. The one thing I did do was be proactive about getting better. I went to therapy, group therapy and a psychiatrist, I learned DBT and CBT, I practiced yoga, and learned breathing techniques. Most days I believed I would never get better. Do you know what changed it all for me? I began to believe that I was ok, and stopped fearing the fear. It sounds simple, but it was the hardest thing I've ever done. Since then I've landed the best job I could ask for, re-enrolled in a Bachelor's program, and my family moved to another state. This is not to say I am rid of the demon completely, but now it's more of a minor annoyance, one I'm grateful for. Without anxiety I never would have made the conscious decision to change my life and to challenge myself to be better.  I know that sounds crazy, and had the me a year ago read this I would've scoffed, and then gripped my already tight chest, a symptom that is long gone now. \nMy point is, every single one of us has this, we are ok, there is life beyond this out there. Anxiety does not define us. I know, I didn't believe it either at one point. Even when you don't believe in you, remember someone does, I do. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "There is a life after anxiety...or should I say with anxiety.",
            "url": "http://www.reddit.com/r/Anxiety/comments/360kc6/there_is_a_life_after_anxietyor_should_i_say_with/"
        },
        {
            "author": "dragonfyre51",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1431978101,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36ej9d/job_hunting_and_interview_advice/",
            "gilded": 0,
            "id": "36ej9d",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36ej9d/job_hunting_and_interview_advice/",
            "retrieved_on": 1440728633,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "So I'm on the job hunt. I'm managing it so far, but I have to fight myself every SINGLE step of the way. I know I shouldn't be tearing myself down, but on bad days it really feels like the most endearing trait is that people feel sorry for me. I feel like such a mess.\n\nI get stuck and can't respond when I have to call someone back or send an email, and an interview pretty much means I won't sleep or feel normal for like that entire day and the day before and after. It won't be just one panic attack but like 2 pretty bad ones and continuous low-level ones. I'm in the process of getting insurance and don't have a healthcare provider right now so meds or therapy aren't an option. Luckily I have a really supportive partner who's been helping me through it, and getting through that terrible interview has helped me get confidence for the next ones. But I've also got that fear that I'll just repeat it again, I'm finding myself avoiding even that location while I'm applying for jobs because I don't want it to happen again.\n\nThe worst part is, despite all of that crap, I know for a fact I can function in a job and do really freaking well. I work hard, I hold myself to really high standards, and I've got nothing but good feedback from people I've actually worked with. I know I can do it, I'm just having a really hard time getting in the door, and I'm trying not to discourage myself.\n\nWhat strategies do you have?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Job hunting and interview advice?",
            "url": "http://www.reddit.com/r/Anxiety/comments/36ej9d/job_hunting_and_interview_advice/"
        },
        {
            "author": "fruit_salad666",
            "author_created_utc": 1394490242,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fn4wa",
            "created_utc": 1432008963,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/36gc68/yoga_helpful_for_my_anxiety/",
            "gilded": 0,
            "id": "36gc68",
            "is_self": true,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/36gc68/yoga_helpful_for_my_anxiety/",
            "retrieved_on": 1440727792,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I started doing yoga about a week ago, and I've found my anxiety improving significantly. I also struggle with self harm and have been using it as an alternative to that. /r/yoga has links to free online classes that you can try, and if you really like it you can go out and buy a yoga mat (usually about 10 dollars). I'm not an expert but if you have any questions feel free to shoot me a message. I've just found yoga very helpful and wanted to share. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Yoga helpful for my anxiety!",
            "url": "http://www.reddit.com/r/Anxiety/comments/36gc68/yoga_helpful_for_my_anxiety/"
        }
    ]
}