{
    "data": [
        {
            "author": "kagehinas",
            "author_created_utc": 1444759085,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_r5qfa",
            "created_utc": 1447781878,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3t6jjy/for_those_of_us_whose_anxiety_never_gets_better/",
            "gilded": 0,
            "id": "3t6jjy",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3t6jjy/for_those_of_us_whose_anxiety_never_gets_better/",
            "retrieved_on": 1450655935,
            "score": 195,
            "secure_media_embed": {},
            "selftext": "So does anyone else struggle with the advice to “face your fears/anxieties because once you actually experience them, you’ll realize that it isn’t so bad? And it’ll get easier!” Because whenever I try to do this, it actually *is that bad*. And it never gets easier for me. This pretty much applied to me all through schooling, like I had a lot of anxiety about tests but I took them anyway and did well, yet the tests never got any easier. I used to work part time in food service, and it was the worst thing ever and I dreaded every day going in just as much as the first day (actually the first day was the easiest because I didn’t know what to expect). Or even something as small as posting on reddit. Okay, yeah, I’m super anxious about making this post. I’m super anxious every time I post or comment. And no matter how many times I post, that anxiety is just as strong as the first time.\n\nMy therapist told me something useful about this today that I wanted to share with the rest of you if you have a similar problem as I do. Like, anxiety about stuff you haven’t experienced before is normal. Usually, when people experience it, they then notice that it’s not so bad, and then next time, they’re not as anxious. This is why for people without anxiety disorders, telling them to “face their fears!!” can be helpful.\n\nBut when you face that anxiety over and over and it never gets any easier, it kind of becomes a problem. Our problem. And we suffer for it, and people without anxiety don’t understand us and get confused. Which is why a lot of anxiety “advice” about “just suck it up” doesn’t work well for some people, or just makes it worse.\n\nSo, apparently the reason it never gets any easier is because we have this problem where we keep reinforcing our own anxiety. It’s not because we *want* to be anxious; heaven knows anxiety is the bane of our existence. For whatever reason, though, our brains have learned to create this go-to place to blame ourselves whenever something bad happens. Chances are, we already know we’re doing this. But our brain is a lot more powerful than we think it is, and this works in both helpful and non-helpful ways. Fortunately, we can change our brains because they’re really powerful! Unfortunately, since we’ve been used to this our whole lives, it’s going to take just as long or maybe even longer to change that train of thought.\n\nFor example, one of my go-to places is this automatic thought process that I’ve been using my whole life: I’m disappointing people. Say I go to work one day dreading it, thinking, “Oh god, I’m going to fail. I’m going to screw up, the customer is going to yell at me, my boss is going to yell at me, and I’m going to disappoint everyone. I’m going to be anxious the whole time.” So I go into work, I stand there being anxious the whole time. We get customers, I continue being anxious. I make drinks and because I’m super anxious, I forget the recipe and have to look it up. We get more customers. I’m a little slow, but otherwise okay. I get anxious about all the waiting customers. This goes on for 3 hours. I end work, feeling super relieved. Instead of thinking, “that wasn’t so bad,” I think, “Wow. That was absolutely terrible. I basically failed, I made all those customers wait, I forgot the recipe, and I’m never going to remember it. And on top of it all I just stood there with 3 hours of anxiety and it was the worst thing ever.” Or something along those lines. Even if I do try to make myself think, “that wasn’t so bad,” it’s pretty much impossible because I’m lying to myself and I know it. Okay. Phew. Even typing that out gave me horrible flashbacks to that food service job, and I’m starting to get anxious again.\n\nThis go-to place was somehow learned in childhood to deal with certain things: maybe it kept me emotionally safe from parents or siblings or whatever, but now it’s causing us a lot of grief and anxiety and is not helpful anymore. But we still use it because it’s the only thing we’ve learned. We get caught up in this spiral of negative thoughts and think either 1. We are caught in the negative thoughts and can’t do anything about them; or 2. We must resist the negative thoughts as much as possible.\n\nThe first option is kind of what we’ve been doing our whole lives, which worked up to a point where.. it didn’t work anymore. Now we’re on our own, and the good thing is, there’s no one there to to tell us, “It’s your fault, you better be sorry, look what you’ve done.” The bad thing is, when we say it ourselves, there’s no one there to tell us, “It’s okay, I forgive you, it was just an accident.” We’re just left believing that it *is* our fault and then just feeling shitty about ourselves.\n\nThe second option still leaves us at the mercy of the negative thoughts: we spend all our energy trying to resist them, and when we fail, it reinforces the first option: we’re just stuck here and can’t do anything about it. *Plus* we’re a failure for even having them in the first place, they’re all in our heads, they’re “fake”, so why is it so debilitating? And then we punish ourselves more ): (btw, anxiety is *not* fake. All your thoughts and emotions are real and valid.)\n\nMindfulness is something I’ve learned about hundreds of times in DBT, CBT, family therapy, etc etc. But sometimes the way it’s explained is kind of abstract and difficult to apply to real life. The bare bones of mindfulness is that it’s the skill of noticing or being aware of your own thoughts.\n\nI guess the strategy I learned today is very similar to mindfulness. When this spiral of thoughts starts happening, instead of becoming entirely engulfed by them or struggling to resist them, try to *just notice them*. My therapist told me to try to think: “Oh, there are those negative thoughts again,” as if you’re standing on a shore, watching a raging river. Part of you might still feel like you're *in* the raging river, being swept away. But the important thing is that now a part of you is also standing on the shore, watching yourself get swept away. The first step to changing something is awareness that it’s happening.\n\nWhich sounds *a lot* easier than it is. Try to think: “There I am, getting swept away by this river of thoughts.” That in itself is like throwing a branch or a rock into the river, slowing it down just a tad bit. Try not to think about stopping it all at once, because it’s way too difficult and way too raging. After all, you’ve spent [insert your age here] years making that river faster and faster, not because you chose to, but just because of circumstances.\n\nI’ve heard this a ton of times. I’ve *tried* this a ton of times, and kept getting discouraged when I wasn’t able to do it.\n\nBut I noticed another thing that helped me today: I get this raging river of negative thoughts *a whole heck of a lot*. Almost every time I interact with a living being, the river starts raging. That sounds familiar. Whenever I interact with living beings, I get anxiety, too. I realized, wow I have *a lot of anxiety*. It’s really shitty. My therapist has been pointing this out to me for like a year.\n\nAnd right when I noticed this today, coupled with my therapist’s advice, I actually felt…a teeny bit hopeful. I noticed that, well, since it happens so much, it doesn’t matter if I succeed at noticing the river every single time. *It’s okay not to notice it every time*. The good part about having such debilitating anxiety (lol I know right) is that this raging river happens probably once every 10 minutes or more. So if you miss out on noticing it once, welp, it’s fine because it’ll probably happen again in the next 10 minutes. ಠ_ಠ\n\nThen, I began to think of it as a game. I began to look forward to my anxiety, just a tiny bit. I told myself, every time I notice that spiral, I’m going to give myself a pat on the back, like a point or something. I’m going to try not to punish myself for having it, or to punish myself for not being able to resist it, or think: “Oh god I’m stuck here forever.” Just noticing it washing me away. (And if I *do* start punishing myself, then there’s just another opportunity to notice it happening.)\n\nEven if you’re on the shore for only a fraction of a second, and then you’re back in that river; that fraction of a second is still a million times better than not noticing it at all.\n\nWhere we go from here, I have no idea. Changing something only works if you do it a single step at a time. And our brains are super powerful, so however old you are (I’m 21) is how long you’ve been dealing and suffering with this anxiety, which is a long fucking time. And we need patience to be able to change a thought process that has been our automatic go-to place for decades. And I’m not even sure if I’ll be able to do it, or if it’ll even work or not. Heck, I only came to this mini-realization today, and I’ve only been practicing it for… *checks watch* like an hour and a half.\n\nBut this is the first time I’ve felt hopeful for anything in a while. This is the first time I’ve actually *looked forward* to “facing my anxieties”. Because this, to me, is not really “facing them head-on” like what we assume people without anxiety disorders must do. Well, we have this disorder, and it sucks, but we have to take a different approach. And that approach starts with just experiencing the anxiety and being aware of it. Being kind and compassionate to ourselves and giving ourselves a lot of opportunities to mess up or fudge it, which is completely okay. Because every time I experience anxiety, aka the coursing river, even though it’s fucking horrible and makes me want to crawl into my bed and hide, it’s also another opportunity to notice the internal thought process that’s reinforcing it.\n\nMy disclaimer here is that for some unknown reason, I feel fucking good today. Tomorrow I might wake up feeling like complete shit and not wanting to interact with people, or apply to jobs, or think about the future, or do any of the million things that give me anxiety.\n\nBut, hey, I’ll probably punish myself (as usual) (: And then I’ll be able to notice me punishing myself, and then cheer myself on for noticing that. Which is different than trying to swim against the current and resist and struggle against my anxiety all in vain. This is what I’ve always been trying to do, and failing at it, and making things worse. Now with what I’ve learned today, I can try stepping out, watching my anxiety happen, and taking the path on the shore instead.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "For those of us whose anxiety never gets better no matter how many times we try to “face our fears”...",
            "url": "https://www.reddit.com/r/Anxiety/comments/3t6jjy/for_those_of_us_whose_anxiety_never_gets_better/"
        },
        {
            "author": "gill_outean",
            "author_created_utc": 1240372559,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3gdxw",
            "created_utc": 1447942577,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tfnvt/dae_feel_stress_and_anxiety_when_job_hunting_the/",
            "gilded": 0,
            "id": "3tfnvt",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 38,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tfnvt/dae_feel_stress_and_anxiety_when_job_hunting_the/",
            "retrieved_on": 1450651667,
            "score": 190,
            "secure_media_embed": {},
            "selftext": "I don't know what it is about searching for a job. Maybe it has to do with putting myself out there for critique and judgment? Maybe my perfectionism is preventing me from potentially sending anything out into the world that isn't *exactly* what I'd like it to be, which of course, is difficult if not impossible.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE feel stress and anxiety when job hunting? The prospect of the work itself doesn't frighten me (it excites me!), but putting together my resume, applying to postings, etc. all send my anxiety into the stratosphere.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tfnvt/dae_feel_stress_and_anxiety_when_job_hunting_the/"
        },
        {
            "author": "flamingosweatpants",
            "author_created_utc": 1403540058,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_h3lue",
            "created_utc": 1447871227,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tbp89/i_fucking_hate_when_someone_tells_me_i_just_need/",
            "gilded": 0,
            "id": "3tbp89",
            "is_self": true,
            "link_flair_css_class": "venting",
            "link_flair_text": "Venting",
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tbp89/i_fucking_hate_when_someone_tells_me_i_just_need/",
            "retrieved_on": 1450653517,
            "score": 187,
            "secure_media_embed": {},
            "selftext": "Do people really think telling someone to get over it when they're having a panic attack is actually helpful? Or that I just need to calm down? You think that's not already running through my mind along with every other little thing going on in my head at the moment? You think I WANT to feel like this or that I'm trying to keep feeling this way? Fuck you. That shit makes me so angry and only makes me feel worse. I WISH I could just turn off all this panic and these thoughts and BE calm. It doesn't work that way!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I fucking hate when someone tells me I just need to calm down and stop feeling the way I feel",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tbp89/i_fucking_hate_when_someone_tells_me_i_just_need/"
        },
        {
            "author": "BabbitandBromide",
            "author_created_utc": 1435873948,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ohs5u",
            "created_utc": 1447865275,
            "domain": "33.media.tumblr.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tb9ky/if_you_have_anxiety_take_deep_breaths_in_sync/",
            "gilded": 0,
            "id": "3tb9ky",
            "is_self": false,
            "link_flair_css_class": "relaxingflair",
            "link_flair_text": "Relaxing",
            "locked": false,
            "media_embed": {},
            "num_comments": 21,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tb9ky/if_you_have_anxiety_take_deep_breaths_in_sync/",
            "post_hint": "image",
            "preview": {
                "images": [
                    {
                        "id": "m7sJRdOSkSvGTNsS-T-j0n3uCPzBWtiqs9xHQMI0-tk",
                        "resolutions": [
                            {
                                "height": 99,
                                "url": "https://i.redditmedia.com/6RRpEQ-7NGCdzLnAFf25xDEt63V6qnTk0rNOkKIjdQs.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=e05a4c7bc66c725900ca4d5b2bde7753",
                                "width": 108
                            },
                            {
                                "height": 198,
                                "url": "https://i.redditmedia.com/6RRpEQ-7NGCdzLnAFf25xDEt63V6qnTk0rNOkKIjdQs.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=04ae48b8be2d39cb2d1fc7454428090d",
                                "width": 216
                            },
                            {
                                "height": 294,
                                "url": "https://i.redditmedia.com/6RRpEQ-7NGCdzLnAFf25xDEt63V6qnTk0rNOkKIjdQs.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=9d48043a29f1850d9afc9dd0dc01320a",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 460,
                            "url": "https://i.redditmedia.com/6RRpEQ-7NGCdzLnAFf25xDEt63V6qnTk0rNOkKIjdQs.jpg?s=95d1182d4675d5cb22bce30c746d9bea",
                            "width": 500
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1450653719,
            "score": 164,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/nlWpke5TSTld0jkgYprNYZR4K2LCtkaB88Dlzs4V9cc.jpg",
            "title": "If you have anxiety, take deep breaths in sync with this",
            "url": "http://33.media.tumblr.com/b1406ea40336dc68e5404b380c391d96/tumblr_nr5kks2QoA1tkg9nqo1_500.gif"
        },
        {
            "author": "foxydoge",
            "author_created_utc": 1397246253,
            "author_flair_css_class": "",
            "author_flair_text": "22. GAD and Panic Disorder.",
            "author_fullname": "t2_g30sj",
            "created_utc": 1448045806,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tlkr3/dae_get_nervous_counting_change_for_too_long_at/",
            "gilded": 0,
            "id": "3tlkr3",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tlkr3/dae_get_nervous_counting_change_for_too_long_at/",
            "retrieved_on": 1450648896,
            "score": 163,
            "secure_media_embed": {},
            "selftext": "This feels like such a silly thing, but I get so nervous counting change in front of people. The anxiety makes my brain function at half speed, so I count slowly and lose my place... which then makes me afraid that I am inconveniencing the people behind me or the cashier when I stand there for too long. I end up panicking most of the time and giving a ten or twenty dollar bill to the cashier, which still feels like an inconvenience!\n\nAt times, my purse has enough change in it to knock someone out if used as a weapon...",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get nervous counting change for too long at registers?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tlkr3/dae_get_nervous_counting_change_for_too_long_at/"
        },
        {
            "author": "comeondude99",
            "author_created_utc": 1447705602,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_s3pt4",
            "created_utc": 1447706084,
            "domain": "self.Anxiety",
            "edited": 1447778800,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3t2cbx/i_cant_live_with_the_fact_that_i_will_be_dead_for/",
            "gilded": 0,
            "id": "3t2cbx",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 60,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3t2cbx/i_cant_live_with_the_fact_that_i_will_be_dead_for/",
            "retrieved_on": 1450657914,
            "score": 148,
            "secure_media_embed": {},
            "selftext": "Ever since the shooting in paris, I'm wondering about the purpose of life. My life doesn't matter, I'm gonna be dead anyway. I can't live with the fact, that I'm nothing after death.\n\nI'm dealing with anxiety for over 4 years, I was feeling good for some time now, but this new thought is a whole new level. Please help!\n\nEdit: Thx for all the great replies! I really appreciate it. Already feeling way better now!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I can't live with the fact, that I will be dead for all eternity.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3t2cbx/i_cant_live_with_the_fact_that_i_will_be_dead_for/"
        },
        {
            "author": "thukui",
            "author_created_utc": 1299554953,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4xnh4",
            "created_utc": 1447650250,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3szhrc/im_going_out_to_look_for_a_job_tomorrow/",
            "gilded": 0,
            "id": "3szhrc",
            "is_self": true,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "locked": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3szhrc/im_going_out_to_look_for_a_job_tomorrow/",
            "retrieved_on": 1450659243,
            "score": 117,
            "secure_media_embed": {},
            "selftext": "i feel so nervous right now but i'm going to do it!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "i'm going out to look for a job tomorrow!",
            "url": "https://www.reddit.com/r/Anxiety/comments/3szhrc/im_going_out_to_look_for_a_job_tomorrow/"
        },
        {
            "author": "Weaksidewing",
            "author_created_utc": 1440875172,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_pygmh",
            "created_utc": 1447609816,
            "domain": "independent.ie",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3sx0x2/former_professional_rugby_player_exgaelic/",
            "gilded": 0,
            "id": "3sx0x2",
            "is_self": false,
            "link_flair_css_class": "articleflair",
            "link_flair_text": "Article",
            "locked": false,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3sx0x2/former_professional_rugby_player_exgaelic/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "KQtRjUmFctq1roXrLiuY92m2ezzOGsCLHNRbu-hXRDw",
                        "resolutions": [
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/HvDsmt_0z4vnLwNYWcuZwNDu439Sr9y7LH6VfNg-fls.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=ad26d2cec37df53736423a45cdc6cce4",
                                "width": 108
                            },
                            {
                                "height": 324,
                                "url": "https://i.redditmedia.com/HvDsmt_0z4vnLwNYWcuZwNDu439Sr9y7LH6VfNg-fls.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=75e2f8301756e212409afd4c8443c48a",
                                "width": 216
                            }
                        ],
                        "source": {
                            "height": 342,
                            "url": "https://i.redditmedia.com/HvDsmt_0z4vnLwNYWcuZwNDu439Sr9y7LH6VfNg-fls.jpg?s=1784d6f003f389017907ee39790376f5",
                            "width": 228
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1450660407,
            "score": 103,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://a.thumbs.redditmedia.com/jR6OSj2AaUJlKdtx8-iNBIsQlr98NYx-y1uGu6n56b8.jpg",
            "title": "Former professional rugby player, ex-gaelic footballer &amp; now musician, Niall \"Bressie\" Breslin gives jaw-dropping speech about his experiences about depression, anxiety, openness and stigma.",
            "url": "http://www.independent.ie/style/celebrity/celebrity-news/video-bressies-powerful-mental-health-speech-goes-viral-depression-destroyed-two-of-my-careers-30803953.html"
        },
        {
            "author": "ctwtn",
            "author_created_utc": 1393896720,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fjh8m",
            "created_utc": 1448106224,
            "domain": "healthcaresolutionsplus.org",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tomgy/a_new_smartwatch_that_detects_seizures_and/",
            "gilded": 0,
            "id": "3tomgy",
            "is_self": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tomgy/a_new_smartwatch_that_detects_seizures_and/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "5EQr3hRpPcTbFty4s6fimz8-s1hN3iMpLkAJ0occCMI",
                        "resolutions": [
                            {
                                "height": 60,
                                "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=bcebfcae307da7e639df2a2efb0bbc1c",
                                "width": 108
                            },
                            {
                                "height": 121,
                                "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=0d641ab709c704c36ba91ade2506cd49",
                                "width": 216
                            },
                            {
                                "height": 180,
                                "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1d72250182371e6172ac4b3adc8261ca",
                                "width": 320
                            },
                            {
                                "height": 360,
                                "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=35c83afae7fdceab2b76d136b6e9e962",
                                "width": 640
                            },
                            {
                                "height": 540,
                                "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=30f209dd9c89ef20805ec21c047ff6d4",
                                "width": 960
                            },
                            {
                                "height": 607,
                                "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=706130e2b91614790977c880f51fe221",
                                "width": 1080
                            }
                        ],
                        "source": {
                            "height": 675,
                            "url": "https://i.redditmedia.com/xnGO2r09cf8HFKViB9X_m2iP8MdHkUez1LQVsvASG34.jpg?s=9ea9c536483ea8942ec308433f6d4d3f",
                            "width": 1200
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1450647474,
            "score": 98,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/YjZEvej9qwspvAiYlh8ZJZxApcnV8466ES7w4hTukSE.jpg",
            "title": "A New Smartwatch That Detects Seizures and Emotional Stress",
            "url": "http://healthcaresolutionsplus.org/a-new-smartwatch-that-detects-seizures-and-emotional-stress-2/"
        },
        {
            "author": "atomic_bobomb",
            "author_created_utc": 1331947436,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_76vlf",
            "created_utc": 1447542979,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3su2hm/does_anyone_else_find_music_to_be_one_of_the_best/",
            "gilded": 0,
            "id": "3su2hm",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 45,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3su2hm/does_anyone_else_find_music_to_be_one_of_the_best/",
            "retrieved_on": 1450661786,
            "score": 68,
            "secure_media_embed": {},
            "selftext": "I am not sure if I am imagining it, but I think music is the only way I can calm my anxiety other than about two other things.  I am lucky enough to have my anxiety to cause me to shake during every waking hour.  I am constantly nervous and people comment on my shaking all the time.  There are spots where the shaking is pretty much nonexistent, but there are also times where the shaking is so bad I can't even hold a pen. I also have those amazingly fun intrusive thoughts that make me think back on that one time I did that one thing back in 2003. The only time I get reprieve from from these symptoms is when I am listening to music. Has anyone else found music to help them as well?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else find music to be one of the best ways to calm anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3su2hm/does_anyone_else_find_music_to_be_one_of_the_best/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "created_utc": 1448021540,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tk4t8/i_feel_like_i_dont_deserve_to_call_myself_a_human/",
            "gilded": 0,
            "id": "3tk4t8",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tk4t8/i_feel_like_i_dont_deserve_to_call_myself_a_human/",
            "retrieved_on": 1450649569,
            "score": 66,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "I feel like I don't deserve to call myself a human being",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tk4t8/i_feel_like_i_dont_deserve_to_call_myself_a_human/"
        },
        {
            "author": "qzapmlwxonskjdhdnejj",
            "author_created_utc": 1391973039,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_f71ux",
            "created_utc": 1447542654,
            "domain": "self.Anxiety",
            "edited": 1447580960,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3su1s3/cant_take_this_anymore/",
            "gilded": 0,
            "id": "3su1s3",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3su1s3/cant_take_this_anymore/",
            "retrieved_on": 1450661795,
            "score": 62,
            "secure_media_embed": {},
            "selftext": "Rant incoming.\n\nIm done with this shit. \nIm done laying awake every night till 4 am and waking up at 8 covered in sweat. Im done getting sick from appointments.  Im done getting sick if I need to travel. Im so fucking done.\n\nI cant even visit my girlfriend who lives 45 mins away, and I cant handle a job.\n\n\nI have a dentist appointment coming up and its killing me. Even if I try to relax is bouncing in the back of my head making sure that I keep getting ill. And the worst is the nights.\n\n\n\nGod I hate the nights. Laying awake with a feeling to puke every second. In the dark with eyes wide open feeling like complete shit.\n\n\nIt ruins me, it ruined friendships and its ruining my health. I cant even feel when I have to eat again and i cant imagine the feeling because of the stress and anxiety that follows.\n\n\n\nTbh something im ashamed of is that even when I get intimate with my girlfriend I get the flirty feeling in my stomach, but in turn that makes me ill too. My head spins everytime it happens and I get desperate for solutions in this situation. Im honestly walking with that one thought in my head to just end this shit. End the contact with everyone and just finish it off. Its also not a thought that comes just one or two times. Its spooking thro my head and it scares me but also comforts me.\n\nBeen to a doctor. Its stress,I gotta relax. I just cant. It kills me from the inside and I cant keep up anymore. Everything is failing. Im a dropout, cant get a job, canteven get my dick up and more. Its a neverending negative spiral and I cant seem to get grip on it.\n\n\nGo outside they say, go do stuff. I cant walk outside without feeling judged by everyone, without me feeling sicker every step. Its a goddamn struggle. Im a man but fuck me im crying like a bitch these last few months.\n\nIm fucking 20 why the fuck did I deserve this. I have no family to turn towards too. (People with Autism werent accepted apparently) and the few friends I got are also miserable fuckups who wont help me in anyway because they have their own shit.\n\nIm just sitting here for the last two years playing games and fighting anxiety attacks that are caused by the most stupid shit. Please someone tell me im not alone. Im really thro with this. I cant do it anymore.\n\n\nEdit: thanks everyone for the responces. This is more then I wished for and im glad yall have solutions for me. Today is another day and imma start fighting again.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Cant take this anymore",
            "url": "https://www.reddit.com/r/Anxiety/comments/3su1s3/cant_take_this_anymore/"
        },
        {
            "author": "CalmUrselfHorsethief",
            "author_created_utc": 1420660664,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kkmfq",
            "created_utc": 1448127319,
            "domain": "self.Anxiety",
            "edited": 1448132982,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tponq/heres_a_list_of_everything_that_made_a_huge/",
            "gilded": 0,
            "id": "3tponq",
            "is_self": true,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tponq/heres_a_list_of_everything_that_made_a_huge/",
            "retrieved_on": 1450646979,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "Hey guys! Ok so I've had issues with anxiety for a while, and until recently its been a 24/7 thing for me. I just wanted to share what helped me out recently because if I knew these things earlier, I would have prevented a large chunk of my anxiety.\n\n**The first 2 are cliche, but they need to be brought up**\n\n**1)** Meditation really was the first thing that got me to calm down. It was the first thing that got me to breathe normally, and it finally gave me SOMETHING to do to shut down at least part of my anxiety. Cant stress this enough.\n\n**2)** Seeing a therapist that **SPECIALIZES** in what my issues changed everything and sped up the whole process. If you have issues with addiction, abuse, whatever, it helps sooooooooooo much when you can speak with someone that actually knows about that specific problem. When they are specialized they know patterns, symptoms and thoughts associated with the topic, and they have real experience with the topic. I mean, they actually see people with your exact problems on a DAILY basis. Now I dont want to say that this is necessary, but my problems were VERY specific, and seeing a specialist helped a bunch. (you might be surprised how specific some therapists specializations are). But most importantly, find a therapist that youre comfortable with. I actually look forward to therapy because my therapist's optimism is so contagious that it gets me leaving session with a smile on my face.\n\n**Here are the weird suggestions that you probably haven't heard of**\n\n**3)** Go to a doctor if you have putting off stressful medical checkups. I know this might sound like a no-brainer, but the apathy that comes from depression paired with the paranoia that comes from anxiety, paired with poverty, can keep a person from checking out some scary shit. I say this from personal experience. I kept thinking that i was being a hypochondriac, so i kept avoiding medical check ups and this turned into me being waaaaay more anxious than I was aware of. I actually got used to the nervous feeling, so I just went about my day, being constantly stressed out. I didnt even realize how much i was stressing out until left my first appointment and felt this huge sense of relief. Then the benefits started to snowball and i actually started to lose a lot of my anxiety. Also, if youre broke like me, you might be surprised to see how much obamacare can cover. I havent paid a dime for blood tests, xrays, , prescriptions, and even MRIs. Check it out ASAP.\n\n**4)** Probiotics: So i tried posting about this a while back and i got a weak response, but basically I chug 2 cups of Kefir when im nervous and it calms be down quite a bit; sometimes to the point where I have cancelled plans to call a friend of family member to tlk about my enxiety. On a realllly bad day, ill actually race to the grocery store and buy some. It still does the trick to this day. if you want to try it out, just drink it in the morning before you eat and let it do its work. You arent supposed to drink if after eating, but ive done it regardless and it has helped a bunch. It actually makes me FEEL calm, rather that feel less anxious.\n\n**5) This one is time sensitive and it really depends on where you are at with your mental health. I dont think everyone should do this, but if therapy has made you comfotable with your depressive or anxious thoughts, then you should try this out. TO CLARIFY: This is not a healthy suggestion if you still experiencing continuous thoughts of self harm because sometimes it is good to stay distracted.** \n\nInternet: I had to stop hours of impulsively going on the internet. It had my mind racing, and because of reddit, i was spending a long portions of my daying thinking intensly and constantly reading about international news. I know this might sound obvious but I dont think our brain is deisgned to look at post after post after post of ISIS, global warming, etc. I also think it isnt designed to experience hours of cats posts, funny videos, and comment section debates. It really takes a toll and it prevents you from calming down. Now I dont think everyone has this problem, but if you do feel like you IMPULSIVELY go on reddit for hours at a time just  this can really make an impact. Try just sitting down with out tv or internet and just let your thoughts go loose. Trying this out calmed me down a ton. It is important to note that I can only do this now because my depression has calmed down enough to where I can enjoy my own thoughts, rather than be stressed out by them. My brain fog has also gotten a lot better.\n\n**6)** This last one is kind of silly but I noticed that looking at artbooks when im anxious helps. It feels like it gives my thoughts a place to go and it really helps when im thinking a mile a sec because now I have something that I can analyze and it gives me a safe place to think.  Now this might just work for me, but it actually does the trick and it actually calms me down enough to the point where I end taking a nap lol.\n\nAnyways so thats the list. Hope some of this helps someone!\n\nTL;DR\n1) Meditation\n2) Seeing a therapist that specializes in your situation\n3) Go through with delayed doctors visits\n4) Probiotics\n5) (Can't TLDR due to disclaimer)\n6) Artbooks\n\nEdited for formatting and TL;DR",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Here's a list of everything that made a huge impact on my anxiety. Hope this helps!",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tponq/heres_a_list_of_everything_that_made_a_huge/"
        },
        {
            "author": "makingthemesses",
            "author_created_utc": 1447033910,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_rv329",
            "created_utc": 1447851775,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tafsv/a_panic_attack_is_like_an_annoying_neighbor/",
            "gilded": 0,
            "id": "3tafsv",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tafsv/a_panic_attack_is_like_an_annoying_neighbor/",
            "retrieved_on": 1450654117,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "\"Just try to remember, a panic attack is like an annoying neighbor. You dread hearing the knock on the door, but their visit is short, and it won't kill you.\"\n\nI have been going through some kind of hell, and my mom had that to say. Makes a lot of sense and I hope it can help someone else, too.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "A panic attack is like an annoying neighbor...",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tafsv/a_panic_attack_is_like_an_annoying_neighbor/"
        },
        {
            "author": "Corerunner",
            "author_created_utc": 1447532665,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_s1bou",
            "created_utc": 1447648910,
            "domain": "self.Anxiety",
            "edited": 1447817134,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3szfak/my_daughters_depression_anxiety/",
            "gilded": 0,
            "id": "3szfak",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3szfak/my_daughters_depression_anxiety/",
            "retrieved_on": 1450659275,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "Long time Reddit viewer, but this is my first post---\n---not for myself, but for my daughter, because I'm trying everything I can to help her and reach out to her. To help her see that life is worth living, even when it doesn't feel like it.\n\nMy daughter, Ellison, is currently in a treatment center for out of control depression and anxiety that reached a point that she wanted to take her own life.\n\nI never imagined when I held her as newborn that my heart would ache so deeply and that I would feel so powerless to help her.\n\nMy wife and I are trying everything we can to help, encourage and support her. But we fear, that so often is the case, that the words of a parent are discarded or unheard.\n\nAs I try to keep the rest of my family positive, I keep pushing my brain to look for other ways to reach my daughter. This morning I thought of some of the wonder ways that Reddit users have reached out to support others in this community. While I don't think I would ever reach out for myself, I know I would try anything to help my daughter.\n\nSo if you have a minute today, or in the coming days, could you write a note of encouragement on a piece of paper and take a photo of yourself holding it. Something simple like \"Ellison don't give up\" or \"Ellison life is worth living\". And post it here, or send it to me, so I can share them with her when I get to see her again in a few days.\n\nIt doesn't have to be in front of the Statue of Liberty or on the beaches of Hawaii, any place would be appreciated. I realize this isn't for everyone, so please feel free to send a note if you choose.  I've received some very inspiring notes from others.  \n\nMy hope is that in seeing the love that comes from others all over the world, from you, she will feel strengthened by that. I know that love can do this, even if it's just a couple of you.\n\nMuch thanks to all the amazing people of Reddit--\n--From a father trying to help his daughter\n\n\n\n\n11/17/15\nI wanted to thank those of you who have given of yourself for my daughter. I wasn't sure if anyone would answer and I've been touched by the sincerity of the comments and suggestions. Those who have sent a photo, I am especially thankful for because it further personalized your message and I feel like I can see hope in your faces.  \n\nI will be going to see her this next week. She hasn't wanted to see anyone for several days, but I'm hoping that things will continue to improve so that next week I can. \n\nI plan to print out tour input and photos to take with me and if the time seems right, to give it to her with the hope that you can inspire her like you have me. ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My Daughter's Depression &amp; Anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/3szfak/my_daughters_depression_anxiety/"
        },
        {
            "author": "catjuggler",
            "author_created_utc": 1321894415,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6aaex",
            "created_utc": 1447970344,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3thmik/today_my_boss_said/",
            "gilded": 0,
            "id": "3thmik",
            "is_self": true,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3thmik/today_my_boss_said/",
            "retrieved_on": 1450650753,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "...that one of my main strengths is anticipating problems before they occur and before anyone else notices that we should be concerned. It's not all bad?",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Today my boss said...",
            "url": "https://www.reddit.com/r/Anxiety/comments/3thmik/today_my_boss_said/"
        },
        {
            "author": "Cunt_Destroyer_420",
            "author_created_utc": 1423059057,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_l5g2j",
            "created_utc": 1447690233,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3t185s/fuck_facebook_it_announces_how_few_people_said/",
            "gilded": 0,
            "id": "3t185s",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3t185s/fuck_facebook_it_announces_how_few_people_said/",
            "retrieved_on": 1450658435,
            "score": 49,
            "secure_media_embed": {},
            "selftext": "Okay, because I am what I am, I'm fucked. \n\nIt was my birthday, and only a bunch of people said happy birthday on Facebook. Then today it announced me that another friend had 70 people congratulate her. \n\nThis is fucking bullshit, so basically everyone on my list saw how few people told me happy birthday and now everyone knows I'm recluse. Fucking beautiful, love this. \n\nI tried to fucking prevent this shit by turning off the option for others to see people who post on my wall, so it would be invisible. DOES IT NOT EVEN WORK!?!",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "FUCK Facebook! It announces how few people said happy birthday to me? FUCK!",
            "url": "https://www.reddit.com/r/Anxiety/comments/3t185s/fuck_facebook_it_announces_how_few_people_said/"
        },
        {
            "author": "damnitjeffy",
            "author_created_utc": 1386910153,
            "author_flair_css_class": "",
            "author_flair_text": "GAD",
            "author_fullname": "t2_ec2xs",
            "created_utc": 1448119998,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tp8hf/dae_ever_get_mad_at_themselves_for_being_anxious/",
            "gilded": 0,
            "id": "3tp8hf",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tp8hf/dae_ever_get_mad_at_themselves_for_being_anxious/",
            "retrieved_on": 1450647189,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "I feel like everyone in the world is mad at me because I'm being crazy anxious, but in reality no one is mad and the world is going to continue on. The only time people get mad is when I react stupidly to thinking they are already mad at me.\n\nLike right now, I know my boyfriend isn't mad at me. But I'm so mad at myself that I have made myself more anxious and so depressed. And nothing is wrong. At all. All of this is in my head.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE ever get mad at themselves for being anxious?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tp8hf/dae_ever_get_mad_at_themselves_for_being_anxious/"
        },
        {
            "author": "C_Gibz",
            "author_created_utc": 1347290278,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8yr35",
            "created_utc": 1447899910,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tdnm7/this_is_gonna_sound_weird_but_does_anyone_else/",
            "gilded": 0,
            "id": "3tdnm7",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tdnm7/this_is_gonna_sound_weird_but_does_anyone_else/",
            "retrieved_on": 1450652605,
            "score": 45,
            "secure_media_embed": {},
            "selftext": "So for the past few weeks, when I'm sitting in class, I've been having trouble focusing (both mentally focusing and literally focusing with my eyes), tight chest, short of breath / trouble breathing, and very, very dizzy. I've had panic attacks before, and these are pretty much my symptoms in the minutes before they happen. When class dismisses and I step outside, the symptoms eventually wear off. I never thought to associate this with the florescent lights that are in the classrooms until someone brought it up. Does anyone else experience this? ",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "This is gonna sound weird, but does anyone else feel abnormal around florescent lights?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tdnm7/this_is_gonna_sound_weird_but_does_anyone_else/"
        },
        {
            "author": "alittlestranger",
            "author_created_utc": 1350445828,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9bsi4",
            "created_utc": 1448077341,
            "domain": "youtube.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tni3q/john_green_on_mental_illness/",
            "gilded": 0,
            "id": "3tni3q",
            "is_self": false,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "media": {
                "oembed": {
                    "author_name": "vlogbrothers",
                    "author_url": "https://www.youtube.com/user/vlogbrothers",
                    "description": "Pizzamas ends today! http://store.dftba.com/collections/pizzamas In which John discusses his mental illness, the challenges of living with chronic illness, a recent run of poor health, the end of Pizzamas, and the question of whether things end or just change. RESOURCES: National Suicide Prevention Lifeline: 1-800-273-TALK (8255) I know it can be scary to make a phone call, but people are nice, I promise.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZ_y4CACK-9g%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZ_y4CACK-9g&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ_y4CACK-9g%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.ytimg.com/vi/Z_y4CACK-9g/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "On Mental Illness (and the end of Pizzamas)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=Z_y4CACK-9g",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZ_y4CACK-9g%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZ_y4CACK-9g&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ_y4CACK-9g%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tni3q/john_green_on_mental_illness/",
            "post_hint": "rich:video",
            "preview": {
                "images": [
                    {
                        "id": "LFsVKrgNAjmjrdB02r-b7Vzpeaf9KRhyXMpiyUnuC-M",
                        "resolutions": [
                            {
                                "height": 81,
                                "url": "https://i.redditmedia.com/zPiDmk38p3SHA8-q1zIUhzQirHr2BQhoji6zbIYO2fI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=00e56edf97743ef8a936fae61d0e33b0",
                                "width": 108
                            },
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/zPiDmk38p3SHA8-q1zIUhzQirHr2BQhoji6zbIYO2fI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=4cec71963c679ae3d906d91d00aa3c78",
                                "width": 216
                            },
                            {
                                "height": 240,
                                "url": "https://i.redditmedia.com/zPiDmk38p3SHA8-q1zIUhzQirHr2BQhoji6zbIYO2fI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=5487f77b2aed7fec7f7c4ab740f51f42",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 360,
                            "url": "https://i.redditmedia.com/zPiDmk38p3SHA8-q1zIUhzQirHr2BQhoji6zbIYO2fI.jpg?s=5a7f062445a869757545b5037b2fb6e0",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1450647997,
            "score": 42,
            "secure_media": {
                "oembed": {
                    "author_name": "vlogbrothers",
                    "author_url": "https://www.youtube.com/user/vlogbrothers",
                    "description": "Pizzamas ends today! http://store.dftba.com/collections/pizzamas In which John discusses his mental illness, the challenges of living with chronic illness, a recent run of poor health, the end of Pizzamas, and the question of whether things end or just change. RESOURCES: National Suicide Prevention Lifeline: 1-800-273-TALK (8255) I know it can be scary to make a phone call, but people are nice, I promise.",
                    "height": 338,
                    "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZ_y4CACK-9g%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZ_y4CACK-9g&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ_y4CACK-9g%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.embed.ly/1/image?url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ_y4CACK-9g%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb",
                    "thumbnail_width": 480,
                    "title": "On Mental Illness (and the end of Pizzamas)",
                    "type": "video",
                    "url": "http://www.youtube.com/watch?v=Z_y4CACK-9g",
                    "version": "1.0",
                    "width": 600
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZ_y4CACK-9g%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZ_y4CACK-9g&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ_y4CACK-9g%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 338,
                "scrolling": false,
                "width": 600
            },
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/ioGXppPLBetzyU9CkW5zcS0m_FueGFJeTP7vAtoAKjY.jpg",
            "title": "John Green On Mental Illness",
            "url": "https://www.youtube.com/watch?v=Z_y4CACK-9g"
        },
        {
            "author": "l3ssth4n3",
            "author_created_utc": 1446897810,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_rtdu3",
            "created_utc": 1447980965,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tiamp/its_so_hard_to_live_with/",
            "gilded": 0,
            "id": "3tiamp",
            "is_self": true,
            "locked": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tiamp/its_so_hard_to_live_with/",
            "retrieved_on": 1450650439,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "I dread waking up knowing I have to deal with this. I'm crying right now by the amount of anxiety I feel. Sometimes it feels like a cruel joke to live with this much anxiety. Hope you all are doing okay today.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "It's so hard to live with.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tiamp/its_so_hard_to_live_with/"
        },
        {
            "author": "mynamewasfuck",
            "author_created_utc": 1295325557,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4qm3z",
            "created_utc": 1447981084,
            "domain": "penny-arcade.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tiawq/gabe_from_penny_arcade_on_anxiety/",
            "gilded": 0,
            "id": "3tiawq",
            "is_self": false,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tiawq/gabe_from_penny_arcade_on_anxiety/",
            "post_hint": "link",
            "preview": {
                "images": [
                    {
                        "id": "hi2gsowPoPel0jedAX1MrLlyGMDuzjOprDcRf20eAFY",
                        "resolutions": [
                            {
                                "height": 81,
                                "url": "https://i.redditmedia.com/DSuYomUnj_r8u03iDExBQRnrpoRkUX5nP31qjOmCIf0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=79ade8ef1e935037e5abb3967580256c",
                                "width": 108
                            },
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/DSuYomUnj_r8u03iDExBQRnrpoRkUX5nP31qjOmCIf0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=236a103fd9c8d49216d4694323f81d69",
                                "width": 216
                            },
                            {
                                "height": 240,
                                "url": "https://i.redditmedia.com/DSuYomUnj_r8u03iDExBQRnrpoRkUX5nP31qjOmCIf0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=419f85735b5acb54c088ce6fabb169f0",
                                "width": 320
                            },
                            {
                                "height": 480,
                                "url": "https://i.redditmedia.com/DSuYomUnj_r8u03iDExBQRnrpoRkUX5nP31qjOmCIf0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=258cb4d277e8dff7c31573df19733234",
                                "width": 640
                            },
                            {
                                "height": 720,
                                "url": "https://i.redditmedia.com/DSuYomUnj_r8u03iDExBQRnrpoRkUX5nP31qjOmCIf0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=e167bf9bc6017be540a4517c799946bd",
                                "width": 960
                            }
                        ],
                        "source": {
                            "height": 768,
                            "url": "https://i.redditmedia.com/DSuYomUnj_r8u03iDExBQRnrpoRkUX5nP31qjOmCIf0.jpg?s=1eba6d750c9b415a2e4c057ed9c9ceb9",
                            "width": 1024
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1450650436,
            "score": 37,
            "secure_media_embed": {},
            "selftext": "",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "http://b.thumbs.redditmedia.com/yAEgNSp_qtdXBYRFuz9NdeCEhDBgEmFf8gAdOQkYN4I.jpg",
            "title": "Gabe from Penny Arcade on anxiety",
            "url": "http://www.penny-arcade.com/news/post/2015/11/19/a-conversation-between-friends"
        },
        {
            "author": "Eternitys-Epitaph",
            "author_created_utc": 1411519742,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ijmsv",
            "created_utc": 1447869096,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3tbjhl/im_currently_hiding_in_a_bathroom_stall_at_work/",
            "gilded": 0,
            "id": "3tbjhl",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3tbjhl/im_currently_hiding_in_a_bathroom_stall_at_work/",
            "retrieved_on": 1450653590,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "The stress finally got to me. I'm so embarrassed. My body just turns on the waterworks in response to frustration...I don't have any control over it and now I'm more anxious because I'm having to hide here trying to figure out how to get my ugly \"I've been crying\" red face and eyes to look normal enough so I can get back to my desk and finish the work. Any tips? The red is really bad..",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I'm currently hiding in a bathroom stall at work, trying to stop crying. Ugh..",
            "url": "https://www.reddit.com/r/Anxiety/comments/3tbjhl/im_currently_hiding_in_a_bathroom_stall_at_work/"
        },
        {
            "author": "BabyFlower",
            "author_created_utc": 1402378883,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gx5ei",
            "created_utc": 1447793897,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3t7fpz/dae_get_really_uncomfortable_when_people_around/",
            "gilded": 0,
            "id": "3t7fpz",
            "is_self": true,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3t7fpz/dae_get_really_uncomfortable_when_people_around/",
            "retrieved_on": 1450655518,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "I'm doing my work at the office right now and I can hear our receptionist whispering to my supervisors in the next room and in my mind i JUST KNOW that they are talking about me. i really hate when adults do this and I feel grateful to work with children so that I can teach them that whispering to other people is an impolite thing to do. Anyone as paranoid as I am? It makes me scared.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE get really uncomfortable when people around them whisper to others?",
            "url": "https://www.reddit.com/r/Anxiety/comments/3t7fpz/dae_get_really_uncomfortable_when_people_around/"
        },
        {
            "author": "OvaryQuiver",
            "author_created_utc": 1423849093,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_lc78v",
            "created_utc": 1447526966,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/3st32g/overwhelming_fear_about_going_to_a_concert_after/",
            "gilded": 0,
            "id": "3st32g",
            "is_self": true,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/3st32g/overwhelming_fear_about_going_to_a_concert_after/",
            "retrieved_on": 1450662245,
            "score": 32,
            "secure_media_embed": {},
            "selftext": "So I won tickets to see one of my husband's favorite bands tonight. I was so excited, until yesterday. Now I'm completely losing it. I'm not sure I can do it. I have OCD and I've been having horrible intrusive thoughts. Flashes of carnage,  except not in Paris, but involving people I know at the concert tonight. I've tried justifying it; it's a small venue, I live in the deep south, it's a small state that is not diverse, the chance of ISIS members being at this concert is small, but I just can't shake this feeling. \n\nI guess I just wanted to share that. I'm trying not to let my anxiety and OCD get in the way of doing things I want, but it's really hard. I also feel obscene for going and having a good time while so much of the world is in mourning.",
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Overwhelming fear about going to a concert after Paris attacks.",
            "url": "https://www.reddit.com/r/Anxiety/comments/3st32g/overwhelming_fear_about_going_to_a_concert_after/"
        }
    ]
}