{
    "data": [
        {
            "author": "Huskie2213",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503270858,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6uz15o/does_anyone_else_feel_like_you_cant_use_your/",
            "id": "6uz15o",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "num_comments": 57,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6uz15o/does_anyone_else_feel_like_you_cant_use_your/",
            "retrieved_on": 1503353669,
            "score": 451,
            "selftext": "For example, say you want to go back to school but being in a classroom gives you anxiety so graduating college is difficult. Now your stuck at a job in which you are underemployed and dislike. I feel anxiety seriously kills your self esteem and you feel like you're not good enough to do anything. When in reality you're perfectly capable, it's just the constant negative thoughts stand in the way. I've researched all the ways to overcome anxiety but can't put them into practice because I just constantly think about having anxiety.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel like you can't use your intelligence because of anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6uz15o/does_anyone_else_feel_like_you_cant_use_your/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "Lybelleworm",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503039761,
            "domain": "self.Anxiety",
            "edited": 1503109237,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ug7hu/i_hate_it_when_people_glorify_anxiety/",
            "gilded": 1,
            "id": "6ug7hu",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 79,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ug7hu/i_hate_it_when_people_glorify_anxiety/",
            "retrieved_on": 1503126419,
            "score": 415,
            "selftext": "I see these posts every week about how girls who are anxious are \"the best wives\", how some idiots claim loud and proud they are anxious and that it made then stronger, how some of my family members laugh at others' suffering by saying anxiety is merely a part of life and they eventually snapped out of it. \n\nI hate it.\n\nIt makes me feel like trash for struggling. Makes me feel ashamed for reaching out. Some people I told about my anxiety issues got excited saying that made me super good at organizing things and I always seemed to know where I was going because of this, but the only reason really is that I can never make a move, even a simple social outing, if I don't know who's there, where it is, when is it over, how do I get back, what will happen. I can rarely go to anything because most people don't get it, they think I'm annoying even, to be asking how things will go, saying I should relax and go with the flow. I can't do that!\n\nI hate this glorification! Being anxious does not make me more organized, it makes me petrified! It does not help me at all! It's not \"cool\" or \"edgy\" to be anxious, it's sometimes (most times) a horrible handicap. It does not make me an eventual better wife, it just sucks in a romantic relationship, second guessing every tone change, every wording, every glance and fearing I am not enough or too much, fearing I'm pushing people away but wishing with all my being I could do that because it would mean not having to calculate when I have to call them/give a sign I'm still alive and interested in their life, because I am... but I suck at keeping touch.\n\nBeing told my anxiety is only in my head and I should snap out of it, it hurts. It hurts because it affects me physically too and it's showing, and people don't get that being unable to have energy, being unable to sleep, being unable to enjoy any physical contact are side effects of me hurting so much \"only in my head\" It hurts so much and I wish I could switch it off, forget about it! It's like people confuses stress with anxiety. And I still haven't been to a doctor because I can't even dare to step into my school's nurse office, I run away. My best friend struggles with anxiety too and how come I can motivate her to reach out and support her, but can't take my own advices?\n\nI've tried talking to my famiy about my anxiety issues and I was told I wasn't special and it was normal at my age, that I would grow out of it. I wouldn't dare to talk about it to the family members who would understand, because I feel like such a burden to everyone.\n\nThis is late night ramblings, I've been feeling down and empty recently and so angry at everything at the same time. \n\nI'm sorry. It's simply annoying to have to explain every day that I am anxious and don't know why, and no I can't help biting my nails or tapping my foot, it just happens while I'm so deep into my own head that I get lost in all the things I should be thinking about but can't in fear of having a full panic attack. It's difficult to make people who don't even know what anxiety feels like understand. It's difficult to make people who think they know understand. \n\nMany things going on at the same time, many responsibilities, many changes, and so little focus and composure to accomplish any of it...\n\nWhile people with anxiety can be the most precious and kind and loving individuals in the world, anxiety is not pretty, it's not a likeable trait one should actively seek to develop or find in a partner. Anxiety is something people accept about others. Those who seek anxiety in a partner are likely to look for someone unstable to save or destroy, or both.\n\nDon't like me because I'm anxious, like me because even if I'm anxious, I came to see you, support you and care for you, as friends, family and loved ones should do. \n\nIf only they would stop wearing anxiety like a fashion statement, and thus help the misunderstanding around it die!\n\nI see so many people on this sub struggle and I just want to say that you all are so awesome and strong. My problems are not as dire as yours, I see some of you trying so hard and it inspires me, but it also makes me so angry at the people who just want to look different and edgy and make you all look like your struggles are nothing but a cheap attempt to get attention. \n\nI'll stop now because this is getting more and more incoherent... Again, late night ramblings.... Sorry.\n\nEdit: Wow, thank you for my first gold, kind stranger!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate it when people glorify anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ug7hu/i_hate_it_when_people_glorify_anxiety/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "eloquinee",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503179161,
            "domain": "mandala.akrin.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6urt2i/we_posted_this_mandala_maker_my_husband_made_a/",
            "id": "6urt2i",
            "is_self": false,
            "is_video": false,
            "locked": false,
            "num_comments": 22,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6urt2i/we_posted_this_mandala_maker_my_husband_made_a/",
            "post_hint": "link",
            "preview": {
                "enabled": false,
                "images": [
                    {
                        "id": "AjIQciNQyg2JAtdDFJl39kTfzeo2LdXMkRQSpjd3quw",
                        "resolutions": [
                            {
                                "height": 108,
                                "url": "https://i.redditmedia.com/uyNZSKxE79JeJK2UZkXFJ6D7P-wg85a84-k5AR4r5EM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=47e290bc9e1468bf98b2551421cd1002",
                                "width": 108
                            },
                            {
                                "height": 216,
                                "url": "https://i.redditmedia.com/uyNZSKxE79JeJK2UZkXFJ6D7P-wg85a84-k5AR4r5EM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=c63fb568d37211949921179fef9fa37f",
                                "width": 216
                            },
                            {
                                "height": 320,
                                "url": "https://i.redditmedia.com/uyNZSKxE79JeJK2UZkXFJ6D7P-wg85a84-k5AR4r5EM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=73a5a9990b2607b609a457b86016d3c9",
                                "width": 320
                            },
                            {
                                "height": 640,
                                "url": "https://i.redditmedia.com/uyNZSKxE79JeJK2UZkXFJ6D7P-wg85a84-k5AR4r5EM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=1a510383b62cd4b918e35cbe727f8b13",
                                "width": 640
                            },
                            {
                                "height": 960,
                                "url": "https://i.redditmedia.com/uyNZSKxE79JeJK2UZkXFJ6D7P-wg85a84-k5AR4r5EM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=8d0eaaa7cb0343a5f798b2816bec5b00",
                                "width": 960
                            }
                        ],
                        "source": {
                            "height": 1024,
                            "url": "https://i.redditmedia.com/uyNZSKxE79JeJK2UZkXFJ6D7P-wg85a84-k5AR4r5EM.jpg?s=8ac684856c0f6a00895e1b47ab3c7261",
                            "width": 1024
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1503273994,
            "score": 365,
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "https://b.thumbs.redditmedia.com/LCAlwzLHEtuZVZahjysuR-a8Ern70n0Z_7q2f41cArI.jpg",
            "thumbnail_height": 140,
            "thumbnail_width": 140,
            "title": "We posted this mandala maker my husband made a while ago. We unexpectedly received a lot of PM and emails about how it has helped people with their anxiety. Thought we would share it here",
            "url": "http://mandala.akrin.com",
            "whitelist_status": "all_ads"
        },
        {
            "author": "batheinsriracha",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502991563,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ubma0/i_keep_shirking_big_life_responsibilities_because/",
            "id": "6ubma0",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 33,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ubma0/i_keep_shirking_big_life_responsibilities_because/",
            "retrieved_on": 1503075176,
            "score": 339,
            "selftext": "There are always a million things to do, places to go, bills to pay, people to see. The list is always endless. I know this is just adulthood, and everyone must make it work. But I cannot. I get so incredibly anxious thinking about all I have to do, all I haven't done yet, how I still don't know much about doing any of these things (no one ever taught me the first thing about finances)...and I just collapse under the weight of it all. I freeze, and I just don't do any of the things I'm supposed to do. I lay there and obsess about what I need to do for hours and hours, but I don't do anything about it. Then I lie about why I can't get anything done, because \"anxiety\" is not an acceptable answer. It pisses everyone off and ruins my life. \n\nI flew to my father's house this week because this half of my family is disappointed that I do not see them often enough (because I don't get time off at work). The whole time I am forced to babysit my much younger siblings and get grilled for not making enough money and living up to the expectations of a normal fucking adult. Then my mother's side got angry that I don't see THEM often enough, so I'm traveling there next week. Amidst all this, I realized that I forgot completely about my volunteering commitment to a local hospital. Volunteering that I need to get into the school program that will hopefully give me a real career, since mentally fucked me fucked up college the first time around. This is not the first time I've forgotten volunteering because of anxious obsessions about other facets of my life. Needless to say, they are sick of me being unreliable and will not be asking me back. Then my coworkers complained about me not getting enough done at work. I can't please family, friends, work, anyone. My life always implodes because I can't be a fucking functional adult. \n\nHow the hell does anyone do it? How especially do mentally ill people do it? ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I keep shirking big life responsibilities because I collapse under the weight of all the stress. I don't know how anyone handles life sometimes, much less clinically anxious people.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ubma0/i_keep_shirking_big_life_responsibilities_because/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "Pkmnislife",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502923194,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u5qdk/i_made_my_therapist_cry/",
            "id": "6u5qdk",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 21,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u5qdk/i_made_my_therapist_cry/",
            "retrieved_on": 1503005726,
            "score": 327,
            "selftext": "So yesterday I made a post about it being my last day in therapy and how it would go and would promise to update (link to the post: https://www.reddit.com/r/Anxiety/comments/6twxen/tommorow_is_my_last_therapy_sessionthings_i/) \n\n\nSo today in my session, we wrapped up everything with mandatory stuff like treatment plans and emergency stuff but also about the future in college and my week. She gave me tips for distress tolerance, etc.\n\nBefore I left, she wanted me to read what I learned in therapy. Instead of just making things up, I read her my Reddit post about what I learned (link above). When I looked up from reading it, she was in tears. \"That's what i wanted you to know this whole time\", she said. I was so proud of myself, I couldn't stop smiling :). \n\nThen we said our goodbyes and went on our way (P.S. she gave me a coloring book as a gift. Yay!)",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I made my therapist cry",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u5qdk/i_made_my_therapist_cry/",
            "whitelist_status": "all_ads"
        },
        {
            "approved_at_utc": null,
            "author": "Taylor6534",
            "author_flair_css_class": null,
            "author_flair_text": "GAD | Depression | Something else",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502832597,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6txclb/something_my_therapist_said_that_i_found_very/",
            "id": "6txclb",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "num_comments": 36,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6txclb/something_my_therapist_said_that_i_found_very/",
            "retrieved_on": 1502915154,
            "score": 269,
            "selftext": "\"when a pessimistic thought enters your mind, its your decision, your choice on what you do with that thought. Even though it seems like it's out of your control, you have more control than you think. Its your brain, your body, your choice. You have total control over your decisions even if it doesn't seem like it. So again, when a pessimistic thought enters your mind, its in your control of whether you accept that thought or whether you reject it. It may be difficult, but you have control\"",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "thumbnail_height": null,
            "thumbnail_width": null,
            "title": "Something my therapist said that I found very useful",
            "url": "https://www.reddit.com/r/Anxiety/comments/6txclb/something_my_therapist_said_that_i_found_very/",
            "view_count": null,
            "whitelist_status": "all_ads"
        },
        {
            "author": "girlwithprtzl",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503083763,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6uk3o5/i_accomplished_something_ive_been_putting_off/",
            "id": "6uk3o5",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 20,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6uk3o5/i_accomplished_something_ive_been_putting_off/",
            "retrieved_on": 1503176894,
            "score": 244,
            "selftext": "Hi guys,\n\nThought this might be a good place to share this! Because of my anxiety and depression I fucked up real bad this year in uni. Failed all of my Winter sem courses and even one in the Fall term. I've been so embarrassed to talk about this to anyone because I feel like such a failure. Since coming home from school in April I've been DREADING dealing with the consequences of all this. Although I had my appeal (aka document outlining my struggles/extenuating circumstances that caused me to fail these courses and why I would like them basically removed from my transcript) ready since April I haven't been able to send it in. Every time I would log on to do it I would read over my appeal letter, criticize tf out of it, and close my browser. I would try to send it I would simply freak out and ended up getting nothing accomplished. It's been four months now since I've been trying to do this and I finally hit that send button today!!!!\n\nBasically, the point of this post is for anyone who's anxiety is keeping them from doing something they absolutely NEED to get done (or you'll be straight up screwed like me) but can't seem to find the courage to do it. Finding that bravery will make a world of difference for your anxious thoughts. Trust me. I don't think I've been this happy in years! ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I aCCOMPLISHED SOMETHING I'VE BEEN PUTTING OFF SINCE APRIL DUE TO MY ANXIETY AND IT FEELS SO GOOD! :)",
            "url": "https://www.reddit.com/r/Anxiety/comments/6uk3o5/i_accomplished_something_ive_been_putting_off/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "matthewebrown",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502885814,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u1mng/my_sister_has_undiagnosed_anxiety_and_my_parents/",
            "id": "6u1mng",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "relationshipflair",
            "link_flair_text": "Relationships",
            "locked": false,
            "num_comments": 17,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u1mng/my_sister_has_undiagnosed_anxiety_and_my_parents/",
            "retrieved_on": 1502966461,
            "score": 221,
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "My sister has undiagnosed anxiety and my parents don't understand. I keep telling them that she can't control being so anxious and fearful but they keep making me out to be causing arguments. They just don't understand how she feels and they shout at me for it. How can I get them to understand?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u1mng/my_sister_has_undiagnosed_anxiety_and_my_parents/",
            "whitelist_status": "all_ads"
        },
        {
            "approved_at_utc": null,
            "author": "INTP-02",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502798149,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ttmp3/no_job_no_college_no_partner_no_friends_no_sleep/",
            "id": "6ttmp3",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "discussion",
            "link_flair_text": "Discussion",
            "locked": false,
            "num_comments": 27,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ttmp3/no_job_no_college_no_partner_no_friends_no_sleep/",
            "retrieved_on": 1502879168,
            "score": 210,
            "selftext": "Anxiety, that's the problem, the thing that sends me to the bathroom when I think about doing new things like going back to college or buy a new motherboard for my PC, the thing that makes me fall in love but after a few week freak out and end the relationship, the thing that makes me stay at home refreshing Reddit's front page like a mad guy, the thing that puts me away from friends, the thing that makes me distrust psychologists and everybody, the thing that makes me wonder if this stranger on the street is willing to harm me, the thing that drops me out of college because I'm afraid of so many things, the thing killing my brain, my focus, my rationality. The thing is gonna kill me sooner or later.\n\nWhat the hell can I do? Five years in this kind of hell and now the only thing I know for sure is that I don't want to increase my pain by trying to escape from it.  ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "thumbnail_height": null,
            "thumbnail_width": null,
            "title": "No job, No College, No Partner, No Friends, No Sleep, No Future. I understand now...",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ttmp3/no_job_no_college_no_partner_no_friends_no_sleep/",
            "view_count": null,
            "whitelist_status": "all_ads"
        },
        {
            "author": "eiauey",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503242518,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6uwa20/snapped_at_family_felt_so_good_but_panicked/",
            "id": "6uwa20",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 3,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6uwa20/snapped_at_family_felt_so_good_but_panicked/",
            "retrieved_on": 1503330410,
            "score": 187,
            "selftext": "I done it. I snapped. I told my aunt what I really thought and that I knew she talks shit about me behind my back constantly and that I'm sick of it. She visits rarely despite living a one hour flight away (second time this year she's been up) and whenever she's up she questions my mental health issues and acts like I treat my gran like shit (I stay with my gran). \nIt felt so good, my heart was racing as was my mind but I held my own and didn't cry like I thought I would if I ever stood up to her. It honestly feels so good. She leaves tonight and I can't wait to see the back of her.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Snapped at family felt so good but panicked",
            "url": "https://www.reddit.com/r/Anxiety/comments/6uwa20/snapped_at_family_felt_so_good_but_panicked/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "4n0therThr0way",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502915446,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u4vsj/rant_why_does_every_fucking_job_i_get_expect_me/",
            "id": "6u4vsj",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "num_comments": 32,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u4vsj/rant_why_does_every_fucking_job_i_get_expect_me/",
            "retrieved_on": 1502998128,
            "score": 140,
            "selftext": "I don't do sales. It's not in me. I don't bother people, I don't talk to people, I don't try and fuck people out of their money so they buy a product they don't need. The 1000% bottom line: **I. DON'T. DO. FUCKING. SALES.**\n\nLast 3 jobs I had, all of them want me to do sales.\n\nI'm property maintenance handyman customer support, BUT: I have to sell them on buying our autopay program (yes, they charge) even if they didn't call about a billing issue.\n\nI'm taking incoming calls for student loan questions, BUT: I have to sell them on agreeing to a refinance and then gather *way* too much personal information (including FAFSA password, WTF?!) and then hand the call off to a closer who gets all of the commission while I'm making minimum wage hourly.\n\nToday, I'm supposed to be shooting and editing video, BUT: I also have to cold-call local colleges (who are insanely busy getting ready for the school year) and try to sell the video program to professors who are more concerned with their first days of school than whether or not I make a quota.\n\nWHY THE FUCK DOES EVERYONE WANT ME TO BE A SALESMAN?! CAN'T YOU HIRE A FUCKING SALESMAN AND JUST LET ME DO THE JOB?! FUCK MAN! WHY DO I EVEN BOTHER HAVING A JOB IF EVERYONE'S JUST GOING TO FUCK ME LIKE THIS! I MIGHT AS WELL WORK FAST FOOD. AT LEAST THERE'S NOT ANY FUCKING SALES QUOTAS! FUCK!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "[rant] WHY DOES EVERY FUCKING JOB I GET EXPECT ME TO DO SALES???",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u4vsj/rant_why_does_every_fucking_job_i_get_expect_me/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "Santa1936",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502952750,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u89nw/tomorrow_im_going_to_embarrass_myself/",
            "id": "6u89nw",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 16,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u89nw/tomorrow_im_going_to_embarrass_myself/",
            "retrieved_on": 1503033323,
            "score": 123,
            "selftext": "I'm done hiding. There's a beautiful girl at work that is clearly interested in me, but I ignore her as much as possible. I avoid looking her way whenever I can see she's looking at me, and I never initiate conversation. I'm sure she thinks I'm not interested, and on some level that's what I want. If she thinks that she'll go away and I won't have to risk anything. Well I'm done\n\nTomorrow I'm going into work with the expectation of embarrassment, that way I have nothing to lose. As far as I'm concerned, if I can bring myself to acknowledge her and start a conversation, even if it's the most awkward conversation I've ever had and it totally scares her away, I've succeeded. Too many times I've let girls who are interested think that I'm not by being too scared to take a risk. Well not tomorrow. I'm going to do it tomorrow. I'm going to say fucking something. God I'm nervous. But also really excited. Wish me luck friends",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Tomorrow I'm going to embarrass myself",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u89nw/tomorrow_im_going_to_embarrass_myself/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "DRmann13",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503316691,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6v2fca/after_decades_of_dealing_with_anxietypanic/",
            "id": "6v2fca",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpfultips",
            "link_flair_text": "Helpful Tips!",
            "locked": false,
            "num_comments": 29,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6v2fca/after_decades_of_dealing_with_anxietypanic/",
            "retrieved_on": 1503395141,
            "score": 105,
            "selftext": "I might not be able to help everyone but hopefully one person.\nI'm in no way an expert and I'm still trying to master the following method. It's all about Mindfulness/awareness/Living in the moment, that's the answer. Why do we get anxious at times? Because of our thoughts - thoughts that only exists in our mind. It's almost impossible to be anxious while you're living in the moment without thinking about the past or the future. Each time you catch yourself thinking/daydreaming just be aware of it and go back to the present and you'll see what a huge difference this makes. I'm not keeping my mind busy to forget about things, i'm doing my best to keep my mind quiet. At night before I go to sleep, I focus on nothing and I have been sleeping a lot better and I am no longer dealing with morning anxiety, why? Because I am not focusing on any thought, I'm letting thoughts come and go. \nThis is seriously as easy as it sounds, try it. For a few hours just let thoughts come and go and just be \"aware\" of that precise moment. \nBefore when I used to practice this I always gave up because I thought I was supposed to not think of anything but the key is to just be aware that you're thinking, control the thoughts, don't allow them to control you.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "after decades of dealing with anxiety/panic attacks, I finally figured it out.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6v2fca/after_decades_of_dealing_with_anxietypanic/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "RnGRamen85",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503016067,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ueahd/anyone_else_feel_extremely_irritable_when_anxious/",
            "id": "6ueahd",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "num_comments": 32,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ueahd/anyone_else_feel_extremely_irritable_when_anxious/",
            "retrieved_on": 1503100627,
            "score": 79,
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Anyone else feel *extremely* irritable when anxious? Like so angry you can't focus on anything and EVERYTHING nearly sends you into a spiralling rage.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ueahd/anyone_else_feel_extremely_irritable_when_anxious/",
            "whitelist_status": "all_ads"
        },
        {
            "approved_at_utc": null,
            "author": "EricSwitch",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502796558,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ttih7/i_finally_did_it_i_took_my_first_flight/",
            "id": "6ttih7",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "locked": false,
            "num_comments": 13,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ttih7/i_finally_did_it_i_took_my_first_flight/",
            "retrieved_on": 1502877408,
            "score": 78,
            "selftext": "So I never really had a fear of flying exactly, but over many years I have been improving on my bad travel anxiety I have suffered with for many years. (I'm 23) Even short car vacations have troubled me in the past. Yesterday, I took my first flight with my wife to Toronto! She has flown before, but never out of the country. It was a pretty short flight (1 hour and 20 mins.) but I am still proud of myself. I honestly never thought I would ever fly, but I did it! And keep it mind,  you can too!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "thumbnail_height": null,
            "thumbnail_width": null,
            "title": "I finally did it! I took my first flight!",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ttih7/i_finally_did_it_i_took_my_first_flight/",
            "view_count": null,
            "whitelist_status": "all_ads"
        },
        {
            "approved_at_utc": null,
            "author": "keylime72",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502837769,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6txw88/i_feel_guilty_about_being_anxious_anybody_else/",
            "id": "6txw88",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "num_comments": 12,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6txw88/i_feel_guilty_about_being_anxious_anybody_else/",
            "retrieved_on": 1502919993,
            "score": 75,
            "selftext": "tl;dr I go through good periods and bad periods and during good periods, I hate myself for being anxious and think it's my fault that I got anxious \n\nMy anxiety seems to sort of go through cycles. It's not like I'm bipolar or something--the lows aren't quite as low as flat out depression and the highs aren't as high as mania. Plus the cycles seem to be mostly triggered by things that happen to me, even if I don't always know what caused the change at the time. \n\nAnyway, basically sometimes for a few weeks or whatever I'm pretty anxious and I just feel like everybody thinks I'm uncool, nobody wants me around, I'm dumb and lazy, and I wonder why anybody is even friends with me to begin with since I'm such a fuck up and I get scared that my dad will stop loving me and that my friends will leave me. While the anxiety during these periods is mostly related to my self worth and interactions with other people, not all of it is. I oftentimes during these periods feel myself questioning and checking every decision that I make. \n\nThen, for whatever reason, I score a win somehow or somebody compliments me and I start to feel that things are looking up. Sometimes if I'm really into whatever project I'm working on then, I get a kind of giddy, optimistic feeling and just feel like everything is going to be alright.\n\nBut anyway, during the happy periods, I look back on my sad periods and think about how I thought about myself and realize that A. It's totally irrational, I make mistakes but realistically I am not the world's biggest fuckup. I have a lot of things to be proud of and I'm just letting my mood/worldview taint my perception of myself and how I think other people see me and B. It doesn't matter that much what other people think of me and I know I have inherent self worth and that there are things I can be happy about, regardless of whether cool people see it that way. When I start to feel better, I feel guilty about feeling anxious and insecure earlier. I hate myself for letting this silly negative worldview get to me and waste my time and cause me to waste my potential. I hate myself for getting caught up in thoughts, problems that aren't even real, and I feel like it's my fault those thoughts stayed with me for as long as they did because I didn't have enough willpower and foresight to just block them out and not let them get to me. I feel like the reason the negative thoughts were able to appear and take control is my laziness and lack of hard work to keep them out. \n\nDoes anyone else ever experience this? How do you deal with it? I know I won't be happy all the time; things happen and some level of insecurity is normal. But how do I keep the negative worldview from taking over my thoughts? How do I keep myself from being overwhelmed by these thoughts. Does anyone have any useful tips on how to recognize negative self talk and change it to be more optimistic, or at least not as hyperbolic? \n\nI think sometimes I let negative thoughts persist because in a way it's easier and more comfortable to just stay sad. That way you have a bit of control over your sadness. If you start to feel something like \"Everybody else is cooler and smarter than I am\" but then you tell yourself \"No that's not true\" but then you go out and do something that day that validates the negative theory, you feel even more like shit and you didn't see it coming. \n\nSorry for rambling. Anyway if anybody has any thoughts about this they'd like to share, comment them below. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "thumbnail_height": null,
            "thumbnail_width": null,
            "title": "I feel guilty about being anxious. Anybody else feel the same?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6txw88/i_feel_guilty_about_being_anxious_anybody_else/",
            "view_count": null,
            "whitelist_status": "all_ads"
        },
        {
            "author": "hughstephner",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503100213,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ulr89/dae_constantly_worry_that_people_are_going_to/",
            "id": "6ulr89",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "num_comments": 17,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ulr89/dae_constantly_worry_that_people_are_going_to/",
            "retrieved_on": 1503195789,
            "score": 69,
            "selftext": "I'm always scared that my boyfriend &amp; friends have some better view of me than I actually am and at any moment they could discover the real me and I'd lose them forever. This is especially true of my boyfriend. I feel like a fraud just waiting to be discovered, but I have no real reason to feel this way.\n\nI think I'm just paranoid and self-conscious, but it eats away at me every moment of every day.\n\nI don't think there's anything that can help, I guess I'm just curious if I'm alone in this.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "DAE constantly worry that people are going to leave them?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ulr89/dae_constantly_worry_that_people_are_going_to/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "Isambard_Maxwell_II",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503330250,
            "domain": "self.Anxiety",
            "edited": 1503330964,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6v3rf0/yesterday_i_rented_a_car/",
            "id": "6v3rf0",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "locked": false,
            "num_comments": 11,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6v3rf0/yesterday_i_rented_a_car/",
            "retrieved_on": 1503411062,
            "score": 69,
            "selftext": "I had the day off and it was only 30 dollars a day (minus fuel). I drove around all day looking for tough places to parallel park. I switched lanes, I hit the gas, parallel parked some more, tried different things, hard break, tried the ABS, changed a tire, changed it back, refuelled, did some more parallel parking, all the while listening to a killer playlist I made especially for that day. \n\nI now declare myself free of any driving related anxiety and I recommend it to anyone who feels the way I did. Few anxieties are as simple to resolve as this one. All you need is some quality time with the vehicle.\n\nEdit: I also got completely ass backwards lost and found my way back again via signs alone and even asked some stranger for directions. Point is it's a great exercise.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Yesterday I rented a car",
            "url": "https://www.reddit.com/r/Anxiety/comments/6v3rf0/yesterday_i_rented_a_car/",
            "whitelist_status": "all_ads"
        },
        {
            "approved_at_utc": null,
            "author": "kawaiicherrybomb",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502811974,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6tuy8o/sometimes_i_feel_like_my_body_gets_anxious_but_my/",
            "id": "6tuy8o",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "discussion",
            "link_flair_text": "Discussion",
            "locked": false,
            "num_comments": 14,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6tuy8o/sometimes_i_feel_like_my_body_gets_anxious_but_my/",
            "retrieved_on": 1502894321,
            "score": 62,
            "selftext": "If that makes sense ¯\\_(ツ)_/¯ ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "thumbnail_height": null,
            "thumbnail_width": null,
            "title": "Sometimes I feel like my body gets anxious but my mind doesn't",
            "url": "https://www.reddit.com/r/Anxiety/comments/6tuy8o/sometimes_i_feel_like_my_body_gets_anxious_but_my/",
            "view_count": null,
            "whitelist_status": "all_ads"
        },
        {
            "author": "CodProXox",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503087043,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ukgiu/after_a_panic_attack_has_subsided_and_youre_able/",
            "id": "6ukgiu",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "num_comments": 9,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6ukgiu/after_a_panic_attack_has_subsided_and_youre_able/",
            "retrieved_on": 1503180845,
            "score": 56,
            "selftext": "Panic attacks are so weird and so scary. The worst thing for me is that overwhelming feeling of sadness and dread where you feel nothing will be cheerful again and that you'll continue to feel horribly scared forever. That feeling, luckily, subsides for me most of the time. But when it's all set and done and my body is exausted, sometimes i just stop and think and say \"what the hell just happened to me??\" sometimes that thought makes me more scared and sometimes it's calming to know that no matter how horrible that feeling may be, it does eventually pass. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "After a panic attack has subsided and you're able to think rationally again, does anyone else just stop and think \"what the actual fuck just happened to me?\"",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ukgiu/after_a_panic_attack_has_subsided_and_youre_able/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "tiredinfinitely",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502926277,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u61g4/is_it_real_or_not/",
            "id": "6u61g4",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 5,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u61g4/is_it_real_or_not/",
            "retrieved_on": 1503008540,
            "score": 42,
            "selftext": "Whenever I have a good day where I make it through situations that are usually tough for me and I am more active and talkative, I feel like my illness is all just a big scam. Today I did exposure therapy for social anxiety and I actually did pretty well. I was able to talk to strangers kind of easily and my therapist thought I was doing well. But then I get to thinking. What if she thinks I'm doing so well that my illness is just something I'm imagining? I was even cracking jokes during it. I feel like I don't even compare to how bad some people have it. Sometimes I ask myself if I am magnifying my symptoms just to seem worse than I am, but then I remember the days at college where I could barely leave my room out of fear of interacting with my roommates. I wouldn't eat if they had friends over and I would hold myself from going to the bathroom for as long as possible because I didn't want anyone to see me. I skipped classes one day because one strand of my hair looked \"weird.\" I dropped a class because they assigned a presentation. I don't know if I'm just really good at faking my personality sometimes to the point that I can trick myself into dealing with things better or if I'm not as sick as I lead myself to believe. It's so frustrating.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Is it real or not?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u61g4/is_it_real_or_not/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "Kitty-blunt",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502888559,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u1vfc/does_anxiety_affect_your_sex_life/",
            "id": "6u1vfc",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 31,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u1vfc/does_anxiety_affect_your_sex_life/",
            "retrieved_on": 1502969839,
            "score": 42,
            "selftext": "I haven't been able to orgasm in a long time. I think it may be anxiety related (I have panic disorder and anxiety) but I'm not sure. I love my boyfriend and am very attracted to him so it doesn't make sense. Anyone else deal with issues in their sex life because of anxiety or have any advice? Thanks!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anxiety affect your sex life?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u1vfc/does_anxiety_affect_your_sex_life/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1503176545,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6urkk7/since_being_prescribed_xanax_last_week_ive/",
            "id": "6urkk7",
            "is_self": true,
            "is_video": false,
            "locked": true,
            "num_comments": 44,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6urkk7/since_being_prescribed_xanax_last_week_ive/",
            "retrieved_on": 1503271329,
            "score": 41,
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "default",
            "title": "Since being prescribed xanax last week, I've learned a lot about it's effects and I'd like to share them with everyone who is taking it or is going to be taking it.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6urkk7/since_being_prescribed_xanax_last_week_ive/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "Thatsfuckedupkendra",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502961394,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u8t22/does_anyone_else_feel_light_headed_very_often/",
            "id": "6u8t22",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "num_comments": 22,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u8t22/does_anyone_else_feel_light_headed_very_often/",
            "retrieved_on": 1503041352,
            "score": 40,
            "selftext": "I know dizziness/light headedness is a symptom of anxiety, but I feel like I experience it more than I should. Im light headed at one point or another on a daily basis, sometimes it's very slight but lasts all day. I have been going through A LOT of pretty heavy stuff lately so I've been assuming it's because of higher stress levels. Does anyone else have experience with this? I can't tell if I'm justified feeling this way or if I'm being anxious about my anxiety. SIGH. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "Does anyone else feel light headed VERY often?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u8t22/does_anyone_else_feel_light_headed_very_often/",
            "whitelist_status": "all_ads"
        },
        {
            "author": "newkindofblue",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1502913478,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6u4ns8/i_hate_everything/",
            "id": "6u4ns8",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "num_comments": 6,
            "over_18": false,
            "parent_whitelist_status": "all_ads",
            "permalink": "/r/Anxiety/comments/6u4ns8/i_hate_everything/",
            "retrieved_on": 1502996237,
            "score": 39,
            "selftext": "I hate talking about my hobbies\n\nI hate going out\n\nI hate people\n\nI hate being alone\n\nI hate everything I care about\n\nI hate the entire world\n\nI hate myself\n\nI just want all the thoughts to stop. Why does my brain betray me?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "thumbnail": "self",
            "title": "I hate everything",
            "url": "https://www.reddit.com/r/Anxiety/comments/6u4ns8/i_hate_everything/",
            "whitelist_status": "all_ads"
        }
    ]
}