{
    "data": [
        {
            "approved_at_utc": null,
            "author": "imnotanamericanidiot",
            "author_created_utc": 1498056158,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4q1sko0",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498852598,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kidwz/my_mom_has_cancer_for_the_second_time/",
            "gilded": 0,
            "id": "6kidwz",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kidwz/my_mom_has_cancer_for_the_second_time/",
            "retrieved_on": 1500199450,
            "score": 36,
            "secure_media_embed": {},
            "selftext": "And i'm the kind of person who hides all the feelings. But this time i'm having a panic attack and i want to cry but i can't. Shes having a nap and i can not stop thinking that she really might die. And that it has spread. Could you please give me aome uplifting somethings to keep it off my mind. I dont want to fall apart when she needs me the most.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "My mom has cancer. For the second time.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kidwz/my_mom_has_cancer_for_the_second_time/"
        },
        {
            "approved_at_utc": null,
            "author": "CWSbitch",
            "author_created_utc": 1491956695,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_17005r",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498852724,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kiedv/anyone_else_feel_like_their_heart_is_always_over/",
            "gilded": 0,
            "id": "6kiedv",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kiedv/anyone_else_feel_like_their_heart_is_always_over/",
            "retrieved_on": 1500199456,
            "score": 20,
            "secure_media_embed": {},
            "selftext": "I feel like no matter what I'm doing it's beating excessive and hard. Lying down. Being active. Just standing up. Am I alone?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone else feel like their heart is always over exerting itself...?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kiedv/anyone_else_feel_like_their_heart_is_always_over/"
        },
        {
            "approved_at_utc": null,
            "author": "GorillazFanGirl",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498851774,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kiar9/constant_anxiety_attacks/",
            "gilded": 0,
            "id": "6kiar9",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kiar9/constant_anxiety_attacks/",
            "retrieved_on": 1500199406,
            "score": 13,
            "secure_media_embed": {},
            "selftext": "I've been diagnosed with anxiety for almost a year now. I've been getting more anxiety attacks lately and the things that helped me calm down no longer help me. I've even tried new things and nothing seems to help. \nIf anyone knows something that can stop or calm an attack could you tell me.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Constant Anxiety Attacks",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kiar9/constant_anxiety_attacks/"
        },
        {
            "approved_at_utc": null,
            "author": "Imherenowmam",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498859820,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj4sa/im_going_to_start_realy_looking_for_help/",
            "gilded": 0,
            "id": "6kj4sa",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj4sa/im_going_to_start_realy_looking_for_help/",
            "retrieved_on": 1500199820,
            "score": 8,
            "secure_media_embed": {},
            "selftext": "I have been dealing with anxiety since I was a kid. I'm 18 now and it's realy holding me back. I have a cripling fear of dying and getting into confrontation. I feel like everyone is bad mouthing me all the time. I'm curently visiting Slovenia and I feel like everyone hates me because I'm foren. I hate living in this mental prison. I can see the outside, but fucking hell. How do I get out? I can't even talk to girls because I think they all have boyfrieds who will kick my ass. \n\nI think everyone wants to rob me because I have wealthy parentes even if I don't dress rich. I go out of my way to wear cheap clothing to lessen this fear. I feel everyone wants me harm or are not interested in helling if my life is on the line. I hate to be bother anyone. I can't fucking live like this. I have had two legit panick attacks in the last seven days.\n\nI have even complimentet suiced. Why the fuck live like this. In constent fear of everything and everyone. Never trusting anyone. I need help. I realy do. This is no way to live...",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Im going to start realy looking for help.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj4sa/im_going_to_start_realy_looking_for_help/"
        },
        {
            "approved_at_utc": null,
            "author": "myconfessionacc",
            "author_created_utc": 1419637974,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_kc380",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498864660,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjl14/i_put_in_my_two_weeks_notice/",
            "gilded": 0,
            "id": "6kjl14",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjl14/i_put_in_my_two_weeks_notice/",
            "retrieved_on": 1500200043,
            "score": 8,
            "secure_media_embed": {},
            "selftext": "Today in a fit of anxiety, I put in my two weeks notice for a decent job.\n\nIt doesn't pay much, but the staff are so kind and the atmosphere (while very boring) is so warm and welcoming. \n\nI did this because I am not catching on to the job very well. I'm extremely bored there, but a few other associates were doing all of these tasks, tasks I didn't even notice needed done, and I was just pittering around straightening up. It was at this moment that I realized I am exactly what I hate, someone not pulling their own weight. \n\nThey could tell something was bothering me, and so I let off a bit of steam. I told them I was disappointed in myself for not acclimating very well. They were extremely comforting and consoling.\n\nA bit of back story, I feel I am a coward. I've lived a very lonely life, but a very nurtured life as well. my co-workers are all women. \n\nPart of me resents this. I am the way I am because I never had a driving force in my life. A tell-it-like-it-is sort of voice to get me off my candy ass and handle business. If I stay at this job, I feel like this will keep happening, and I will never become the man I need to be. I am too soft. \n\n\nBut then I want to stay. They are legit cool to work with. I did feel a bit left out as well in that instance, because they were all working together while I was off by myself. That was hard to digest. My entire life has been that way. \n\nI told my boss I didn't think I was meshing very well with the team or the atmosphere. She said she wished I would stay, and that I did a great job anyway. I completely disagree, and I don't know how to handle her kind words.\n\n\nAnd so I come home, tail between my legs, feeling defeated.  I just don't know what to do about anything. I am so lost. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I put in my two weeks notice",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjl14/i_put_in_my_two_weeks_notice/"
        },
        {
            "approved_at_utc": null,
            "author": "LonghandWriter",
            "author_created_utc": 1482698690,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_13urv9",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498860697,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj7ui/do_i_just_enjoy_people_pitying_me/",
            "gilded": 0,
            "id": "6kj7ui",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj7ui/do_i_just_enjoy_people_pitying_me/",
            "retrieved_on": 1500199863,
            "score": 6,
            "secure_media_embed": {},
            "selftext": "Hey all,\n\nSo, until recently, I never dealt with any sort of anxiety. Like, I’ve always been a bit of a worrywart, but never so bad I felt it was negatively impacting my life.\n\nBut, over the last year or so, something’s changed. Personally, I think it’s because I’m trapped in a toxic environment with no real way out, and everyone’s always fighting with one another, which gives me a lot of stress because I have to work from home so I’m always there.\n\nAnyway, I have two major things. First off, I’ve been suffering from really bad mood swings. Like, I only ever really feel sort excited and impulsive or absolutely exhausted. And when I’m in either of these moods, I can’t shake them no matter what. They just stay as long as they want, and while at first it wasn’t really a problem, I’m starting to experience those lows more and more. Like, sometimes I’ll have days where I’m all excited to work and do stuff and then the smallest thing will happen—sometimes even just a stray thought from my past—and I lose all energy, and instead of working, I just crawl back into bed and beat myself up and tell myself how bad I am and stuff like that.\n\nSecondly, I’ve got a major fear of pissing people off. I don’t really understand this one, but basically, I’ve become everyone’s punching bag because I’m so scared to say no and I’m so easily guilted into doing other people’s work or stuff like that. My mind can’t fathom somebody being upset with me over a prolonged period of time because I jump to all these insane conclusions about how they’re going to hurt me, or hurt my family, or just something crazy like that. I get so many headaches just trying to think through my day and pick apart everything everyone said to me just to make sure I didn’t upset anyone.\n\nAnyway, my main point of this post isn’t to ask for a diagnosis—I know I need a doctor or something for that. I just want to know if any anybody has some advice because at this point, I’m getting a little scared to talk to my best friend about it. Like, he’s always been there for me, but whenever I have sort of a freakout moment(which at this point feels like once or twice a day) I quickly send him a couple messages freaking out or something like that and, unless they’re really serious, he’s starting just ignoring them. Also, I don't *feel* like it was this bad until I sort of stepped back and realized I needed help, so I’m worried that maybe I don’t have these problems, and maybe I just enjoy being pitied because for some reason sending a message to him feels so good, and sort of bumps me up a little bit even if the next couple minutes are spent freaking out about whether he’s gonna stop speaking to me or not.\n\nSo uh, yeah. Just any advice until I can get to the doctors would be very much appreciated. Also, how do I restrain myself from venting and just deal with this stuff by myself? I don’t want to burden anybody. Thanks.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Do I just enjoy people pitying me?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj7ui/do_i_just_enjoy_people_pitying_me/"
        },
        {
            "approved_at_utc": null,
            "author": "VoicesofCompassion",
            "author_created_utc": 1460959866,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_x9gj5",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498863589,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjhi1/challenging_anxiety/",
            "gilded": 0,
            "id": "6kjhi1",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjhi1/challenging_anxiety/",
            "retrieved_on": 1500199995,
            "score": 6,
            "secure_media_embed": {},
            "selftext": "Yesterday, I challenged my anxiety in the biggest way I ever have. I've been going to group therapy DBT for treatment of BPD, depression and anxiety and that was already one of the most difficult things I've ever done, but I've kept up with it and been doing my best using my coping mechanisms. I've got a long way to go and I'm still pretty low, but I'm doing much better than I ever was and I'm grateful for that.\n\nSometimes it's extremely difficult to leave the house or do just about anything due to the different ways the anxiety manifests, other days it barely bothers me (it tends to fluctuate with the mood swings of BPD). In regards to going out and doing stuff, sometimes I'll feel comfortable and 100% okay and safe and out of nowhere start to majorly panic and be consumed by anxiety and then need a break from social interaction or have to leave immediately, which is embarrassing. Usually though, I can have my anxiety under decent enough control so long as I have my partner with me, as he is my anchor and soothes me. If I need to leave, he gets me out of there, and as a result of this I've become extremely dependent on him. I appreciate his unconditional love and support, but I realize there are times I will have to do things on my own. I want to be that strong. \n\nYesterday, I took my first step alone. I've always wanted to be a part of activism, so I went to the first meeting for an organization I'm interested in all by myself because my partner had work.On the way there, I had a panic attack and I also had another in the bathroom. I was incredibly ready to leave but I did breathing exercises and gave myself a pep talk before gritting my teeth and going into the selected meeting room. \n\nThe entire time I was on edge, my insides were screaming and I felt like I was going to explode... But it was still nice. It was terrifying, but the people were very loving, kind and all around good people that shared my level of empathy and interests. Afterwards on the ride home, I panicked again and started to drown in bad thoughts of how stupid, awkward and weird I was and how they must've all hated me... I started feeling overwhelmed with the desire to self harm and suicidal thoughts, and my mom is bad with mental health so she just kinda ignored it and offered an \"it's okay\". But then those people reached out to me for no reason at all, expressed that they loved I was there, that they had been happy to have me and looked forward to working with me in the future. \n\nI realized then... I challenged my anxiety. And though it was only a small step forward, I won that battle. It was fighting against me harder than anything, but I still went. I may have been shaking, but I talked, laughed and smiled. I did it all by myself, and gave my mental illness the big middle finger. Of course I cried to my partner later that night and he soothed me and comforted me (especially when I had another freak out because they posted what I considered an ugly picture of me) but I still did it. I made new friends, and now I'm going to be a part of something I've always wanted to do. \n\nI'm so scared right now, and my anxiety is hitting me pretty hard. It's kinda pitiful, but I know I need a few days to recharge. But I challenged it. I fought it with hope, love and desire for my own happiness. Maybe right now all I'm capable of is therapy, working on commissions from home, crying and obsessing all day, and taking itty bitty steps to challenge my mental illnesses. But I still did something I wanted to do for years, and used my new coping skills to fight off the evil thoughts afterwards and didn't resort to self harm. I may not have won the war just yet, but I won the battle. \n\nAnd I want you all to know that you can do it too. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Challenging Anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjhi1/challenging_anxiety/"
        },
        {
            "approved_at_utc": null,
            "author": "turtlesx3",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498860402,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj6t2/jobs_agoraphobia/",
            "gilded": 0,
            "id": "6kj6t2",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj6t2/jobs_agoraphobia/",
            "retrieved_on": 1500199848,
            "score": 5,
            "secure_media_embed": {},
            "selftext": "I posted this in r/agoraphobia earlier but haven't gotten any feedback so I was hoping I might be able to get a little advice on a more active board....\n\nAgoraphobia started ruining my life in March. I had been working 2 jobs since November and started getting really flaky with both of them throughout March &amp; April before quitting one in the beginning of May. Since then I've gotten really good at going to work everyday and staying my whole shift, which im proud of but its only about 30 hours a week and a little above minimum wage so I don't see it as a long term \"career\" and it's obviously not that great of a paycheck. Going back to school is not realistic for me but I'd love to work in a nursing home as a cna or have a receptionist job or just something that's more challenging and better paying than my current retail job. Has anyone successfully gotten a new job despite having agoraphobia? How did you handle the filling out an app, interview, training and what not anxiety on top of agoraphobic anxiety? Thanks for reading &amp; I appreciate any suggestions!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Jobs &amp; agoraphobia",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj6t2/jobs_agoraphobia/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498851065,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ki7zr/dae_have_those_moments_where_you_enjoy_a_social/",
            "gilded": 0,
            "id": "6ki7zr",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6ki7zr/dae_have_those_moments_where_you_enjoy_a_social/",
            "retrieved_on": 1500199368,
            "score": 3,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "DAE have those moments where you enjoy a social event and realise life can actually be good?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ki7zr/dae_have_those_moments_where_you_enjoy_a_social/"
        },
        {
            "approved_at_utc": null,
            "author": "WorkHardEatPizza",
            "author_created_utc": 1498090586,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4rjmeum",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498867013,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjsdg/dont_know_where_im_headed/",
            "gilded": 0,
            "id": "6kjsdg",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjsdg/dont_know_where_im_headed/",
            "retrieved_on": 1500200166,
            "score": 3,
            "secure_media_embed": {},
            "selftext": "I've been high anxiety lately because of home issues, but I've also been feeling like I'm going to burn out at work. I'm a technician on a very demanding unit. I work three 12+ hour shifts per week. I've been okay with this for the most part, but I'm starting to feel like it's too much for me. My work is emotionally and mentally taxing. Also very physically demanding, but I don't mind that.\n\nHere's where I'm mostly stressed about: I've been on a road to acquire a Bachelor of Nursing for the last couple of years. Working with nurses for the last year and a half, I'm not sure this is for me. I think I would burn out quickly and it would be a constant emotional battle. I would like to remain working in healthcare, possibly as a therapist.\n\nWhat is making me anxious, is I'm 28 years old and I feel like I should have this done by now. I feel I've dilly-dallied all this time and I'm too old to want to become something now. In order to be a Psychologist I need a PhD or a PsyD, both which will take another 8-10 years of schooling. I want to start a family here in the next couple of years, however I can't help but feel as though it's not fair to do that when I'm still figuring out my life.\n\nRealistically I know people go to school with children all the time. I know that people older than me start over. I expected myself to have shit figured out by now, and I don't.\n\nAny words of wisdom or encouragement? Have any experiences to share?\n\nAny input is appreciated!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Don't know where I'm headed...",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjsdg/dont_know_where_im_headed/"
        },
        {
            "approved_at_utc": null,
            "author": "_KnowTheLedge_",
            "author_created_utc": 1441776986,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_qas8e",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498858322,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kizcw/deleted_social_media_but_now_fighting_fomo/",
            "gilded": 0,
            "id": "6kizcw",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kizcw/deleted_social_media_but_now_fighting_fomo/",
            "retrieved_on": 1500199745,
            "score": 3,
            "secure_media_embed": {},
            "selftext": "I finally decided to delete my social media, since I found myself addicted to it. It also didn't help that my anxiety only increased when seeing what all the people I used to call \"friends\" in college are doing things. \n\nBut now I have thoughts that I'll be alone forever, since social media is the main way people keep in contact nowadays. I want to focus on me, but I feel so lonely and alone. How do I move past this?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Deleted social media, but now fighting FOMO",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kizcw/deleted_social_media_but_now_fighting_fomo/"
        },
        {
            "approved_at_utc": null,
            "author": "TheDoctorDi",
            "author_created_utc": 1428247712,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_mpuat",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498858575,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj09s/psychiatrist_prescribed_me_zoloft_anxiety_is/",
            "gilded": 0,
            "id": "6kj09s",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "locked": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj09s/psychiatrist_prescribed_me_zoloft_anxiety_is/",
            "retrieved_on": 1500199758,
            "score": 3,
            "secure_media_embed": {},
            "selftext": "I have PTSD with my primary problem being severe anxiety. My psychiatrist prescribed me Zoloft a month and a week ago. I started on 25mg and she upped it to 50mg a week ago. The first time around, it was rough, my stomach was upset, I was nauseous, and my anxiety subsided briefly, but came back after a little while. The side effects did subside after a week or so. \n\nSince my dose has been doubled, I have had my migraines return, I feel sick all the time, and I'm overall not adjusting well. I want to brave out the storm to see if this dosage will work, but man I am so ill. \n\nOne of the strange things I've had occur is earworms. I have one out of  handful of songs constantly stuck in my head, but it's one or two lines and it's extremely stressful and anxiety inducing. I've never had a problem like this before. I can consciously stop briefly by focusing really hard, screaming in my head, or making actual noise. It comes right back, and is stronger when I am alone. Do any of you have a strategy to combat this? ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Psychiatrist prescribed me Zoloft... Anxiety is currently worse and I have a weird side effect",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj09s/psychiatrist_prescribed_me_zoloft_anxiety_is/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498859919,
            "domain": "self.Anxiety",
            "edited": 1499189402,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj53q/swallowing/",
            "gilded": 0,
            "id": "6kj53q",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj53q/swallowing/",
            "retrieved_on": 1500199824,
            "score": 3,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "Swallowing",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj53q/swallowing/"
        },
        {
            "approved_at_utc": null,
            "author": "kellyaoo",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498860179,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj605/anxiety_symptoms/",
            "gilded": 0,
            "id": "6kj605",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj605/anxiety_symptoms/",
            "retrieved_on": 1500199837,
            "score": 3,
            "secure_media_embed": {},
            "selftext": "Hi all, first time posting. I'm curious as to what others' anxiety symptoms are, and whether or not you've ever experienced a change in your symptoms over the course of your experience with anxiety.\n\nI feel like my symptoms have changed over the years (I am 24, and my anxiety disorder/OCD was diagnosed in high school). A few years ago when I was graduating college I experienced vague migraines that went away once I graduated. This year I am starting a new job, last summer I moved a few states away from home to attend graduate school, and am generally doing well, but inside I feel like a total mess. I'm having a lot of swaying/dizzy spells that feel as if I'm on a boat that is in rough waters. Also experiencing a lot of shortness of breath/feelings of suffocation/throat closing feelings. \n\nI have really debilitating health anxiety coupled with OCD (making it almost impossible to not obsess over anything I deem to be \"amiss\") so I always assume I'm dying because the symptoms of my anxiety seem to have evolved over the years (with a few mainstays such as constant hyperventilation/not being able to take a satisfying breath, heart fluttering, general feelings of wanting to jump out of my skin.) \n\nAnyway, was curious as to others' experiences and looking for a little validation as well haha. \n\n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anxiety symptoms",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj605/anxiety_symptoms/"
        },
        {
            "approved_at_utc": null,
            "author": "EntropyMuffin",
            "author_created_utc": 1498674186,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5eq80cc",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498857287,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kivom/i_had_another_breakdown_today/",
            "gilded": 0,
            "id": "6kivom",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 2,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kivom/i_had_another_breakdown_today/",
            "retrieved_on": 1500199695,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "I usually always feel like I'm getting better and more able to manage my anxiety and bipolar disorder, and most of the time, I guess it's true... But then sometimes something really little just makes me totally melt down, and then it's like I'm not making any progress at all... and sometimes, I'm scared that it'll never really go away, or will get worse\n\nEven though I feel like I'm a lot better most of the time, sometimes it feels like I'm still deteriorating. I know I'm not, but I guess it still just feels like it. I'm scared that I'll get worse and that maybe I'll develop a really serious disease like Schizophrenia or something, even though I don't really have any other signs of it.\n\nI don't know. I just needed to vent and feel bad about myself for a second. I hope everyone else is feeling better than I do. Thanks for reading",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I had another breakdown today",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kivom/i_had_another_breakdown_today/"
        },
        {
            "approved_at_utc": null,
            "author": "ashkraft",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498859334,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kj31v/feeling_frustrated/",
            "gilded": 0,
            "id": "6kj31v",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kj31v/feeling_frustrated/",
            "retrieved_on": 1500199797,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "I feel like whenever I get into an argument with my boyfriend, my anxiety sky rockets. I start finding myself thinking that he will never forgive me and that it'll always be in the back of his mind. \n\nI start thinking it'll be in HIS best interest not to have me around because why would he want me around to pick dumb arguments. \n\nI worry for what feels like days that I'm not good enough for him, all because of one stupid remark I may have made. I'm not sure if this is normal. But I do know I want it to stop, because he can only love me as much as I love myself. But when he gets angry so quickly, I have a hard time accepting myself through his eyes. \n\nIf this even makes sense. I'm just frustrated and anxious. Any tips? ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Feeling frustrated",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kj31v/feeling_frustrated/"
        },
        {
            "approved_at_utc": null,
            "author": "urbanskyz",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498863553,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjhcq/19f_had_my_first_really_bad_panic_attack_now_im/",
            "gilded": 0,
            "id": "6kjhcq",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjhcq/19f_had_my_first_really_bad_panic_attack_now_im/",
            "retrieved_on": 1500199993,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "So, I'm new here and I have no idea if I did this right or wrong, but I feel like I need to reach out for some advice.\n\nLet me preface this by saying that I've always been a relatively anxious person. I have had the palpitations and burning feeling in my chest before.\n\nA few days ago, I had a really bad panic attack. I had spent 20 hours over the past 2 days watching series, neglecting sleep and eating. I had been feeling some anxiety before because of an argument I had with my boyfriend (I always get very anxious whenever I think someone is upset at me). I  am used to it though - my chest just feels heavy and my body feels numb.\n\nHowever something else that had never happened to me before happened along with this. I was sitting in the shower crying, going over all the times I've made people mad at me in relationships - next thing I know it feels like a switch flipped in my head and I'm running out of the shower, I can't control my thoughts and I can barely breathe. My vision starts to go wobbly, and then everything around me seems unfamiliar and I don't recognize my parents. THAT freaked me out, losing my cognitive functions is like my greatest fear and I thought I was developing schizophrenia. I calmed down eventually, but I've been having trouble falling asleep and my appetite just returned today.\n\nI don't know what to make of it. I'm trying to find the right thought process to recover. I went to the doctor yesterday and he said I'm fine, I just need to normalize my eating and sleeping habits. (I work from home so I'm a law unto myself and because of this I was sleeping 11 hours out of the day, and barely eating.)\n\nSince it happened though, I keep evaluating all my thoughts to see if I'm going crazy, or I'm thinking anything that will trigger the same thing that happened that night. I also get anxious now whenever I don't feel 100%, like when I'm hungry or tired. Also, losing consciousness to fall asleep gives me anxiety as well. I want to be okay, but a part of me feels like this is the beginning of a decline. \n\nI don't want my anxiety to conquer me, I want to conquer it! But like my doctor said, there is no quick fix and I have to put in the work. \n\nI'd just like tips and maybe reassurance that I'm not on the brink of schizophrenia. My boyfriend is clueless about anxiety (he's the analytical type, and can't really understand what I mean when I explain my anxious thoughts to him. He has expressed his desire to learn though.)\n\nWhat do I do? ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "19F, Had my first really bad panic attack now I'm constantly scared of having another",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjhcq/19f_had_my_first_really_bad_panic_attack_now_im/"
        },
        {
            "approved_at_utc": null,
            "author": "throwawaylolanus",
            "author_created_utc": 1449373076,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_spjk1",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498866017,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjp6w/tfw_i_know_that_seeing_a_therapist_will_make_the/",
            "gilded": 0,
            "id": "6kjp6w",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjp6w/tfw_i_know_that_seeing_a_therapist_will_make_the/",
            "retrieved_on": 1500200107,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "I keep making excuse after excuse.\n\n* The therapy room is close to my friend's lockers, I don't want them to see me going in\n\nFound a time when friends weren't there\n\n* The therapy room is close to another teacher's office, I don't want them to see my going in\n\nFound a time when teachers weren't there but therapy man was\n\n* I don't have enough time\n\nThat's just completely false, I have lots of time.\n\nAfter I got over all these bullshit excuses, I walked up to the therapy door, ready to knock. And I was just instantly paralysed with fear, and walked my ass right back down the stairs.\n\nFuck this, fuck anxiety, and fuck having to constantly deal with interactions and everyday life on a lower level to everyone else.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "TFW I know that seeing a therapist will make the anxiety better especially since it hasn't gotten that bad yet, but I can't work up the courage to see the therapist BECAUSE OF THE ANXIETY.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjp6w/tfw_i_know_that_seeing_a_therapist_will_make_the/"
        },
        {
            "approved_at_utc": null,
            "author": "DNAlias",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498849189,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ki0l6/does_your_anxiety_ever_lead_to_denial_how_do_you/",
            "gilded": 0,
            "id": "6ki0l6",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 1,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6ki0l6/does_your_anxiety_ever_lead_to_denial_how_do_you/",
            "retrieved_on": 1500199266,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "Sometimes I avoid things to the point of not registering that they need to be done at all.  It makes it very difficult to motivate myself if I don't think it's a problem.  ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does your anxiety ever lead to denial? How do you cope with that?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ki0l6/does_your_anxiety_ever_lead_to_denial_how_do_you/"
        },
        {
            "approved_at_utc": null,
            "author": "panegyric",
            "author_created_utc": 1316735374,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5wqbc",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498852821,
            "domain": "themighty.com",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kierz/anyone_else_having_trouble_dealing_with_the/",
            "gilded": 0,
            "id": "6kierz",
            "is_self": false,
            "is_video": false,
            "link_flair_css_class": "discussion",
            "link_flair_text": "Discussion",
            "locked": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kierz/anyone_else_having_trouble_dealing_with_the/",
            "post_hint": "link",
            "preview": {
                "enabled": false,
                "images": [
                    {
                        "id": "g5F1xy6FTkNGsi7PnqnfoNcy8bzQsJcBWeaMWic8_6g",
                        "resolutions": [
                            {
                                "height": 53,
                                "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=87cd97d458d2c8e86ba15f53bdb2fbb4",
                                "width": 108
                            },
                            {
                                "height": 107,
                                "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=3cb427fb329454921b88f3ecd8d22255",
                                "width": 216
                            },
                            {
                                "height": 159,
                                "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=7bc1e57a2590d879b915882504b820b8",
                                "width": 320
                            },
                            {
                                "height": 319,
                                "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=40b6b9dd513a4a254695b6de03347ace",
                                "width": 640
                            },
                            {
                                "height": 479,
                                "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=9a79dd1fb4b99128929e7dac0726daa3",
                                "width": 960
                            },
                            {
                                "height": 539,
                                "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=e429379337e018b0bf445b8377af7f84",
                                "width": 1080
                            }
                        ],
                        "source": {
                            "height": 1061,
                            "url": "https://i.redditmedia.com/sT5Yv3F32hbaTwP6cR7TM8bXRyRyFmNxXDRYt2f28Fk.jpg?s=19ca49416d52f0eb90a6a1904e47d343",
                            "width": 2123
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1500199461,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "https://b.thumbs.redditmedia.com/zBBG20tVNjFbZkdG3DFQ_qIaHK38YPIqTGOmrwDbu0A.jpg",
            "thumbnail_height": 69,
            "thumbnail_width": 140,
            "title": "anyone else having trouble dealing with the healthcare debate? I've been anxious for months and I'm wondering if I'm alone. I wrote about it here and I'm hoping you'll Check it out.",
            "url": "https://themighty.com/2017/06/effects-of-healthcare-debate-on-stress-levels-people-with-chronic-illness/"
        },
        {
            "approved_at_utc": null,
            "author": "cattracka",
            "author_created_utc": 1479213255,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_12twi8",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498853300,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kigpl/how_do_you_deal_with_the_daily_grind_at_work/",
            "gilded": 0,
            "id": "6kigpl",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kigpl/how_do_you_deal_with_the_daily_grind_at_work/",
            "retrieved_on": 1500199488,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "I have been out of work for a while due to medical problems. The thing I fear most about going back to work is going back to feeling the way I did before. \n\nI was a teacher. I felt like my life was on repeat every day. Although the lessons might change, the general pattern was always the same. The days seemed to drag on longer and longer, and I got more claustrophobic as I went.  Just looking at the clock would make panic set in.\n\nThat's where the other medical issues came in. I have a severe case of IBS which is only made worse by my mental health problems. It's not really curable, so all I can do is fight the symptoms and hope for the best. When I'm stressed, there's nothing I can do. Even with medication, it will hit me full force. \n\nAnd when it comes to the anxiety and depression, my doctors say that I am resistant to medication after over a decade of no improvement on various different pills. They're going to start electroshock in August. If that doesn't work, I doubt these things will ever change.\n\nI spent most days leaving in the middle of lessons to run to the bathroom, throw up, or any number of embarassing things. It got to the point where I was in constant fear of an episode, which made the stress I already felt skyrocket out of control. I'm scared to death of going back to work.\n\nHow do you cope with it? How do you put up with the long, endless days? The claustrophobic, trapped feeling? The panic attacks? The pity from coworkers and the bad attitude from bosses?\n\n(I've tried general techniques from my therapist. Breathing exercises, naming off different objects and details of those objects... but those techniques don't work so well in the middle of engaging work.)",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "How do you deal with the daily grind at work?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kigpl/how_do_you_deal_with_the_daily_grind_at_work/"
        },
        {
            "approved_at_utc": null,
            "author": "IrishSoap",
            "author_created_utc": 1440168312,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_pqnzj",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498865960,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjoz8/im_down_to_four_pills_of_lexapro_and_my_dr_is_on/",
            "gilded": 0,
            "id": "6kjoz8",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "medsflair",
            "link_flair_text": "Medication",
            "locked": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjoz8/im_down_to_four_pills_of_lexapro_and_my_dr_is_on/",
            "retrieved_on": 1500200101,
            "score": 2,
            "secure_media_embed": {},
            "selftext": "What do I do? I started on Escitalopram 2 months ago and my life has really turned around since then. I've gotten two raises and I feel happy for the first time since my preteens (I'm 25 now).\n\nI don't want to go back to obsessing over small mistakes for days on end. I want to have a clear mind and I'm nervous I will lose that clarity once my prescription runs out.\n\nWhat can I do to get at least a few pills of 20mg Escitalopram until he gets back?  ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I'm down to four pills of lexapro and my dr. is on vacation until 6 days from now",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjoz8/im_down_to_four_pills_of_lexapro_and_my_dr_is_on/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498866083,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kjpdn/heart_attack_thought_loop/",
            "gilded": 0,
            "id": "6kjpdn",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 0,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kjpdn/heart_attack_thought_loop/",
            "retrieved_on": 1500200109,
            "score": 1,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "Heart Attack; Thought Loop!",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kjpdn/heart_attack_thought_loop/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498858257,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6kiz50/how_to_not_be_such_a_hypochondriac/",
            "gilded": 0,
            "id": "6kiz50",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 3,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6kiz50/how_to_not_be_such_a_hypochondriac/",
            "retrieved_on": 1500199742,
            "score": 1,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "How to not be such a hypochondriac?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6kiz50/how_to_not_be_such_a_hypochondriac/"
        }
    ]
}