{
    "data": [
        {
            "approved_at_utc": null,
            "author": "AP_Renekton",
            "author_created_utc": 1396746023,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_g059c",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498335184,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ja8z1/during_work_days_i_look_forward_to_my_days_off/",
            "gilded": 0,
            "id": "6ja8z1",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6ja8z1/during_work_days_i_look_forward_to_my_days_off/",
            "retrieved_on": 1500177591,
            "score": 481,
            "secure_media_embed": {},
            "selftext": "Has anyone had a similar experience, or does anyone have any suggestions? I don't particularly dislike my job either, outside of having to wake up early - but this has gone on for a couple of years and a couple of different jobs.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "During work days, I look forward to my days off. During days off, I stress over when I have to go back to work.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ja8z1/during_work_days_i_look_forward_to_my_days_off/"
        },
        {
            "approved_at_utc": null,
            "author": "Fuzzyduck76",
            "author_created_utc": 1461640052,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_xglam",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498153925,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6iv710/is_anyone_elses_social_anxiety_exponentially/",
            "gilded": 0,
            "id": "6iv710",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 65,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6iv710/is_anyone_elses_social_anxiety_exponentially/",
            "retrieved_on": 1500170153,
            "score": 362,
            "secure_media_embed": {},
            "selftext": "My social anxiety is bad but still pretty manageable. However, when I need to talk to someone on the phone, it's like I instantly start having a full-blown panic attack.\n\nIt seriously makes me feel shaky and sick at my stomach for the entire rest of the day. :'(",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Is anyone else's social anxiety exponentially worse when they have to speak on a phone?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6iv710/is_anyone_elses_social_anxiety_exponentially/"
        },
        {
            "approved_at_utc": null,
            "author": "morimushroom",
            "author_created_utc": 1451797267,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_tfli9",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498504358,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jn91x/lpt_slow_the_fuck_down/",
            "gilded": 0,
            "id": "6jn91x",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 30,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jn91x/lpt_slow_the_fuck_down/",
            "retrieved_on": 1500184082,
            "score": 349,
            "secure_media_embed": {},
            "selftext": "Seriously. A minute ago, I was shoveling food into my  mouth. I felt like I had a billion things to do at the moment, even though in reality I had a lot of time to do those things.  I felt light headed and my heart was racing. In the moment I realized that there was no point  in rushing and decided to take my time eating. As soon as I started to slow down, my anxiety instantly improved. I  didn't feel 100%, but I felt more calm and less overwhelmed than before. It's weird how a simple thing like eating slowly can change things up.\n\n(forgive me if this is an obvious LPT.  It's certainly not new because I've been told it countless times, but I've often overlooked it. Hopefully this will help those of you who overlooked it as I have.)",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "LPT: slow the fuck down.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jn91x/lpt_slow_the_fuck_down/"
        },
        {
            "approved_at_utc": null,
            "author": "darus214",
            "author_created_utc": 1320339539,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_668xi",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498432955,
            "domain": "self.Anxiety",
            "edited": 1498491110,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jhgz5/im_25_lost_all_my_friends_dropped_out_of_college/",
            "gilded": 0,
            "id": "6jhgz5",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jhgz5/im_25_lost_all_my_friends_dropped_out_of_college/",
            "retrieved_on": 1500181229,
            "score": 192,
            "secure_media_embed": {},
            "selftext": "Edit: Thank you everyone for the wonderful comments. I’ve read every single one and I will definitely take the advice. I am definitely in a good place right now, better than I was several years ago and I’d like to keep that momentum going. It’s easy to look back now and see what I did right/wrong but I still feel a bit stuck. My pills are definitely helping and I should probably start therapy but I’ve been putting off. I know things can change for the better because they already have and your awesome advice and words are definitely helping. Thank you everyone!\n\n\nYou don’t have to read this, it’s more for venting and maybe getting some perspective from strangers. \n\n\n Anxiety has ruined my life and It’s time I took it back. \n\nI’ve had generalized anxiety all my life. It has always kept me from enjoying life, being a kid, meeting people, or even presenting a project during class. I never understood what was happening or that it all related until it started getting really bad. \n\nMy childhood years were spent worrying about my alcoholic father. Never knew how bad the night would be but I always knew there was a fight coming. I don’t know if this is where it started but it definitely didn’t help. Seeing my mom and 3 sisters in a constant state of panic and always being in the middle of it all makes me feel like I was raised to have constant fear. When I finally decided that something had to change, I forced my own father out of the house and hoped for the best. \n\nAt this point in my life I was graduating 8th grade and helping my mom take care of my little sister. My 2 older sisters moved out but were always a call away. As a family we did everything together. Through thick or thin, I could always count on them. My mom was struggling to find a job but somehow managed to make ends meet. My father was a worthless piece of shit that made life difficult even though he wasn’t living with us. \n\nAt first he would stalk and try to scare my family into thinking she was going to jail. The battle for the house would last years and the constant fear for my moms life was always in the back of my mind. Every letter in the mail made my stomach turn. Eventually my father forced us into foreclosure and the endless bills not meant for a single mother forced her into bankruptcy. You’d expect parents to shield their kids from things like this but my family was a bit different. Coming from Europe without knowing the language meant my sisters and I had to translate everything. Any bill or court document was given to us and we were the ones that had to analyze it and take care of it. On one hand I got a really good taste of the adult world and made me learn a lot about finances. I guess you can always find a silver lining in everything. \n\nHigh school was one of the best years of my life. I somehow managed to make friends, thanks to my 1 childhood friend. I probably would never have experienced high school the way I did if I didn’t ride on the coattails of her popularity. As with all teenagers, I managed to get my drivers license and it was such a freeing experience that for some time after, my anxiety was gone. I did everything with my friends and for a short while, I felt normal. That is probably why it was at this point that I decided to come out.  \n\nAs if I didn’t have enough going on in my life, through all of these years I was having an internal struggle with my own body. High school was a time I finally accepted myself and decided to come out. My friends were shocked and all but they still accepted me for me. With everything my family had been through, I was not going to throw this at them so for a short while I kept it to myself. \n\nAfter graduating high school I was still feeling pretty great about myself. I managed to get into Depaul University in downtown Chicago with a major in web design. I though I was going to like the college experience but it turned out to be the complete opposite. It’s at this point in my life that I felt like I was never going to be ok again. We had just moved to the suburbs after loosing the house. It took me 1.5 hours just to make it to school. I didn’t plan on living in the suburbs before accepting my application.  I hated everything about it. Id get panic attacks just thinking of riding the train. To this day, the though of going downtown gives me anxiety. So many people everywhere and not a single place to hide. I don’t know where it went wrong but I started to slip. I couldn’t eat, I couldn’t think, and school was just making it worse. My first year was pretty easy but I made the mistake of getting a full time job that my brother-in-law got me, working in the office at the same truck repair shop he was working as a mechanic. When my sophomore year of school approached I had already wiped out most of my social life. My anxiety was so bad I could only eat once a day. The though of school projects, group presentations, endless essays, and the never ending school days left me in a state of panic I could not get out. I had lost so much weight I was always weak. I had no energy for anything and all that progress I had made in high school was completely wiped out and now I was left with anxiety I had never experienced before and left all alone with no friends. \n\nI had managed to hide most of this from my family by always putting on a brave face . I don’t know why I did that because things may have been different if I had just asked for help. Working and going to school full time was stupid but it was my brother-in-law that made it worse. \n\nSomehow he became my father and started to drink. My oldest sister was now living the same life we all knew too well. Their 2 kids ended up being in that same environment my sisters and I had experienced growing up. We all knew what it meant and we had enough. During one of his drinking marathons, my sister left him for good. The fear of loosing everything must’ve really terrified him because he managed to go to an AA meeting and turn his life around. He has managed to be alcohol-free to this day which is something I wish I could say about my own father. \n\nYet again, things were turning around for my family but I was still sick to my stomach. After being in a constant state of anxiety, my body began to break. I knew if I kept this up, I would not survive but I didn’t want to burned my family which is probably why I never got help. On the other hand, I always thought my anxiety would pass and that my troubles were all in my head. It took my aunt from halfway across the world to see that something was wrong before I could get myself to go see a doctor. \n\nIt was a day when my mom had FaceTimed her sister that it all changed for me. They were talking for hours about anything that popped in their head when the topic of me came up. I started chatting with my aunt and explaining my situation that she noticed something wrong. She had been a nurse in France for many years and she saw the signs of someone calling out for help. My weight had plummeted since the last time she saw me and she knew we had a lot on our plates. She did not like what she was seeing and she told my mom to take me to a doctor right away. A few days later I had an appointment and a real explanation for my symptoms. \n\nI was diagnosed with generalized anxiety which I’m being treated for with medication. After several years of taking them, I’ve managed to live a somewhat normal life. I don’t wake up in fear. I can eat normally without throwing up.  I can go to the mall and not sweat like it’s a life and death situation. I even managed to take a solo trip to San Francisco and experienced one of the best vacations of my life. My family is finally on solid ground, with my youngest sister just graduating college, my oldest sister buying a house with her husband with a huge yard for the kids, and my other sister becoming a mommy and having a family of her own. When I think back and realize just how far we’ve come, I am extremely happy that my family got through the hardship and we can finally be happy. But on the other hand, I feel I am struggling to make a life of my own. I am now 25, living in my own condo that I purchased at 21, and enjoying a steady job that I managed to get on my own. I should be happy but with no one to share it with, I am finding myself wishing for more. \n\nI have never been on a date, experienced valentines with a loved one, or celebrated an anniversary. I fear that after being alone for so long I can no longer adjust to a life where I have to co-depend on someone. I have no friends. I don’t go out. Every day is the same old story. I feel my life is stuck on repeat where all I do is work and sleep. My weekends fly by because all I do is stay home and browse reddit or watch a movie. My only means of getting out is to visit my sisters or to go to work. After high school, hanging out with my friends gave me anxiety but now that several years have passed and my one friend from my childhood (let’s call her ash) is getting married, I would like to change. I don’t care about the others but I know I was a lousy friend to ash. I don’t expect her to understand anxiety but I wish I wasn’t left out. Anxiety has ruined my life and made me miss many of the things young people do and I won’t be able to get that back but going forward I want things to be different, I just wish I knew how to do that. I don’t want to wake up one day on my death bed with absolutely nothing to show for my life, wishing for one more chance. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I'm 25, lost all my friends, dropped out of college, and never dated. How do I get my life back?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jhgz5/im_25_lost_all_my_friends_dropped_out_of_college/"
        },
        {
            "approved_at_utc": null,
            "author": "coalmines",
            "author_created_utc": 1361157340,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_amzms",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498669107,
            "domain": "self.Anxiety",
            "edited": 1498747528,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6k1wk2/i_got_up_and_went_to_work_today/",
            "gilded": 0,
            "id": "6k1wk2",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6k1wk2/i_got_up_and_went_to_work_today/",
            "retrieved_on": 1500191323,
            "score": 181,
            "secure_media_embed": {},
            "selftext": "So this is my first time posting on here.  I haven't had any anxiety issues recently until  I had a severe anxiety attack three nights ago.  It was the first time I had physical symptoms manifest from it and it lasted about two hours.  It left me in a terrible state and I called in sick the past two days and even went to an emergency mental health clinic and was prescribed prozac.  I spent the past two days in bed being nervous about work.  The thought of going to work this morning made my heart race and I began to shake but I don't have anymore sick days.  However, I just made myself do it.  I thought to myself, what if I had to support children?  I know it probably isn't good to put pressure on yourself but I just forced myself to go.  I knew if I didn't do it now I might never do it. The drive was not the best but once I got to work I felt okay.  I'm still worried about how I will feel when I get home or tomorrow morning before work but I feel so proud that I got out of bed and did it today.\n\n*Update: I made it through the work day and woke up the following morning without any anxiety about work!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I got up and went to work today.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6k1wk2/i_got_up_and_went_to_work_today/"
        },
        {
            "approved_at_utc": null,
            "author": "Grassmartian",
            "author_created_utc": 1492457070,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_175rjr",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498587326,
            "domain": "self.Anxiety",
            "edited": 1498609485,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jul5i/i_bury_my_best_friend_tomorrow_i_bumped_into_my/",
            "gilded": 0,
            "id": "6jul5i",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "relationshipflair",
            "link_flair_text": "Relationships",
            "locked": false,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jul5i/i_bury_my_best_friend_tomorrow_i_bumped_into_my/",
            "retrieved_on": 1500187709,
            "score": 174,
            "secure_media_embed": {},
            "selftext": "Tomorrow I bury my best friend who tragically passed away at the age of 25. I'm heartbroken and I will be speaking at his funeral. I am happy with the speech but I am nervous, petrified to mess up. He was an incredible guy and I want to send him off well, justify what he meant to me. \n\nmy ex who broke up with me 2 months ago has kept contact to ask how I have been doing and if I ever needed anything go to her. \n\nI went to the gym yesterday evening just to pass the time and maybe work off a small hangover I was nursing from the night before. I felt okay but by the end of my session I was very tired. \n\nAs I was walking back towards my flat I spot my ex with a guy next to her sitting down. I could have turned around but I didn't. I go up to her and say hi, she seems shocked to see me and asks if I'm doing okay. I say no, not really and say I'll leave them to it and say goodbye. \n\nAs I walk down the road my ex has caught up with me after she runs to catch up with me. She says she has done this to tell me that what's happening with her and him is not what it seems and she didn't want me to worry about something when it's not. She says they are not seeing each other and that he is just a work friend. That he is going through a hard time. \n\nWe then get talking about how I'm feeling, how devestated I am, how I'm scared for Wednesday. She and a mutual friend went to a concert last week and she mentions they talked. She said she went on a rant about how much she cares about me, that I was her best friend, that she is worried for me. She says she's nearly messaged me just to see if I want to hang out. She has come to me since my best friends death to apologise and she says that she will leave me alone now and will wait for me to message. \n\nI do say I miss her but right now my head is all over the place. I'm considering my options about going home and starting again. That I'm not looking for anyone right now. I'm just tired, exhausted. She said I look like I haven't eaten well, that I'm really pale. She nearly went to the same club as me the night before but didn't and stays she's glad she didn't. \n\nShe offers to cook me a meal or go for coffee. That she is always here for me. I ask again about them and she says they're not seeing other, that something could happen but it isn't. \n\nI accidentally saw her open diary just before the break up about a guy who has a family that makes her laugh, feel alive. This guy has a child. I recognise him from her xmas party. \n\nI'm really confused about why she chased after me. It's obvious she cares but is she feeling guilty, trying to spare my feelings in the hardest time of my life. \n\nI do want her back in my life but seeing her with another guy hurt big time. Seeing them close to each other eating ice cream. She works with him, did she like him when we were dating. \n\nI also hate the idea of her sharing her sympathy and support with other people, especially a guy like that. And it hurts to hear her say to me he's going through a hard time. I'm going through the hardest time of my life. I feel like I can't use her as a crutch.\n\nI'm so confused, hurt, a mess. I bury my best friend tomorrow . I am absolutely terrified. I feel sick, like I'm going to mess up and ruin everything. \n\nThe last 2 months has been the worst of my life, it just has. I want things to be better. I want him back. I want her back. I feel terrible. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I bury my best friend tomorrow. I bumped into my ex with another guy. I can't deal with this. I feel sick.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jul5i/i_bury_my_best_friend_tomorrow_i_bumped_into_my/"
        },
        {
            "approved_at_utc": null,
            "author": "Massive_Moonhead",
            "author_created_utc": 1361298627,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_anpnw",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498642183,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jzhea/i_read_a_poem_at_my_mums_funeral_yesterday/",
            "gilded": 0,
            "id": "6jzhea",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jzhea/i_read_a_poem_at_my_mums_funeral_yesterday/",
            "retrieved_on": 1500190131,
            "score": 173,
            "secure_media_embed": {},
            "selftext": "I had a panic in the funeral car because I was sat between 2 people and felt trapped, but it only lasted a couple of minutes and managed to control it. I don't know how I found the strength to read the poem out as public speaking is my biggest fear, but I knew mum would be proud and needed to represent and had a few nice comments afterwards. I am pretty proud of myself today for doing the hardest thing I've ever had to do in my life. So fuck you anxiety, you didn't win this time.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I read a poem at my mums funeral yesterday",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jzhea/i_read_a_poem_at_my_mums_funeral_yesterday/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498253237,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j46wr/heres_something_simple_you_can_do_during_a_panic/",
            "gilded": 0,
            "id": "6j46wr",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j46wr/heres_something_simple_you_can_do_during_a_panic/",
            "retrieved_on": 1500174605,
            "score": 148,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "here's something simple you can do during a panic attack - play i-spy",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j46wr/heres_something_simple_you_can_do_during_a_panic/"
        },
        {
            "approved_at_utc": null,
            "author": "itsonlyfear",
            "author_created_utc": 1496069426,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_2ibaoql",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498093959,
            "domain": "self.Anxiety",
            "edited": 1498249662,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6iq8ck/if_you_need_some_encouragement/",
            "gilded": 0,
            "id": "6iq8ck",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6iq8ck/if_you_need_some_encouragement/",
            "retrieved_on": 1500167705,
            "score": 146,
            "secure_media_embed": {},
            "selftext": "[removed]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "If you need some encouragement",
            "url": "https://www.reddit.com/r/Anxiety/comments/6iq8ck/if_you_need_some_encouragement/"
        },
        {
            "approved_at_utc": null,
            "author": "kittykittycatbean",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498403763,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jetic/dae_get_anxious_in_a_social_situation_where_you/",
            "gilded": 0,
            "id": "6jetic",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jetic/dae_get_anxious_in_a_social_situation_where_you/",
            "retrieved_on": 1500179922,
            "score": 146,
            "secure_media_embed": {},
            "selftext": "(i.e.) introducing my parents to my boyfriends parents, or a coworker to a friend? \n\nI feel like I have to be the glue that holds the groups together, entertain them, and keep them both feeling equally included. So much of my energy goes into making sure I look cool and relaxed, figuring out what I should be doing with my hands, who I need to introduce to who. I probably look so uncomfortable. By the end of the get together, I've had zero fun and I'm exhausted. \n\nCan anyone relate, or does anyone have tips for dealing. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "DAE get anxious in a social situation where you are the only connection between 2 social groups?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jetic/dae_get_anxious_in_a_social_situation_where_you/"
        },
        {
            "approved_at_utc": null,
            "author": "MetebelisE",
            "author_created_utc": 1451474679,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_tc7z7",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498297505,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j7cri/anxious_about_writing_literally_anything_emails/",
            "gilded": 0,
            "id": "6j7cri",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 27,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j7cri/anxious_about_writing_literally_anything_emails/",
            "retrieved_on": 1500176166,
            "score": 94,
            "secure_media_embed": {},
            "selftext": "I am the least anxious person I know in many ways- very little scares me. But I get extremely anxious about writing. And writing anything. \n\nResponding to messages, writing notes for my neighbour explaining how to feed my cat, writing emails to colleagues. It takes me forever to do because I get so anxious I just proof read and proof read. Objectively, it doesn't matter if I make mistakes and I'm not sure I would care if I did but there's something about writing anything turns me into a complete perfectionist.\n\nI've got an email to reply to at the minute. I need to write something about 2 lines long so I've been thinking about it for about 2 hours and putting off doing it because I'm... afraid? Of what, I really don't know.\n\nWhen I try and Google the problem, there's lots of people talking about essay writing anxiety, or email writing anxiety and nobody talking about writing anything at all anxiety. \n\nDoes anyone have any advice? The advice I'd probably give myself is \"go and see a therapist, you idiot\". But, like many people I suppose, I have no idea how to even go about doing that. And how would I explain what's wrong?\n\n(Obviously, terrified of writing this and posting this... but somehow pressing the submit button.)",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "anxious about writing literally anything - emails, texts, notes, this post. Help!",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j7cri/anxious_about_writing_literally_anything_emails/"
        },
        {
            "approved_at_utc": null,
            "author": "publictalk",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498383647,
            "domain": "self.Anxiety",
            "edited": 1498386174,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jdjdz/watching_the_disney_channel_at_4am_in_the_er/",
            "gilded": 0,
            "id": "6jdjdz",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jdjdz/watching_the_disney_channel_at_4am_in_the_er/",
            "retrieved_on": 1500179293,
            "score": 86,
            "secure_media_embed": {},
            "selftext": "It feels nice to be healthy for a couple of hours. Makes you realize how awful anxiety really is.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Watching the Disney channel at 4am in the ER waiting room was by far the most relaxing thing I've done in months",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jdjdz/watching_the_disney_channel_at_4am_in_the_er/"
        },
        {
            "approved_at_utc": null,
            "author": "CuteThingsAndLove",
            "author_created_utc": 1440773117,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_pxc6w",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498142511,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6itwre/so_my_coworker_unexpectedly_and_very_suddenly/",
            "gilded": 0,
            "id": "6itwre",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6itwre/so_my_coworker_unexpectedly_and_very_suddenly/",
            "retrieved_on": 1500169521,
            "score": 86,
            "secure_media_embed": {},
            "selftext": "He was like my age, early 20's. I saw him every day and this does not feel real, and I've been disassociating since I found out which was like an hour ago.\n\nDeath/afterlife is my trigger. So I think I'm the only person at work who reacted as strongly as I did. My dad came and brought me xanax and even cut it in half for me so I won't fall asleep at my desk.\n\nI didnt have a full on anxiety attack though, which is good I guess but I'm worried it will happen later on when I least expect it. Thats what happened when I had the worst attack of my life; my dog died and I cried a lot but then about a month later I had the attack. It was awful, my worst memory. And at that time I didnt think about it but I'm 100% certain it was because of his death.\n\nI don't know what to do. All my coworkers are now coming up to me either saying \"man that sucks\" or something along those lines and some of them who saw my reaction are now asking if I'm okay. I don't want to talk about it but I think I have to.\n\nThe xanax is working. I'm calm. But I think I'm getting sleepy.\n\nI dont know what I was really writing. I think I just wanted to share it with someone, have it written down somewhere. I dont think I'm being coherent really but I can't tell\n\n\n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "So, my coworker unexpectedly and very suddenly passed away last night",
            "url": "https://www.reddit.com/r/Anxiety/comments/6itwre/so_my_coworker_unexpectedly_and_very_suddenly/"
        },
        {
            "approved_at_utc": null,
            "author": "dzejvi",
            "author_created_utc": 1437170771,
            "author_flair_css_class": "",
            "author_flair_text": "Recovering",
            "author_fullname": "t2_ovgeh",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498217733,
            "domain": "self.Anxiety",
            "edited": 1498217957,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j0mhm/selfhelp_for_panic_attacks_my_tips/",
            "gilded": 0,
            "id": "6j0mhm",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j0mhm/selfhelp_for_panic_attacks_my_tips/",
            "retrieved_on": 1500172843,
            "score": 84,
            "secure_media_embed": {},
            "selftext": "I'm going to copy here what I wrote to some person and maybe you people can find it useful. I've been dealing with anxiety and panic attacks for years and I learned how to prevent them and how to help myself during and after the attack. So,  \n\n\n**During a panic attack, what I'm doing:**  \n- having a water besides me  \n- going somewhere where I feel safe and where I'm alone  \n- breathing, trying to calm myself down by repeating myself that I'm safe and that's everything's going to be okay  \n- repeating that it's \"just\" a panic attack and that it'll go away after a few minutes  \n- sometimes, if I'm home, lying on my bed with some relaxing music with closed eyes  \n- taking the medication for anxiety as fast as I can (if you're taking them)  \n\n\n**What I'm doing after the panic attack:**  \n- drinking enough water  \n- rest, rest, rest  \n- writing about it and tell that to my doctor (if you have a doctor)  \n- talking to someone about it  \n- generally taking care of myself  \n\n\n**What I'm doing to prevent the next panic attack:**  \n- recognizing the triggers and early symptoms of it  \n- after you recognized the early symptoms, trying to calm yourself down for prevention  \n- drinking water and staying hydrated if you notice the symptoms  \n- going somewhere safe until you feel good enough to go to the outside world  \n- taking the medication for anxiety (if you're taking them) when you notice that the symptoms are getting worse and you can't calm yourself down mentally  \n- remembering one thing:  \n----&gt; if you panic about the physical sensations and symptoms (usually they're the first one to appear), it's more likely that you'll get the panic attack. It's important to just recognize the sensations and trying to do something for your body to calm down after you calm down the mind. But the most important thing I've learned through my journey is learning to calm down your mind, because that's the real prevention. The only dangerous thing that can happen to you during the panic attack is being anxious, which can be scary to you and that's why I said (subjectively) dangerous. But prevention is really important; If I didn't know how to prevent the panic attacks, I would be on much more medications right now.  \n\nHope I helped someone, and if anyone has any questions about panic attacks, my PM is open.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Self-help for panic attacks (my tips)",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j0mhm/selfhelp_for_panic_attacks_my_tips/"
        },
        {
            "approved_at_utc": null,
            "author": "everydaycolonic",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498249386,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j3sxu/not_used_to_feeling_no_anxiety/",
            "gilded": 0,
            "id": "6j3sxu",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 50,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j3sxu/not_used_to_feeling_no_anxiety/",
            "retrieved_on": 1500174413,
            "score": 74,
            "secure_media_embed": {},
            "selftext": "Anyone else get super freaked out for a couple minutes when they're doing something and not feeling anxious? Like, almost depending on anxiety as a feeling of \"normal\".",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Not used to feeling no anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j3sxu/not_used_to_feeling_no_anxiety/"
        },
        {
            "approved_at_utc": null,
            "author": "HotAssMess",
            "author_created_utc": 1469647885,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_zv88g",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498526182,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jpf80/today_i_made_it_to_my_7th_consecutive_day/",
            "gilded": 0,
            "id": "6jpf80",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jpf80/today_i_made_it_to_my_7th_consecutive_day/",
            "retrieved_on": 1500185158,
            "score": 72,
            "secure_media_embed": {},
            "selftext": "I successfully meditated for 25 minutes today. I feel good. That's all I wanted to say! ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Today, I made it to my 7th consecutive day meditating.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jpf80/today_i_made_it_to_my_7th_consecutive_day/"
        },
        {
            "approved_at_utc": null,
            "author": "juninhhh",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498320367,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j8x83/am_i_a_shitty_person_because_i_dont_feel_like/",
            "gilded": 0,
            "id": "6j8x83",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j8x83/am_i_a_shitty_person_because_i_dont_feel_like/",
            "retrieved_on": 1500176937,
            "score": 70,
            "secure_media_embed": {},
            "selftext": "Sometimes even when I'm with other people, I like to just sit in my thoughts and it makes me uneasy to talk. Like it feels forced and like the only purpose is to break the silence. At the same time I feel like who I'm with thinks I don't want to be around them if I don't talk",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Am I a shitty person because I don't feel like talking",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j8x83/am_i_a_shitty_person_because_i_dont_feel_like/"
        },
        {
            "approved_at_utc": null,
            "author": "PsychTau",
            "author_created_utc": 1497212735,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3s0d5fp",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498222209,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j0zh0/how_do_you_get_out_of_your_head/",
            "gilded": 0,
            "id": "6j0zh0",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j0zh0/how_do_you_get_out_of_your_head/",
            "retrieved_on": 1500173021,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "Started a new job two months ago, in a position I have no experience in (but have related experience).  The past two weeks have been awful and I'm completely stuck in my anxious thoughts...questioning every decision I make, everything I say, feeling like I'm stupid.  Supervisor wants me to be more \"aggressive\" and just charge through things and don't let people \"get one over on me\", which I didn't know was actually happening so now I doubt my intelligence and abilities even more.  How do I get out of my head and stop ruminating on this?  How do I get rid of my crippling self doubt that is causing me to not get things done because I'm afraid of doing them wrong?  I can tell myself it's not rational but I can't convince myself of that.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "How do you \"Get out of your head\"?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j0zh0/how_do_you_get_out_of_your_head/"
        },
        {
            "approved_at_utc": null,
            "author": "Strawberrycho",
            "author_created_utc": 1442763665,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_qm0sm",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498487213,
            "domain": "self.Anxiety",
            "edited": 1498510704,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jle56/im_23_have_a_2_year_old_live_in_culture_were/",
            "gilded": 0,
            "id": "6jle56",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jle56/im_23_have_a_2_year_old_live_in_culture_were/",
            "retrieved_on": 1500183168,
            "score": 58,
            "secure_media_embed": {},
            "selftext": "I'm 23 with a 2 year old son. I have anxiety with I take medication for but recently stopped because my parents don't believe in anxiety or therapy for it, so they stopped buying my medication and sending it to me( I live in a different country as them but still close enough to get there in an hour flight).\n\nI come from a country where it's frowned upon so I can't get anyone to talk to and help me. I have been dealing with a lot lately I need somewhere to let it out. I feel like I'm just floating through the world aimlessly most of the time. It's hard for me to get out of bed and go to class because I start thinking of all the things that could go wrong and how I don't have any friends there. I don't live with my son, he lives in my home country with my parents, this wasn't a choice I was forced into this under the threat that they would cut me off financially (paying for my classes). I get panic attakes which always leave me  much more anxious. \n\nI recently got engaged but I'm having doubts about that, my fiancé is not as financially stable as my parents would like, so I'm stuck in the middle having to juggle between making them happy and trying to make myself happy. I haven't told them he asked to marry me because they'll ask if his got the money to pay for me and our son (who he doesn't get to see). I don't go to a university so no free councilling and the health care here is atrocious so nothing is truly free. \n\nA few days ago my brother who recently got married and had a daughter has decided since he has his own family he doesn't want anything to do with me anymore. He called out of the blue and told me to leave him alone and I was ruining his family. Please understand I did nothing for all this. He also cut off my older sister and my mother. His never really gotten along with my father. He was the only person that understood me and was patient with me. So that's really been hard for me to get over but I will do as he says and leave him alone. \n\nMy mother on the other hand hates my fiancé and has set out to make my life as difficult as she can. She will go from telling my oldest brothers that I stole money from her to telling my aunt (whom I live with at the moment) that I don't pick up her calls or reply her messages. I call my mother everyday to speak to my son so he won't forget me or my voice. My son suddenly got blind out of nowhere (but has since regained his sight), she blames me and my fiancé for that. She comes into the room where I am and starts screaming about how much she hates my fiancé and his family. She tells everyone. \n\nMy father like most fathers in my culture only talks to his children about school and nothing else. So I can't talk to him. \n\nThere's so much more happening but I won't get into it. I just needed someone to talk to who isn't family\n\nEdit: someone just commented saying I should leave school. I can't leave school right now. In my home country the best job I can get will only pay me $200 per month. My son has a medical condition which needs over $600 per month in medication. So leaving school isn't an option. Also this is one of those countries were beating your child isn't illegal. \n\nEdit 2: I went home when I was pregnant because I was too sick to stay here with my boyfriend especially when he hasn't paid the bride price. My mother had to come get me from the hospital at 7 months.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I'm 23, have a 2 year old. Live in culture were therapy is frowned upon",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jle56/im_23_have_a_2_year_old_live_in_culture_were/"
        },
        {
            "approved_at_utc": null,
            "author": "VAPOR_HappyRain_WAVE",
            "author_created_utc": 1481207393,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_13ev1g",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498305147,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6j7rh4/i_obsess_over_if_i_ever_upset_someone_and_its/",
            "gilded": 0,
            "id": "6j7rh4",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6j7rh4/i_obsess_over_if_i_ever_upset_someone_and_its/",
            "retrieved_on": 1500176368,
            "score": 56,
            "secure_media_embed": {},
            "selftext": "So, as the title implies, I cling onto every chance of a possible relationship with anyone, and end up hurting myself because of it. What I mean by that is that I have a huge issue of desperately needing approval of people around me, and I am super paranoid that any tiny little thing that I did will cause someone I like (platonic or not) to dislike me and want nothing to do with me.\n\nSo I end up fixating on what I say to people, and when I am not interacting with people, I am paranoid that what I said made them hate me or something like that, not matter how ridiculous it is.\nI do have a fair few diagnosed mental health issues and maybe some undiagnosed ones. But aside from medication and therapy, is there any good techniques to calm myself in the moment? This is really keeping me from just enjoying my time with people...\n\n-----\n\nTLDR: I'm always obsessive about if I said something wrong to someone to cause them to hate me, even if there is no reason to think that way, and it keeps me from just enjoying my time with people.\n\nAlso sorry if this is the wrong subreddit to post this in. I think it is but I could be wrong... :'(\n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I obsess over if I ever upset someone, and it's keeping me from enjoying talking to people.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6j7rh4/i_obsess_over_if_i_ever_upset_someone_and_its/"
        },
        {
            "approved_at_utc": null,
            "author": "raingodofmorning",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498413601,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jfpse/does_anyone_else_avoid_other_people_because_they/",
            "gilded": 0,
            "id": "6jfpse",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jfpse/does_anyone_else_avoid_other_people_because_they/",
            "retrieved_on": 1500180362,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "When I was about 12 (25 years ago), I used to have this group of friends that I would go out to lunch with to restaurants near school on half days. One day at school, I overheard this one guy who was in the same group ask another guy in the group if I was going to lunch that day. The other guy said no, and the first guy said \"good, because raingodofmorning is so annoying.\" Then he turned around and saw me, and gave some half-hearted, awkward, non-apology. \n\nI've never really gotten over this, and I have a fear of hanging out with people and them secretly wishing I wasn't there because I'm so annoying, but me never knowing about it. And I actually think that I might be pretty annoying to be around. My brain works really, really fast and I have anxiety and adhd, so I talk fast and I can talk a lot. I put a ton of effort into not interrupting, but it's very hard to listen without getting distracted by random thoughts. (I know that everyone does this, and try to remind myself most people aren't paying attention to everything I say, but I feel like an extreme case of this). I have trouble in awkward silences with coworkers not filling the silence, like I never know when to leave someone's office or how to stop talking when someone is in my office--even if I want the person to leave. \n\nI don't talk to anyone outside of work except for some out of town friends via text (I type too much there, too). I had some friends I used to hang out with at these gatherings where they'd host people at their house weekly, and I stopped hanging out with them suddenly. I saw them recently when they came by to pick up something from me, and it was a pretty awkward encounter, and they didn't say anything like \"we miss you at the gatherings\" or \"why don't you come anymore?,\" or \"you should come next week,\" or anything, really, outside of a vague \"we should get dinner sometime\" that sounded like the clichéd thing people say when parting, regardless of whether they mean it. This is something I've identified as an external clue (as in, not something from my own head) that they might also find me annoying. \n\nI'm not quite sure if I should work on: (a) just accepting that I am an annoying person and being okay with keeping my contact with others limited in order to avoid inadvertently thrusting myself upon a social group one too many times, or (b) if I should work on convincing myself that I'm not annoying, even if it isn't really true. (I do see a therapist. This is one of many issues we work on, but it is very slow going).\n\nAnyone with similar experiences? Any thoughts/advice/opinions (that fit within the rules of this community)?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anyone else avoid other people because they know they are pretty obnoxious to be around?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jfpse/does_anyone_else_avoid_other_people_because_they/"
        },
        {
            "approved_at_utc": null,
            "author": "anxious-wreck",
            "author_created_utc": 1476102868,
            "author_flair_css_class": "",
            "author_flair_text": "tbh",
            "author_fullname": "t2_120nh0",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498425548,
            "domain": "self.Anxiety",
            "edited": 1498426187,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jgtq3/my_boyfriend_is_hiv_positive_and_its_killing_me/",
            "gilded": 0,
            "id": "6jgtq3",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "relationshipflair",
            "link_flair_text": "Relationships",
            "locked": false,
            "media_embed": {},
            "num_comments": 44,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jgtq3/my_boyfriend_is_hiv_positive_and_its_killing_me/",
            "retrieved_on": 1500180908,
            "score": 48,
            "secure_media_embed": {},
            "selftext": "I just need to start this off by saying: holy shit, please do not judge me.\n\nI'm 19 years old, he is 20 (we're both guys).\n\nI won't go too much into details, all I will say is that my boyfriend got diagnosed as HIV positive a little more than a month ago, and I took the test and resulted negative, will retake it in around 2 weeks?? (that's when our 3 month mark of no sex will be hit).\n\nThe thought of transmission, the thought of people being judgmental (specially my family) just makes me have a huge anxiety attack, which is something I despise. \n\nIt frustrates me to much to not be able to relax and listen to what people tell me, and even though his doctor said that out of treatment a kiss is not considered a way to contract HIV unless there's a gum disease or something, I get very anxious after kissing him and everything goes to **shit**.\n\nHe's an amazing person, he's really great and even though he can't see that, I try and show him how important he is to me, but sometimes I can't seem to stand the idea of being anxious all the time about getting HIV (even when he's on his treatment) and it's been giving me serious anxiety lately.\n\nI feel like I'm not making much sense but I really need at least opinions, what should I do????? Right now we're kind of *on hold* and we decided to not to anything until I take my test again and get my results, and then we'll see what happens.\n\nI don't want to hurt him, oh lord I don't but I don't want to feel so scared all the time and it's something that I cannot control at all. One day I'll be feeling **AMAZING** and will rule the world and not care about this, and the next day I'll be having panic attacks and also be really scared for everything and just want to cry and regret everything.\n\nI hope this makes sense: I will **never** regret being with him EVER, but I do regret that I didn't do something before. I love him, I love him so much oh my god but I'm dying in the inside right now. I feel again that my post doesn't make sense but hey, I don't know what the fuck I'm doing.\n\nEDIT: the thought of breaking up with him physically exhausts me and destroys me but sometimes I think that it's the only way out of this horrifying loop of nights crying, anxiety attacks and such things.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "my boyfriend is HIV positive and it's killing me with anxiety.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jgtq3/my_boyfriend_is_hiv_positive_and_its_killing_me/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498571576,
            "domain": "self.Anxiety",
            "edited": 1498588777,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jstc5/quick_replies_please_i_might_hang_out_with_a/",
            "gilded": 0,
            "id": "6jstc5",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "schoolflair",
            "link_flair_text": "School/Exams",
            "locked": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jstc5/quick_replies_please_i_might_hang_out_with_a/",
            "retrieved_on": 1500186835,
            "score": 47,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "(quick replies Please) I might hang out with a really attractive girl today but ive never hung out with a girl outside of school/work",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jstc5/quick_replies_please_i_might_hang_out_with_a/"
        },
        {
            "approved_at_utc": null,
            "author": "davidjeffries10",
            "author_created_utc": 1485795147,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_14x5dc",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498103116,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ir16p/does_pot_cause_anxiety_for_anyone_else/",
            "gilded": 0,
            "id": "6ir16p",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6ir16p/does_pot_cause_anxiety_for_anyone_else/",
            "retrieved_on": 1500168102,
            "score": 44,
            "secure_media_embed": {},
            "selftext": "I love smoking and have been for years. But recently I've started to get super bad anxiety after smoking. I think it may be time to give it up. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does pot cause anxiety for anyone else?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ir16p/does_pot_cause_anxiety_for_anyone_else/"
        },
        {
            "approved_at_utc": null,
            "author": "Coolbeanz7",
            "author_created_utc": 1317617978,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5yyg7",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498438743,
            "domain": "self.Anxiety",
            "edited": 1498456385,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6jhzbu/definitely_late_to_the_game_at_36_years_old_but_i/",
            "gilded": 0,
            "id": "6jhzbu",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6jhzbu/definitely_late_to_the_game_at_36_years_old_but_i/",
            "retrieved_on": 1500181479,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "Holy shit! How was this never in my life before this!?! This show has really helped give me something to look forward to and it is also insanely comforting. Its definitely a new love for me. :) I also started drawing Pokemon which I've been told Im good at, and is also insanely relaxing and FUN!!! GOTTA CATCH EM ALL!!!! \n\nPS: If you are wondering at all my favorite Pokemon so far is Eevee. I am SUCH A NERD WITH EVERYTHING LOLOL!!!! &lt;3\n\n**EDIT:** Okay I admit it: I have become a HUGE Team Rocket fan as well. And I just absolutely love the character Meowth!!!! :D (\"That's right!\")",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Definitely late to the game (at 36 years old!) but I just \"discovered\" the joys of Pokemon!!!!",
            "url": "https://www.reddit.com/r/Anxiety/comments/6jhzbu/definitely_late_to_the_game_at_36_years_old_but_i/"
        }
    ]
}