{
    "data": [
        {
            "approved_at_utc": null,
            "author": "Mikeycal",
            "author_created_utc": 1356795779,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_a1d72",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497586990,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hkbif/my_therapist_of_4_years_just_passed_away_i_want/",
            "gilded": 0,
            "id": "6hkbif",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hkbif/my_therapist_of_4_years_just_passed_away_i_want/",
            "retrieved_on": 1500146887,
            "score": 653,
            "secure_media_embed": {},
            "selftext": "This isn't a post about being anxious due to my clinical psychologist dying. It is a celebration of what he meant to me and a celebration of all the therapist out there that are making a difference. \n\nMy therapist's name was Louis. When I met him, nearly 4 years ago, I was at a bad place in my life. I had been suffering from the effects of Anxiety Disorder for nearly 13 years, and visiting my GP monthly for over a year, when I asked her for a recommendation for a therapist. She gave me Louis' number and the number of 3 other therapists.\n\nAfter delaying for weeks, I called all of the referrals I was given. Two weren't taking new patients, one wasn't returning my calls and the 4th was Louis. What are the chances that I would like the only Therapist that would see me? (well, 100%)\n\nI was really nervous about meeting Louis because I had never been to therapy before. I had no idea what to expect. Would he judge me? Would he yell at me? Would he humiliate me? Would he intimidate me into taking action? I wasn't sure, but decided that I was willing to try.\n\nLouis was a short Jewish man that reminded me of the actor Saul Rubinek (Warehouse 13) with a trendier, gray, beard. He had a very soft way of communicating that made you feel instantly comfortable. After meeting him once, I knew that we were going to get along. Sometimes in life, you just click with people instantly. This is how it was with Louis and me. :)\n\nAs I went to each session, I discovered that Louis and I had tons in common: we experienced many of the same issues. So his recommendations felt tailored to me. In a way, talking to Louis was like talking to an older version of myself. We had different upbringings, I was raised Catholic and he was raised Jewish, but there we so many parallels between our lives that he would instantly be able to tell me his version of my story and how he dealt with it. This was the reinforcement I needed to prove to myself that everything was going to be okay. I was in good hands.\n\nDon't get me wrong, not every session in 4 years was pleasant. But every session was productive. He knew how to see past my BS. He knew how to get to the core of the issue. And the amazing thing was that the days that I thought I had nothing to talk about were the days that we made the most progress.\n\nBasically, when you don't think you have anything to talk about, it's usually because you have been trained to see past your BS. This means that you can actually start making some significant forward movements. \n\nNow, after 4 years of treatment. I am feeling fantastic and it is thanks to Louis. My goal when I started therapy was as follows:\n\nTo be myself without reservation, without shame, and without apology. \n\nLouis helped me to do these things by supporting the work I did as a vlogger. He helped me to talk publically about dealing with anxiety. He helped me to turn my weakness into a super power.\n\nNow...\n\nToday, while on a hike, I found out that Louis had passed away via the internet. I hadn't heard from him in few weeks and decided to give his office call. His message had been replaced with a referral service. I instantly typed \"Obituary Louis...\" and discovered that he had passed away 3 days ago, and I had just missed his funeral earlier in the day. \n\nThe feelings came rushing in, but there was no Anxiety. It was just a combination of sadness and joy. As I walked through the park, I cried and laughed - I must have looked like a crazy person. \n\nI cried because I lost a great friend. I laughed because I was full of joyful gratitude. He saved my life. And, to me, gratitude is displayed as laughter with tears.\n\nI decided that, while I missed his funeral, that I would place flowers at his office door. His office was right next door to a supermarket; so I ran in and got some flowers and a card. I quickly returned to my car and added the line... \"Louis was a blessing in my life.\"\n\nI exit my car and head towards the building only to be accosted by a parking attendant for the supermarket, \"You can't park here...\". I turn with flowers in hand, \"My friend is dead, I just want to show him some respect.\" \n\nWe argued a little and I told the attendant, in a frustrated tone, \"Fine! I will move my car!\" I could tell that he was kind of regretting telling me to move the car, due to the circumstances, but I just didn't have the time or energy.\n\nI ran up the stairs to Louis' office, placed the flowers and the card at the door, and returned to my car. All I could think of is that Louis would have wanted me to apologize to the parking attendant. \n\nI drove toward the attendant... He looked me in the eye as I approached. Probably thinking I was going to flip him off or something. But I channelled my friend and said, \"I want to apologize. I was a jerk to you. My friend died and I am a little upset. But he trained me to see when I am spreading my pain around. You were just doing your job.\" \n\nThe attendant told me, \"I am feeling really bad about this...\" I told him \"I am sorry for making you feel bad, but I am grateful to you because you have helped me to see that the lessons, that my friend taught me, will always be with me. \n\nLouis will always be with me, as my shoulder angel.\n\nThank you Louis. \nI love you! \ngodspeed my brother.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "My therapist of 4 years just passed away... I want to celebrate him. He helped me through my worst years.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hkbif/my_therapist_of_4_years_just_passed_away_i_want/"
        },
        {
            "approved_at_utc": null,
            "author": "douxp",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497911406,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6i9wkh/dae_have_a_foggy_feeling_in_their_head_like_you/",
            "gilded": 0,
            "id": "6i9wkh",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 112,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6i9wkh/dae_have_a_foggy_feeling_in_their_head_like_you/",
            "retrieved_on": 1500159603,
            "score": 604,
            "secure_media_embed": {},
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "DAE have a foggy feeling in their head, like you can't concentrate on anything, whenever you are experiencing high levels of stress and anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6i9wkh/dae_have_a_foggy_feeling_in_their_head_like_you/"
        },
        {
            "approved_at_utc": null,
            "author": "CWSbitch",
            "author_created_utc": 1491956695,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_17005r",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497668346,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hr5x7/does_anyone_else_get_randomly_anxious_even_when/",
            "gilded": 0,
            "id": "6hr5x7",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 28,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hr5x7/does_anyone_else_get_randomly_anxious_even_when/",
            "retrieved_on": 1500150339,
            "score": 419,
            "secure_media_embed": {},
            "selftext": "So I'm a little nervous about going to a ball game tomorrow. Travel/out of state/big crowd/spending the night with others. I've been cleaning all day so my mind hasn't been on that or anything else even. I've been pretty relaxed, calm, and just focused on cleaning. I just had to take one of my meds because out of nowhere I had the chest tightness, then my mind started getting nervous. Etc etc. it just randomly hit me. But it started when I was already quite calm and not thinking of anything. I don't know why that keeps seeming to happen. Even when I have nothing to be anxious about. At all. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anyone else get randomly anxious even when they're calm and have no negative thoughts?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hr5x7/does_anyone_else_get_randomly_anxious_even_when/"
        },
        {
            "approved_at_utc": null,
            "author": "andbingowashishomo",
            "author_created_utc": 1416337255,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_jfh7g",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497782295,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hz1af/was_admitted_to_a_psychiatric_ward_yesterday/",
            "gilded": 0,
            "id": "6hz1af",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hz1af/was_admitted_to_a_psychiatric_ward_yesterday/",
            "retrieved_on": 1500154239,
            "score": 405,
            "secure_media_embed": {},
            "selftext": "Yesterday I was at a restaurant with my husband, my sisters-in-law and some friends for a birthday party. It was very hot at the table so I went for some fresh air. A few minutes later, as I sat alone, I was hit smack dab in the gut by feelings of guilt and hopelessness. Lately I've been feeling very unenthusiastic about life in general, not really excited about the prospect of a potential sixty more years in a dull repetitive cycle that only leads to death. A feeling that says it wouldn't be so horrible if I didn't exist. \n\nNormally I can win over these thoughts. Remind myself how loved I am by my family and friends, that I'm safe and secure and have a lot to be grateful for. But it was like my brain switched into autopilot and I felt myself walking to the closest bridge to jump. Luckily I didn't find it, but I did pass the emergency room on my walk so I took that as a sign. A few tearful hours later, I was voluntarily admitted to the nearest psychiatric ward for monitoring. Got to talk to someone, was given a room and a sleeping pill and then woke up feeling very raw. \n\nI got breakfast, played some cards with the other patients and got to see a psychiatrist. His evaluation was that I seemed to have all my wits about me, and that I'm not any harm to myself. So I'm getting picked up in about half an hour. \n\nThe ton of supportive messages I've received moves me to tears. I can't believe how close I was. I just need to stay strong and never give in. I do want to live, but it's hard and I feel weak and incapable of handling life on my own. \n\nThanks for reading. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Was admitted to a psychiatric ward yesterday",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hz1af/was_admitted_to_a_psychiatric_ward_yesterday/"
        },
        {
            "approved_at_utc": null,
            "author": "tw1706",
            "author_created_utc": 1482258612,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_13q4jw",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497971655,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6iene5/today_i_challenged_my_anxiety_by_using_public/",
            "gilded": 0,
            "id": "6iene5",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 19,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6iene5/today_i_challenged_my_anxiety_by_using_public/",
            "retrieved_on": 1500161978,
            "score": 381,
            "secure_media_embed": {},
            "selftext": "I'm really proud of myself and I thought I'd share it with you guys :) so here goes\n\n\nEven the thought of going somewhere unfamiliar on my own causes me to get panicky, never mind traveling via public transport, until today.\n\nI wanted to visit a cemetery, as I have family members who are buried there. I'd never been to the cemetery before so it would be a first. I started my adventure with catching the train, I had caught this train many times, but this time was my first time catching it alone. That was easy enough and I noticed I was a lot less scared than I thought I would be. I arrived at my first location, from there I had to catch a bus. I hate busses as they give me so much anxiety (I'm always worried I'd get the wrong bus or get off at the wrong bus stop or something) waiting for the bus I managed to strike a conversation with an older man, he confirmed that I was waiting for the correct bus to get to the cemetery.\n\nSoon enough the bus pulled in, I asked the driver if they go to the cemetery, he confirmed so I payed the driver and sat down nervously. I then got off at my stop and walked the rest to the cemetery.\n\nI walked up a path and turned a corner and there it was. It felt amazing to see it and know that I've travelled all on my own, albeit it not being far, and that I had challenged my anxiety and I had conquered it :)\n \n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Today I challenged my anxiety by using public transport and visiting somewhere I've never been before on my own.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6iene5/today_i_challenged_my_anxiety_by_using_public/"
        },
        {
            "approved_at_utc": null,
            "author": "StanLey96",
            "author_created_utc": 1440746446,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_px3rw",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497521979,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6he50o/anyone_else_feels_like_your_brain_just_doesnt/",
            "gilded": 0,
            "id": "6he50o",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 23,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6he50o/anyone_else_feels_like_your_brain_just_doesnt/",
            "retrieved_on": 1500143798,
            "score": 250,
            "secure_media_embed": {},
            "selftext": "I feel absolutely fine in 2 person conversation, but when there more than 2 people around I always switch to my weird mode, all my ideas dissapear and all I can do is smile and say things like \"yeah, sure, good, I see,..\"\n\nI'm 20 and I have always been like this, I just can't function in classes, pubs, or any places with more people around me\n\nIs there any way out of this?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone else feels like your brain just doesn't work when there is more than one person around?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6he50o/anyone_else_feels_like_your_brain_just_doesnt/"
        },
        {
            "approved_at_utc": null,
            "author": "manning_upp",
            "author_created_utc": 1341882807,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_8a3sx",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498014744,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ij5d2/anyone_else_chew_the_inside_of_your_mouth/",
            "gilded": 0,
            "id": "6ij5d2",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 67,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6ij5d2/anyone_else_chew_the_inside_of_your_mouth/",
            "retrieved_on": 1500164194,
            "score": 234,
            "secure_media_embed": {},
            "selftext": "Whenever I'm anxious (all the time) I often bite and chew the insides of my cheeks and lips. The inside of my mouth feels like raw hamburger, I need to stop but its so damn hard. \nIts a subconscious thing, often times I don't realize I'm even doing it. My dentist said its one of the worst he's seen and if I don't stop it could lead to gum disease, and rarely mouth cancer. Pretty sure parts of my mouth is just scar tissue at this point and will never be normal again. \n\nAnyone else bite their lips, chew their cheeks, teeth grinding, nail biting or something simular? What do you do to stop or help reduce this behavior? \n\nIm beginning to think its less of an anxiety thing and more in the realm of OCD. Its a subconscious compulsory behavior I have whenever I'm anxious, so I'm not so sure.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone else chew the inside of your mouth?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ij5d2/anyone_else_chew_the_inside_of_your_mouth/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497468643,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6h9u8h/i_worked_my_first_day_at_my_job/",
            "gilded": 0,
            "id": "6h9u8h",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "progressflair",
            "link_flair_text": "Progress!",
            "locked": false,
            "media_embed": {},
            "num_comments": 26,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6h9u8h/i_worked_my_first_day_at_my_job/",
            "retrieved_on": 1500141672,
            "score": 214,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "I worked my first day at my job.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6h9u8h/i_worked_my_first_day_at_my_job/"
        },
        {
            "approved_at_utc": null,
            "author": "Throwaasys",
            "author_created_utc": 1496019092,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_2gdnkq9",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498067267,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6inh5n/i_dont_like_my_old_friends_anymore/",
            "gilded": 0,
            "id": "6inh5n",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 52,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6inh5n/i_dont_like_my_old_friends_anymore/",
            "retrieved_on": 1500166332,
            "score": 152,
            "secure_media_embed": {},
            "selftext": "Recently met some new people who are very nice and supportive. I was with my normal group last night and I realized how mean they are to me and they kept making suicide jokes. They knew I was suicidal less than a month ago as well. It feels horrible saying I don't like them and I feel nervous around them. I don't know what to do anymore I don't want to be around them, but then they just show up at my house. Just needed to vent.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I don't like my old friends anymore.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6inh5n/i_dont_like_my_old_friends_anymore/"
        },
        {
            "approved_at_utc": null,
            "author": "bootyfeminism",
            "author_created_utc": 1466550320,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_yx5tg",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497728647,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hvdrx/youre_too_sensitive/",
            "gilded": 0,
            "id": "6hvdrx",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hvdrx/youre_too_sensitive/",
            "retrieved_on": 1500152417,
            "score": 135,
            "secure_media_embed": {},
            "selftext": "DAE think this is an asshole-ish thing to tell or hear from somebody, whether from your parents or otherwise? My mom does it all too frequently when I get even remotely upset about something she might say or what's going on but yet, she has a volatile temper and gets upset easily at certain moments herself. Some obvious projection here and I really don't know how to deal with it anymore. I have mild-to-severe anxiety along with multiple other \"disorders\" that could be diagnosed or not and I've been sick of my current living circumstances for a long time. I still love my parents but trust me, they are not easy nor often pleasant to be around for long.\n\nAny help or suggestions would be duly appreciated. Thanks!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "\"You're Too Sensitive\"",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hvdrx/youre_too_sensitive/"
        },
        {
            "approved_at_utc": null,
            "author": "JustBeingABro",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497847565,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6i4anb/need_someone_to_talk_to/",
            "gilded": 0,
            "id": "6i4anb",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 73,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6i4anb/need_someone_to_talk_to/",
            "retrieved_on": 1500156836,
            "score": 126,
            "secure_media_embed": {},
            "selftext": "Feel free to message me anytime. I may not always be able to reapond right away but I always respond eventually and I never ghost away. I try my best to hold conversation woth anyone. I love you all. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Need someone to talk to?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6i4anb/need_someone_to_talk_to/"
        },
        {
            "approved_at_utc": null,
            "author": "liamfulton",
            "author_created_utc": 1372103520,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_c5dct",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497871839,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6i5t38/anyone_else_self_sabotage_before_big_events/",
            "gilded": 0,
            "id": "6i5t38",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6i5t38/anyone_else_self_sabotage_before_big_events/",
            "retrieved_on": 1500157585,
            "score": 117,
            "secure_media_embed": {},
            "selftext": "So I'm going to Glastonbury festival tomorrow which I've spent pretty much all year hyping about. Thing is, when big event gets closer, my mind starts finding ways to make me anxious and down. I've come to expect now but it's really getting to me today and I really wish I could just enjoy things as myself. \n \nMy favourite band Radiohead are headlining and this was meant to be sort of like closure as this time last year I was struggling with panic disorder and ended up having the biggest panic attack of my life at one of their gigs. I believe I'm past the worst of my anxiety and wanted this to basically be a big fuck you to it. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone else Self Sabotage before big events?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6i5t38/anyone_else_self_sabotage_before_big_events/"
        },
        {
            "approved_at_utc": null,
            "author": "ralyks",
            "author_created_utc": 1329718589,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6yx93",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497542343,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hfwwf/i_just_interviewed_for_my_dream_job/",
            "gilded": 0,
            "id": "6hfwwf",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "workflair",
            "link_flair_text": "Work/Search",
            "locked": false,
            "media_embed": {},
            "num_comments": 18,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hfwwf/i_just_interviewed_for_my_dream_job/",
            "retrieved_on": 1500144674,
            "score": 99,
            "secure_media_embed": {},
            "selftext": "I have been diagnosed with Generalized Anxiety Disorder with Panic Disorder and Social Anxiety Disorder for about six years now. I applied for a dream job four months ago not expecting anything back because let's face it, I'm me and I never expect good things to happen. Contrary to my cognitive thinking, I got a call yesterday asking me to interview this morning. After throwing up a few times and hyperventilating before the interview, I did my interview. I actually did it, I didn't completely shut down or have a panic attack during the interview. Let me repeat that, I DID IT! If I can do it, then so can you! I know it's hard, it is very uncomfortable, and easier to say than to do, but this feeling right now is amazing and I want all of you to experience this feeling. Right now I am sitting in my car with a huge smile on and tears running down my face because I am so happy, and for once, I'm proud of myself. You all deserve this exact feeling!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I just interviewed for my dream job.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hfwwf/i_just_interviewed_for_my_dream_job/"
        },
        {
            "approved_at_utc": null,
            "author": "jdwoodruff86",
            "author_created_utc": 1488914521,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_15zwa6",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497823883,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6i2ear/sunday_night_anxiety/",
            "gilded": 0,
            "id": "6i2ear",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 15,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6i2ear/sunday_night_anxiety/",
            "retrieved_on": 1500155898,
            "score": 95,
            "secure_media_embed": {},
            "selftext": "Do you guys tend to get a lot of anxiety on Sunday night's cause you think about the workweek ahead? What tips can you give that might help? Thanks!!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Sunday Night Anxiety",
            "url": "https://www.reddit.com/r/Anxiety/comments/6i2ear/sunday_night_anxiety/"
        },
        {
            "approved_at_utc": null,
            "author": "voscuetarian",
            "author_created_utc": 1484606114,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_14i4gt",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497543557,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hg1kn/does_anyone_else_experience_the_overthinking_of/",
            "gilded": 0,
            "id": "6hg1kn",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hg1kn/does_anyone_else_experience_the_overthinking_of/",
            "retrieved_on": 1500144737,
            "score": 78,
            "secure_media_embed": {},
            "selftext": "It almost as though I get stuck when I'm caught thinking about it. This is especially most worrying when I'm eating food. \n\nIs there any advice that you could give to help for when this occurs?\n\nAs a slight extra note, these feelings are more frequent when alcohol has been consumed the previous night, but still do happen when I haven't had a drink at all.\n\nThanks.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anyone else experience the overthinking of swallowing?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hg1kn/does_anyone_else_experience_the_overthinking_of/"
        },
        {
            "approved_at_utc": null,
            "author": "ConstructiveFeedbax",
            "author_created_utc": 1383000561,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_doqtg",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497555369,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hhddg/this_one_if_for_you_warriors_here/",
            "gilded": 0,
            "id": "6hhddg",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hhddg/this_one_if_for_you_warriors_here/",
            "retrieved_on": 1500145407,
            "score": 70,
            "secure_media_embed": {},
            "selftext": "Hey. I want to tell you how strong you are. You've found yourself on a rather bumpy road, with a car you no longer no as well as before. It's not doing you a favor right now. But it's rolling. Sometimes stopping for days, to rest and figure things out. Sometimes hitting a bump and almost falling over. But actually, nothing can topple this car. And even though the bumps and potholes are annoying, scary, hopeless and seemingly endless - it's not. In the end, all is well and all is well. And if all is not well, then it's not the end. \n\nYou and your car will find your way. Over, across, below, straight through like a meteor, you will overcome. And suddenly you'll find yourself on a more tranquil road. Is it the same road as before or did you build a new one with your determination. Maybe it's not important. \n\nStop trusting the thought saying \"It feels like I'm going backwards, falling down, it feels like the ground is crumbling beneath my feet.\" It is far from the truth. Look below you, is the ground shaking? \n\nWarrior, you are moving forward. Without knowing, you are learning. Learning what? Something. Learning new ways to live. Ways not to live. Learning to be brave, to reach out, to be kinder to yourself. \n\nFind something you like, and stick to it. It might mean sacrificing old habits, and it definitely means sacrificing comfort. For me that thing is yoga. I hope and anticipate that I can bring the power and tranquility off the mat in the future.\n\nI like talking about random shit with friends.\n\nI like watching Rick and Morty.\n\nI like sex. Passionate, breathing out loud, sex.\n\nI like cooking, drawing, and teaching.\n\nI don't like myself. I don't like the future. I don't like being in a place far away from home with no one to talk to. All alone. But I'm getting there, with practice, trial and error.\n\nThank you. Keep bumping.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "This one if for you warriors here",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hhddg/this_one_if_for_you_warriors_here/"
        },
        {
            "approved_at_utc": null,
            "author": "FacesOfTruth",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497496587,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hchlo/anyone_else_think_everyone_is_too_angry/",
            "gilded": 0,
            "id": "6hchlo",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hchlo/anyone_else_think_everyone_is_too_angry/",
            "retrieved_on": 1500142985,
            "score": 61,
            "secure_media_embed": {},
            "selftext": "I mean, not to ramble on too much, it just seems as though everyone everywhere is so quick tempered, short with people, and angry all the time. The most minor of inconveniences sets people off into fits of red rage. I just think this anger is what contributes to at least my anxiety as well as a few others. I am positively terrified of being yelled at, threatened, and just having anger towards me in any foreseeable way, and so, with that, I tend to shut myself out due to this fear. \n\nI am 18, I am growing up in a time where we are very unhappy, very anti-social, and quickly angered. It's clear that this isn't only unhealthy for those with anxiety, but society as a whole and no one can, or simply refuses to, pinpoint why. I've heard stories from my parents, I've read books about times before I was alive and I know there was a time when we weren't like this.\n\nI just wanted to post this here to give my thoughts, why it bothers me and how it affects my anxiety, and see if any of you share my thoughts and opinions. \n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone else Think Everyone is too angry?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hchlo/anyone_else_think_everyone_is_too_angry/"
        },
        {
            "approved_at_utc": null,
            "author": "LeslieAndAnn4ever",
            "author_created_utc": 1479292254,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_12uouj",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497571302,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hiz1t/overcome_with_tears_of_relief_that_i_am_finally/",
            "gilded": 0,
            "id": "6hiz1t",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 5,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hiz1t/overcome_with_tears_of_relief_that_i_am_finally/",
            "retrieved_on": 1500146204,
            "score": 60,
            "secure_media_embed": {},
            "selftext": "My family has a history of mental health issues so i don't really see a stigma, but it has taken me 30 years to finally admit that my issues are valid, they're a problem and it's ok to get help. I always just thought it was in my head but recently things started getting bad and I finally made an appointment with a therapist for cognitive behavioral therapy and am working with my doctor about getting some medicine. Overcome with emotions of finally acknowledging my issues are real. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Overcome with tears of relief that i am finally getting help!",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hiz1t/overcome_with_tears_of_relief_that_i_am_finally/"
        },
        {
            "approved_at_utc": null,
            "author": "okdenok",
            "author_created_utc": 1450033868,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_sxayj",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497723813,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6huy9z/does_anybody_else_find_it_almost_impossible_to/",
            "gilded": 0,
            "id": "6huy9z",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 20,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6huy9z/does_anybody_else_find_it_almost_impossible_to/",
            "retrieved_on": 1500152204,
            "score": 59,
            "secure_media_embed": {},
            "selftext": "My anxiety lends to a huge fear of authority in the workplace. With the added depression from doing mundane tasks, it's one of the most difficult things in the world for me. I could work as something as simple as a cashier and still become overwhelmed with dread and misery before every single shift.\n\nI have no idea how to get across this bridge. I've been in therapy for nearly a year, have been put on medication, and I'm still terrified to work. Please, please, please, someone help me.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anybody else find it almost impossible to work anywhere?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6huy9z/does_anybody_else_find_it_almost_impossible_to/"
        },
        {
            "approved_at_utc": null,
            "author": "Pikawing",
            "author_created_utc": 1433024474,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_nt53p",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497888780,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6i7eup/i_took_a_huge_step_forward_this_weekend_with_my/",
            "gilded": 0,
            "id": "6i7eup",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6i7eup/i_took_a_huge_step_forward_this_weekend_with_my/",
            "retrieved_on": 1500158377,
            "score": 52,
            "secure_media_embed": {},
            "selftext": "I went out clubbing with friends and this time, I decided to just say to hell with it...I spent all night talking to whoever I wanted to talk to, dancing with whoever I wanted to dance with, and it was amazing. Normally I would be so shy when it comes to approaching people I don't know, but...nobody shot me down for approaching them and whatever fear I might've had about it basically went away all in one night. I'm on cloud nine.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I took a huge step forward this weekend with my social anxiety...it was incredible",
            "url": "https://www.reddit.com/r/Anxiety/comments/6i7eup/i_took_a_huge_step_forward_this_weekend_with_my/"
        },
        {
            "approved_at_utc": null,
            "author": "sparklexfairy",
            "author_created_utc": 1493255852,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_17fxhk",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497727057,
            "domain": "self.Anxiety",
            "edited": 1497727381,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hv8wg/tried_to_go_two_salons_today_and_i_failed_i_felt/",
            "gilded": 0,
            "id": "6hv8wg",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 7,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hv8wg/tried_to_go_two_salons_today_and_i_failed_i_felt/",
            "retrieved_on": 1500152351,
            "score": 50,
            "secure_media_embed": {},
            "selftext": "I went to two salons to try and get a haircut.  I failed. The first one i went into, the hairdressers did not even notice me, i think one looked at me but they were too busy talking with each other while doing another person's hair. Then the two customers looked at me weird.  I sat down for like 5 minutes, then i got up and left. i felt too nervous.  \n\nThen i tried to go to another salon to see if i would get better people. Someone did say hi to me. Then that was it. Another worker came looking at me weird asking if i had an appointment. i said no i was a walk in.  She told me that after the stylist is done she would do my hair.      \n\nI was feeling on edge and nearly crying. The stylists were looking at me in bad way and the other ones were too busy chatting with each other to pay attention to me. I felt so ignored. So i left that place because i was breaking down in tears. i felt so ugly and how they looked at me, i felt it conformed it. I am just going back to my regular stylist that knows me,  rather than try a new one.\n\n I can't believe i am crying over this maybe it just my hormones going crazy, i really hope  i don't sound crazy to you people.  i just have bad anxiety (agoraphobia) and very low self esteem.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Tried to go two salons today and i failed. I felt so anxious and ignored by them that i just left the place in tears.Has anyone been in similar situation?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hv8wg/tried_to_go_two_salons_today_and_i_failed_i_felt/"
        },
        {
            "approved_at_utc": null,
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497763377,
            "domain": "self.Anxiety",
            "edited": 1497807480,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6hy35g/i_cant_put_up_with_my_anxiety_anymore/",
            "gilded": 0,
            "id": "6hy35g",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6hy35g/i_cant_put_up_with_my_anxiety_anymore/",
            "retrieved_on": 1500153764,
            "score": 47,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "I can't put up with my anxiety anymore",
            "url": "https://www.reddit.com/r/Anxiety/comments/6hy35g/i_cant_put_up_with_my_anxiety_anymore/"
        },
        {
            "approved_at_utc": null,
            "author": "throwaway456124",
            "author_created_utc": 1492641297,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_178542",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497717241,
            "domain": "self.Anxiety",
            "edited": 1497717853,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6huc47/how_to_deal_with_a_parent_that_gets_angry_about/",
            "gilded": 0,
            "id": "6huc47",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "ventflair",
            "link_flair_text": "Venting",
            "locked": false,
            "media_embed": {},
            "num_comments": 29,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6huc47/how_to_deal_with_a_parent_that_gets_angry_about/",
            "retrieved_on": 1500151900,
            "score": 43,
            "secure_media_embed": {},
            "selftext": "My father is a pretty angry dude. Short tempered, and when he does get angry, he is ENGRAGED. I'm talking screaming, insults, etc. Yesterday was a really bad day for my anxiety. We were set to go somewhere in about an hour and I started crying as a result of a panic attack. I truly was terrified in the moment. He came in, told me to \"shut the f* up, grow up, and get over it\" and told me that \"it's always the same shit and it's ridiculous\". I'm 18 so this obviously stings coming from my dad. Aside from having pretty severe anxiety, I otherwise do what I'm told, don't break any rules, don't drink/smoke, etc. When we arrived at said event (something I was dreading) I tried doing something I had to do but was afraid of once, succeeded, and then was told I had to do it again because it didn't develop correctly. Full blown panic, and I couldn't do it. My dad came storming into the room (with 5 people/doctors/assistants) and told me that if I didn't do it he was done with me. He snatched my phone out of my hand (with which I was using music to calm myself) in front of everybody. I was embarrassed enough already.\n\nI couldn't do it so we left and in the elevator he told me not to talk to him anymore, and that he was stripping me of all of my privileges and was no longer going to take me to my college orientation weekend next week. Instead of fighting him back I just listened, and in the car on the way home I gave him a sincere apology twice to which the first he said \"Shut up and stop talking\" and to the second no response. I just went to my room and didn't talk to him for the rest of the day.\n\n\nHe snapped at me again this morning, telling me once again to shut up and it's always the same shit.\n\n\nHis reaction to my anxiety makes me even more anxious as I then worry about getting noticeably anxious and getting him angry. When I tell my mom she just sides with him and tells me \"Everyone's entitled to react how they want and I'm responsible for whether or not I let it affect me\". My mom and dad both came from abusive fathers and my mom always reminds me \"well we used to get beat so at least he's not beating you\". As if that justifies anything. Oh. \n\nI normally have a very good relationship with my dad when he's not angry with me, he does a lot for me but I just can't take this temper anymore. It makes me feel like absolute shit and like I'm a fuck up or that something's wrong with me and my parents don't want me around.\n\n\nAny advice?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "How to deal with a parent that gets angry about anxiety?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6huc47/how_to_deal_with_a_parent_that_gets_angry_about/"
        },
        {
            "approved_at_utc": null,
            "author": "Ihisilloc",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1497876295,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6i65wd/im_so_tired_of_people_deciding_that_they_know_me/",
            "gilded": 0,
            "id": "6i65wd",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 8,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6i65wd/im_so_tired_of_people_deciding_that_they_know_me/",
            "retrieved_on": 1500157761,
            "score": 41,
            "secure_media_embed": {},
            "selftext": "Everyone talks down to me. I'm a nervous guy and this makes it hard for me to open up and make friends. I guess it's my fault for hanging around people I can't open up to... still there are so many people who hear me say or do something and then immediately they act like they know my whole life story. They become the expert because they know they can use my nervousness against me. I can't even blame them, I shouldn't be so insecure i guesss. I don't know why I even wrote this I don't deserve to be happy. All I ever did was avoid relationships and jerk off in my free time. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I'm so tired of people deciding that they know me just because of my shyness",
            "url": "https://www.reddit.com/r/Anxiety/comments/6i65wd/im_so_tired_of_people_deciding_that_they_know_me/"
        },
        {
            "approved_at_utc": null,
            "author": "Harogenki42",
            "author_created_utc": 1457534375,
            "author_flair_css_class": "",
            "author_flair_text": "Worries about things out of my control a lot...",
            "author_fullname": "t2_wa82q",
            "banned_at_utc": null,
            "brand_safe": true,
            "can_mod_post": false,
            "contest_mode": false,
            "created_utc": 1498056886,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6imb8i/i_deleted_my_facebook_account_today_over_the/",
            "gilded": 0,
            "id": "6imb8i",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 13,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6imb8i/i_deleted_my_facebook_account_today_over_the/",
            "retrieved_on": 1500165754,
            "score": 33,
            "secure_media_embed": {},
            "selftext": "I know it may sound like a stupid thing to delete an account over but the shit I saw on that tab has just fuelled my anxiety like whatever remark North Korea makes, Russia and the fucking doomsday clock being moved because Trump became president...It's made me fear about stuff like nuclear war a lot thanks to this...  ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I deleted my facebook account today over the trending tab...",
            "url": "https://www.reddit.com/r/Anxiety/comments/6imb8i/i_deleted_my_facebook_account_today_over_the/"
        }
    ]
}