{
    "data": [
        {
            "author": "Phantom_Pizza",
            "author_created_utc": 1350865708,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9dgcu",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495543228,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6cue66/hey_hey_you_gives_internet_hug_its_going_to_be_ok/",
            "gilded": 0,
            "id": "6cue66",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 129,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6cue66/hey_hey_you_gives_internet_hug_its_going_to_be_ok/",
            "retrieved_on": 1497170671,
            "score": 716,
            "secure_media_embed": {},
            "selftext": "Sometimes all I want is someone to hug me and tell me it's going to be ok. What's frustrating is that if I tell people this I feel like they'll just be doing because I told them I like it, and not because they actually care or because they actually think I'll be ok. \n\n\nIve been lurking a while here and as shitty as it sounds its weirdly comforting to know I'm not alone, so thank you.\n\nSorry the body of this post isn't as happy as the title.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Hey. Hey you. *gives Internet hug* It's going to be ok",
            "url": "https://www.reddit.com/r/Anxiety/comments/6cue66/hey_hey_you_gives_internet_hug_its_going_to_be_ok/"
        },
        {
            "author": "iampieman",
            "author_created_utc": 1401784806,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_gtsg2",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495952743,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dsfft/does_anyone_elses_anxiety_mean_they_cant_ever/",
            "gilded": 0,
            "id": "6dsfft",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 77,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dsfft/does_anyone_elses_anxiety_mean_they_cant_ever/",
            "retrieved_on": 1497187691,
            "score": 618,
            "secure_media_embed": {},
            "selftext": "Like, i can't even leave the house or do anything outside of the house the day before I have to work because my anxiety tells me there is no point. It is hard to explain..but I just feel I can't do anything the day before work because I will be too stressed and anxious about work the next day and if I went out of the house to do anything, I would be constantly looking at my watch to see how long is left until I have to work (18 hours, 12 hours etc.) and feel sick with anxiety.\n\nBy staying in I can try and maintain a routine that helps me, but it is becoming harder as now it is creeping into my saturdays and I am beginning to not want to go out on Saturdays now either. It is so hard to explain why I do this, I am not even sure. People are starting to notice. Does anyone else experience this and have found any ways to manage this? ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anyone else's anxiety mean they can't ever enjoy/do anything on sunday because of work the next day?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dsfft/does_anyone_elses_anxiety_mean_they_cant_ever/"
        },
        {
            "author": "IsMiseGroot",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495711602,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6d90e1/anyone_else_just_constantly_worry_about_their/",
            "gilded": 0,
            "id": "6d90e1",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 133,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6d90e1/anyone_else_just_constantly_worry_about_their/",
            "retrieved_on": 1497178078,
            "score": 443,
            "secure_media_embed": {},
            "selftext": "Also, my country is currently going through a heat wave and I cannot cope with the heat...",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone else just constantly worry about their heart, clots, tumours and just the general fear that you have a disease that will kill you prematurely?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6d90e1/anyone_else_just_constantly_worry_about_their/"
        },
        {
            "author": "camelelf",
            "author_created_utc": 1419894286,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ke2yk",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495816954,
            "domain": "self.Anxiety",
            "edited": 1495817450,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6di37h/does_anyone_else_feel_anxious_when_listening_to/",
            "gilded": 0,
            "id": "6di37h",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 37,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6di37h/does_anyone_else_feel_anxious_when_listening_to/",
            "retrieved_on": 1497182564,
            "score": 310,
            "secure_media_embed": {},
            "selftext": "It usually stops me from playing music inside my own house, during day hours unless I have my windows closed.\n\nIt's a beautiful day here so I've got all the windows open, but playing music feels like the whole world is watching. I feel like I'll be judged for *what* I listen more irritating people and I have no idea why I feel like that.\n\nI don't even play it loud, usually around 50db according to my phone, and I can't hear any of my neighbours unless they laugh or shout.\n\nIt's the same with earphones in public, I'm always terrified they're too loud. I can't be alone in this?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anyone else feel anxious when listening to music around others?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6di37h/does_anyone_else_feel_anxious_when_listening_to/"
        },
        {
            "author": "hanswermhat7",
            "author_created_utc": 1491132852,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_16pnf4",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495640419,
            "domain": "self.Anxiety",
            "edited": 1496611156,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6d2x5d/for_people_with_anxiety_who_drink_and_smoke_weed/",
            "gilded": 0,
            "id": "6d2x5d",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 69,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6d2x5d/for_people_with_anxiety_who_drink_and_smoke_weed/",
            "retrieved_on": 1497174915,
            "score": 279,
            "secure_media_embed": {},
            "selftext": "* Firstly I want to state any advice I might be giving on how I overcame this is not aimed at people who can enjoy a joint or a drink every now and then. I don't mean to sound absolute with some of my statements, it's just in relation to the hole I was in.\n\nI smoked weed for 7 years (started at 16), daily for 6. I slowly started drinking more and more alongside it until it was 4-5 beers and 2 grams of weed daily.\n\nI've had anxiety since about 12. Bad depression, suicidal thinking, isolation gradually got worse from 18. By 22 (last year), life was so shit. It was unbarable. Over the 3 years before I'd had failed relationships, unemployment, family problems, intense isolation (weed and drinks on my own in a little shed watching videos off my phone - 8 hours a day sometimes).\n\nI'm a prime example of using my anxiety as an excuse to abuse substances and avoid social situations and self improvement. I could have convinced you back then that I'm all good, just sorting through things. I have remarkable people skills when I apply them (did sales for 2 years), but I wasn't interested in anything other than getting fucked up and living in a realty where \"this is my life for now . . .\".\n\n\nAlmost decided to live in my car, live with a crack head, travel the country (aka: begin my homeless life, cause I really had no money and if I did it would've gone to beer). I was losing my mind.\n\nAfter being heavily suicidal for a week I decided I can't live like this anymore - but I don't want to die right now.\n\nI planted a thought in my head. 'if you ever want to overcome this, you need to begin to change'. I envisioned the person I wanted to be; even if I wasn't unequipped to be so at the time.\n\n**It took me one year** of very gradual changes to get to where I am now. One week sober. I closed up the shed, changed from bongs to joints and sat outside my house on a chair. The joints got bigger and bigger but a least I was only drinking 2-3 beers a day. \n\nI implemented hobbies back into my life. Didn't spend a lot of time on them, but just 5-10 mins was a start. I joined a gym, some weeks I went once or twice, sometime I didn't go for a month. I reached out to old friends, sometime we didn't catch up until a couple weeks, sometimes we were both busy at different times, but I saw peoples faces and her their voices - after too long of seeing the same-old and only connecting with people through weed or alcohol (or other).\n\nHad to work so hard to **prepare myself** to change my ways. It didn't take weeks or months. It took a whole year - 52 weeks of ups and downs, but a commitment to improving myself. It was difficult. It didn't feel like anything was different mentally until toward the end. I saw psych's, drs, counselors and was so optimistic they would help me change myself until I realized I already knew what to do. I decided I can channel all my anxiety into self improvement.\n\nBought a huge whiteboard, and everyday woke up I had these chores to do. Idea's, reminders, quotes. Things just kept coming to mind. Things to fix/buy/take for a walk/hobbies to look into. I was still a depressed, anxious, alcoholic-stoner - but instead of watching tv, playing games, watching life slip away - I felt like I was on to something.\n\nI never expected the benefits from cutting down and quitting. Every department of my life is better. I had to force change. It took me a year because change made me more anxious.  **I've been sober for a week and the change is awesome!** I laugh, I stay active, I speak clearly, I look people in the eye, I get things done as I want to get them done - immediately. Living a different reality.\n\nIf anyone here is being controlled by these substances I just want to remind you that they are holding you back. These coping mechanisms are making you doubt yourself and not allowing you to progress - not allowing you to know yourself without them.\n \n\nI've heard every excuse in the book against self-improvement. Don't gratify your situation. Don't gratify your anxiety. It's a little runt that wants you to believe you can't change and will never be happy enough anyway. Lower your pride to allow for change. Take control of your life. Learn to love yourself again (you deserve to).   Life will welcome you back with open arms.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "For people with anxiety who drink and smoke weed",
            "url": "https://www.reddit.com/r/Anxiety/comments/6d2x5d/for_people_with_anxiety_who_drink_and_smoke_weed/"
        },
        {
            "author": "Doglin",
            "author_created_utc": 1464759165,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_yd6hb",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495471696,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6cof5s/does_checking_emails_make_you_anxious/",
            "gilded": 0,
            "id": "6cof5s",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 34,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6cof5s/does_checking_emails_make_you_anxious/",
            "retrieved_on": 1497167712,
            "score": 261,
            "secure_media_embed": {},
            "selftext": "TL;DR Got over anxiety socially, however recently checking E-mails has made me nervous. This weekend I took off (I'm the CEO trying to be more efficient) &amp; didn't check my E-mail Friday, so I knew I'd be in for a surprise Monday. I have a tendency to get sucked into notifications (even if but a text) and want to know how I can over-come this to not be worried, and more importantly not get sucked into responding to everything. \n\nHey guys, I used to have a tiny bit of shyness &amp; anxiety when I was younger. I'm 19 now, and had forced myself to go out quite a bit (meet women, talk, etc.) and I found that my anxiety all but went away (socially)! \n\nI got an injury though &amp; have been stuck at home for a few months, going out is VERY limited. I kind of let it take me over (I have anxiety around injuries) and hid inside, afraid of getting a set-back (which ironically set me back). Anyways, thought I should share that because it might explain why...:\n\nI went to check my E-mail this morning. I run my own business, and there was just something this morning about checking my E-mail where I was SO SCARED to check it! I had 3 Skype messages, and about 10 E-mails (8 of which were useless). I saw the notifications and had that \"ping\" in my chest like I was gonna die.. \n\nI'm wondering if maybe it's because I haven't been going out. So, in my isolation, the body is naturally becoming anxious again. I might have to force myself to go out even through my physical pain because oh my gosh was checking my E-mail probably the hardest thing today... I can run a multi-national business from home, yet checking what needs to be done today was too scary. I don't understand lol.\n\nSo guys &amp; girls- does checking notifications make you anxious? I find that when I get \"down\" it creates this loop where I'm anxious to check, but I am also addicted to checking (and getting sucked in to whatever it is). It's like I can't leave one notification un-responded. Maybe that's why I was so anxious... this was the first weekend (and Friday) that I didn't check my E-mail AT ALL, so I knew a couple messages would be waiting. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does checking E-mails make you anxious?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6cof5s/does_checking_emails_make_you_anxious/"
        },
        {
            "author": "YourAverageAlien",
            "author_created_utc": 1488309901,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_15t2g8",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495981670,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6du1pm/theres_a_frightened_little_kid_inside_of_you/",
            "gilded": 0,
            "id": "6du1pm",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 14,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6du1pm/theres_a_frightened_little_kid_inside_of_you/",
            "retrieved_on": 1497188494,
            "score": 163,
            "secure_media_embed": {},
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "There's a frightened little kid inside of you. Learn to hug them tight. Tell them: \"It's OK. I'm right here, you're safe with me. I always did and always will take care of you.\"",
            "url": "https://www.reddit.com/r/Anxiety/comments/6du1pm/theres_a_frightened_little_kid_inside_of_you/"
        },
        {
            "author": "agrokrang",
            "author_created_utc": 1455386794,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ut0sg",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495887223,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dndyw/nausea_and_lack_of_appetite_anyone_get_this/",
            "gilded": 0,
            "id": "6dndyw",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 46,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dndyw/nausea_and_lack_of_appetite_anyone_get_this/",
            "retrieved_on": 1497185189,
            "score": 142,
            "secure_media_embed": {},
            "selftext": "My anxiety has been pretty high lately and have been experiencing nausea and the thought of eating makes me sick. Anyone else ever get this with their anxiety?",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Nausea and lack of appetite. Anyone get this?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dndyw/nausea_and_lack_of_appetite_anyone_get_this/"
        },
        {
            "author": "bananabananacat",
            "author_created_utc": 1476986816,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_129k0q",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495601656,
            "domain": "youtu.be",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6d024s/it_sounds_stupid_but_watching_a_live_stream_of/",
            "gilded": 0,
            "id": "6d024s",
            "is_self": false,
            "is_video": false,
            "locked": false,
            "media": {
                "oembed": {
                    "author_name": "Kitten Academy",
                    "author_url": "https://www.youtube.com/user/scribblej",
                    "height": 344,
                    "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/YPv9yKC76hE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.ytimg.com/vi/YPv9yKC76hE/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Kitten Academy Live Stream",
                    "type": "video",
                    "version": "1.0",
                    "width": 459
                },
                "type": "youtube.com"
            },
            "media_embed": {
                "content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/YPv9yKC76hE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 344,
                "scrolling": false,
                "width": 459
            },
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6d024s/it_sounds_stupid_but_watching_a_live_stream_of/",
            "post_hint": "rich:video",
            "preview": {
                "enabled": false,
                "images": [
                    {
                        "id": "x6wik5kYH7sfpbYiHK2DbG0SV43M5Pzp8MSAGGi1ruE",
                        "resolutions": [
                            {
                                "height": 81,
                                "url": "https://i.redditmedia.com/yLMtPwKNPdqdFYuEhEC5BpV1p0ms2B0BMZ23YwzfWuM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=432eebbaa4825bbdb61a7bf932c11cc8",
                                "width": 108
                            },
                            {
                                "height": 162,
                                "url": "https://i.redditmedia.com/yLMtPwKNPdqdFYuEhEC5BpV1p0ms2B0BMZ23YwzfWuM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=ce9f79b3f2788ff6b9aa95b0788743a8",
                                "width": 216
                            },
                            {
                                "height": 240,
                                "url": "https://i.redditmedia.com/yLMtPwKNPdqdFYuEhEC5BpV1p0ms2B0BMZ23YwzfWuM.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=a357e3029e7d97d2dc834f93620cf90e",
                                "width": 320
                            }
                        ],
                        "source": {
                            "height": 360,
                            "url": "https://i.redditmedia.com/yLMtPwKNPdqdFYuEhEC5BpV1p0ms2B0BMZ23YwzfWuM.jpg?s=167733c7764c4476c7095948347cd54e",
                            "width": 480
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1497173505,
            "score": 140,
            "secure_media": {
                "oembed": {
                    "author_name": "Kitten Academy",
                    "author_url": "https://www.youtube.com/user/scribblej",
                    "height": 344,
                    "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/YPv9yKC76hE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                    "provider_name": "YouTube",
                    "provider_url": "https://www.youtube.com/",
                    "thumbnail_height": 360,
                    "thumbnail_url": "https://i.ytimg.com/vi/YPv9yKC76hE/hqdefault.jpg",
                    "thumbnail_width": 480,
                    "title": "Kitten Academy Live Stream",
                    "type": "video",
                    "version": "1.0",
                    "width": 459
                },
                "type": "youtube.com"
            },
            "secure_media_embed": {
                "content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/YPv9yKC76hE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;",
                "height": 344,
                "scrolling": false,
                "width": 459
            },
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "https://b.thumbs.redditmedia.com/Gq0Q5zCK4zvxWq1s_6cv3ayjfQLIrjVl0meCqEEyw3Q.jpg",
            "thumbnail_height": 105,
            "thumbnail_width": 140,
            "title": "It sounds stupid, but watching a live stream of kittens helps calm me - wanted to share!",
            "url": "https://youtu.be/YPv9yKC76hE"
        },
        {
            "author": "forgetfulkaiju",
            "author_created_utc": 1459642619,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_wu7qk",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495424364,
            "domain": "self.Anxiety",
            "edited": 1495456042,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6ckxmk/anxiety_is/",
            "gilded": 0,
            "id": "6ckxmk",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 22,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6ckxmk/anxiety_is/",
            "retrieved_on": 1497165997,
            "score": 119,
            "secure_media_embed": {},
            "selftext": "I'm hoping not to trigger anyone with this, I just need to write it out and post it somewhere, anywhere, even if no one reads it.\n\nAnxiety is talking yourself up for twenty minutes to make a simple phone call.  \nAnxiety is calling twice and hanging up when someone picks up.  \nAnxiety is rehearsing what you're going to say, and still ending up thinking \"why the fuck did I say that?\" afterwards.  \nAnxiety is being terrified of failing, but expecting it anyway.  \n\nAnxiety is actively keeping track of how you place your feet, so no one will think you're \"walking weird.\"  \nAnxiety is staring at the ground, making sure nothing will make you trip, and to keep from looking at people.  \nAnxiety is worrying you're looking at someone for too long and they're going to think you're some kind of jerk.  \n\nAnxiety is avoiding going to the store, even though you've been out of milk for a week.  \nAnxiety is only leaving your apartment to walk your dog, or see your mom.  \nAnxiety is waiting outside someone's door for five minutes before finally knocking.  \nAnxiety is not speaking unless you have to, and **always** being polite.  \n\nAnxiety is feeling like all eyes are on you, thinking everyone is talking about you.  \nAnxiety is your brain screaming, \"no one is even looking in your direction! No one cares! Stop it! Be normal!\"  \nAnxiety is crying over the little things.  \nAnxiety is knowing that no one cries after going to a doctor appointment.  \nAnxiety is deleting a facebook comment three minutes after you posted it.  \n\nAnxiety is *constantly* worrying about your loved ones.  \nAnxiety is texting your mom four times to be sure of when she'll be home.  \nAnxiety is panicking when she doesn't answer.  \nAnxiety is crying until you can't breathe.  \nAnxiety is **hating** yourself for getting so worked up over nothing, but you're already on this ride and there's no stopping now.  \n\nAnxiety is going to someone's house and waiting to use the bathroom, because you don't want to make it unavailable to anyone else.  \nAnxiety is not sleeping at a sleepover.  \nAnxiety is leaving early because you are not comfortable anywhere but home.  \nAnxiety is not being able to sleep anyway because you're thinking too much about the \"what-ifs\" of upcoming events.  \n\nAnxiety is asking your boyfriend repeatedly if he's mad at you, or if your relationship is okay.  \nAnxiety is making him get up to ask for more napkins.  \nAnxiety is not being able to talk to your brothers or dad about your anxiety, because you're afraid they'll think you're a freak.  \nAnxiety is your muscles aching because you're always tensed up.  \nAnxiety is freaking out because someone started coming out of a driveway you were passing.  \n\nAnxiety is **NOT** \"just being shy.\"  \nAnxiety is **NOT** being \"too good to associate with people.\"  \nAnxiety is **NOT** \"just being nervous.\"  \nAnxiety is **NOT** \"just being a drama queen.\"  \nAnxiety is **NOT** something you can just \"get over.\"  \nAnxiety is **NOT** fake, or a cry for attention.  \n\nAnxiety is **NOT** life defining.  \n\nYou can work through it, little by little. I believe in you. I believe in me.\n\nNote: These are some of my triggers/things I have to deal with on a daily basis. I cried the whole time. But I feel better. Please feel free to add your own.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anxiety is...",
            "url": "https://www.reddit.com/r/Anxiety/comments/6ckxmk/anxiety_is/"
        },
        {
            "author": "kindapottamus",
            "author_created_utc": 1488083822,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_15qj0i",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495408050,
            "domain": "self.Anxiety",
            "edited": 1495413251,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6cjn34/i_built_an_online_therapy_journal_for_getting/",
            "gilded": 0,
            "id": "6cjn34",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6cjn34/i_built_an_online_therapy_journal_for_getting/",
            "post_hint": "self",
            "preview": {
                "enabled": false,
                "images": [
                    {
                        "id": "zlPDEFh2L_QiUH0h0lsIVKsciKYVkG9hsKGWjO_KqNE",
                        "resolutions": [
                            {
                                "height": 68,
                                "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=f8fc5029e3c54e61d0ae940ef675257d",
                                "width": 108
                            },
                            {
                                "height": 136,
                                "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=5db0dd64216fbac5da081c0e31da821c",
                                "width": 216
                            },
                            {
                                "height": 201,
                                "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=71b3f2bc3b15131a83827151bc82c4ca",
                                "width": 320
                            },
                            {
                                "height": 403,
                                "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=ab5b6957a72eaf6797da3661f7c967ad",
                                "width": 640
                            },
                            {
                                "height": 605,
                                "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=99de3c31d4294a6f0b3b192dca204612",
                                "width": 960
                            },
                            {
                                "height": 681,
                                "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=d1f39897feb03fa845a771e372286626",
                                "width": 1080
                            }
                        ],
                        "source": {
                            "height": 820,
                            "url": "https://i.redditmedia.com/WnDzBM8XTPQCh7g1cVxe2RLQ-Jeoy63VLJMSyRewxIk.jpg?s=ed8380d81f998b9ac53f5b6d77a29d51",
                            "width": 1300
                        },
                        "variants": {}
                    }
                ]
            },
            "retrieved_on": 1497165362,
            "score": 94,
            "secure_media_embed": {},
            "selftext": "I've been managing anxiety for most of my life. \n\nAbout 10 years ago, I found that writing in a journal helped me sort out my thoughts, decompress, and get things off my chest that are stressing me out. I always feel a little bit lighter after I journal.\n\nI've spent the last 2+ years building an online therapy journal called KindMind. I use it pretty-much every day, usually twice a day, so you know it's good® Thought friends at r/anxiety might find it useful:\n\nhttps://www.kindmind.com\n\nWorks best in Google Chrome. Also, heads up that this isn't a substitute for professional medical care in any way : )\n\nHappy journaling and thanks for reading!",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I built an online therapy journal for getting things off your chest",
            "url": "https://www.reddit.com/r/Anxiety/comments/6cjn34/i_built_an_online_therapy_journal_for_getting/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495666644,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6d5pmg/anyone_have_such_bad_anxiety_they_cant_do/",
            "gilded": 0,
            "id": "6d5pmg",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6d5pmg/anyone_have_such_bad_anxiety_they_cant_do/",
            "retrieved_on": 1497176453,
            "score": 80,
            "secure_media_embed": {},
            "selftext": "Today I got a job and was in charge of folding cloths. I couldnt fold a t shirt correctly mainly because my anxiety and my heart was bumping like crazy. I know I can do it normally ,but when there are 3 people and a manager watching me I just mess up because im scared. This has happened to me while driving as well. I can drive perfectly ,but when theres a instructor I got nervous and start making errors with my heart beating really fast. ",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone have such bad anxiety they cant do anything right while being watched?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6d5pmg/anyone_have_such_bad_anxiety_they_cant_do/"
        },
        {
            "author": "kaxxcxn",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495695574,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6d81bq/i_need_a_fucking_hug/",
            "gilded": 0,
            "id": "6d81bq",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 16,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6d81bq/i_need_a_fucking_hug/",
            "retrieved_on": 1497177599,
            "score": 69,
            "secure_media_embed": {},
            "selftext": "I am constantly worried.\n\nI started a new job recently and I am not doing so great. Or maybe I am and I just havent learned enough. Its a job requiring speed and I am not that fast yet. I am always worried people are discussing my performance. Or talking behind my back in general. Im worried I wont be able to get up to par fast enough. I really need this job.\n\nI am worried Im constantly dying. Every glitch in my body is a signal of cancer. Everytime I get slightly sick its cancer.\n\nI wake up in a sweat from dreaming of anxiety. I sleep 10 to 12 hours a day simply because I dont want to be awake, and have to face these feelings. They haunt me regardless.\n\nI find rarely find peace. Ocasionally after work Im able to ground myself and enjoy a few hobbies. Today is bad, though. Im typing this on my lunch and I couldnt even be bothered eating. I just want to drink the world's entire water supply and fall asleep.\n\nI need some sort of reassurance that this will pass. That I will get use to the job. That Ill work past all this health anxiety\n\nIve dealt with every brand of anxiety you can imagine, but this is by far the most drained Ive felt from it. Help.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I need a fucking hug",
            "url": "https://www.reddit.com/r/Anxiety/comments/6d81bq/i_need_a_fucking_hug/"
        },
        {
            "author": "Oxidia",
            "author_created_utc": 1478029823,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_12j1ch",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495779125,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6df7vl/anyone_just_tired_with_the_lvl_of_resistence_your/",
            "gilded": 0,
            "id": "6df7vl",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6df7vl/anyone_just_tired_with_the_lvl_of_resistence_your/",
            "retrieved_on": 1497181149,
            "score": 67,
            "secure_media_embed": {},
            "selftext": "I'm going today to my psychiatrist, it's a 15-20 min drive on the highway, nothing bumpy. I mean, i was allways a carsick child, i just get carsick no matter the transportation. Or at least i fear i'll get carsick. The thing is, i allways get super anxious when i have to go somewhere, no matter the distance and no matter where i go because of the transportation. I prefer to travel by bus short distances and alone. That way i can get out anytime (i never got out tho i allways ride untill my destination) if i get sick and not bother anyone. Yesterday i had to wait 20 min in a dentist waiting room to get my teeth polished and before we went i was thinking how i would prefer to have my legs broken then go. The point is, i've been to my theraphist 6-7 times allready, she is amazing lady and every time i went everything was superb but i'm tired i have to wrestle my brain every time, every time and about every single possible change and inconvenience  in my life. It's so hard to train that stupid scared brain of mine. So here i sit in my room picking what to wear to my theraphist, i have to leave in an hour and i'm freaking out a bit. Sigh.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Anyone just tired with the lvl of resistence your brain puts up",
            "url": "https://www.reddit.com/r/Anxiety/comments/6df7vl/anyone_just_tired_with_the_lvl_of_resistence_your/"
        },
        {
            "author": "ObscuredByCIouds",
            "author_created_utc": 1476489725,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_124kj1",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495740583,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dbw3l/does_anyone_often_have_anxiety_spikes_at_night/",
            "gilded": 0,
            "id": "6dbw3l",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "daeflair",
            "link_flair_text": "DAE Questions",
            "locked": false,
            "media_embed": {},
            "num_comments": 25,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dbw3l/does_anyone_often_have_anxiety_spikes_at_night/",
            "retrieved_on": 1497179496,
            "score": 66,
            "secure_media_embed": {},
            "selftext": "",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anyone often have anxiety spikes at night that lead to feelings of impending doom in the morning right before getting your period?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dbw3l/does_anyone_often_have_anxiety_spikes_at_night/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495771470,
            "domain": "self.Anxiety",
            "edited": 1495771651,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6deoce/this_is_long_i_found_my_cure_for_panic_attacks/",
            "gilded": 0,
            "id": "6deoce",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 9,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6deoce/this_is_long_i_found_my_cure_for_panic_attacks/",
            "retrieved_on": 1497180880,
            "score": 54,
            "secure_media_embed": {},
            "selftext": "[deleted]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "This is long. I found my cure for panic attacks. Bear with me.",
            "url": "https://www.reddit.com/r/Anxiety/comments/6deoce/this_is_long_i_found_my_cure_for_panic_attacks/"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "banned_by": "moderators",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495930196,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dqwtx/i_want_to_kill_myself/",
            "gilded": 0,
            "id": "6dqwtx",
            "is_self": true,
            "is_video": false,
            "locked": true,
            "media_embed": {},
            "num_comments": 32,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dqwtx/i_want_to_kill_myself/",
            "retrieved_on": 1497186940,
            "score": 53,
            "secure_media_embed": {},
            "selftext": "[removed]",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "default",
            "title": "i want to kill myself",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dqwtx/i_want_to_kill_myself/"
        },
        {
            "author": "Bucolic_Intent",
            "author_created_utc": 1435580915,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_of23g",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495812926,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dhobp/anxiety_kit/",
            "gilded": 0,
            "id": "6dhobp",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 48,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dhobp/anxiety_kit/",
            "retrieved_on": 1497182361,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "My therapist just gave me creating an anxiety kit as homework. This is typically a small satchel with textured objects and good smells. Obviously, being the way I am, choosing the \"wrong\" things is making me frustrated and anxious. So I have decided to continue with this project as an exposure exercise even though I think it's kinda stupid.\n\nWhat would really help me is if you guys were willing to show me pictures of your own kits if you have them. I'm very visual and describing what should be inside of one doesn't really inspire me as much as looking at what other people have done.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "\"Anxiety kit\"",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dhobp/anxiety_kit/"
        },
        {
            "author": "Andrew-23",
            "author_created_utc": 1287157013,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4fkph",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495816417,
            "domain": "self.Anxiety",
            "edited": 1495819151,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6di178/my_day_12_stint_in_a_mental_hospital_changed_my/",
            "gilded": 0,
            "id": "6di178",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 6,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6di178/my_day_12_stint_in_a_mental_hospital_changed_my/",
            "retrieved_on": 1497182537,
            "score": 46,
            "secure_media_embed": {},
            "selftext": "My life was an absolute wreck. My ankle was destroyed playing basketball. I had a four inch screw inserted to connect the bones that had been separated in the break. I couldn't walk for months without crutches. I put all my eggs in one basket expecting to get into the Air Force with my brother before my ankle broke. He's been my best friend my whole life and wanted nothing more than to join the Air Force with him. I got denied because of my heart condition that I had surgically repaired. It was the recession so I couldn't find a job and didn't have money to go to school. The web design freelancing I did had dried up.\n\nMy days consisted of taking pain killers, watching TV, going to the library with my mother and playing games. I had just moved to a different town and did not have any friends besides people I played basketball with. I obviously couldn't do that anymore so I basically didn't see anyone but my mother and my Aunt that I lived with.\n\nMy addiction the the Vicodin I was taking soon spun out of control. It basically fixed all my problems with pain, depression anxiety, eating, sleeping, you name it. I felt as if it made me a better person. I soon started taking 8-12 a day instead of the 4 or 5 I should have been taking. It was a lot for someone only about 115 lbs.\n\nAs soon as my supply ran out and no longer had refills, my life completely changed. I couldn't sleep, couldn't eat, and was in a lot of pain. It spiraled out of control in the coming days and didn't sleep for 4 straight days. I was overwhelmed with anxiety and vomited for 4 straight days. I went from being a thin 6 feet 135 lbs before breaking my ankle to under 100 pounds after withdrawal.\n\nSuicide was one of the only things I could think about. My panic attacks were so bad I thought I was dying. It wasn't too far fetched considering I had heart surgery a few years before to repair a giant hole in my heart. I thought the chest pains I was having could be from my heart surgery and that I would be dead soon.\n\n**After 4 nights of non stop vomiting, pain, panic attacks, chest pain, suicidal thoughts and no sleep, I wanted nothing else but to die. The only thing that stopped me is that my family would be devastated. There was no way I could do that to them.**\nI decided enough was enough and checked myself into the hospital. They sent me to an inpatient mental hospital after hearing about my suicidal thoughts.\n\nI spoke to a psychiatrist soon after arriving and completely broke down. I had never really talked to anyone and opened up about my depression and anxiety. I poured my heart out and he said I had major depression. He told me how shocked he was I had never told anyone about my years and years of depression and how much of a wreck my life was. He told me I was really strong.\n\nI told him my mother takes Paxil + Abilify and it worked for her. She had been in and out of mental hospitals for the last 5-6 years. He started me on both. I started out very tired from the mix of drugs and slept a lot. I had my 3 meals a day and did all groups.\nI heard so many crazy stories in these groups and it showed me how people were even worse off than I was. Here I was suicidal, depressed, withdrawing from Vicodin, with a broken ankle and people had it worse than me.\n\nMe being me, I got along well with everybody. I had a roommate who said at group that I was the only person he could talk to and get along with. He had anger issues and was very defensive. He tried to kill himself by taking a pot of crack or something like that.\nSome woman told me that the CIA puts chips in our brains so they can watch us from outer space. Some other girl went crazy because the coffee wasn't out early enough. She started pounding on the walls. One of the workers grabbed her hands and another grabbed her feet. She got carried out like that while flopping like a fish. She came back later as a zombie from being drugged up.\nI told one of my roommates I was on Paxil and he said one day I will wake up and it will be like Christmas.\n\nOne night I really wasn't feeling well. I went over to the nurses station and sat down. I told them I felt sick and they told me to wait. I vomited and then went blind. It was the first time I ever lost my vision. I was scared shitless. Some of the fellow patients came over and helped calm me down. I actually prayed with one of them even though I am not very religious. I had nowhere else to turn at that point.\n\nI got taken off of Abilify but stayed on Paxil in the days that followed.\n\nThe day finally my roommate told me about finally came. I woke up feeling happy for the first time in a while a few days later. My Aunt visited me pretty much everyday to bring me clothes, food and see how I was doing. We talked with one of the fellow patients and I actually was laughing and smiling. She said something pretty profound. She said it was the first time she saw me smile in a long time. It reminded me of a dream I had while in the hospital where someone told me to smile more.\nThe psychiatrist told me he thought I was ready to go home. I told him I was still having chest pain, anxiety and my hands were shaking. He told me that was in my head. I thought to myself **\"I'm in a damn mental hospital, of course it's in my head\".** He prescribed me a beta blocker and it helped.\n\nI was finally able to joke around, smile, have energy and feel like I wasn't miserable for once. My family visited one last time and my Uncle was in from Texas. My father was there for the first time. I told them I wanted to go to college. They were happy to see me happy and thinking about the future for the first time in a while. It's funny because one of the patients actually gave me the nickname \"College Boy\" after thinking I was a smart guy and hearing I wanted to go to college.\n\nThe next day we started decorating the ward for the Christmas party we were having in a few days. I pretty much knew I wouldn't be around for it. I was finally ready. I told people at group that night that I was going home. I wished them all well in front of the group.\n\nIt was the turning point of my life. I finally got the help I should have for years earlier. I learned so much about myself in those 12 days. I learned that I can get through anything, I just have to ask for help.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "My Day 12 Stint in A mental hospital changed my life",
            "url": "https://www.reddit.com/r/Anxiety/comments/6di178/my_day_12_stint_in_a_mental_hospital_changed_my/"
        },
        {
            "author": "jamaicanoproblem",
            "author_created_utc": 1395192003,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_fr8n4",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495974223,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dtj2x/i_drove_for_the_first_time_in_8_years_and_it_was/",
            "gilded": 0,
            "id": "6dtj2x",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dtj2x/i_drove_for_the_first_time_in_8_years_and_it_was/",
            "retrieved_on": 1497188240,
            "score": 42,
            "secure_media_embed": {},
            "selftext": "I've always been afraid of driving. I've had a valid license since I was 16 but I've barely ever used it. The only driving I've ever really done was for a summer job in college, which involved a 10 mile drive on empty country back roads--basically all you have to do is stay on the pavement. So yeah, inexperience + anxiety = fuck that noise.\n\nBut I have now driven on CITY roads TWICE (including roads with cars parked on both sides and roads with little kids playing soccer, two of my biggest driving challenge fears) and I did ok.  'Good', even--though my husband may have been embellishing to make me feel better...)\n\nStill not quite ready for parallel parking or highway driving but I am feeling a lot more confident. I can drive to the grocery store! I CAN DRIVE TO THE GROCERY STORE MYSELF! I don't have to walk and carry it all up that goddamn hill, or beg my husband to bring something home, or pay a delivery guy to get it for me! I can just get in our car and go by myself without waiting for anyone else, or for the weather to get better so the walk won't suck... I can go pick up my prescriptions! I can go to the hair dresser! I COULD MAYBE EVEN DRIVE MYSELF TO THERAPY!!!\n\nSO MANY THINGS I CAN DO NOW!\n\nI was just excited and wanted to share.\n\n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I drove for the first time in 8 years. And it was ok!",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dtj2x/i_drove_for_the_first_time_in_8_years_and_it_was/"
        },
        {
            "author": "frenchy612",
            "author_created_utc": 1312483919,
            "author_flair_css_class": "",
            "author_flair_text": "PD / GAD / OCD ",
            "author_fullname": "t2_5m9gu",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495645513,
            "domain": "self.Anxiety",
            "edited": 1495645796,
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6d3h6c/does_anxiety_make_you_unsure_if_youre_sick_or_not/",
            "gilded": 0,
            "id": "6d3h6c",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 11,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6d3h6c/does_anxiety_make_you_unsure_if_youre_sick_or_not/",
            "retrieved_on": 1497175187,
            "score": 28,
            "secure_media_embed": {},
            "selftext": "It feels as though everything is coming down on me at once. I graduated college, which means I'm officaily an \"adult\" - which is has been scaring me a lot. I am now hours away from my girlfriend, I don't have a daily routine because I'm done with classes, I'm back in the quiet suburbs at home (away from all my friends and places I liked to spend time), my parents are constantly yelling at one another, dogs always barking, and I continue having nightmares of my anxiety related fears. Everything started to get really bad on my graduation day though.\n\nI recently had a panic attack while at my college graduation ceremony. I was in the middle of this crowded, huge, very hot, loud, gymnasium and felt lightheaded. I ended up panicking and spent an hour extremely upset, laying down in an ambulance next to the gym for an hour. \n\nSince then I've been feeling \"sick\" for a few days and unsure if this is my anxiety. MY ANXIETY ALWAYS MAKES ME FEEL LIKE I AM EXPERIENCING A HORRIBLE ILLNESS. I'm never sure if it is my anxiety or not. I've been distressed even days after the panic attack at school. \n\nI feel exhausted, \"out of it,\" heartburn, have gotten a palpitation, sore/dry throat, dry tasting mouth, watery eyes, stressed, verge of crying, very depressed, hopeless, extremely scared all the time, tense jaw, very scared, racing thoughts of dying, mucus in back of nose, and it just feels uncomfortable to live. These symptoms just reinforce my fears of getting sick - so it's this vicious cycle.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Does anxiety make you unsure if you're sick or not?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6d3h6c/does_anxiety_make_you_unsure_if_youre_sick_or_not/"
        },
        {
            "author": "YourLocalVoid",
            "author_created_utc": 1468756669,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_zkr4b",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495486768,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6cq1bq/secondhand_embarrassment/",
            "gilded": 0,
            "id": "6cq1bq",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6cq1bq/secondhand_embarrassment/",
            "retrieved_on": 1497168510,
            "score": 27,
            "secure_media_embed": {},
            "selftext": "Does anybody else feel insanely anxious and embarrassed at other people's screw ups? It has nothing to do with me yet I still feel like I'm the one who messed up. Like when somebody in class gets reprimanded by the teacher and I see how embarrassed they are I feel like they might at that moment. Or when somebody says something awkward I feel like it was me that said it and get really nervous about it.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Secondhand Embarrassment?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6cq1bq/secondhand_embarrassment/"
        },
        {
            "author": "DeadGravityyy",
            "author_created_utc": 1454112429,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_u8i99",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495802794,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dgq25/going_on_my_first_ever_plane_ride_tomorrowhelp/",
            "gilded": 0,
            "id": "6dgq25",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "helpflair",
            "link_flair_text": "Needs A Hug/Support",
            "locked": false,
            "media_embed": {},
            "num_comments": 36,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dgq25/going_on_my_first_ever_plane_ride_tomorrowhelp/",
            "retrieved_on": 1497181890,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "So tomorrow is a scary day for me, as I have never been on a plane before. And most people are scared of the plane crashing or something, but i'm afraid of the \"sinking feeling\" that i get whenever i go on a steep ride, because of the G-Forces felt. I'm not that sensitive to them, but i have gone on one ride called \"Mission: Space - Orange\" that made me feel like i was going to suffocate under the pressure. \n\nI know that this isn't going to happen, but could someone give me some reassurance?\n",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Going on my first ever plane ride tomorrow...help please?",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dgq25/going_on_my_first_ever_plane_ride_tomorrowhelp/"
        },
        {
            "author": "DrinksOnMeEveryNight",
            "author_created_utc": 1459709884,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_wusxn",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495894426,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dnw90/i_need_to_be_constantly_worried/",
            "gilded": 0,
            "id": "6dnw90",
            "is_self": true,
            "is_video": false,
            "locked": false,
            "media_embed": {},
            "num_comments": 4,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dnw90/i_need_to_be_constantly_worried/",
            "retrieved_on": 1497185440,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "It's like I need to constantly be worried - I can't remember what it's like to not be worried about something. I can't let happy times actually be happy without fear and worry and anxiety looming and taking over. I wish this would just get better. I hate my life.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "I need to be constantly worried",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dnw90/i_need_to_be_constantly_worried/"
        },
        {
            "author": "AbiGrover",
            "author_created_utc": 1489618027,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_167z4p",
            "brand_safe": true,
            "contest_mode": false,
            "created_utc": 1495911631,
            "domain": "self.Anxiety",
            "full_link": "https://www.reddit.com/r/Anxiety/comments/6dpddd/boyfriend_raises_his_voice_when_im_struggling/",
            "gilded": 0,
            "id": "6dpddd",
            "is_self": true,
            "is_video": false,
            "link_flair_css_class": "relationshipflair",
            "link_flair_text": "Relationships",
            "locked": false,
            "media_embed": {},
            "num_comments": 10,
            "over_18": false,
            "permalink": "/r/Anxiety/comments/6dpddd/boyfriend_raises_his_voice_when_im_struggling/",
            "retrieved_on": 1497186175,
            "score": 23,
            "secure_media_embed": {},
            "selftext": "I usually have a difficult time leaving the house and it's recently been frustrating my boyfriend. Most of the time he'll just be visibly annoyed but sometimes he'll raise his voice and swear at me. This always happens while we're out because that's when it's most difficult for me. I'm almost always afraid to say something when I'm freaking out or just feeling scared now. I usually end up crying and have to apologize before he calms down. I don't know, I think it's just been wearing on him. I know it was exhausting for everyone before him to deal with too. I don't have family anymore and I've never had friends outside of this relationship. I would feel dirty/guilty of something trying to meet new people if I were able to. I'm just feeling really isolated and alone right now.",
            "spoiler": false,
            "stickied": false,
            "subreddit": "Anxiety",
            "subreddit_id": "t5_2qmij",
            "suggested_sort": null,
            "thumbnail": "self",
            "title": "Boyfriend raises his voice when i'm struggling",
            "url": "https://www.reddit.com/r/Anxiety/comments/6dpddd/boyfriend_raises_his_voice_when_im_struggling/"
        }
    ]
}